{
    "course_title": "Building Inclusive Secondary Classrooms",
    "study_period": "Summer 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC7606-80096-7580",
    "full_course_code": "EDUC7606-80096-7580",
    "course_code": "EDUC7606",
    "class_code": "80096",
    "semester_code": "7580",
    "semester_details": "Summer Semester, 2025 (01/12/2025 - 14/02/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate an awareness of recent developments in research into effective teaching in inclusive classroom environments and the differentiation of teaching in ways that are responsive to the learning strengths and needs of students across the full range of abilities and that take account of the impact on learning of diverse backgrounds (e.g. linguistic, Indigenous, cultural, religious and socio-economic)."
        },
        {
            "number": "LO2.",
            "description": "Reflect on legislative requirements, system policies and processes, positive behaviour supports, and teaching strategies that promote student wellbeing and safety, and support participation and learning of all students with a focus on those with disabilities."
        },
        {
            "number": "LO3.",
            "description": "Plan challenging learning goals and effectively organise classroom activities for students of diverse backgrounds and across the full range of abilities using age-appropriate curriculum and approaches to differentiated teaching strategies."
        },
        {
            "number": "LO4.",
            "description": "Explain approaches for interpreting student data and strategies for working appropriately with others, including parents/carers, external professionals and community groups to action a personal learning plan and modify teaching practices."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate clear, fluent, and coherent communication skills consistent with personal, professional and academic conventions."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Task 1 - Adjusted learning activity development and presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>50% Oral presentation 20 minutes 30% Justification 1500 words 20% </dd>",
            "due_date": "<dd><p> 17/12/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L05",
            "mode": "Activity/ Performance, Written",
            "category": "Paper/ Report/ Annotation, Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>In this task, you will work with other students in the course to prepare a presentation of a lesson segment from a full plan that has been designed to meet the learning needs of all students in an inclusive class including those with disability, from diverse backgrounds, Indigenous learners, and with a range of abilities. The lesson plan will be applicable to your learning area and based on the Australian Curriculum.</p>\n<p>Using the principles of Universal Design for Learning, your group will <strong>plan a 40-minute lesson including teaching </strong>that support student participation (including Aboriginal and Torres Strait Islander students), as well as strategies for assessing what students know or are able to do as a result of the lesson. </p>\n<p>In addition to the general planning for all, you will plan learning adjustments based on a learning need as specified by the Nationally Consistent Collection of Data categories (Physical, Sensory, Cognitive or Social/Emotional), indicating appropriate adjustments for teaching and assessing a student with that need. </p>\n<p>Presentation 30%:</p>\n<ul>\n<li>lesson plan (individual or group response)</li>\n<li>presentation of an activity from the lesson plan (up to 20 minutes)</li>\n</ul>\n<p><br/></p>\n<p>Individual response 20%:</p>\n<ul>\n<li>overview and background</li>\n<li>narrative review of current research literature</li>\n<li>justification of adjustments</li>\n</ul>\n<p><br/></p>\n<p>Details of the format for the group presentation and the individual written response will be provided on the course Blackboard site.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission is via Blackboard in the Assessment folder.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Task 2 - Case study: Response to scenario",
            "special_indicators": [],
            "weighting": "<dd>50% ~ 5 pages </dd>",
            "due_date": "<dd><p> 30/01/2026 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This is a culminating task where you will build on your understandings of building inclusive classrooms by documenting preparations for a meeting with parents.</p>\n<p> </p>\n<p>Scenario:</p>\n<p>Two weeks into the new school year, the parents of a student in your year 9 class have asked to meet with you to discuss how you will accommodate their child’s learning needs as specified in the Individual Education Plan<a href=\"blank\">[1]</a> (IEP).</p>\n<p> </p>\n<p>In this task, you will document your preparation for the meeting, including the following:</p>\n<p> </p>\n<p><strong>1. Background</strong> (suggested two A4 pages)</p>\n<ul>\n<li>A summary of the relevant legislation and policy documents, and a teacher’s legal obligations, related to this scenario. (Choose a jurisdiction where you plan to teach).</li>\n<li>A plan of adjustments to be made based on learning, assessment, and behaviour as appropriate to the student’s needs. Justify your plan based on research evidence and subject matter expertise.</li>\n<li>An indication of the assessment data (formative and summative) you would study prior to the meeting to provide background on the student’s progress.</li>\n<li>An overview of your investigation of applicable external professional (e.g., allied health professionals) and community representatives including professional support networks, such as disability associations, and other community groups for extending your personal professional knowledge and practice.  </li>\n<li>A brief summary of relevant research evidence identifying how to effectively engage with families as partners in promoting learning appropriate to the student’s stage of learning.</li>\n</ul>\n<p><strong> </strong></p>\n<p><strong>2. A plan for the meeting</strong> (suggested two A4 pages)</p>\n<ul>\n<li>Location, timing, seating arrangement, refreshments etc.</li>\n<li>Introductions – opportunity for parents to indicate what they wish to gain from the meeting.</li>\n<li>How you will work with parents/carers over the year, including considerations of sensitivity, confidentiality, seeking their input and advice, and how you intend to collaborate with them throughout the year. You may wish to consider engagement strategies, such as the use of two-way positive communication, collaborative planning and problem-solving, and how you will use light-touch learning updates (e.g. brief, regular updates), among other approaches.</li>\n<li>Explanation of learning adjustments applicable to your subject area in response to the student’s IEP.</li>\n<li>Explanation of reasonable adjustments planned for assessment, responding to the IEP.</li>\n<li>Explanation of your plan for the student’s wellbeing and safety, including positive behaviour support processes (Tier 1, 2 or 3, as applicable).</li>\n</ul>\n<p><strong> </strong></p>\n<p><strong>3. Follow up</strong> (suggested up to one A4 page)</p>\n<ul>\n<li>Recording of the conversation.</li>\n<li>Further meetings.</li>\n<li>Reporting to others.</li>\n</ul>\n<p><br/></p>\n<p> <a href=\"blank\">[1]</a> Individual Education Plan is internationally recognised terminology. Local jurisdictions may use different terminology e.g. personalised learning plans.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission is via Blackboard in the Assessment folder.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(01 Dec - 07 Dec)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1 - Embracing inclusive practice</strong><br><p>This first week's activities set the context for this course. It introduces students to the concept of inclusion and begins the work of developing an evidence base for practice. </p>\n<p>Introduction to Universal Design for Learning (UDL) establishes an approach to planning learning and assessment activities to support the majority of learners.</p>\n<p>Some learners need more than UDL, requiring learning adjustments. Approaches such as Learning Year Level Adjusted Curriculum will be introduced.</p>\n<p>Underpinning all this work is a research evidence base. Students will learn how to access the research evidence and prepare a narrative literature review.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 1 - Embracing inclusive practice</strong>",
            "topic_description": "Week 1 - Embracing inclusive practice This first week's activities set the context for this course. It introduces students to the concept of inclusion and begins the work of developing an evidence base for practice. Introduction to Universal Design for Learning (UDL) establishes an approach to planning learning and assessment activities to support the majority of learners. Some learners need more than UDL, requiring learning adjustments. Approaches such as Learning Year Level Adjusted Curriculum will be introduced. Underpinning all this work is a research evidence base. Students will learn how to access the research evidence and prepare a narrative literature review.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 2(08 Dec - 14 Dec)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2 - Understanding the legislative context - Evidence for Inclusive Education</strong><br><p>The education of students with disabilities is underpinned by international charters, Australian and state legislation and local policies. This week covers legal frameworks for inclusion, the research evidence for the effectiveness of inclusive education, and Australia's Nationally Consistent Collection of Data scheme.</p>\n<p>Our legal obligations are important. The purpose is to ensure all learners can enjoy their right to a quality education in safe, supportive environments. Therefore, this week, we also cover Educational Quality of Life, student well-being, trauma informed practices, and approaches to supporting behaviour for learning.</p>\n<p>Specific approaches to support learners with language, literacy and numeracy development are covered.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Week 2 - Understanding the legislative context - Evidence for Inclusive Education</strong>",
            "topic_description": "Week 2 - Understanding the legislative context - Evidence for Inclusive Education The education of students with disabilities is underpinned by international charters, Australian and state legislation and local policies. This week covers legal frameworks for inclusion, the research evidence for the effectiveness of inclusive education, and Australia's Nationally Consistent Collection of Data scheme. Our legal obligations are important. The purpose is to ensure all learners can enjoy their right to a quality education in safe, supportive environments. Therefore, this week, we also cover Educational Quality of Life, student well-being, trauma informed practices, and approaches to supporting behaviour for learning. Specific approaches to support learners with language, literacy and numeracy development are covered.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 3(15 Dec - 21 Dec)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3 - Working with others</strong><br><p>Presentations.</p>\n<p>Teachers work with many others, including other teaching staff, allied professionals e.g. therapists, teacher aides and families.</p>\n<p>Communities of Practice (COP) or Professional Learning Communities (PLC) are helpful organisational structures which will be introduced this week.</p>\n<p>Teachers work in teams, often as the leader. When a student with an individual learning plan is in the class, many people may be involved in the community of practice. These could be teacher aides, specialist teachers, therapists, parents and learning support teams. This module will explore ways of building positive relationships, including running meetings.</p>\n<p>Transitions involve working with others and are an important aspect of the work of teachers as students move into, between and out of school contexts.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 3 - Working with others</strong>",
            "topic_description": "Week 3 - Working with others Presentations. Teachers work with many others, including other teaching staff, allied professionals e.g. therapists, teacher aides and families. Communities of Practice (COP) or Professional Learning Communities (PLC) are helpful organisational structures which will be introduced this week. Teachers work in teams, often as the leader. When a student with an individual learning plan is in the class, many people may be involved in the community of practice. These could be teacher aides, specialist teachers, therapists, parents and learning support teams. This module will explore ways of building positive relationships, including running meetings. Transitions involve working with others and are an important aspect of the work of teachers as students move into, between and out of school contexts.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Mid Sem break(29 Dec - 04 Jan)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-semester break</strong><br><p>Official UQ Summer Semester Mid-sem break.</p></br></p></div></td>",
            "topic_title": "<strong>Mid-semester break</strong>",
            "topic_description": "Mid-semester break Official UQ Summer Semester Mid-sem break.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(26 Jan - 01 Feb)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8 - Optional tutorial</strong><br/><p>There will be an optional drop in online tutorial to revisit course content prior to submission of the final task.</p>\n<p>Wednesday 28th January 4-5pm.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 8 - Optional tutorial</strong>",
            "topic_description": "Week 8 - Optional tutorial There will be an optional drop in online tutorial to revisit course content prior to submission of the final task. Wednesday 28th January 4-5pm.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}