{
    "course_title": "Clinical Nursing Practice 5",
    "study_period": "Summer 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/NURS3202-80203-7580",
    "full_course_code": "NURS3202-80203-7580",
    "course_code": "NURS3202",
    "class_code": "80203",
    "semester_code": "7580",
    "semester_details": "Summer Semester, 2025 (01/12/2025 - 14/02/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate safe and professional nursing practice commensurate with year level of study aligned to the Nursing and Midwifery Board of Australia's Professional Standards."
        },
        {
            "number": "LO2.",
            "description": "Assess, plan, implement and evaluate evidence-based nursing care that respects and acknowledges the values of patient and family centred care."
        },
        {
            "number": "LO3.",
            "description": "Implement effective professional and interprofessional written, verbal, non-verbal, and digital communication skills to inform, educate and empower individuals, their family and colleagues towards safe and expected healthcare outcomes."
        },
        {
            "number": "LO4.",
            "description": "Demonstrate the pharmacological principles including safe use of medicines and monitoring of individual response under the direct supervision of the registered nurse."
        },
        {
            "number": "LO5.",
            "description": "Develop interprofessional practice skills in conflict management and collaborative leadership and enhance skills in role clarification, team functioning, interprofessional communication and client-centred care."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Clinical placement completion (formative, summative ANSAT and placement hours)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p>Due dates are dependent on allocated clinical placement dates.</p>\n<p><br/></p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Performance, Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The aim of this assessment is to leverage the clinical placement experience as a platform for integrating theoretical knowledge into practical applications. Students will be tasked with demonstrating the progression of their clinical knowledge, skills, and proficiency in alignment with their current year of study. Throughout the clinical placement, the emphasis will be on students demonstrating adherence to professional standards and conduct expected of a registered nurse, while staying within the confines of their specified scope of practice.</p>\n<ul>\n<li>Midpoint (Formative) ANSAT: To be completed at the midpoint (50% of clinical placement completed) and documented in Myprogress (ePad).</li>\n<li>Final (Summative) ANSAT: To be completed on the final two clinical shifts of the clinical placement and documented in Myprogress (ePad).</li>\n<li>Timesheets to be completed in Myprogress; ePad at the conclusion of each shift.</li>\n</ul>\n<p><em>Formative ANSAT:</em></p>\n<ul>\n<li>Midpoint (Formative) ANSAT: To be completed at the midpoint (50% of clinical placement completed) and documented in Myprogress (ePad).</li>\n<li>You must receive a score of 3 or above on every criteria (failure to do so will result in a learning plan being implemented).</li>\n<li>You must show evidence/reflection of achieving your learning goals OR evidence of amended learning goals.</li>\n<li>New learning goals need to be formulated during this meeting.</li>\n</ul>\n<p><em>Summative ANSAT:</em></p>\n<ul>\n<li>Completion due within the final two rostered shifts of clinical placement.</li>\n<li>To be completed by a UQ Clinical Supervisor, Preceptor, Nurse Educator or Buddy RN via ePAD.</li>\n<li>You must receive a score of 3 or above on every criterion (failure to do so will result in a fail grade for the course).</li>\n<li>You must show evidence/reflection of achieving your learning goals OR evidence of amended learning goals.</li>\n</ul>\n<p><em>Timesheet:</em></p>\n<ul>\n<li>Students enrolled in this course are required to complete 240 hours clinical placement.</li>\n<li>The Clinical Practicum Timesheet must be signed off by the student's Registered Nurse Preceptor / UQ Practice Educator every shift via a declaration in MyProgress ePAD. From your MyProgress home page, you can click ‘Timesheet’. The timesheet appears for you to complete; placement, location, activity type, date, duration and enter a name into ‘approved by’. Students must ensure they choose the correct location and type of shifts from the dropdown boxes. Once you have completed the form, hand your device to your Registered Nurse Preceptor / UQ Practice Educator. They will officially verify your entry by choosing the ‘Approved by’ section and entering their name and work email address. Once completed, click \"submit\". Information on ePAD will be provided to students prior to placement.</li>\n</ul>\n<p>Students are to review the assessment task sheet located on the course Blackboard site.</p>\n<p><em>Please note: Clinical placement may be scheduled outside of the semester</em>.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students are to submit clinical hours, formative and summative ANSATs via ePAD.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 13",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Clinical Placement</strong><br><p>Students undertaking NURS3202 are required to complete 240 hours of clinical placement. Clinical placement allocations are accessible via Inplace.</p>\n<p>Clinical placement may occur outside of the semester dates. </p></br></p></div></td>",
            "topic_title": "<strong>Clinical Placement</strong>",
            "topic_description": "Clinical Placement Students undertaking NURS3202 are required to complete 240 hours of clinical placement. Clinical placement allocations are accessible via Inplace. Clinical placement may occur outside of the semester dates.",
            "learning_outcomes": []
        }
    ]
}