{
    "course_title": "Anthropology of Current World Issues",
    "study_period": "Summer 2024",
    "location": "St Lucia",
    "attendance": "Online",
    "url": "https://course-profiles.uq.edu.au/course-profiles/ANTH1030-80154-7480",
    "full_course_code": "ANTH1030-80154-7480",
    "course_code": "ANTH1030",
    "class_code": "80154",
    "semester_code": "7480",
    "semester_details": "Summer Semester, 2024 (25/11/2024 - 08/02/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand key anthropological concepts and methods"
        },
        {
            "number": "LO2.",
            "description": "Think openly and critically about cultural difference and sameness andevaluate the world from a range of perspectives and points of view"
        },
        {
            "number": "LO3.",
            "description": "Synthesize and engage anthropological work on current world issues as experienced in a variety of places by a variety of people"
        },
        {
            "number": "LO4.",
            "description": "Analyse and evaluate current world issues through an anthropological lens"
        },
        {
            "number": "LO5.",
            "description": "Develop critical thinking and communication skills"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "World101x quizzes, questions, maps, projects",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 29/11/2024 - 24/01/2025</p>\n<p>\n</p><p>2:00PM Friday of each World101X online study week, unless specified differently</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Participation/ Student contribution, Project, Quiz, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>*We will show you how to sign into World101x together and discuss the requirements for this assessment item in the first tutorial, so please make sure you are able to attend. Clear instructions will also be posted on blackboard.</strong></p>\n<p><strong>Online quizzes, participation tabs and museum project:</strong></p>\n<p>For each online study module, you will complete short, multiple-choice quizzes on edX to test your comprehension of the module's content. You will also complete participation tabs that prompt you to engage with the online discussion. In week 5, part of the online task includes a museum project that requires that you upload an image and 20-word description of two objects from your home as if they were destined for a museum. These quizzes and other tasks will be completed and scored through the extend platform within blackboard.</p>\n<p>It is highly recommended that you complete the quiz and tasks for each online study module by Friday of that week at <strong>2pm.</strong></p>\n<p>The online study modules will be open throughout the semester, so you can work ahead if you so choose. You will have only one attempt at each quiz; re-tries are not possible. Prior to completing the quiz, please make sure you have a secure internet connection and have updated your internet browser to the latest version.</p>\n<p>You can follow your progress and check your marks on the extend site under the 'progress' tab.</p>\n<p>For more information on quizzes, please see the Learn.UQ Assessment website at <a href=\"https://web.library.uq.edu.au/node/1715/4\">https://web.library.uq.edu.au/node/1715/4</a></p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>If you have any technical problems or questions with regards to online assessment, please visit or contact the UQ Library Ask I.T. </strong>Service Helpdesks at <a href=\"https://web.library.uq.edu.au/library-services/it\">https://web.library.uq.edu.au/library-services/it</a></p>\n<p><strong>AI Use:</strong> This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>These assessments are to be completed via the extend platform via a link within blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Museum Project",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 2/01/2025 4:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>For this project, you will reflect on the role of museums, things and material objects more generally, and your perceptions, ideas, and thoughts about how things get categorised, represented and displayed. Think of something that you own that brings you comfort and joy, something that you would hate to lose, something perhaps with a story to tell. Now think of that thing in a museum in the future, now existing without its story or its history -- an 'orphan thing' that has come to represent an aspect of your society in the early 21st century.</p>\n<p><strong>This project will have three parts:</strong></p>\n<ol>\n<li><strong>Choose ONE object</strong> from your own home that is important to you in some way, and that shows its history, usage and/or significance in some way. Now imagine your object is in a museum 50 years in the future. </li>\n<li><strong>Attach a label to your object</strong>, which will tell someone in 50 years about it, its importance to you, and to the society you live in. The label must be no longer than 100 words. Think critically about the object, its role, and significance, and boil this down to a concise and easy-to-understand label. What do you want to tell others and future generations about this object?</li>\n<li>In addition to this label, you will be required to<strong> reflect in 600 words or less </strong>by thinking critically about some of the issues raised during the course segment on museums. For example: What are the broader political and social dynamics around your choice of the object displayed? How do you imagine they might be received, and how might they best be displayed to reveal your intention/s? What do you think are the dynamics at play when museums display objects from the past in general? </li>\n</ol>\n<p><br/></p>\n<p>This assessment should be submitted to Turnitin via Blackboard and should be structured as follows:</p>\n<ul>\n<li>Title</li>\n<li>Photograph of your object</li>\n<li>Label (100 words)</li>\n<li>Reflection (600 words)</li>\n<li>Bibliography</li>\n</ul>\n<p><br/></p>\n<p><strong>A note on ChatGPT and other forms of generative AI:</strong></p>\n<p>All assignments for this course are to be researched and written by you. You are to explore the literature, you are to think the ideas, you are to write the sentences, you are to build the argument. I recognise that ChatGPT can be used in a variety of ways in the course of learning about a new topic. Some students, for example, might use ChatGPT as a place to start to begin to learn about a new concept or topic. While this can be helpful, it can also produce results that are highly problematic. We will discuss some of these issues during the course. What I ask of you is this:</p>\n<p>1)    All written assignments are to be researched and written by you.</p>\n<p>2)    If you use ChatGPT as a source of initial inquiry, you: a) acknowledge this in your final work in a statement at the end (either before or after your bibliography), b) you divulge the questions you asked AI in the course of research, and c) you use the response you receive as a preliminary start only. It is your responsibility to ensure that the information you gather from AI is accurate and timely and I can assure you, from playing around with ChatGPT myself, that this is not always the case.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. For more information on quizzes, please see the Learn.UQ Assessment website at <a href=\"https://web.library.uq.edu.au/node/1715/4\">https://web.library.uq.edu.au/node/1715/4</a></p>\n<p><strong>If you have any technical problems or questions with regards to online assessment, please visit or contact the UQ Library Ask I.T. Service Helpdesks at </strong><a href=\"https://web.library.uq.edu.au/library-services/it\">https://web.library.uq.edu.au/library-services/it</a></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Media Project",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 24/01/2025 4:00 pm</p>\n<p>\n</p><p>You will need to confirm your format with the course coordinator by <strong>10th January 2025. </strong></p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The media project is an exercise in taking the anthropological understanding you have gained about a variety of world issues and applying it to a specific case or \"current event\". This media project is about you choosing a topic and exploring it anthropologically.</p>\n<p><br/></p>\n<p><strong>Media Project Outline</strong></p>\n<ol>\n<li>Choose a current event or happening. This can be something you pick up in the international or local news; it can be something trending on TikTok or twitter; it can be a major issue in your own field of study (for example, engineering, waste management, or music); or it can be something you observe happening around you, like protests or developments. </li>\n<li>Gather at least 4 primary sources, such as news clips, press releases, government reports, videos, photographs, or other information about this event/happening. Depending on your topic, more than 4 sources may be necessary. Unless you are writing on disinformation, all these sources should be from reliable, trustworthy media sources. Consider: what might an anthropologist have to say about this topic? What is anthropological about this particular event or thing in the world? How might I (meaning you) explain this event to someone else by drawing on the perspectives/tools used in anthropology?</li>\n<li>Reflect on how these primary sources resonate with at least four (4) peer-reviewed anthropological secondary sources. These can be works we have discussed in class, sources you used for your essay, or new sources. Think about how the particular case might be informed by the theory or argument set forth in these anthropological sources.</li>\n<li>From these primary sources, craft your own news piece that brings in an anthropological perspective. This should be between 700-900 words (including captions or comic dialogue), and it can take many different formats: a standard news article, a \"zine\" essay, a radio clip, a video clip, a graphic/comic strip, a series of photos/images/graphs accompanied by relevant text, or something else. <strong>You will need to confirm your format with the course coordinator by 10th January 2025. </strong></li>\n<li>Write a brief 300-word reflection on how your news piece engages with or speaks to anthropological concepts, theory, or perspectives, i.e., your four secondary sources. This reflection allows you to explain how these anthropological concepts, theories or perspectives have informed your news piece. It is both a tool for checking your own analysis and an opportunity to draw clear connections between primary and secondary sources.</li>\n<li>Produce a reference list of all cited primary and secondary anthropological sources. These should be under separate subheadings titled “primary sources” and “secondary sources.” The reference list is NOT part of your word count. Check the UQ Library guides for advice on formatting citations and references for a range of source types: <a href=\"https://guides.library.uq.edu.au/referencing\">ALL GUIDES - Library Guides at University of Queensland Library</a></li>\n</ol>\n<p><br/></p>\n<p><strong>What you will submit has three components: 1)</strong> the 700-900 word news piece that can take a variety of formats and <strong>2)</strong> the 300-word written reflection combined together with <strong>3)</strong> a properly formatted citation list with at least 8 sources (4 primary, 4 secondary). You will submit your components via Turnitin on Blackboard.</p>\n<p><br/></p>\n<p>Even though your project can take different formats, you must demonstrate correct referencing and show that you have drawn upon at least 4 relevant peer reviewed sources.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course.</p>\n<p><strong>AI Use: </strong>Artificial Intelligence (AI) provides emerging tools that may support students in completing this assessment task. Students may appropriately use AI in completing this assessment task. Students must clearly reference any use of AI in each instance. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(25 Nov - 01 Dec)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture 1</strong><br><p>Anthropological perspectives and concepts for contemporary world issues; Discussion of the course structure, assessments, and course expectations</p></br></p></div></td>",
            "topic_title": "<strong>Lecture 1</strong>",
            "topic_description": "Lecture 1 Anthropological perspectives and concepts for contemporary world issues; Discussion of the course structure, assessments, and course expectations",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 1(25 Nov - 01 Dec)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 1</strong><br><p>Getting to know each other and the course, assessments, and the World101x learning modules;</p>\n<p>Discussion of what it means to think anthropologically</p></br></p></div></td>",
            "topic_title": "<strong>Workshop 1</strong>",
            "topic_description": "Workshop 1 Getting to know each other and the course, assessments, and the World101x learning modules; Discussion of what it means to think anthropologically",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 1(25 Nov - 01 Dec)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>World101x Episode 0 &amp; Episode 1</strong><br><p>Online via UQx World101x. Complete all online tasks (videos, quizzes, discussions, surveys)</p>\n<p>Assessment: quizzes in Episode 1</p></br></p></div></td>",
            "topic_title": "<strong>World101x Episode 0 &amp; Episode 1</strong>",
            "topic_description": "World101x Episode 0 & Episode 1 Online via UQx World101x. Complete all online tasks (videos, quizzes, discussions, surveys) Assessment: quizzes in Episode 1",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(02 Dec - 08 Dec)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture 2</strong><br><p>Colonialism, multiculturalism, and nationalism</p></br></p></div></td>",
            "topic_title": "<strong>Lecture 2</strong>",
            "topic_description": "Lecture 2 Colonialism, multiculturalism, and nationalism",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(02 Dec - 08 Dec)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 2</strong><br><p>Discussion of course material: Anthropological approaches to understanding nationalism, multiculturalism, racism;</p>\n<p>Discussion of museum project, finding peer-reviewed sources, and the purpose of a rough draft;</p>\n<p>BRING AT LEAST 3 PEER-REVIEWED SOURCES FOR MUSEUM PROJECT TO WORKSHOP (see Blackboard for more details);</p></br></p></div></td>",
            "topic_title": "<strong>Workshop 2</strong>",
            "topic_description": "Workshop 2 Discussion of course material: Anthropological approaches to understanding nationalism, multiculturalism, racism; Discussion of museum project, finding peer-reviewed sources, and the purpose of a rough draft; BRING AT LEAST 3 PEER-REVIEWED SOURCES FOR MUSEUM PROJECT TO WORKSHOP (see Blackboard for more details);",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(02 Dec - 08 Dec)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>World 101x Episode 2</strong><br><p>Online via UQx World101x. Complete all online tasks (videos, quizzes, discussions, surveys)</p>\n<p>Assessment: quizzes in Episode 2</p></br></p></div></td>",
            "topic_title": "<strong>World 101x Episode 2</strong>",
            "topic_description": "World 101x Episode 2 Online via UQx World101x. Complete all online tasks (videos, quizzes, discussions, surveys) Assessment: quizzes in Episode 2",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(09 Dec - 15 Dec)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture 3</strong><br/><p>Conceptualising indigeneity, identity, and sovereignty</p></p></div></td>",
            "topic_title": "<strong>Lecture 3</strong>",
            "topic_description": "Lecture 3 Conceptualising indigeneity, identity, and sovereignty",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(09 Dec - 15 Dec)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 3</strong><br/><p>Discussion of course material: Indigeneity as identity and anthropological concept, belonging in settler colonial societies, and Indigenous rights movements;</p>\n<p>Discussion of thesis statements and writing anthropologically; </p>\n<p>BRING IDEAS FOR MUSEUM PROJECT FOR WORKSHOP (see Blackboard for more details)</p></p></div></td>",
            "topic_title": "<strong>Workshop 3</strong>",
            "topic_description": "Workshop 3 Discussion of course material: Indigeneity as identity and anthropological concept, belonging in settler colonial societies, and Indigenous rights movements; Discussion of thesis statements and writing anthropologically; BRING IDEAS FOR MUSEUM PROJECT FOR WORKSHOP (see Blackboard for more details)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(09 Dec - 15 Dec)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>World 101x Episode 3 &amp; Episode 4</strong><br/><p>Online via UQx World101x. Complete all online tasks (videos, quizzes, discussions, surveys)</p>\n<p>Assessment: quizzes in Episode 3 &amp; Episode 4</p></p></div></td>",
            "topic_title": "<strong>World 101x Episode 3 &amp; Episode 4</strong>",
            "topic_description": "World 101x Episode 3 & Episode 4 Online via UQx World101x. Complete all online tasks (videos, quizzes, discussions, surveys) Assessment: quizzes in Episode 3 & Episode 4",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(16 Dec - 22 Dec)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture 4</strong><br/><p>Material Culture, Museums, &amp; the Social/Political Life of Things</p></p></div></td>",
            "topic_title": "<strong>Lecture 4</strong>",
            "topic_description": "Lecture 4 Material Culture, Museums, & the Social/Political Life of Things",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(16 Dec - 22 Dec)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 4</strong><br/><p>Discussion of course material: The politics of representation and decolonizing collections;</p>\n<p>BRING ROUGH DRAFT OF MUSEUM PROJECT TO WORKSHOP FOR FINAL PEER REVIEW (see Blackboard for more details)</p></p></div></td>",
            "topic_title": "<strong>Workshop 4</strong>",
            "topic_description": "Workshop 4 Discussion of course material: The politics of representation and decolonizing collections; BRING ROUGH DRAFT OF MUSEUM PROJECT TO WORKSHOP FOR FINAL PEER REVIEW (see Blackboard for more details)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(16 Dec - 22 Dec)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>World101x Episode 5</strong><br/><p>Online via UQx World101x. Complete all online tasks (videos, quizzes, discussions, surveys)</p>\n<p>Assessment: quizzes in Episode 5</p></p></div></td>",
            "topic_title": "<strong>World101x Episode 5</strong>",
            "topic_description": "World101x Episode 5 Online via UQx World101x. Complete all online tasks (videos, quizzes, discussions, surveys) Assessment: quizzes in Episode 5",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5 (Mid Sem break ends Wed)(30 Dec - 05 Jan)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture 5</strong><br/><p>Global connection, precarity, and life within limits</p></p></div></td>",
            "topic_title": "<strong>Lecture 5</strong>",
            "topic_description": "Lecture 5 Global connection, precarity, and life within limits",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5 (Mid Sem break ends Wed)(30 Dec - 05 Jan)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Museum Project Due </strong><br/><p>Museum project due Thursday 2nd Jan, 4pm</p></p></div></td>",
            "topic_title": "<strong>Museum Project Due </strong>",
            "topic_description": "Museum Project Due Museum project due Thursday 2nd Jan, 4pm",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5 (Mid Sem break ends Wed)(30 Dec - 05 Jan)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 5</strong><br/><p>Discussion of course material: Limits, hope, and making do in everyday life;</p>\n<p>Discussion of media assignment;</p>\n<p>WORKSHOP POTENTIAL IDEAS AND FORMATS FOR THE MEDIA PROJECT (see Blackboard for more details)</p></p></div></td>",
            "topic_title": "<strong>Workshop 5</strong>",
            "topic_description": "Workshop 5 Discussion of course material: Limits, hope, and making do in everyday life; Discussion of media assignment; WORKSHOP POTENTIAL IDEAS AND FORMATS FOR THE MEDIA PROJECT (see Blackboard for more details)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5 (Mid Sem break ends Wed)(30 Dec - 05 Jan)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>World101x Episode 6</strong><br/><p>Online via UQx World101x. Complete all online tasks (videos, quizzes, discussions, surveys)</p>\n<p>Assessment: quizzes in Episode 6</p></p></div></td>",
            "topic_title": "<strong>World101x Episode 6</strong>",
            "topic_description": "World101x Episode 6 Online via UQx World101x. Complete all online tasks (videos, quizzes, discussions, surveys) Assessment: quizzes in Episode 6",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(06 Jan - 12 Jan)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture 6</strong><br/><p>Resources, commodification, and rights</p></p></div></td>",
            "topic_title": "<strong>Lecture 6</strong>",
            "topic_description": "Lecture 6 Resources, commodification, and rights",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(06 Jan - 12 Jan)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 6</strong><br/><p>Discussion of course material: Thinking about value, translation &amp; rights amid privatization and environmental struggles;</p>\n<p>Discussion of linking data with anthropological theory/concepts;</p>\n<p>BRING AT LEAST 4 PRIMARY SOURCES &amp; 2 PEER-REVIEWED SOURCES FOR MEDIA PROJECT TO WORKSHOP (see Blackboard for more details) &amp; CONFIRM MEDIA PROJECT FORMAT</p></p></div></td>",
            "topic_title": "<strong>Workshop 6</strong>",
            "topic_description": "Workshop 6 Discussion of course material: Thinking about value, translation & rights amid privatization and environmental struggles; Discussion of linking data with anthropological theory/concepts; BRING AT LEAST 4 PRIMARY SOURCES & 2 PEER-REVIEWED SOURCES FOR MEDIA PROJECT TO WORKSHOP (see Blackboard for more details) & CONFIRM MEDIA PROJECT FORMAT",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(06 Jan - 12 Jan)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>World101x Episode 7</strong><br/><p>Online via UQx World101x. Complete all online tasks (videos, quizzes, discussions, surveys)</p>\n<p>Assessment: quizzes in Episode 7</p></p></div></td>",
            "topic_title": "<strong>World101x Episode 7</strong>",
            "topic_description": "World101x Episode 7 Online via UQx World101x. Complete all online tasks (videos, quizzes, discussions, surveys) Assessment: quizzes in Episode 7",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(13 Jan - 19 Jan)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture 7</strong><br/><p>Movement, migration, and displacement</p></p></div></td>",
            "topic_title": "<strong>Lecture 7</strong>",
            "topic_description": "Lecture 7 Movement, migration, and displacement",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(13 Jan - 19 Jan)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 7</strong><br/><p>Discussion of course material: Anthropological approaches to understanding migration, borders, and belonging;</p>\n<p>BRING DRAFT SCRIPT OF MEDIA PROJECT TO WORKSHOP (see Blackboard for more details)</p></p></div></td>",
            "topic_title": "<strong>Workshop 7</strong>",
            "topic_description": "Workshop 7 Discussion of course material: Anthropological approaches to understanding migration, borders, and belonging; BRING DRAFT SCRIPT OF MEDIA PROJECT TO WORKSHOP (see Blackboard for more details)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(13 Jan - 19 Jan)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>World101x Episode 8</strong><br/><p>Online via UQx World101x. Complete all online tasks (videos, quizzes, discussions, surveys)</p>\n<p>Assessment: quizzes in Episodes 8</p></p></div></td>",
            "topic_title": "<strong>World101x Episode 8</strong>",
            "topic_description": "World101x Episode 8 Online via UQx World101x. Complete all online tasks (videos, quizzes, discussions, surveys) Assessment: quizzes in Episodes 8",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(20 Jan - 26 Jan)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture 8</strong><br/><p>Anthropocene, toxicity, power</p></p></div></td>",
            "topic_title": "<strong>Lecture 8</strong>",
            "topic_description": "Lecture 8 Anthropocene, toxicity, power",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(20 Jan - 26 Jan)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>World101x Episode 9</strong><br/><p>Online via UQx World101x. Complete all online tasks (videos, quizzes, discussions, surveys)</p>\n<p>Assessment: quizzes in Episodes 9</p></p></div></td>",
            "topic_title": "<strong>World101x Episode 9</strong>",
            "topic_description": "World101x Episode 9 Online via UQx World101x. Complete all online tasks (videos, quizzes, discussions, surveys) Assessment: quizzes in Episodes 9",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(20 Jan - 26 Jan)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 8</strong><br/><p>Conclusion of course and discussion of course materials: Thinking anthropologically about global phenomena</p>\n<p>DISCUSSION OF ANY FINAL QUESTIONS ABOUT MEDIA PROJECT (see Blackboard for more details)</p></p></div></td>",
            "topic_title": "<strong>Workshop 8</strong>",
            "topic_description": "Workshop 8 Conclusion of course and discussion of course materials: Thinking anthropologically about global phenomena DISCUSSION OF ANY FINAL QUESTIONS ABOUT MEDIA PROJECT (see Blackboard for more details)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(20 Jan - 26 Jan)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Media Assignment Due Fri 4PM</strong><br/><p>See assessment section of Course Profile for details</p></p></div></td>",
            "topic_title": "<strong>Media Assignment Due Fri 4PM</strong>",
            "topic_description": "Media Assignment Due Fri 4PM See assessment section of Course Profile for details",
            "learning_outcomes": []
        }
    ]
}