{
    "course_title": "Literature Review",
    "study_period": "Summer 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/BIOX7100-80099-7480",
    "full_course_code": "BIOX7100-80099-7480",
    "course_code": "BIOX7100",
    "class_code": "80099",
    "semester_code": "7480",
    "semester_details": "Summer Semester, 2024 (25/11/2024 - 08/02/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Critically read the scientific literature and recognise papers of great scientific merit in a defined area;"
        },
        {
            "number": "LO2.",
            "description": "Comprehensively evaluate work already done in an area and assess where deficiencies in the knowledge of the subject lie;"
        },
        {
            "number": "LO3.",
            "description": "Critically review an area of research to detect its strengths and weaknesses;"
        },
        {
            "number": "LO4.",
            "description": "Organise ideas derived from other people's work, and to write a clear, concise, readily understandable review in an objective manner."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Meetings with Supervisor",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 24/01/2025 2:00 pm</p>\n<p>\n</p><p>Meetings held throughout semester</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Oral",
            "category": "Notebook/ Logbook, Participation/ Student contribution",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Supervisor meetings during semester</strong></p>\n<p>You should arrange to meet with your supervisor<strong> at least 5 times</strong> during the semester to discuss your chosen topic and paper. <strong>You should ensure that a record of your meetings with your supervisor is maintained using the meeting diary template</strong>. You will note such things as what was discussed and what you were requested to do before the next meeting using the meeting diary template. Please ensure that your supervisor signs and dates each entry. A copy of the meeting diary should be submitted through the relevant Turnitin submission point in Blackboard by the due date given in the course profile. Scanned copies are acceptable.</p>\n<p>Your performance during and in response to these meetings will be taken into account when the supervisor formulates a mark. In silico meetings (e.g. via Zoom or email) are acceptable. If you do not arrange and attend these meetings you will fail the course (see course hurdles).</p>\n<p><strong>Supervisor's mark (advice for supervisors)</strong></p>\n<p>If the student does not attend regular meetings or keep in regular email contact they should be marked accordingly. The mark they are awarded should reflect the depth of issues discussed and questions asked, and your perception of their critical analysis skills.</p>\n<p><strong>Use of Artificial Intelligence (AI) or Machine Translation (MT)</strong></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit a scanned copy of your meeting diary through the course Turnitin submission point in Blackboard when you submit your Literature Review. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Literature review",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>80%</dd>",
            "due_date": "<dd><p> 24/01/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Selection of the Literature Assignment topic</strong></p>\n<p>1. The student should decide on a scientific area that aligns with their Masters program and that interests them. Before the first week of semester the student should secure a supervisor. There are many avenues to identify a potential supervisor:</p>\n<p>·        the School of Chemistry and Molecular Biosciences website (<a href=\"http://scmb.uq.edu.au/\">scmb.uq.edu.au</a>)</p>\n<p>·        the SCMB Research Projects booklet (<a href=\"http://scmb.uq.edu.au/postgrad-coursework\">scmb.uq.edu.au/postgrad-coursework</a>)</p>\n<p>·        web pages of the various research institutes at UQ, links to those web pages can be found here <a href=\"https://research.uq.edu.au/\">research.uq.edu.au</a></p>\n<p><strong>·     </strong>   the UQ Researchers website<strong> (</strong><a href=\"https://researchers.uq.edu.au/\">researchers.uq.edu.au</a>)</p>\n<p>You should contact prospective supervisors and ask whether they have time to supervise your literature review. Supervision will involve meeting with you <strong>at least 5 times</strong> during semester to discuss your progress and help you with any difficulties you have encountered. Your supervisor must sign the <a href=\"https://scmb.uq.edu.au/files/18632/SCMB%20Postgraduate%20Coursework%20Supervisor%20Approval%20Form%20-%20Jan%202022.pdf\">SCMB Postgraduate Coursework Supervisor Approval Form</a>. </p>\n<p>2. Once you have had an introductory meeting with your supervisor and established the area of research for your literature review, you should begin looking for key papers. This will involve searching the various library databases (<em>e.g.</em> PubMed) for relevant papers. If you are not familiar with these databases, you should enrol in one of the short courses offered by the library. Please ask at the Information desk or contact the UQ library online (https://web.library.uq.edu.au/contact-us) and indicate that you are a postgraduate student. You should then further discuss the area you wish to review with your supervisor to confirm that the area is of current interest to the field and is of sufficient breadth such that there is adequate material to review. <strong><em>The area chosen will not have been reviewed recently.</em></strong></p>\n<p><strong>Preparation of the Literature Review</strong></p>\n<p>The Literature Review will consist of the sections described below and it is expected that the review will cover approximately 100 papers from the primary literature (ie not reviews themselves). The page limit is 30 pages (this does NOT include bibliography, figures and tables) <strong><em>if this limit is exceeded penalties will be applied in marking</em>.</strong></p>\n<p>The plan will be prepared using a word processor: page margins will be set to 2cm all round, pages will be numbered, font of 12pt Calibri or Times New Roman (or equivalent) is acceptable, line spacing of 1.5 will be used. The first page (not counted in the total number pages) should carry your title, course code your name and student number, and your supervisor’s details.</p>\n<p>The Literature Review should be similar in style to reviews published by scientific journals (see Nature Reviews for an example). There is no need to format the text into columns. All figures and figure legends should be inserted into the text as close as possible to the point where the figure is referred to. Figures are very useful - ideally you should create your own to summarise findings from multiple papers. You can use figures from published papers as along as the figure legend is your own words and you reference the source of the image. In general the review would have the following sections:</p>\n<p><strong>(a) An abstract</strong>. This should be no longer than 1 page and should briefly summarise the focus of the review.</p>\n<p><strong>(b) Background</strong>. This section should describe the biological system or process that is the focus of the review. This section should introduce the reader to all of the relevant terminology and describe the established function or role of the components of the system or process.</p>\n<p><strong>(c) Recent Advances.</strong> In this section you should summarise the recent work that has been published in your chosen research area. You should try to categorise findings and present them together. Particular attention should be given to aspects of the research area that are controversial or where conflicting data has been published.</p>\n<p><strong>(d) Conclusion/Perspectives.</strong> This section should be a brief description of the \"state-of-play\" in the research area you have reviewed. What are the overall outcomes from all of the published research? Where to now? You should look to give personal insight into: where advances have truly been made; the limitations of the current published work; and what still need to be investigated.</p>\n<p><strong>(e) Bibliography. </strong>Include titles of research articles, and include URLs</p>\n<p><strong>Assessment of the Literature review </strong></p>\n<p>Your literature review will be assessed by two examiners using the published criteria.</p>\n<p>Finally, remember that the Literature review must be your own work. You may obtain advice and comment from your supervisor on the ideas in your proposal, and from various sources on whether your English expression is appropriate, but you should not request, or expect, others to rewrite your submission. Acknowledge all help and sources, especially if you quote text and ideas written by others.</p>\n<p><strong>Use of Artificial Intelligence (AI) or Machine Translation (MT)</strong></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit your literature review through the course Turnitin submission point in Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 8(25 Nov - 26 Jan)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Literature Review Workshops</strong><br><p>Workshop run weekly by Dr Zyta Ziora to support planning and writing.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Literature Review Workshops</strong>",
            "topic_description": "Literature Review Workshops Workshop run weekly by Dr Zyta Ziora to support planning and writing.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}