{
    "course_title": "Exercise for Healthy Populations Practicum",
    "study_period": "Summer 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/HMST3001-80069-7480",
    "full_course_code": "HMST3001-80069-7480",
    "course_code": "HMST3001",
    "class_code": "80069",
    "semester_code": "7480",
    "semester_details": "Summer Semester, 2024 (04/11/2024 - 09/03/2025)",
    "learning_outcomes": [],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Professional Attributes Self-Assessment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> PASS/FAIL </dd>",
            "due_date": "<dd><p>Upon accrual of 48 placement hours</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>As a student practitioner embarking on your first placement, you are required (and very strongly encouraged) to reflect on your own performance at the end of your first week of placement. During your reflections you are required to ‘self-assess’ and provide a rating of your performance, graded on a Likert scale (‘Not Meeting Expectations’, ‘On Track to Meet Expectations’, ‘Meeting Expectations’, and ‘Exceeds Expectations’). Your reflections are based on the following eight Professional Attributes:</p>\n<ol>\n<li>Professional conduct</li>\n<li>Client interaction/rapport (Client facing skills)</li>\n<li>Collaborative practice</li>\n<li>Communication</li>\n<li>Awareness of limitations and work-readiness</li>\n<li>Exercise prescription</li>\n<li>Exercise assessment, and</li>\n<li>Exercise delivery</li>\n</ol>\n<p>Following this, student practitioners are required to develop three ‘SMART’ learning goals appropriate to their placement. These SMART goals will be tracked throughout your placement with your clinical educator often returning to these goals during your professional attribute’s intermediate assessment and your professional attributes final assessment.</p>\n<p>You are encouraged to develop your critical reflective ability through this task. To support your self-assessment, your clinical educator will encourage deeper reflection on a range of professional attributes by providing excerpts derived from your logbook entries. Using these excerpts, questions will be posed to you to assist you in deeper exploration of the selected professional attributes.</p>\n<p><strong>A note on the use of Artificial Intelligence (AI):</strong></p>\n<ul>\n<li>The accreditation and competency assessments evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI).</li>\n<li>Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via ePortfolio. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Critical Reflections",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> PASS/FAIL </dd>",
            "due_date": "<dd><p>Upon accrual of 60 and 100 placement hours</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Self-reflection is a vital skill to develop for understanding and evaluating experiences. This assessment piece is designed to support student's transition from theory to practice by promoting critical self-reflection. Students are required to analytically reflect upon a real-life ‘critical’ event, incident, activity or task that you experience on placement. A critical incident can be positive or negative. These are events or ‘light bulb moments’ which occurred during (or as a result of) your clinical development and have impacted you in an important (critical) way. A total of two written reflections need to be submitted throughout HMST3001 (upon the accrual of 60 and 100 placement hours, respectively). They should provide insight into how your professional skills and attributes improve, the challenges you overcome and identify, and the new training methods you’ve added to your professional ‘toolbox’. Content should follow the SEALER reflection structure. </p>\n<p><strong>A note on the use of Artificial Intelligence (AI):</strong></p>\n<ul>\n<li>The Critical Reflections evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</li>\n<li>The Professional Attributes Intermediate Assessment is to be completed in-person. The use of Artificial Intelligence (AI) tools will not be permitted. Any attempted use of AI may constitute student misconduct under the Student Code of Conduct.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via ePortfolio.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Placement Consolidation Video",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> PASS/FAIL </dd>",
            "due_date": "<dd><p>Upon accrual of 140 placement hours</p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L06",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will reflect against their own practice and experiences gathered during their time on placement in video format. Students will be required to respond to four questions to promote their reflection and consolidation of their placement experience.</p>\n<p>The questions are designed to focus your reflection in four domains:</p>\n<ul>\n<li>'Where am I up to',</li>\n<li>'How I got here',</li>\n<li>''How am I progressing', and</li>\n<li>'Where am I going'.</li>\n</ul>\n<p>Note: There are no strict rules for structuring your video reflection given you answer the questions clearly and legibly. However the duration of video is capped at <strong>three to four minutes long</strong> to allow your clinical educator equal time to all students.</p>\n<p><strong>A note on the use of Artificial Intelligence (AI):</strong></p>\n<ul>\n<li>The Placement Consolidation Video evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI).</li>\n<li>Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via ePortfolio.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Accreditation & Competency Assessments",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> PASS/FAIL </dd>",
            "due_date": "<dd><p><strong>Students as Practitioner Documents</strong></p>\n<p><em>Logbooks:</em></p>\n<p>Due 5:00pm, Monday following each week of placement</p>\n<p><em>Record of Student Engagement (ROSE) form:</em></p>\n<ul>\n<li>Without supervisor signature: Due within 10 business days after the completion of your placement.</li>\n<li>With supervisor signature: Due within 20 business days after the completion of your placement.</li>\n</ul>\n<p><strong>Professional Attributes Competency Assessments</strong></p>\n<p><em>Professional Attributes Intermediate Assessment</em></p>\n<p>Due upon accrual of 70 to 80 placement hours</p>\n<p><em>Professional Attributes Final Assessment</em></p>\n<p>Due 5:00pm, Friday on last day of placement (Upon accrual of 140 placement hours)</p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L06",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>In order for students to demonstrate meeting the ESSA Practicum Standards during their placement, a number of verification documents are required across two domains, focusing on Accreditation (Students as Practitioner Documents) and Competency (Professional Attributes Assessments), respectively.</p>\n<p><strong>Accreditation Domain: </strong></p>\n<p><strong>Student as Practitioner Documents </strong>(including logbooks, and record of student engagement forms)</p>\n<ol>\n<li><strong>Logbooks</strong></li>\n</ol>\n<ul>\n<li>In order to prove that students meet ESSA Practicum Standards during their placement, a record of activities or 'logbook' must be kept, detailing all relevant practicum hours.</li>\n<li>For HMST3001, a minimum of 140 hours of practicum is required to be undertaken in a variety of activities to demonstrate attainment of competency in exercise assessment, prescription, delivery and 'other' AES scope of practice hours.</li>\n<li>Logbooks are to be submitted by <strong>9pm</strong> each Monday and will be reviewed by your clinical educator.</li>\n<li>Logbooks must be submitted via <a href=\"https://placements.uq.edu.au/\">InPlace</a>.</li>\n<li>Feedback from clinical educators must be addressed in a timely manner, before the end of semester, in order to receive a passing grade.</li>\n<li>HMST3001 requires all assessment items to be graded to a satisfactory level to pass the course. Satisfactory level on InPlace is classified as having all logbook entries classed as “<strong>Finalised\"</strong>.</li>\n</ul>\n<p><strong>Due Date: 5pm Monday following each week of placement </strong></p>\n<p>___________________________________________________________________________________________________________________________________________________</p>\n<ol>\n<li><strong>Record of Student Engagement (ROSE) Form</strong></li>\n</ol>\n<p>The ROSE form provides a summary of the activities you undertook on your HMST3001 placement (i.e. a summary of what was included in your logbooks) and a reflection on how this placement assisted you to develop the ESSA exercise science professional attributes (different to the ‘Professional Attributes’ used in your self-assessment, intermediate assessment, and final supervisor assessment) required for an Accredited Exercise Scientist.</p>\n<p>A copy of the <strong>ESSA exercise science professional attributes</strong> is attached below and have also been made available on Blackboard.</p>\n<p>There are two due dates for the ROSE form:</p>\n<ul>\n<li><strong>Without</strong> supervisor signature: Complete and submit your ROSE form via ePortfolio without your supervisor's signature within 10 business days after completion of your placement. Your clinical educator will review and provide feedback before you obtain the signature.</li>\n<li><strong>With</strong> supervisor signature: Following feedback from your clinical educator, obtain your placement supervisors signature and submit to ePortfolio within 20 business days <strong>(one month)</strong> after the completion of your placement. Your ROSE form cannot be finalised without a valid placement supervisor signature.</li>\n</ul>\n<p>·        <strong>Submission of a ROSE form after 20 business days (one month) after the completion of placement will result in a fail grade</strong></p>\n<p><strong>Due Date: </strong></p>\n<ul>\n<li><strong>Without</strong> supervisor signature: Due within 10 business days (two weeks) after the completion of your placement.</li>\n<li><strong>With</strong> supervisor signature: Due within 20 business days (one month) after the completion of your placement.</li>\n</ul>\n<p><strong>Note:</strong> Business days does not include weekends or public holidays.</p>\n<p>___________________________________________________________________________________________________________________________________________________</p>\n<p><strong>Competency Domain: </strong></p>\n<p><strong>Professional Attributes Competency Assessments </strong>(Including professional attributes intermediate and final assessment)</p>\n<p><strong>1. Professional Attributes Intermediate Assessment</strong></p>\n<p>Student practitioners will have their placement performance assessed by their practicum supervisor and their clinical educator when they have accrued between 70 to 80 placement hours. Performance is graded on a Likert scale ('Not Meeting Expectations’, 'On Track to Meet Expectations', 'Meeting Expectations', and 'Exceeds Expectations') and is based on eight professional attributes:</p>\n<ol>\n<li>Professional conduct</li>\n<li>Client interaction/rapport (Client facing skills)</li>\n<li>Collaborative practice</li>\n<li>Communication</li>\n<li>Awareness of limitations and work-readiness</li>\n<li>Exercise prescription</li>\n<li>Exercise assessment, and</li>\n<li>Exercise delivery.</li>\n</ol>\n<p> Your clinical educator has provided you with excerpts pulled from your logbooks that match sub-skills listed in either the “Awareness of Limitations”, “Exercise Assessment”, “Exercise Prescription”, and or “Exercise Delivery” Professional Attributes. These can be found in your logbook feedback under “Exercising Insights: Intermediate Assessment”. You are strongly encouraged to reflect on these excerpts to better prepare yourself for the intermediate assessment.</p>\n<ul>\n<li>Intermediate assessments are conducted by the student's clinical educator and no submission is required from the student.</li>\n<li>Students are required to initiate communication with their practicum supervisor and clinical educator to ensure that this assessment is scheduled in week three of their placement.</li>\n<li>It is strongly encouraged that students email their clinical educator by the end of their first week of placement to arrange and book the intermediate assessment.</li>\n<li>Intermediate assessments will be conducted with all three parties (i.e. student, practicum supervisor and clinical educator) either face-to-face at the placement site or online via Zoom or Teams where appropriate.</li>\n<li>The purpose of the intermediate assessment is to provide students with an early indication of how they are performing, make sure they feel properly oriented and supported, and re-evaluate 'SMART' learning goals set during their self-assessment. In the case of any early difficulties, strategies for improvement can be implemented.</li>\n</ul>\n<p><strong>Due date:</strong> Upon accrual of 70 to 80 placement hours</p>\n<p><strong>2. Professional Attributes Final Assessment</strong></p>\n<p>Students will have their performance on placement assessed by their practicum supervisor on their last day of placement (or as close to this as possible, considering scheduling requirements). Performance is graded on a Likert scale ('Not Meeting Expectations’, 'Meeting Expectations', and 'Exceeds Expectations') and is based on eight professional attributes:</p>\n<ol>\n<li>Professional conduct</li>\n<li>Client interaction/rapport (Client facing skills)</li>\n<li>Collaborative practice</li>\n<li>Communication</li>\n<li>Awareness of limitations and work-readiness</li>\n<li>Exercise prescription</li>\n<li>Exercise assessment, and</li>\n<li>Exercise delivery</li>\n</ol>\n<p>Final assessments are conducted by the practicum supervisor (clinical educator’s or the student are not required to be present). Students will be required to send the ‘final assessment’ link to their practicum supervisor. The final assessment link should be sent at least 7 business days prior to the students last day of placement.</p>\n<p>Students are also responsible for providing their placement supervisor with a copy of their ‘professional attribute Intermediate Assessment’ outcomes. A “How-To” video has been made to support you in this responsibility. The video can be found on Blackboard within the “</p>\n<p>Students are required to communicate with their practicum supervisor to ensure that the final assessment is completed before the end of their last day of placement. A “How-To” video has been made to guide you in sending the ‘final assessment link’ to your placement supervisor.</p>\n<p>The purpose of the final assessment is to provide students with an indication of how they performed on placement to inform future placements and/or practice. </p>\n<p><strong>Due Date: </strong>1pm Friday on last day of placement (Upon accrual of 140 placement hours)</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via ePortfolio.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Not scheduled",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Course Orientation</strong><br/><p>- Introduces the course objectives <br/>- Describes assessment requirements<br/>- Outlines ESSA's exercise science practicum requirements and reviews implications on logbooks and student as practitioner documents.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Course Orientation</strong>",
            "topic_description": "Course Orientation - Introduces the course objectives - Describes assessment requirements - Outlines ESSA's exercise science practicum requirements and reviews implications on logbooks and student as practitioner documents.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Healthy Populations Practicum</strong><br><p>Students to organise and complete 140 hours of practicum in an appropriate setting providing exercise delivery for apparently healthy individuals</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Healthy Populations Practicum</strong>",
            "topic_description": "Healthy Populations Practicum Students to organise and complete 140 hours of practicum in an appropriate setting providing exercise delivery for apparently healthy individuals",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        }
    ]
}