{
    "course_title": "Food & Fibre Case Studies I",
    "study_period": "Sem 1 2025",
    "location": "Gatton",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/AGRC1012-20628-7520",
    "full_course_code": "AGRC1012-20628-7520",
    "course_code": "AGRC1012",
    "class_code": "20628",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Classify the types and operations of firms in the agribusiness supply chain"
        },
        {
            "number": "LO2.",
            "description": "Analyse aspects of the management of an individual agribusiness by using a Business Model Canvas"
        },
        {
            "number": "LO3.",
            "description": "Evaluate elements of the business environment that influence the management and profitability of these firms"
        },
        {
            "number": "LO4.",
            "description": "Demonstrate the preliminary steps of the entrepreneurship process involved in starting a business"
        },
        {
            "number": "LO5.",
            "description": "Report your findings at an appropriately professional standard, both orally and in written form"
        },
        {
            "number": "LO6.",
            "description": "Interact effectively as a group toward a common outcome."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Business Model Canvas Reports (Individual)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>60% (Marks breakdown = BMC 1: 10%; BMC 2: 50%) </dd>",
            "due_date": "<dd><p>BMC 1: 7/04/2025 2:00 pm</p>\n<p>BMC 2: 13/05/2025 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Business Model Canvas Reports 1:</strong></p>\n<p>These assessments involve a field visit to an agribusiness, where students utilise the Business Model Canvas (BMC) to understand the business. It is a practical and comprehensive approach to learning. This method introduces students to the real-world dynamics of agribusiness and equips them with a powerful analytical tool to examine its operations.</p>\n<p>The BMC is a strategic management template for developing new business models or documenting and analysing existing ones. It visually outlines a business's nine key building blocks, making it easier to understand how a company operates, generates value, and sustains itself in the competitive market. These blocks include:</p>\n<p><br/></p>\n<p>1. <strong>Value Propositions: </strong>What value does the business promise to deliver to its customers? This component focuses on the problem the business solves or the need it fulfils.</p>\n<p>2. <strong>Customer Segments:</strong> Who are the business's target customers? Identifying the specific segments the business serves is crucial for tailoring its value propositions.</p>\n<p>3.<strong> Channels:</strong> How does the business reach customer segments to deliver the value proposition? This involves the company's marketing and distribution strategies.</p>\n<p>4. <strong>Customer Relationships:</strong> What relationship does the business establish with its customer segments? This could range from personal assistance to automated services.</p>\n<p>5. <strong>Revenue Streams: </strong>How does the business earn money? This block examines the company's various sources of income.</p>\n<p>6. <strong>Key Resources:</strong> What critical assets are essential for the business to deliver its value proposition? Resources can be physical, intellectual, human, or financial.</p>\n<p>7. <strong>Key Activities:</strong> What are the most important activities the business must do to deliver its value proposition? This includes production, problem-solving, and platform/network maintenance.</p>\n<p>8. <strong>Key Partnerships:</strong> Who are the business's key partners or suppliers? Partnerships are crucial for optimising operations, reducing risks, and acquiring resources.</p>\n<p>9. <strong>Cost Structure:</strong> What are the business's major cost drivers? Understanding the cost structure is vital for ensuring the business model is financially viable.</p>\n<p>By analysing an agribusiness through the lens of the BMC, students will gain insights into how the business creates, delivers, and captures value. This hands-on experience deepens their understanding of the theoretical aspects of business models and enhances their analytical skills by applying the BMC to a real-world context. Addressing all nine building blocks allows students to develop a holistic view of the business's operational, financial, and strategic foundations, preparing them for future roles in business development, strategic planning, and entrepreneurship.</p>\n<p><br/></p>\n<p><strong>Business Model Canvas Report 2:</strong></p>\n<p>Building on the foundational skills developed in the first two assessments, the third assessment challenges students to delve deeper into the Business Model Canvas (BMC) they have previously completed. This phase of the assessment series is designed to enhance analytical and problem-solving skills, focusing on strategic aspects of the agribusiness studied. Below are the detailed instructions for completing this assessment:</p>\n<p><strong>Assessment Overview:</strong></p>\n<p>For this assessment, you will build upon the work done in the previous assessments by conducting a thorough analysis of the agribusiness using the BMC. Your task includes creating a value chain map for the company, identifying a specific problem within one of the BMC’s nine building blocks, and proposing a viable solution.</p>\n<p><strong>Instructions </strong></p>\n<p><strong>1. Value Chain Analysis:</strong></p>\n<p>• Begin by mapping out the agribusiness's primary and support activities to introduce the value chain concept.</p>\n<p><strong>2. Analysis of BMC Building Blocks:</strong></p>\n<p>• Review the Business Model Canvas you completed in the previous assessment.</p>\n<p>• Write a detailed report on each of the nine building blocks, focusing on the operational, financial, and strategic aspects of the agribusiness. Each section should include an analysis of the current state.</p>\n<p><strong>3. Identification of a Problem:</strong></p>\n<p>• Based on your analysis, identify a critical problem or area of improvement within one of the nine building blocks. Explain why this issue is significant and how it affects the overall business model.</p>\n<p><strong>4. Proposing a Solution:</strong></p>\n<p>• Develop a comprehensive solution to the identified problem. Your solution should be practical, based on industry best practices, and include a brief implementation plan. Consider the potential impact of your solution on the business's operations and financial health.</p>\n<p><strong>Submission Guidelines</strong></p>\n<p>• Your report will be submitted on Turnitin.</p>\n<p>• Ensure your analysis is supported by relevant data, theories, and concepts discussed in class.</p>\n<p>• While this instruction does not specify a word limit, please note that Inspera will impose a word limit for each section of the report.</p>\n<p>• Submit your completed assessment through Inspera by the specified deadline. Review the platform's submission guidelines and technical requirements beforehand.</p>\n<p>This assessment offers an opportunity to showcase your comprehensive understanding of the BMC, analytical skills, and ability to propose strategic solutions to real-world business challenges.</p>\n<p><br/></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your Assessment task, in Blackboard, via the Turnitin link by the submission deadline. You should also retain an electronic copy of every piece of assessment you submit. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Group Presentation (Existing Agribusiness)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p> 15/04/2025</p>\n<p>\n</p><p>In class</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will form groups of four or five. Each group will select and briefly introduce an Australian agribusiness during class. The students are tasked with preparing an 8-minute presentation on their chosen business, which will be conducted in class.</p>\n<p>To complete the task effectively and prepare an engaging presentation, follow these structured steps:</p>\n<p><strong>1. Choose Your Product</strong></p>\n<ul>\n<li>Start by selecting a food or fibre product that interests you. This could be anything from a type of vegetable, fruit, grain, meat product, or even a processed food item.</li>\n<li>Consider a product that has relevance to your region, personal interest, or one that has been in recent news for being innovative or controversial.</li>\n</ul>\n<p><strong>2. Research Firms in the Three Sectors</strong></p>\n<p><strong>A. Food Sector</strong></p>\n<ul>\n<li>Look for a company that is involved in preparing, marketing, or selling the final food product to consumers. Examples include restaurants, food service companies, or retail brands.</li>\n<li>Utilise the Internet, business databases, or food industry reports to find a company related to your chosen product.</li>\n</ul>\n<p><strong>B. Production Agriculture Sector</strong></p>\n<ul>\n<li>Identify a farm or agricultural business that grows or raises the primary ingredient(s) for your chosen product.</li>\n<li>Search for direct producers, cooperatives, or family farms. Use agricultural directories, farming association websites, and agricultural research databases.</li>\n</ul>\n<p><strong>C. Input Supply Sector</strong></p>\n<ul>\n<li>Find a company that supplies the raw materials, machinery, seeds, or other inputs required for producing your chosen product.</li>\n<li>Look into suppliers of seeds, fertilisers, farming equipment, or financial services like loans and insurance tailored to agriculture.</li>\n</ul>\n<p><strong>3. Gather Information on Each Firm</strong></p>\n<p>For each company you identify, research and note down the following:</p>\n<ul>\n<li><strong>Overview and Market Presence:</strong> Size of the firm, location, scope of operations (local, national, international), and the markets they serve.</li>\n<li><strong>Products and Services:</strong> Specific products or services they offer, especially as related to your chosen food or fibre product.</li>\n<li><strong>Link to Your Product:</strong> Explain how each firm is involved in the lifecycle of your chosen product, from production to market.</li>\n</ul>\n<p><strong>4. Compare and Contrast the Firms</strong></p>\n<ul>\n<li>Analyse the similarities and differences in their market approach, size, geographical presence, and role in the food production and marketing system.</li>\n<li>Consider aspects such as their contribution to the economy, employment, sustainability practices, and innovation.</li>\n</ul>\n<p><strong>5. Identify Challenges</strong></p>\n<ul>\n<li>Research and reflect on the various challenges each firm faces, such as regulatory hurdles, supply chain issues, market competition, environmental concerns, and changing consumer preferences.</li>\n</ul>\n<p><strong>6. Prepare Your Presentation (8 Minutes)</strong></p>\n<ul>\n<li><strong>Introduction:</strong> Briefly introduce your chosen product and the importance of understanding its production and marketing system.</li>\n<li><strong>Company Overviews:</strong> Present a slide for each firm, summarising key points from your research. Use visuals like logos, product images, or infographics to make it engaging.</li>\n<li><strong>Linkages and Analysis:</strong> Explain how these firms are interconnected and their significance in your product's context. Use diagrams or charts to illustrate these connections.</li>\n<li><strong>Challenges:</strong> Discuss the main challenges these firms face, offering insights into how they impact the production and distribution of your product.</li>\n</ul>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Your Group Presentation is also to be uploaded under the appropriate assessment submission link on your course Blackboard site. You should also retain an electronic copy of every piece of assessment you submit.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Group Presentation (Agropreneur)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 27/05/2025</p>\n<p>\n</p><p>In class</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will work in groups of 4 or 5. They will work together to pitch a new venture in agribusiness. The presentation will be held in class.</p>\n<p><strong>ASSESSMENT TASK: </strong>Pitching a startup idea that solves a problem in the agricultural industry.</p>\n<p><strong>AIMS: </strong>The aim of this final presentation:</p>\n<p>·      To introduce students to a pitching template model</p>\n<p>·      To expose students to an entrepreneurial mindset that solves real-world problems</p>\n<p>·      To encourage students to work in teams and develop their presentation skills</p>\n<p> <strong>OBJECTIVES: </strong>Upon completing the guest lecture, students will know the required structure of a startup pitch deck. Students will conduct a 10 -12 minutes presentation that will:</p>\n<p>·      Present a problem and possible solution</p>\n<p>·      Present a thorough value proposition</p>\n<p>·      Present a brief market analysis and go-to-market strategy</p>\n<p>·      Justify the business model and identify the competitive advantage</p>\n<p>·      demonstrates professional standards of presentation</p>\n<p><strong>PITCH DECK PRESENTATION:</strong></p>\n<p>PowerPoint Slides = 10 Slides</p>\n<p>Time = 10 - 12 Minutes</p>\n<p>Slides Template</p>\n<p><br/></p>\n<p>1.    Title Slide</p>\n<p>2.     Problem</p>\n<p>3.    Solution/ Value Proposition</p>\n<p>4.    Your Product/Service</p>\n<p>5.    Market Validation (How do you know people would pay for this?)</p>\n<p>6.    Market Size (Is the market big enough?)</p>\n<p>7.    Go-To-Market Strategy (How would you introduce your product/service?)</p>\n<p>8.    Business Model (How will you make money?)</p>\n<p>9.    Competition (What are being offered by competitors?)</p>\n<p>10. Competitive Advantage (What makes your product or service unique?)</p>\n<p><br/></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Your Group Presentation is also to be uploaded under the appropriate assessment submission link on your course Blackboard site. You should also retain an electronic copy of every piece of assessment you submit.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Course Overview and Introductory Lecture</strong><br><p>This initial lecture will give an overview of all the tasks and activities in the course. It is essential for students to be present for this session as it is when teams will be formed. Details of the first presentation will be provided in this lecture.</p></br></p></div></td>",
            "topic_title": "<strong>Course Overview and Introductory Lecture</strong>",
            "topic_description": "Course Overview and Introductory Lecture This initial lecture will give an overview of all the tasks and activities in the course. It is essential for students to be present for this session as it is when teams will be formed. Details of the first presentation will be provided in this lecture.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Case Study, Presentation and Working in Groups</strong><br><p>This lecture will focus on teaching students how to conduct a case study, work in groups, and effectively present their findings.</p></br></p></div></td>",
            "topic_title": "<strong>Case Study, Presentation and Working in Groups</strong>",
            "topic_description": "Case Study, Presentation and Working in Groups This lecture will focus on teaching students how to conduct a case study, work in groups, and effectively present their findings.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Business Model Canvas</strong><br><p>This lecture will provide an in-depth understanding of the Business Model Canvas (BMC) and its application in creating and analysing business models.</p></br></p></div></td>",
            "topic_title": "<strong>Business Model Canvas</strong>",
            "topic_description": "Business Model Canvas This lecture will provide an in-depth understanding of the Business Model Canvas (BMC) and its application in creating and analysing business models.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Case-based learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Case Study 1</strong><br><p>(Business Model Canvas 1) Field Trip: Students will engage in a hands-on exercise to apply the BMC method to a real-life business case.</p></br></p></div></td>",
            "topic_title": "<strong>Case Study 1</strong>",
            "topic_description": "Case Study 1 (Business Model Canvas 1) Field Trip: Students will engage in a hands-on exercise to apply the BMC method to a real-life business case.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Case-based learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Case Study Reflection</strong><br><p>In the first hour, students will collaboratively build a Business Model Canvas (BMC) based on insights from the recent field trip. The second hour will focus on peer marking, followed by the third hour dedicated to preparing for the upcoming Agribusiness presentation.</p></br></p></div></td>",
            "topic_title": "<strong>Case Study Reflection</strong>",
            "topic_description": "Case Study Reflection In the first hour, students will collaboratively build a Business Model Canvas (BMC) based on insights from the recent field trip. The second hour will focus on peer marking, followed by the third hour dedicated to preparing for the upcoming Agribusiness presentation.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Case-based learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Case Study (Building on Case Study 1)</strong><br/><p>This session will commence with an overview of the Australian native food industry, followed by the presentation of a specific business challenge from Case Study Company 1</p></p></div></td>",
            "topic_title": "<strong>Case Study (Building on Case Study 1)</strong>",
            "topic_description": "Case Study (Building on Case Study 1) This session will commence with an overview of the Australian native food industry, followed by the presentation of a specific business challenge from Case Study Company 1",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Group Presentation on Australian Agribusinesses</strong><br/><p>Each group will give a presentation on an agribusiness of their choice.</p></p></div></td>",
            "topic_title": "<strong>Group Presentation on Australian Agribusinesses</strong>",
            "topic_description": "Group Presentation on Australian Agribusinesses Each group will give a presentation on an agribusiness of their choice.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-Semester Break (Independent Study)</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-Semester Break (Independent Study)</strong>",
            "topic_description": "Mid-Semester Break (Independent Study)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Case-based learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Case Study 2</strong><br/><p>(Business Model Canvas 2) Field Trip</p>\n<p>Students will continue to engage in a hands-on exercise to apply the BMC method to a real-life business case. However, in this final case study, students will use the BMC as a tool to identify one potential area for improvement.</p></p></div></td>",
            "topic_title": "<strong>Case Study 2</strong>",
            "topic_description": "Case Study 2 (Business Model Canvas 2) Field Trip Students will continue to engage in a hands-on exercise to apply the BMC method to a real-life business case. However, in this final case study, students will use the BMC as a tool to identify one potential area for improvement.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Agribusiness and Sustainability</strong><br/><p>This lecture will delve into the topic of agribusiness and sustainability, examining how these two concepts intersect and the importance of considering sustainability in the agricultural industry.</p></p></div></td>",
            "topic_title": "<strong>Agribusiness and Sustainability</strong>",
            "topic_description": "Agribusiness and Sustainability This lecture will delve into the topic of agribusiness and sustainability, examining how these two concepts intersect and the importance of considering sustainability in the agricultural industry.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Agroprenuer</strong><br/><p>This workshop will guide participants through the process of developing a startup in the agriculture industry. Attendees will learn about key considerations such as market research, business planning, and fundraising strategies to successfully launch and scale an agribusiness venture. The workshop will be interactive, with hands-on exercises and group activities to apply the concepts learned in real-life scenarios.</p></p></div></td>",
            "topic_title": "<strong>Agroprenuer</strong>",
            "topic_description": "Agroprenuer This workshop will guide participants through the process of developing a startup in the agriculture industry. Attendees will learn about key considerations such as market research, business planning, and fundraising strategies to successfully launch and scale an agribusiness venture. The workshop will be interactive, with hands-on exercises and group activities to apply the concepts learned in real-life scenarios.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Field Trip (Cotton Industry)</strong><br/><p>This field trip is aimed to get the students to reflect on the various steps and processes involved in the creation of the product and to consider the value each step adds and how it contributes to the final product. Students will be encouraged to think about the different players involved in the supply chain and their roles in ensuring the smooth flow of goods from production to delivery to the customer<br/>(THIS FIELD TRIP IS SUBJECT TO CHANGE IF THE WEATHER CONDITIONS ARE NOT FAVOURABLE)</p></p></div></td>",
            "topic_title": "<strong>Field Trip (Cotton Industry)</strong>",
            "topic_description": "Field Trip (Cotton Industry) This field trip is aimed to get the students to reflect on the various steps and processes involved in the creation of the product and to consider the value each step adds and how it contributes to the final product. Students will be encouraged to think about the different players involved in the supply chain and their roles in ensuring the smooth flow of goods from production to delivery to the customer (THIS FIELD TRIP IS SUBJECT TO CHANGE IF THE WEATHER CONDITIONS ARE NOT FAVOURABLE)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Group Presentation (Agropreneur)</strong><br><p>Groups will present their agribusiness start-up idea for a panel to review.</p></br></p></div></td>",
            "topic_title": "<strong>Group Presentation (Agropreneur)</strong>",
            "topic_description": "Group Presentation (Agropreneur) Groups will present their agribusiness start-up idea for a panel to review.",
            "learning_outcomes": []
        }
    ]
}