{
    "course_title": "Cross-Cultural Perspectives on Health",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/ANTH7250-21654-7520",
    "full_course_code": "ANTH7250-21654-7520",
    "course_code": "ANTH7250",
    "class_code": "21654",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Identify, compare and apply key theories and concepts in medical anthropology to examine health issues"
        },
        {
            "number": "LO2.",
            "description": "Demonstrate and reflect on how culture shapes illness experiences, health, and healing practices"
        },
        {
            "number": "LO3.",
            "description": "Design, conduct and analyse narrative interviews on health and illness"
        },
        {
            "number": "LO4.",
            "description": "Identify practical contributions and best practices from anthropology for addressing health issues"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Illness Narrative Interview & Essay",
            "special_indicators": [],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 11/04/2025 5:00 pm</p></dd>",
            "learning_objectives": "L02, L03",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>An illness narrative is a personal story about an illness experience. Illness narratives are used by medical anthropologists and medical doctors to understand the patient’s experience with a disease. (See additional resources about illness narrative on Blackboard). </p>\n<p>You are asked to design and conduct, record, through transcription or detailed notes, an illness narrative interview with a relative, classmate or friend, and then write an essay on that interview which analyses their story, including some direct quotes that represent their experience. </p>\n<p>In this essay, you will demonstrate your ability to explain and apply the meaning-centred or interpretive approach in medical anthropology. You will describe, identify, and analyse cultural and social influences on health and illness using quotes from your interviewee and supporting references from anthropology texts.</p>\n<p>Word Limit: 2000 words +/-10%</p>\n<p><strong>Reference in APA 7th.</strong></p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>Use of AI: </strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Case Study",
            "special_indicators": [],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 9/06/2025 5:00 pm</p></dd>",
            "learning_objectives": "L01, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Taking inspiration from one of the videos below, you are asked to write a case study of approximately 3000 words that applies a medical anthropology approach to describe and analyse a health topic. This includes power, inequalities, systems, as well as norms and beliefs. Include quotes from the participants in the video you choose. Your paper will report on and analyse the context and causes, and should include discussion of solutions or attempts to improve the problem, with particular attention to contributions from anthropology. Word limit: 3000 +/-10%</p>\n<p><a href=\"https://www.youtube.com/watch?v=6Xc1TBjcixc\">https://www.youtube.com/watch?v=6Xc1TBjcixc</a> (Drew from New York, focused on schizophrenia)</p>\n<p><a href=\"https://www.youtube.com/watch?v=sdfSZduKZws\">https://www.youtube.com/watch?v=sdfSZduKZws</a> (Dimple from India, focused on diabetes)</p>\n<p><a href=\"https://www.youtube.com/watch?v=YwBGUzAhtNU\">https://www.youtube.com/watch?v=YwBGUzAhtNU</a> (Indigenous and rural Australians, focused on heart conditions)</p>\n<p>You can enable transcripts my clicking ‘more’ in the description and ‘show transcript’ at the bottom of the page.</p>\n<p>Reference in APA 7th.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>Use of AI: </strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introducing Medical Anthropology</strong><br><p>This session introduces what medical anthropology is all about, including some of its history, and explains the course content and assessments. As with all the lectures in the course it will be a mix of lecture and discussion or small group work, so please look at the course profile and the course reading guide on Blackboard and read the Week 1 materials before class. See reading details on Blackboard.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Introducing Medical Anthropology</strong>",
            "topic_description": "Introducing Medical Anthropology This session introduces what medical anthropology is all about, including some of its history, and explains the course content and assessments. As with all the lectures in the course it will be a mix of lecture and discussion or small group work, so please look at the course profile and the course reading guide on Blackboard and read the Week 1 materials before class. See reading details on Blackboard.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Theoretical Approaches in Medical Anthropology</strong><br><p>In this class we introduce the three main theoretical approaches within medical anthropology - that is, the interpretive or meaning-centred approach, the critical approach, and the ecological approach. This lecture and discussion provides essential content for your understanding of medical anthropology.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Theoretical Approaches in Medical Anthropology</strong>",
            "topic_description": "Theoretical Approaches in Medical Anthropology In this class we introduce the three main theoretical approaches within medical anthropology - that is, the interpretive or meaning-centred approach, the critical approach, and the ecological approach. This lecture and discussion provides essential content for your understanding of medical anthropology.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Methodologies of Medical Anthropology</strong><br><p>This class focuses on how medical anthropology is done in practice and the principles that guide its methods. It introduces the practice of anthropological interview and the illness narrative interview. See reading guide on Blackboard for readings.</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Methodologies of Medical Anthropology</strong>",
            "topic_description": "Methodologies of Medical Anthropology This class focuses on how medical anthropology is done in practice and the principles that guide its methods. It introduces the practice of anthropological interview and the illness narrative interview. See reading guide on Blackboard for readings.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Cultural Concepts of Health and Illness</strong><br/><p>This class focuses on how culture influences health ideas and healing systems through the ideas of ethnomedicine, medical pluralism, and disease causation. These are the core ideas of interpretive medical anthropology.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Cultural Concepts of Health and Illness</strong>",
            "topic_description": "Cultural Concepts of Health and Illness This class focuses on how culture influences health ideas and healing systems through the ideas of ethnomedicine, medical pluralism, and disease causation. These are the core ideas of interpretive medical anthropology.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Health Inequalities and Local Biologies</strong><br/><p>In addition to looking at culture, medical anthropology also asks how inequalities (social, political, environmental) affect health - this lecture will introduce and explore critical medical anthropology and its key concepts, including how anthropology understands the determinants of health. Building on the introduction to health inequalities, this session focuses on the concept of local biologies and uses it to analyse racial disparities and the effects of racism on health. </p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Health Inequalities and Local Biologies</strong>",
            "topic_description": "Health Inequalities and Local Biologies In addition to looking at culture, medical anthropology also asks how inequalities (social, political, environmental) affect health - this lecture will introduce and explore critical medical anthropology and its key concepts, including how anthropology understands the determinants of health. Building on the introduction to health inequalities, this session focuses on the concept of local biologies and uses it to analyse racial disparities and the effects of racism on health.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Gender and Sexuality in Health and Health Care</strong><br/><p>Considerations of gender are essential to medical anthropology, and sexuality has often been an area of contention between medicine and anthropology. This class introduces the anthropology of genders and sexualities and shows how these cultural and embodied constructs intersect with health and health care.</p></p><p><strong>Learning outcomes:</strong> L02, L04</p></div></td>",
            "topic_title": "<strong>Gender and Sexuality in Health and Health Care</strong>",
            "topic_description": "Gender and Sexuality in Health and Health Care Considerations of gender are essential to medical anthropology, and sexuality has often been an area of contention between medicine and anthropology. This class introduces the anthropology of genders and sexualities and shows how these cultural and embodied constructs intersect with health and health care.",
            "learning_outcomes": [
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Biomedicine, Biotechnologies, and Biopolitics</strong><br/><p>This class focuses on the anthropology of biomedicine, including ideas of the body, and critiques of the power relations embedded in medical practices and systems. We also look at anthropological analyses of biotechnologies and how anthropologists contribute to emerging technologies.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Biomedicine, Biotechnologies, and Biopolitics</strong>",
            "topic_description": "Biomedicine, Biotechnologies, and Biopolitics This class focuses on the anthropology of biomedicine, including ideas of the body, and critiques of the power relations embedded in medical practices and systems. We also look at anthropological analyses of biotechnologies and how anthropologists contribute to emerging technologies.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-semester break - No class</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-semester break - No class</strong>",
            "topic_description": "Mid-semester break - No class",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Embodied Difference &amp; Disability Worlds</strong><br/><p>Bringing in insights from Disability Studies, this class focuses on social and cultural understandings of dis/ability, including inequalities, activism, and enduring questions of what is 'normal' and how to understand 'difference'.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Embodied Difference &amp; Disability Worlds</strong>",
            "topic_description": "Embodied Difference & Disability Worlds Bringing in insights from Disability Studies, this class focuses on social and cultural understandings of dis/ability, including inequalities, activism, and enduring questions of what is 'normal' and how to understand 'difference'.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Reproductive Health and Justice</strong><br/><p>This class begins by looking at how inequalities and culture shape reproduction (including fertility, pregnancy, birth, childrearing) and then investigates the idea of reproductive justice for improving reproductive health policies and interventions. </p></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Reproductive Health and Justice</strong>",
            "topic_description": "Reproductive Health and Justice This class begins by looking at how inequalities and culture shape reproduction (including fertility, pregnancy, birth, childrearing) and then investigates the idea of reproductive justice for improving reproductive health policies and interventions.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Health Sovereignties</strong><br/><p>This class focuses on how to do health and health care in ways that dismantle rather than reinforce existing colonial, social and structural hierarchies, especially for Indigenous peoples in Australia and globally. It asks what health concepts and programs look like if they are guided by goals of decolonisation and health sovereignty.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Health Sovereignties</strong>",
            "topic_description": "Health Sovereignties This class focuses on how to do health and health care in ways that dismantle rather than reinforce existing colonial, social and structural hierarchies, especially for Indigenous peoples in Australia and globally. It asks what health concepts and programs look like if they are guided by goals of decolonisation and health sovereignty.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Global Health and Medical Humanitarianism</strong><br/><p>Global health and medical humanitarianism are important areas of anthropological practice and innovation. In this class we discuss what anthropology brings to the study of globally common diseases and how anthropologists contribute to improving health issues like infectious disease, malaria, malnutrition and HIV/AIDS.</p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Global Health and Medical Humanitarianism</strong>",
            "topic_description": "Global Health and Medical Humanitarianism Global health and medical humanitarianism are important areas of anthropological practice and innovation. In this class we discuss what anthropology brings to the study of globally common diseases and how anthropologists contribute to improving health issues like infectious disease, malaria, malnutrition and HIV/AIDS.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Course Conclusion</strong><br/><p>In this class we will synthesise key insights and skills from the course and explore future directions and practices in medical anthropology.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Course Conclusion</strong>",
            "topic_description": "Course Conclusion In this class we will synthesise key insights and skills from the course and explore future directions and practices in medical anthropology.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        }
    ]
}