{
    "course_title": "Applied Anthropology and Indigenous Territories",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/ANTH2260-21636-7520",
    "full_course_code": "ANTH2260-21636-7520",
    "course_code": "ANTH2260",
    "class_code": "21636",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate knowledge of anthropological theory as relevant to the study of Indigenous history and culture"
        },
        {
            "number": "LO2.",
            "description": "Demonstrate knowledge of the relationship between the theory and practice of anthropology in Australia and comparative contexts"
        },
        {
            "number": "LO3.",
            "description": "Practice applied anthropological methods of participant observation, interviewing, and cultural mapping"
        },
        {
            "number": "LO4.",
            "description": "Express an informed opinion on ethical issues relating to applied anthropological research."
        },
        {
            "number": "LO5.",
            "description": "Undertake successful academic research in the library, in archival collections and with electronic resources."
        },
        {
            "number": "LO6.",
            "description": "Demonstrate competence in methodologies pertinent to research undertaken with Indigenous peoples"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Reflection on positionality",
            "special_indicators": [],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p>Presented in class in weeks 5, 6, and 7. You must present your positionality in class. The date will be assigned at the beginning of the semester.</p></dd>",
            "learning_objectives": "L01, L02, L04, L05, L06",
            "mode": "Oral",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment requires you to present a short reflection in class about your own positionality in relation to your work goals. The reflection should be a maximum of 5 minutes long and must cover the following points:</p>\n<ul>\n<li>Introduce yourself and explain your work/career goals</li>\n<li>Explain how you will use what you learn in anthropology to achieve these goals. Make reference to readings and/or lecture slides about applied anthropology to contextualise your work/career aspirations in relation to the example of people like Genevieve Bell, Gillian Tett, as well as the guest speakers you have heard from in seminars. What kinds of content knowledge/skills/theory from anthropology is relevant to your goals?</li>\n<li>Critically reflect on your own positionality and its relevance to your goals. Positionality refers to how your culture, identity, and position in society shape your experience of the world, how you perceive others, and how others perceive you. Depending on your positionality, you may wish to reflect on the benefits and/or challenges of conducting anthropological research in an Indigenous community as an Indigenous person (if you are Indigenous). Alternatively, you may wish to reflect on conducting research with Indigenous people as an Australian citizen who is non-Indigenous, or as a non-citizen who is Indigenous in another setting (e.g., a Native American working in Australia), or as a person with another background and heritage. You may wish to consider your gender, class or religious background or belief system, your cultural and educational background or ethnicity, work experience, the languages you speak, whether you have a rural or urban background, and so on.</li>\n</ul>\n<p>Given the focus of this course, you are encouraged to engage with your positionality particularly in relation to 'Indigenous territories'. Please note, there is no right or wrong answer to this question. You will instead be marked on your ability to critically reflect on your positionality in relation to the experience of working as an anthropologist. You do not have to be comprehensive about your positionality, but should focus on one or two aspects of it. To prepare for this assessment, you should reflect on the different contexts in which you may work in the future, and the ways in which your positionality may have benefits and/or challenges in different contexts. Different aspects of your positionality may well come to shape your work in different ways, particularly your work with Indigenous peoples, and this assessment is asking you to start to think about how you will manage this, and to share your thoughts with the class.</p>\n<p>Please note: according to University policy, student presentations must be recorded and stored in the event that students ask for a re-mark. In keeping with this policy, presentations will be audio recorded and stored in a secured folder on the University server. Presentations will be deleted from this folder after 1 year.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>Use of AI: </strong>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will <strong>not be permitted</strong>. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Presented in class.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "1500 word essay",
            "special_indicators": [],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 16/05/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L04, L05, L06",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The second assessment asks you to expand your reading and research into native title by undertaking an analysis of one native title case. You can choose either a successful one (e.g. <em>Rainbow on behalf of the Kurtjar People v State of Queensland (No 2)</em> [2021] FCA 1251) or one unsuccessful native title claim (e.g. <em>Malone v State of Queensland (The Clermont-Belyando Area Native Title Claim) (No 5) </em>[2021] FCA 1639; <em>Blucher on behalf of the Gaangalu Nation People v State of Queensland (No 3) </em>[2023] FCA 600).</p>\n<p>Your essay should:</p>\n<ul>\n<li>outline the ethnographic context of your case study (where was it? who were the claimants? how was the traditional system of land and water rights and interests described?)</li>\n<li>describe any features unique to the case, such as the traditional rights and interests claimed </li>\n<li>explain the outcome of the case in relation to the requirements of the section 223(1) of the Native Title Act (e.g. why in your view was your case successful or unsuccessful?)</li>\n<li>provide a critical review of the reasons for judgement (e.g. do you agree with the judge's decisions to award or deny native title?)</li>\n<li>conclude with a critical reflection on the strengths and weaknesses of the Native Title Act in its ability to recognise Aboriginal and Torres Strait Islanders' connections to land and waters.</li>\n</ul>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>Use of AI: </strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Documenting Indigenous values after native title",
            "special_indicators": [],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 9/06/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L06",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The seminar results paper will be a write up of the results of the applied anthropology project, drawing on skills acquired during the seminars and presented in the form of a report (incorporating the results of interviews and participant observation and presenting findings and preliminary recommendations). A 'work brief' will be provided prior to the practical exercise/possible fieldtrip to guide this assessment. Maximum 1000 words (excluding references and supporting information which are restricted to an additional 1000 words).</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>Use of AI: </strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction: Applied and Engaged Anthropology</strong><br><p>What is applied anthropology? How do anthropologists work to make a difference in the world?</p>\n<p>In this introductory seminar we will look at some of the settings and contexts in which anthropologists work outside universities, including with Indigenous people, as well as in design, business, and development projects around the world.</p>\n<p>To prepare for this seminar, please watch the YouTube clip about Genevieve Bell, read the extract from Gillian Tett's book, Tett &amp; Friedman's book and the overview provided by Paul Sillitoe.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Introduction: Applied and Engaged Anthropology</strong>",
            "topic_description": "Introduction: Applied and Engaged Anthropology What is applied anthropology? How do anthropologists work to make a difference in the world? In this introductory seminar we will look at some of the settings and contexts in which anthropologists work outside universities, including with Indigenous people, as well as in design, business, and development projects around the world. To prepare for this seminar, please watch the YouTube clip about Genevieve Bell, read the extract from Gillian Tett's book, Tett & Friedman's book and the overview provided by Paul Sillitoe.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong> Postponed due to Cyclone</strong><br/><p>**Due to the University-wide closures in response to Cyclone Alfred, week 2 learning activity has been postponed.</p></p></div></td>",
            "topic_title": "<strong> Postponed due to Cyclone</strong>",
            "topic_description": "Postponed due to Cyclone **Due to the University-wide closures in response to Cyclone Alfred, week 2 learning activity has been postponed.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>History and Theory of Applied Anthropology</strong><br/><p>This seminar looks at the history of applied anthropology, examining the shifting ways in which anthropologists have worked in Australia and internationally.</p>\n<p>This seminar also addresses theory relevant to applied research, as well as some of the politics and ethics of applied anthropology, including the concept of 'positionality' which we will engage with in our presentations.</p>\n<p>Make sure you attend this seminar as we will be using this time to schedule the date of the presentations.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>History and Theory of Applied Anthropology</strong>",
            "topic_description": "History and Theory of Applied Anthropology This seminar looks at the history of applied anthropology, examining the shifting ways in which anthropologists have worked in Australia and internationally. This seminar also addresses theory relevant to applied research, as well as some of the politics and ethics of applied anthropology, including the concept of 'positionality' which we will engage with in our presentations. Make sure you attend this seminar as we will be using this time to schedule the date of the presentations.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Applied Anthropology with Indigenous Peoples</strong><br/><p>This seminar addressing some of the contexts in which anthropologists work with Aboriginal and Torres Strait Islander people in Australia, and Indigenous peoples internationally, on matters relating to colonialism, land rights and native title, cultural heritage protection, intra-Indigenous disputes, mining agreements, economic development, and so on.</p>\n<p>In this seminar, we will also expand our thinking about positionality by considering the perspectives of several Indigenous scholars.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Applied Anthropology with Indigenous Peoples</strong>",
            "topic_description": "Applied Anthropology with Indigenous Peoples This seminar addressing some of the contexts in which anthropologists work with Aboriginal and Torres Strait Islander people in Australia, and Indigenous peoples internationally, on matters relating to colonialism, land rights and native title, cultural heritage protection, intra-Indigenous disputes, mining agreements, economic development, and so on. In this seminar, we will also expand our thinking about positionality by considering the perspectives of several Indigenous scholars.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ethics in Applied Research and Presentations</strong><br/><p>Applied research involves investigating real-life situations and making decisions which will affect the lives of others, including Indigenous peoples. It often involves liaising with national governments and the United Nations, non-government organisations (like Oxfam), development agencies (like the World Bank), as well as businesses like mining companies.</p>\n<p>Each of our engagements as applied anthropologists involve complex ethical considerations. To guide our work, we draw on ethics documents such as the Australian Institute of Aboriginal and Torres Strait Islander Studies (AIATSIS) Code of Ethics, Australian Anthropological Society (AAS) Code of Ethics and the UN Declaration On the Rights of Indigenous Peoples (UNDRIP). In this workshop, we will examine some of the concepts in these documents, such as the concept of 'free, prior and informed consent'. We will also workshop how to apply ethics codes such as the AIATSIS Code to a range of real-life work scenarios.</p>\n<p>This week, we will also begin our presentations, which will continue until the mid-semester break.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Ethics in Applied Research and Presentations</strong>",
            "topic_description": "Ethics in Applied Research and Presentations Applied research involves investigating real-life situations and making decisions which will affect the lives of others, including Indigenous peoples. It often involves liaising with national governments and the United Nations, non-government organisations (like Oxfam), development agencies (like the World Bank), as well as businesses like mining companies. Each of our engagements as applied anthropologists involve complex ethical considerations. To guide our work, we draw on ethics documents such as the Australian Institute of Aboriginal and Torres Strait Islander Studies (AIATSIS) Code of Ethics, Australian Anthropological Society (AAS) Code of Ethics and the UN Declaration On the Rights of Indigenous Peoples (UNDRIP). In this workshop, we will examine some of the concepts in these documents, such as the concept of 'free, prior and informed consent'. We will also workshop how to apply ethics codes such as the AIATSIS Code to a range of real-life work scenarios. This week, we will also begin our presentations, which will continue until the mid-semester break.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Australian Native Title (1) and Presentations</strong><br/><p>This week provides an introduction to Australian native title anthropology, focusing on the history of land rights, native title, and cultural heritage legislation and jurisprudence in Australia and comparative international contexts like the United States, Canada, and New Zealand.</p>\n<p>This week we will also continue our presentations.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L06</p></div></td>",
            "topic_title": "<strong>Australian Native Title (1) and Presentations</strong>",
            "topic_description": "Australian Native Title (1) and Presentations This week provides an introduction to Australian native title anthropology, focusing on the history of land rights, native title, and cultural heritage legislation and jurisprudence in Australia and comparative international contexts like the United States, Canada, and New Zealand. This week we will also continue our presentations.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Australian Native Title (2) and Presentations</strong><br/><p>This week's seminar describes the role of applied anthropologists in the Australian native title system. We will discuss different aspects of native title with a particular focus on anthropologists' role in (1) establishing the society to which Aboriginal people belonged at sovereignty; (2) understanding traditional law and custom; (3) proving continuity of connection under traditional law and custom.</p>\n<p>This is the third week of presentations.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L06</p></div></td>",
            "topic_title": "<strong>Australian Native Title (2) and Presentations</strong>",
            "topic_description": "Australian Native Title (2) and Presentations This week's seminar describes the role of applied anthropologists in the Australian native title system. We will discuss different aspects of native title with a particular focus on anthropologists' role in (1) establishing the society to which Aboriginal people belonged at sovereignty; (2) understanding traditional law and custom; (3) proving continuity of connection under traditional law and custom. This is the third week of presentations.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>No class - public holiday</strong><br/><p>No classes this week</p></p></div></td>",
            "topic_title": "<strong>No class - public holiday</strong>",
            "topic_description": "No class - public holiday No classes this week",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Anthropology after Native Title and Presentations</strong><br/><p>This week's class will consider critiques of the native title system and hear from senior Indigenous speakers about aftermath of claims, including the challenges involved in managing native title rights and the work that anthropologists do with Indigenous corporations in the aftermath of native title.</p>\n<p>We will also conclude our presentations this week.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L06</p></div></td>",
            "topic_title": "<strong>Anthropology after Native Title and Presentations</strong>",
            "topic_description": "Anthropology after Native Title and Presentations This week's class will consider critiques of the native title system and hear from senior Indigenous speakers about aftermath of claims, including the challenges involved in managing native title rights and the work that anthropologists do with Indigenous corporations in the aftermath of native title. We will also conclude our presentations this week.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Methods 1: Ethnography</strong><br/><p>The seminar focuses on the practical skills needed to elicit ethnographic data for applied purposes.</p>\n<p>We will specifically learn:</p>\n<p>* Preparation and planning for fieldwork (site visits, site surveys and off-site interviews);</p>\n<p>* How to find people and assess whether you are talking to the right person (involving considerations of who speaks for an area, kinship relations, ritual specialists, gender relations);</p>\n<p>* How to know what to ask about when you find someone (what kind of information do you need?);</p>\n<p>* How to record information (note taking, audio recordings, video, GPS, topographic maps); and,</p>\n<p>* How to write up information as fieldnotes (transcription techniques, addressing and maintaining your fieldnotes, mapping).</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Methods 1: Ethnography</strong>",
            "topic_description": "Methods 1: Ethnography The seminar focuses on the practical skills needed to elicit ethnographic data for applied purposes. We will specifically learn: * Preparation and planning for fieldwork (site visits, site surveys and off-site interviews); * How to find people and assess whether you are talking to the right person (involving considerations of who speaks for an area, kinship relations, ritual specialists, gender relations); * How to know what to ask about when you find someone (what kind of information do you need?); * How to record information (note taking, audio recordings, video, GPS, topographic maps); and, * How to write up information as fieldnotes (transcription techniques, addressing and maintaining your fieldnotes, mapping).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction to the workshop module</strong><br/><p>This week's seminar will introduce the practical module of the course, explain the brief for the applied anthropology design project (the 'Documenting Indigenous values after native title' final assessment), and provide a discussion of some of the practical skills that applied anthropologists use, including the skills you will need for your project (and final assessment).</p>\n<p>This will be followed by methods seminars focused on developing practical skills for anthropological work, beginning with a focus on working in response to a brief.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Introduction to the workshop module</strong>",
            "topic_description": "Introduction to the workshop module This week's seminar will introduce the practical module of the course, explain the brief for the applied anthropology design project (the 'Documenting Indigenous values after native title' final assessment), and provide a discussion of some of the practical skills that applied anthropologists use, including the skills you will need for your project (and final assessment). This will be followed by methods seminars focused on developing practical skills for anthropological work, beginning with a focus on working in response to a brief.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Methods 2: The Art of Listening</strong><br/><p>This seminar focuses on applied skills for interviewing. </p>\n<p>We will specifically learn:</p>\n<p>* Planning for interviews and building discussion guides</p>\n<p>* Avoiding leading questions</p>\n<p>* Listening, note-taking, and avoiding bias</p>\n<p>* Managing data</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Methods 2: The Art of Listening</strong>",
            "topic_description": "Methods 2: The Art of Listening This seminar focuses on applied skills for interviewing. We will specifically learn: * Planning for interviews and building discussion guides * Avoiding leading questions * Listening, note-taking, and avoiding bias * Managing data",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Methods 3: The Art of Looking</strong><br/><p>This seminar focuses on participant observation. </p>\n<p>We will specifically learn:</p>\n<p>* What to look for? What is the point of participant observation?</p>\n<p>* How to make fieldnotes</p>\n<p>* How to categorise and manage field data</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Methods 3: The Art of Looking</strong>",
            "topic_description": "Methods 3: The Art of Looking This seminar focuses on participant observation. We will specifically learn: * What to look for? What is the point of participant observation? * How to make fieldnotes * How to categorise and manage field data",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Fieldwork",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Fieldtrip: Documenting Indigenous values after native title</strong><br/><p>This week involves an ethnographic interviewing/fieldwork exercise focused on identifying Indigenous values in the context of development activities. Please keep 17 May free as this exercise is tied to the final assessment. Please meet on Chancellors Place at 8 a.m. We should be back at UQ around 4 p.m. Participation is strongly recommended as a highlight of the course but it is not compulsory to attend and if you are unable to attend, an alternative assessment will be available. NB this exercise will incur a cost of approximately $50 per person to cover transport to and from the fieldwork site.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Fieldtrip: Documenting Indigenous values after native title</strong>",
            "topic_description": "Fieldtrip: Documenting Indigenous values after native title This week involves an ethnographic interviewing/fieldwork exercise focused on identifying Indigenous values in the context of development activities. Please keep 17 May free as this exercise is tied to the final assessment. Please meet on Chancellors Place at 8 a.m. We should be back at UQ around 4 p.m. Participation is strongly recommended as a highlight of the course but it is not compulsory to attend and if you are unable to attend, an alternative assessment will be available. NB this exercise will incur a cost of approximately $50 per person to cover transport to and from the fieldwork site.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Fieldtrip debrief and final assessment seminar</strong><br/><p>This week provides an opportunity to debrief about the field trip and start to think about how to turn your data into a report.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05, L06</p></div></td>",
            "topic_title": "<strong>Fieldtrip debrief and final assessment seminar</strong>",
            "topic_description": "Fieldtrip debrief and final assessment seminar This week provides an opportunity to debrief about the field trip and start to think about how to turn your data into a report.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Challenges and Opportunities</strong><br/><p>This concluding seminar summarises lessons from the course and includes discussion of the marketplace for applied work in Australia and some professional and commercial considerations involved in building a successful career outside the University.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Challenges and Opportunities</strong>",
            "topic_description": "Challenges and Opportunities This concluding seminar summarises lessons from the course and includes discussion of the marketplace for applied work in Australia and some professional and commercial considerations involved in building a successful career outside the University.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        }
    ]
}