{
    "course_title": "Responsible AI",
    "study_period": "Sem 1 2025",
    "location": "External",
    "attendance": "Online",
    "url": "https://course-profiles.uq.edu.au/course-profiles/BSAN7210-22676-7520",
    "full_course_code": "BSAN7210-22676-7520",
    "course_code": "BSAN7210",
    "class_code": "22676",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Identify and reflect on key ethical, legal and social aspects related to the AI life cycle from design to deployment."
        },
        {
            "number": "LO2.",
            "description": "Research and critically analyse the opportunities and risks that AI presents in various scenarios and for diverse stakeholders."
        },
        {
            "number": "LO3.",
            "description": "Propose and evaluate organisational and technological solutions in collaboration with others that respond to ethical, legal and social implications of the responsible use of AI in business and society."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Individual Reflective Essay",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>45%</dd>",
            "due_date": "<dd><p> 31/03/2025 3:00 pm</p></dd>",
            "learning_objectives": "L01",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Goal:</strong> The goal for this writing task is to apply the ethical, legal and social implications (ELSI) framework covered in Modules 1 and 2 to create a short essay responding to a series of reflective questions.</p>\n<p>Tasks: Choose any AI technology or AI innovation or AI system. You will be provided with three short prompts for reflection, with respect to artificial intelligence, and asked to consider and respond to prompts relating to all material in Modules 1 and 2, including questions relating to:</p>\n<ol>\n<li>What are key ethics dimensions related to ethics in the development and deployment of your chosen AI technology, innovation or system. (Module 2.1)</li>\n<li>What legal and regulatory issues are associated with your technology innovation or system? Relate your answer to AI systems throughout their lifecycle (Module 2.2)</li>\n<li>What are the broader societal implications of your chosen AI technology if it were deployed at scale? Include the impacts of your chosen technology on various stakeholders, including vulnerable groups and stakeholders from diverse walks of life. (Module 2.3). </li>\n</ol>\n<p>Based on this you will develop a three-part individual essay. Allocate equal effort to each area.</p>\n<p>The essay should be between 1,500 – 2,300 words that responds to each of the Ethical, Legal, and Social Implications prompts (i.e. three essays of 500 – 800 words each). The individual reflective essay will need to be submitted via Blackboard.</p>\n<p><strong>Essay</strong></p>\n<p>You will want to address the following in your Individual Reflective Essay:</p>\n<ul>\n<li>A critical analysis responding to each of the prompting questions, applying the Ethical, Legal, and Social Implications framework.</li>\n<li>At least three supporting references for each of the three sections of the essay.</li>\n</ul>\n<p><strong>Criteria &amp; Marking for Individual Reflective Essay:</strong></p>\n<p>The focus of the individual reflective essay should be on demonstrating an ability to critically analyse and reflect upon the prompting questions and identifying, describing and applying relevant ethical, legal and social issues.</p>\n<p><strong>Individual reflective essay Assessment Criteria</strong></p>\n<p>Your individual reflective essay will be assessed according to the following criteria:</p>\n<ol>\n<li>Depth and breadth of knowledge/content of the distinct aspects of the Ethical, Legal, and Social Implications of Responsible AI</li>\n<li>Critical Judgement: Critical analysis and problem solving; including evaluation of distinct aspects of the Ethical, Legal, and Social Implications framework</li>\n<li>Ethical, Legal and Social Understanding: An ability to discuss Responsible AI as a ethical, legal or social undertaking</li>\n<li>Communication: The ability to select and use the appropriate level, style and means of communication</li>\n</ol>\n<p>To achieve a grade of 7 (85-100%) you will have completed a very persuasive, well-written, and thoughtful essay that clarifies and explains your responses to the prompting questions with a very clear and effective structure, with a sufficient amount of relevant supporting materials that are appropriately referenced. You will have utilised supplied and original materials in an excellent discussion that complies precisely with the stated word limit.</p>\n<p>To achieve a grade of 6 (75-84%) you will have completed a persuasive and well-written essay that clarifies and explains your responses to the prompting questions with an effective structure, with a sufficient amount of relevant supporting materials that are appropriately referenced. You will have utilised supplied and original materials in a very good discussion that complies with the stated word limit.</p>\n<p>To achieve a grade of 5 (65-74%) you will have completed a well-written essay that clarifies and explains your responses to the prompting questions with an adequate structure, with a sufficient amount of relevant supporting materials that are appropriately referenced. You will have utilised supplied and original materials in a solid discussion within the stated word limit.</p>\n<p>To achieve a grade of 4 (50-64%) you will have presented an adequate talk that addresses aspects of your topic but with flaws in approach, structure and/or delivery, and/or with an insufficient amount and/or inappropriately referenced supporting materials. There may have been limitations to your use of supporting materials, and/or difficulties in meeting set word limit constraints.</p>\n<p>Grades of 1-3 (less than 50%) will be awarded to essays that are not adequately prepared or written, that do not clarify or address aspects of your responses to the prompting questions with an adequate structure and/or lack an effective structure. Major deficiencies are also present in utilising supporting materials and/or meeting word requirements.</p>\n<p><strong>AI Statement:</strong></p>\n<p><em>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission is via the Turnitin submission point on Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Final Group Presentation and Individual Reflection",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>55% (35% Final Group Presentation; 20% Individual Reflection)  </dd>",
            "due_date": "<dd><p>Presentation Content and Individual Reflection 26/05/2025 3:00 pm</p>\n<p>Peer Assessment 30/05/2025 3:00 pm</p>\n<p>\n</p><p>Both the Presentation Content and Individual Reflection are due by the due date.</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Activity/ Performance, Oral, Product/ Artefact/ Multimedia, Written",
            "category": "Essay/ Critique, Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Goal:</strong> The goal for this task is to work with a group of your peers to apply the Ethical, Legal, and Social Implications framework to a case study of your own choosing (with the approval of the course coordinator). You will then present your analysis in two forms: </p>\n<ol>\n<li>Via a recorded group presentation lasting ten minutes; and</li>\n<li>An individual written reflection presented as an Executive Summary tailored to specific issues and for a targeted stakeholder audience.</li>\n</ol>\n<p><strong>Tasks: </strong>You will be randomly allocated to groups via Blackboard by Week 5. You will need to contact other group members and coordinate with one another to complete the assessment. </p>\n<p>Select a case study for analysis: Each group will select a real-life scenario relevant to the field of business analytics where the responsible use of AI is up for debate. You will treat this scenario as a case study to which you will apply the Ethical, Legal, and Social Implications framework to identify issues and problems, as well as potential solutions.</p>\n<p><strong>Based on this you will develop the two outputs described above:</strong></p>\n<ol>\n<li><em>Group Presentation</em>: A recorded group presentation of your selected case study. The presentation should be no more than 15 minutes in length and be uploaded to Blackboard submission area Monday of Week 13. Each group member should have a role in the development and/or delivery of the presentation. You will be expected to be ready to discuss your presentations in a Q&amp;A session in the Week 13 Seminar Live Session.</li>\n<li><em>Individual Reflection: </em>You will submit an individually written Reflection of (length, description) and submit this on Monday of Week 13 via Blackboard.</li>\n</ol>\n<p><strong>Presentations</strong></p>\n<p><strong>Presentation Content:</strong> The presentation should comprise a brief introduction to the scenario, the identification of key ethical, legal and social concerns, and a conclusion. You will be expected to produce slides for the presentation.</p>\n<p>Peer-evaluation of presentation: You will be provided with a form that allows you to describe your contribution to the group presentation, as well as evaluate the contributions of your colleagues. This needs to be submitted in Week 13, via Blackboard.</p>\n<p><strong>Individual Reflection</strong></p>\n<p>Each individual team member will be asked to write their own Reflection on the case selected. The Reflection should be a maximum of 3 pages, single-spaced, and in 12-point Time New Roman font. References should be included. Please use APA7 referencing style. You may want to include appendices supporting your summary and these will not be included in the page count.</p>\n<p>Given space constraints you will most probably need to select a sub-topic or narrow your analysis in the Reflection, and this should be made explicit. You will want to address the following in your Reflection:</p>\n<ul>\n<li>A brief description of the case relevant for the focus or angle you will be analysing.</li>\n<li>A critical analysis of the topic and application of the Ethical, Legal, Social Implications framework.</li>\n<li>Recommendations for the stakeholder audience you are addressing in your summary. </li>\n</ul>\n<p><strong>Peer Evaluations (BuddyCheck)</strong></p>\n<p>All group work requires a peer-evaluation: You will be provided with a link that will allow you to describe your contribution to the group presentation, as well as evaluate the contributions of your colleagues. </p>\n<p>The grade on your team's project determines a substantial portion of your total grade. Your instructor cannot directly observe the relative contributions of each team member. You must therefore submit confidential quantitative peer evaluations of each other member in your team. Evidence is required. For example, minutes of meetings. You are required to assess the contribution of your team mates to this project. You will award them a mark between 1 &amp; 5 for each of 4 criteria as follows: </p>\n<p><em>1) Organisation/project management </em></p>\n<p>Allocate a mark to each team member for their role in establishing the process needed to complete the assignment. Consider their approach to setting up meeting times and work submission deadlines as well as their willingness to listen to other team members' opinions. A mark of one indicates little to no contribution, and a mark of five indicates the maximum contribution possible. </p>\n<p><em>2) Knowledge </em></p>\n<p>Allocate a mark to each team member for their contribution of knowledge, and skills to the project. Consider how much research and preparation time this person put in, as well as how much impact their contribution had. Did their input demonstrate a serious commitment to the assessment objectives, or a superficial approach? A mark of one indicates little to no contribution, and a mark of five indicates the maximum contribution possible. </p>\n<p><em>3) Communication </em></p>\n<p>Allocate a mark to each team member for how well they collaborated and communicated with others in the team and fulfilled their individual roles within the team. To determine your mark consider if each team member: -was present at all meetings, as long as feasibly possible (either in person, or via phone/online); -played an active role in facilitating group agreement and resolving conflict and; -provided timely responses to all digital communications and queries. A mark of one indicates little to no contribution, and a mark of five indicates the maximum contribution possible. </p>\n<p><em>4) Responsibility </em></p>\n<p>Allocate a mark to each team member for how well they took responsibility for the teams outcome, and consistently acted in a manner that demonstrated they were keen for the whole group to perform well. Consider whether this person kept to the agreed deadlines for work. A mark of one indicates little to no contribution, and a mark of five indicates the maximum contribution possible. </p>\n<p>A mark of 1 indicates little to no contribution in this area, and a mark of 5 indicates the maximum contribution possible. Provide a brief justification for point assignments, e.g., 5 points: e.g. Student A attended the team meetings and/or discussion boards and their valuable contributions were high quality. </p>\n<p><strong>Oral Presentation Assessment Criteria </strong></p>\n<p>Your oral presentation will be assessed according to the following criteria: </p>\n<ol>\n<li>Content and argument of the topic of the presentation. </li>\n<li>Engagement with academic sources and evidence.  </li>\n<li>Compliance with the stated time limit. </li>\n<li>Evidence of preparation including PowerPoint if required.  </li>\n<li>Fluency, ease and persuasiveness of the presentation. </li>\n</ol>\n<p><strong>AI Statement:</strong></p>\n<p><em>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission information will be posted on Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction to Responsible AI</strong><br/><p>In Module 1, you will be introduced to the ELSI Framework, which stands for the ethical, legal, and social implications for artificial intelligence. </p>\n<p>In the Seminar we will have welcome and course introduction. </p></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Introduction to Responsible AI</strong>",
            "topic_description": "Introduction to Responsible AI In Module 1, you will be introduced to the ELSI Framework, which stands for the ethical, legal, and social implications for artificial intelligence. In the Seminar we will have welcome and course introduction.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ethics and AI</strong><br/><p>In Module 2.1, you will examine the key philosophy and ethical dimensions of AI, and focusing on business analytics.</p>\n<p>In our Seminar we will be Aapplying the ELSI framework: Ethics and AI. Please prepare prior to attendance.</p></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Ethics and AI</strong>",
            "topic_description": "Ethics and AI In Module 2.1, you will examine the key philosophy and ethical dimensions of AI, and focusing on business analytics. In our Seminar we will be Aapplying the ELSI framework: Ethics and AI. Please prepare prior to attendance.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Law and AI</strong><br/><p>In Module 2.2, you will develop your theoretical understanding of the relationship between AI and law, different models for explaining legal, technological, and social change, and a practical understanding of different areas of law and how these might impact on your future work.</p>\n<p>In the Seminar we will be applying the framework focusing on the law. Please prepare prior to attendance.</p></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Law and AI</strong>",
            "topic_description": "Law and AI In Module 2.2, you will develop your theoretical understanding of the relationship between AI and law, different models for explaining legal, technological, and social change, and a practical understanding of different areas of law and how these might impact on your future work. In the Seminar we will be applying the framework focusing on the law. Please prepare prior to attendance.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Society and AI</strong><br/><p>In Module 2.3, you will examine the broader societal implications that are important to consider with AI and automated decision-making systems.</p>\n<p>In the Seminar we will be applying the framework focusing on the social and societal implications of AI systems. Please prepare prior to attendance.</p></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Society and AI</strong>",
            "topic_description": "Society and AI In Module 2.3, you will examine the broader societal implications that are important to consider with AI and automated decision-making systems. In the Seminar we will be applying the framework focusing on the social and societal implications of AI systems. Please prepare prior to attendance.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Privacy, Consent &amp; Surveillance - Part 1</strong><br/><p>Consent and privacy challenges are important considerations with AI systems and data. As we begin Module 3.1, we will cover issues associated with Privacy, Consent and Surveillance as these arise in the artificial intelligence landscape. </p>\n<p>We will explore these issues through two different case studies.</p>\n<p>The Seminar provides a discussion on the (fictional) case of 'Optimizing Schools' (Princeton Case Study) and the privacy, surveillance and consent issues raised when a high school uses student data to improve student retention rates. Please prepare prior to attendance.</p></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Privacy, Consent &amp; Surveillance - Part 1</strong>",
            "topic_description": "Privacy, Consent & Surveillance - Part 1 Consent and privacy challenges are important considerations with AI systems and data. As we begin Module 3.1, we will cover issues associated with Privacy, Consent and Surveillance as these arise in the artificial intelligence landscape. We will explore these issues through two different case studies. The Seminar provides a discussion on the (fictional) case of 'Optimizing Schools' (Princeton Case Study) and the privacy, surveillance and consent issues raised when a high school uses student data to improve student retention rates. Please prepare prior to attendance.",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Privacy, Consent &amp; Surveillance 2, w/Team Session</strong><br/><p>In the second part of Module 3.1, we will cover additional issues associated with Privacy, Consent and Surveillance as these arise in the artificial intelligence landscape.  In Week 6 teams gather to select a topic for the Final Group Presentations (Assessment #2, due in Week 13). Students team up in groups of 3 - 4 (or other amount to be determined by instructor depending on course enrollment). Teams will select an organisational case relating to responsible AI and prepare a PPT presentation as a video recording on their findings. A set of guiding questions will be provided in week 5. </p></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Privacy, Consent &amp; Surveillance 2, w/Team Session</strong>",
            "topic_description": "Privacy, Consent & Surveillance 2, w/Team Session In the second part of Module 3.1, we will cover additional issues associated with Privacy, Consent and Surveillance as these arise in the artificial intelligence landscape.  In Week 6 teams gather to select a topic for the Final Group Presentations (Assessment #2, due in Week 13). Students team up in groups of 3 - 4 (or other amount to be determined by instructor depending on course enrollment). Teams will select an organisational case relating to responsible AI and prepare a PPT presentation as a video recording on their findings. A set of guiding questions will be provided in week 5.",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Diversity, Inclusiveness, and Fairness</strong><br/><p>In Module 3.2, you will examine how the concepts of fairness, inclusivity, and non-discrimination relate to AI.</p>\n<p>We will explore these issues through two different case studies.</p>\n<p>This week's Seminar provides a discussion on the (fictional) case of 'Hiring by Machine', which raises relevant real-world questions about fairness, equity, unfair discrimination and others. Please prepare prior to attendance.</p></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Diversity, Inclusiveness, and Fairness</strong>",
            "topic_description": "Diversity, Inclusiveness, and Fairness In Module 3.2, you will examine how the concepts of fairness, inclusivity, and non-discrimination relate to AI. We will explore these issues through two different case studies. This week's Seminar provides a discussion on the (fictional) case of 'Hiring by Machine', which raises relevant real-world questions about fairness, equity, unfair discrimination and others. Please prepare prior to attendance.",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Trustworthy systems</strong><br/><p>This week, in Module 3.3, we will cover Transparency, Contestability, Explainability, Understandability, and Safety in the artificial intelligence landscape. We will explore these issues through two different case studies.</p>\n<p>The Seminar provides a discussion on the (fictional) case of 'Cogito Ergo Sum', which raises issues relating to disclosure when a person is interacting with an AI system. Please prepare prior to attendance.</p></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Trustworthy systems</strong>",
            "topic_description": "Trustworthy systems This week, in Module 3.3, we will cover Transparency, Contestability, Explainability, Understandability, and Safety in the artificial intelligence landscape. We will explore these issues through two different case studies. The Seminar provides a discussion on the (fictional) case of 'Cogito Ergo Sum', which raises issues relating to disclosure when a person is interacting with an AI system. Please prepare prior to attendance.",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Mid-sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In-semester break</strong><br/><p>No classes</p></p></div></td>",
            "topic_title": "<strong>In-semester break</strong>",
            "topic_description": "In-semester break No classes",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Human, Societal &amp; Environmental Well-Being</strong><br/><p>This week, in Module 3.4A, we will cover Human, Societal and Environmental Well-Being in the artificial intelligence landscape. We will explore these issues through two different case studies.</p>\n<p>This Seminar provides a discussion on the (fictional) case of 'Healthcare App', which describes the development of an app which uses AI to make diabetic care easier and more accessible, but raises issues about the equity of benefits and utility. Please prepare prior to attendance.</p></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Human, Societal &amp; Environmental Well-Being</strong>",
            "topic_description": "Human, Societal & Environmental Well-Being This week, in Module 3.4A, we will cover Human, Societal and Environmental Well-Being in the artificial intelligence landscape. We will explore these issues through two different case studies. This Seminar provides a discussion on the (fictional) case of 'Healthcare App', which describes the development of an app which uses AI to make diabetic care easier and more accessible, but raises issues about the equity of benefits and utility. Please prepare prior to attendance.",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Assessment #2 Working Week</strong><br/><p>Assessment #2 Working Week</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Assessment #2 Working Week</strong>",
            "topic_description": "Assessment #2 Working Week Assessment #2 Working Week",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Generative AI</strong><br/><p>This week, in Module 3.5, we will cover Generative AI in the artificial intelligence landscape. We will explore these issues through two different case studies.</p>\n<p>The Seminar provides a discussion on a case to be provided in Week 12 relating to generative and their potential ethical, legal and societal implications. Please prepare prior to attendance.</p></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Generative AI</strong>",
            "topic_description": "Generative AI This week, in Module 3.5, we will cover Generative AI in the artificial intelligence landscape. We will explore these issues through two different case studies. The Seminar provides a discussion on a case to be provided in Week 12 relating to generative and their potential ethical, legal and societal implications. Please prepare prior to attendance.",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>AI Misinformation</strong><br/><p>In Module 3.5 we will cover Misinformation in the artificial intelligence landscape. We will explore these issues through two different case studies.</p>\n<p>This session provides a discussion on the (fictional) case relating to Deep Fakes and their potential ethical, legal and societal implications. Please prepare prior to attendance.</p></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>AI Misinformation</strong>",
            "topic_description": "AI Misinformation In Module 3.5 we will cover Misinformation in the artificial intelligence landscape. We will explore these issues through two different case studies. This session provides a discussion on the (fictional) case relating to Deep Fakes and their potential ethical, legal and societal implications. Please prepare prior to attendance.",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Summary</strong><br/><p>In this concluding module [Module 4], we will summarize and reflect on the course and you will complete the final assessment.</p>\n<p>Q&amp;A Session. Please see details on how this will be run on Blackboard.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Summary</strong>",
            "topic_description": "Summary In this concluding module [Module 4], we will summarize and reflect on the course and you will complete the final assessment. Q&A Session. Please see details on how this will be run on Blackboard.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        }
    ]
}