{
    "course_title": "Learning from the International Experience",
    "study_period": "Sem 1 2025",
    "location": "External",
    "attendance": "Online",
    "url": "https://course-profiles.uq.edu.au/course-profiles/COMU3060-21026-7520",
    "full_course_code": "COMU3060-21026-7520",
    "course_code": "COMU3060",
    "class_code": "21026",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate skills of data collection based on observation and note-taking."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate understanding of theoretical frameworks for analysing intercultural experience and competence"
        },
        {
            "number": "LO3.",
            "description": "Engage in reflective processes for understanding and evaluating intercultural experiences and challenges"
        },
        {
            "number": "LO4.",
            "description": "Apply problem-solving and critical thinking skills in intercultural contexts"
        },
        {
            "number": "LO5.",
            "description": "Relate international experience to theoretical frameworks"
        },
        {
            "number": "LO6.",
            "description": "Articulate and communicate intercultural understanding effectively in a variety of genres"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Sequence: Fieldnotes",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 28/02/2025 5:00 pm</p>\n<p> 31/03/2025 5:00 pm</p>\n<p> 30/04/2025 5:00 pm</p>\n<p> 30/05/2025 5:00 pm</p>\n<p> 30/06/2025 5:00 pm</p>\n<p> 31/07/2025 5:00 pm</p>\n<p>\n</p><p>In order to accommodate different academic calendars at our Study Abroad partner institutions, there are six opportunities to submit a field note: five will count towards your final result for the course. </p></dd>",
            "learning_objectives": "L01",
            "mode": "Written",
            "category": "Notebook/ Logbook",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment item encourages you to approach your in-country study as fieldwork, compiling a shared database of fieldnotes which we will then draw on in Semester 2 2025. The shared data base is housed on a padlet in the folder corresponding to this assessment item on Blackboard. You also upload each fieldnote to Turnitin (via a link on Blackboard) in order to receive personalized, private, feedback. </p>\n<p><br/></p>\n<p><strong>What is a fieldnote? </strong>Your fieldnote uses a template provided on Blackboard to record the important details of a precise observation which you have personally made. You explain why this observations is interesting as data relating to your chosen theme (see below) and note any questions it raises for you. Your focus is on the observation and questions it raises, which might themselves be answered by further observations. You can relate your observation, briefly, to wider patterns of behaviour, but your aim is not to describe those wider patterns. You may include photographs or recordings. The shared padlet proposes four initial themes for these observations, students can propose additional themes for consideration. You do not need to post on all the themes. <em>Note: you can post additional observations to the padlet, above 5 in total - simply upload to Turnitin those which you wish to be marked. </em></p>\n<p>Themes:</p>\n<ul>\n<li>Cultural practices (doing things differently)</li>\n<li>Intercultural practices (practices of mediation; negotiation; accommodation, successful or otherwise)</li>\n<li>Embodiment (being there in person; contact through the senses)</li>\n<li>Linguistic landscapes (language use in the host culture; language use among Study Abroad students; language learning) </li>\n</ul>\n<p>Each entry will be at least 150 words. See Blackboard for the template detailing the information to include in each entry. </p>\n<p><br/></p>\n<p><strong>How many fieldnotes do I make and when do I post them?</strong> You should submit five fieldnotes for marking, but there are six opportunities to submit, to cater for different starting and finishing dates. Each opportunity closes on the last working day of each month: February, March, April, May, June, July. Remember, nothing stops you submitting a fieldnote early, or submitting a fieldnote when you are no longer in-country as long as it relates to an observation you made during Study Abroad. If you choose to submit six fieldnotes, the best five marks will count towards your final result for the course. </p>\n<p><br/></p>\n<p><strong>Marking criteria</strong>: Each fieldnote is marked out of 5% on the quality of: Information provided; Comments on observation; Language. (See detailed grid on Blackboard). </p>\n<p><br/></p>\n<p><strong>Use of Generative AI and Machine Translation: </strong> This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p><br/></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Each entry must be submitted via Turnitin AND posted on the shared padlet. Links to both are provided in the Blackboard \"Assessment\" section. <em>Your assessment is not completely submitted until it has been uploaded to both platforms. </em></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Report on tutorial discussion of a reading",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 11/08/2025 - 10/11/2025</p>\n<p>\n</p><p>In Sem 2, 2025, students will act as rapporteurs on discussion of one reading, based on that reading and work in class in their choice of: Week 3, Week 5, Week 9, Week 11 or Week 13. The report is due one week after the tutorial, or, in the case of Week 13, by the Monday of exam period.</p></dd>",
            "learning_objectives": "L02, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Once during the semester following your Study Abroad experience, you act as rapporteur on class discussion of one of the set readings: you are responsible for providing a guide for your peers to the main points of the article, as discussed in class, and to the usefulness of the article in terms of analyzing the fieldnotes submitted by your cohort. This evaluation of usefulness should include an example of how the article could be applied to a specific fieldnote (or a cogent argument as to how it cannot be applied to our data set and the kind of data which would be needed to use the theoretical framework outlined in the reading).</p>\n<p>You will sign up through Blackboard to choose the particular reading for which you will be responsible.</p>\n<p>You will post your summary within the week following class.</p>\n<p>Fuller guidelines will be posted on Blackboard.</p>\n<p><strong>Length:</strong> 1000 words, not including references</p>\n<ul>\n<li>If your paper is under 900 words, your mark will be reduced proportionally. For example, if your initial mark is 14/20, but you only wrote 500 words, rather than 1000, your marks is reduced to 7/20.</li>\n<li>If your paper is over 1 100 words, the excess material may not be read. For example, by the 1 100 word point, you are still explaining the methodology used by the authors of the article and haven't yet got to your evaluation of the usefulness of the article you won't get points for that evaluation.</li>\n</ul>\n<p><strong>Marking criteria:</strong> the report will be marked on the quality of the summary, of the evaluation of the applicability of the article to your fieldnotes (including the example) and of the written expression. (A detailed rubric is provided on Blackboard).</p>\n<p><strong>Use of generative AI and Machine Translation:</strong> This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Your report will be made available to other students on Blackboard. You should also upload it to Turnitin. (Full details will be provided on Blackboard). </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Pre-departure seminar for future Study Abroad Participants",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 8/09/2025 - 12/09/2025</p>\n<p>\n</p><p>Exact date/s depend/s on timetabling. The usual class time in Week 7 will be used for presentations, with additional sessions timetabled as student numbers require. </p></dd>",
            "learning_objectives": "L03, L04, L06",
            "mode": "Activity/ Performance, Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>COMU3065 students present at a pre-departure seminar for other students interested in Study Abroad, to provide precise, useful advice based on your Study Abroad experience (and, potentially, those of your peers). You should pick a specific topic of relevance to your audience, which you should announce in the introduction to your presentation. For example, you might cover topics such as:</p>\n<ol>\n<li><em>Negotiating the academic system in [host country].</em> What did you learn from negotiating the differences? Were there challenges and how did you overcome them? How could others learn from your experience? </li>\n<li><em>Intercultural communication in [host country].</em> What advice would you give to students interested in the country where you did your exchange? Share your intercultural insights!</li>\n<li><em>Developing your skillset through Study Abroad</em>. What skills and attributes have you developed during Study Abroad which have contributed to your personal and professional development, and how could other students benefit in the same way (or learn from your errors).</li>\n<li><em>Self-care and Study Abroad. </em>Based on your experience, what advice can you give your audience members so that they cope and thrive in the sometimes challenging Study Abroad environment?</li>\n</ol>\n<p>Please note: if you are also providing a text to the Global Experiences team, or to your scholarship sponsor, you can draw on that work for this presentation: however, this is a presentation, not the reading of a script. </p>\n<p><br/></p>\n<p><strong>Length and format: </strong>This presentation should be 6-8 minutes long, be supported by a Powerpoint (or similar) and be followed by responding to 3 to 4 questions from the audience. Internal students present in-person, external students present on Zoom. </p>\n<p><br/></p>\n<p><strong>Marking criteria: </strong> This assessment item will be marked on the quality of: the information provided;  presentation skills; language. (For a detailed rubric, see Blackboard.) </p>\n<p><br/></p>\n<p><strong>Use of Generative AI and Machine Translation: </strong>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their work independent of AI and MT tools</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>In-person or via Zoom</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Analytical essay",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>35%</dd>",
            "due_date": "<dd><p> 18/11/2025 5:00 pm</p></dd>",
            "learning_objectives": "L02, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students write an essay which draws on a selection of the fieldnotes, relates them to theoretical frameworks for analysing intercultural experiences, competencies and study abroad, to provide a precise analysis leading to a logical conclusion. Students are invited to discuss their plan for their essay with the course co-ordinator before starting to write it. The essay should be clearly structured with an<strong> introduction</strong> stating the precise topic to be discussed, a summary of <strong>relevant literature</strong>, a brief indication of the <strong>method</strong> by which the field notes and examples were selected, a <strong>discussion</strong> and <strong>conclusion</strong>. (More detailed guidelines are provided on Blackboard along with the essay questions.)</p>\n<p>What to include:</p>\n<ul>\n<li>Precise references to examples in the Field Notes. </li>\n<li>References to the readings studied throughout semester. </li>\n<li>References to concepts discussed in class.</li>\n</ul>\n<p><strong>Length:</strong> 2000 words (1 800 - 2 200 words, excluding the reference list and any appendices). Below 1 800, and the mark will be reduced proportionally. For example 30/35 for an essay which is 1500 words long will be reduced to 1500/2000 x 30. Markers will not read beyond 2 200 words.</p>\n<p><strong>Marking criteria:</strong> The essay will be marked on the quality of: the demonstrated understanding of theory discussed during the course; the analysis; organisation of the essay and its argument; academic writing. A detailed marking rubric is available on the course Blackboard site. </p>\n<p><strong>Use of generative AI and Machine Translation:</strong> This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Via Turnitin (submission link on Blackboard)</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Not scheduled",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semester 1 2025 : Introduction to the course</strong><br><p>Online materials on Blackboard present the aims and objectives of the course. </p></br></p><p><strong>Learning outcomes:</strong> L03, L05</p></div></td>",
            "topic_title": "<strong>Semester 1 2025 : Introduction to the course</strong>",
            "topic_description": "Semester 1 2025 : Introduction to the course Online materials on Blackboard present the aims and objectives of the course.",
            "learning_outcomes": [
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Not scheduled",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semester 1 2025: Study Abroad</strong><br><p>Your Study Abroad experience overlaps with UQ's Semester One 2025 (it might start earlier or end later). During this time, your contribution to COMU3060 takes the form of completing five fieldnotes - see the assessment section for details. </p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L06</p></div></td>",
            "topic_title": "<strong>Semester 1 2025: Study Abroad</strong>",
            "topic_description": "Semester 1 2025: Study Abroad Your Study Abroad experience overlaps with UQ's Semester One 2025 (it might start earlier or end later). During this time, your contribution to COMU3060 takes the form of completing five fieldnotes - see the assessment section for details.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L06"
            ]
        },
        {
            "learning_period": "Week 14(28 Jul - 03 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semester 2 2025, Week One: Expectations and Experience</strong><br/></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Semester 2 2025, Week One: Expectations and Experience</strong>",
            "topic_description": "Semester 2 2025, Week One: Expectations and Experience",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 16(11 Aug - 17 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semester 2 2025, Week Three: Identity Transformation </strong><br/></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Semester 2 2025, Week Three: Identity Transformation </strong>",
            "topic_description": "Semester 2 2025, Week Three: Identity Transformation",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 18(25 Aug - 31 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semester 2 2025, Week Five: Becoming one of the locals???</strong><br/></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Semester 2 2025, Week Five: Becoming one of the locals???</strong>",
            "topic_description": "Semester 2 2025, Week Five: Becoming one of the locals???",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 20(08 Sep - 14 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semester 2 2025, Week Seven: Pre-departure Seminar for Future Study Abroad Participants. </strong><br><p>Students participate in the delivery of the pre-departure seminar for peers planning to study abroad. Depending on student numbers, presentations may also be scheduled outside of classtime. See assessment details for more information. </p></br></p><p><strong>Learning outcomes:</strong> L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Semester 2 2025, Week Seven: Pre-departure Seminar for Future Study Abroad Participants. </strong>",
            "topic_description": "Semester 2 2025, Week Seven: Pre-departure Seminar for Future Study Abroad Participants. Students participate in the delivery of the pre-departure seminar for peers planning to study abroad. Depending on student numbers, presentations may also be scheduled outside of classtime. See assessment details for more information.",
            "learning_outcomes": [
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 22(22 Sep - 28 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semester 2 2025, Week Nine: Questioning Authenticity</strong><br/></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Semester 2 2025, Week Nine: Questioning Authenticity</strong>",
            "topic_description": "Semester 2 2025, Week Nine: Questioning Authenticity",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 24(13 Oct - 19 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semester 2 2025, Week Eleven : Multilingual Mindsets</strong><br/></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Semester 2 2025, Week Eleven : Multilingual Mindsets</strong>",
            "topic_description": "Semester 2 2025, Week Eleven : Multilingual Mindsets",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 26(27 Oct - 02 Nov)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semester 2 2025, Week Thirteen: Living and Working in Intercultural Spaces</strong><br/></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Semester 2 2025, Week Thirteen: Living and Working in Intercultural Spaces</strong>",
            "topic_description": "Semester 2 2025, Week Thirteen: Living and Working in Intercultural Spaces",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        }
    ]
}