{
    "course_title": "Introduction to Strategic Communication",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/COMU1052-22062-7520",
    "full_course_code": "COMU1052-22062-7520",
    "course_code": "COMU1052",
    "class_code": "22062",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "DESCRIBE the diverse nature of contemporary practices of strategic communication, the relationship of public relations practice to other public communication practices like marketing, advertisement and journalism, the role of stakeholders and publics and the communication practitioner itself in and outside of an organization (corporate, NGO, political and educational institutions etc.)."
        },
        {
            "number": "LO2.",
            "description": "UNDERSTAND and INTERPRET the key elements of communication theories, strategies and tactics, and, thus, the character and operationalization of a best practice communication planning framework."
        },
        {
            "number": "LO3.",
            "description": "PRODUCE strategic communication practices by constructing and presenting a communication plan that is based on research and contains a situation analysis, target audiences, goals and objectives, communication strategies and tactics, and evaluation methods. Work effectively in teams to make informed team decisions and demonstrate interpersonal, leadership and communication skills."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Learning Reflection",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>25% 1000 words (2 reflective journal entries, 500 words each) </dd>",
            "due_date": "<dd><p> 19/05/2025 4:00 pm</p>\n<p>\n</p><p>Submit both reflections by no later than 4pm Monday 19 May 2025 (see Blackboard for details)</p></dd>",
            "learning_objectives": "L01, L02",
            "mode": "Written",
            "category": "Notebook/ Logbook, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assignment task involves students reflecting on their learning and writing two reflective journal entries. This experience helps to build reflective practice, which is emerging as a vitally important component of strategic communication. It is through reflection that today's communication practitioners and experts become more attuned to the challenges of implementing best practice approaches. </p>\n<p>Through reflection, professionals adopt more critical perspectives on developments in the field, and develop as flexible, adaptable, and strategic members of their organizations and consultancies.</p>\n<p>In our second week, you are to prepare one learning journal entry. Entry #1 will be a pre-reflection on the course, Entry #2 will be written throughout the course time and it will be a post-reflection on the course. </p>\n<p>Your tutor will provide detailed guidance and instructions on how to complete the two entries. </p>\n<p>This needs to be a critical reflection. Therefore, you will need to move beyond merely describing your learning experience. Instead, you should aim to highlight, explain, and analyse the changes in your understandings and approaches as a result of your learning experience. Unfold the moments when you consider you came to deeper realisations and understandings (the 'aha moments'). Assess the implications of what you have learned for your future professional practice.</p>\n<p>Here is the schedule and structure for your journal entries:</p>\n<p><strong>Entry #1 Pre-Reflection (complete by Week 2)</strong></p>\n<p>As you begin studying this course, record your reflections on:</p>\n<ul>\n<li>What do you think is involved in strategic communication?</li>\n<li>What has shaped your current thinking about what strategic communication is?</li>\n<li>What do you think are the key challenges of strategic communication and particularly public relations today?  </li>\n<li>What value do you think strategic communication brings to an organisation – of whatever kind (Nonprofit, corporate, political organization etc.?</li>\n</ul>\n<p><strong>Entry #2 Post-Reflection (complete on or before Monday 19th May, See Blackboard for details)</strong></p>\n<p>As you are coming to the end of this course, record your reflections on:</p>\n<ul>\n<li>Now, what do you think is involved in strategic communication?</li>\n<li>Which aspects of the course learning experience have been most helpful in shaping your current thinking about what is involved in public relations?  (The lectures?  The tutorials?  The workshops?  The textbook chapters? The video interviews with PR professionals?  The assignment tasks?)   </li>\n<li>Which aspects of the course learning experience have been most challenging for you, and why?</li>\n<li>Now, what do you think are the key challenges of public relations in the contemporary organisation?  </li>\n<li>Now, what value do you think public relations brings to an organisation?</li>\n</ul>\n<p><strong>Student use of AI in Assessment 1</strong></p>\n<p>This assessment task evaluates students’ abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via TurnItIn on Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Case Study Analysis",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>25% 1500 words </dd>",
            "due_date": "<dd><p> 11/04/2025 4:00 pm</p></dd>",
            "learning_objectives": "L01, L02",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assignment task is designed to enable students to demonstrate their understanding of key elements of effective, best-practice, public relations campaign design, and to apply this understanding through critically analysing a public relations campaign case study.</p>\n<p>During the lectures and tutorials, a best-practice communication campaign planning framework will be provided. This is an individual assignment. The student will undertake a critical analysis of a case study public relations campaign plan that will be provided.</p>\n<p>Each student needs to prepare a 1500-word report of an analysis of a case study. This case study will be made available via learning resources on Blackboard in Week 4. Your purpose in this report is to present a case on whether or not the campaign plan is effective or not – whether it contains (and effectively applies) the components of campaign design identified via best practice frameworks.  </p>\n<p>An important part of this assignment is demonstrating your understanding of best practice frameworks (for example, the framework that contained in the course textbook by Silverman &amp; Smith). Your paper will be assessed on the quality and depth of your <em>critical</em> analysis. Ensure the critical analysis is explained and justified. The report should not be simply descriptive. </p>\n<p>The report should also include recommendations for improvements to the plan. Suggested amendments and inclusions to the campaign plan should be provided, with specific examples of redrafted elements included.</p>\n<p>Ensure that all sources of information used in this report are acknowledged via intext referencing and a list of references (using APA 7th edition referencing format). The report should be prepared in Microsoft Word format. Ensure that the file is named as follows: FamilyName,FirstName_StudentNumber_CourseNumber_AssessmentTask.docx. The document itself should be formatted with 1.5-2 line spacing, minimum size 12 font (preferably Times New Roman), and 2.5cm margins.</p>\n<p><strong>Student use of AI in assessment 2 </strong></p>\n<p>Assignments have been designed to be challenging, authentic and complex. Whilst students may use AI technologies, successful completion of assessments in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference AI or MT technologies use may constitute student misconduct under the Student Code of Conduct. If you are using AI or MT tools, collate all prompts and responses with the URL and date in a single PDF document as an appendix and submit it along with your assignments. To pass assessments for this course, students will be required to demonstrate detailed comprehension of their written submission independent of AI or MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via TurnItIn on Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Campaign Pitch, Documents, Peer Group Evaluation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 23/05/2025 4:00 pm</p>\n<p>\n</p><p>Campaign Pitch Presentation: In-class presentation in Week 12 tutorials (week beginning May 19th - 23). All groups must be prepared for week 12. Week 13 will only be used if time runs out, please keep availability for both weeks.</p>\n<p>Documents and Peer Group Evaluation: Due by 4pm 23 May 2025</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assignment task is designed to enable students to demonstrate their understanding of effective, strategic, engaging, best-practice, public relations campaign design – particularly how to develop a campaign plan, and present a pitch for this campaign plan.</p>\n<p>During the tutorials, peer groups for this assignment task will be formed. Each peer group will research and develop a public relations campaign plan for a client organisation, and present an oral pitch of this campaign plan. (Groups will be formed by the end of Week 5 in tutorials where continued attendance is strongly encouraged as tutors will guide group work and documentation activities).</p>\n<p>For the purpose of this assignment, the peer group should take on the role of a PR consultancy – so you should 'create' a consultancy for the peer groups. The public relations campaign being developed should be for a real organisation OF YOUR GROUP’S CHOICE (to be discussed with your tutor).</p>\n<p>It is expected that each member of the peer group will sustain a strong level of engagement with the work of the team, will show a degree of respect for the opinions/input of others into decision-making, will demonstrate a willingness to take on responsibilities and complete these on time, and will adopt a collaborative approach (working well with all team members - avoiding passivity, submissiveness or domination).</p>\n<p>Each member of the peer group is required to share equally in the development of the communication campaign plan, in presenting the pitch, and in preparing the supporting documentation to be submitted.</p>\n<p>Information from academic sources should be used in the preparation of this assignment. Sources used should be acknowledged following appropriate academic referencing process. A reference list should be provided in the campaign pitch Powerpoint/Prezi slide presentation.</p>\n<p>There are three components to be completed:</p>\n<p><strong>1. Supporting Documents for Campaign Pitch Presentation (2,000 words maximum)</strong></p>\n<p>You are to prepare the following documents:</p>\n<ul>\n<li>A consultancy credentials document (SWOT analysis and Problem/Vision statement, links and reference page to research identified, campaign schedule and budget).</li>\n<li>A document which contains the Powerpoint/Prezi slides used for the pitch presentation (and any other supporting materials used);</li>\n</ul>\n<p>You are to bring to the pitch presentation a printed copy of the presentation slides (you may scale slides to fit to 1-2 pages) for your tutor, who you will present to.</p>\n<p>NOTE: Ensure that you clearly include the full names and student numbers of all members of the peer group on a title page/cover page. The material should be prepared in Microsoft Word format. Ensure that the file is named as follows: ConsultancyName_TutorialDayandTime _CourseNumber_AssessmentTask.docx</p>\n<p>Ensure that all sources of information used in this report are acknowledged via intext referencing and a list of references (using APA 7th edition referencing format).</p>\n<p><strong>2. Campaign Pitch Presentation</strong></p>\n<p>The pitch presentation should be 15 minutes, with a further 5 minutes at the end allocated for a question time. (As a team, you should develop a strategy for addressing questions – prepare potential questions and answers, and nominate who should respond to which types of questions.)</p>\n<p> The pitch presentation should provide an intelligible and clear account of the PR campaign plan. You should address the following:</p>\n<ul>\n<li>Introduction:\tA brief introduction about your PR consultancy/team, your credentials, and any relevant information about your PR consultancy. </li>\n<li>Where are we now?\tA clear, and concise, account of the current situation that the client is facing; the situation analysis (including, for example, an assessment of major competitors, supporters, opponents, public perceptions of the organisation, and key publics for this current situation); the problem/opportunity to be addressed through the campaign.</li>\n<li>Where do we want to be?\tA clear, and concise, account of the purpose for the campaign (this should be visionary, but realistic for the organisation); the design of the campaign (e.g. how it positions the organisations); the goal of the campaign (e.g. why the campaign is needed and the predicted outcome/s); the objectives (and how these will shape the development of the campaign). </li>\n<li>How will we get there?\tA clear, and concise, account of the messaging strategy (the key messages for the specific target publics); the communication tactics (i.e. how the messaging strategy for the target publics will be executed; the campaign schedule; the campaign budget. </li>\n<li>How will we know we've achieved good outcomes?\tA clear, and concise, account of the plan for monitoring and evaluating the effectiveness of the campaign (this should link to the campaign objectives); how successful outcome/s of the campaign will be determined </li>\n<li>Conclusion and question time:\tProvide a clear summary statement of the campaign purpose, key strengths/uniqueness in the campaign design, and the end outcome/s that will be achieved. (Include the Powerpoint/Prezi slide with the reference list here.) Then, open up a Q&amp;A time. </li>\n</ul>\n<p>The presentation should be professional in approach. Aim to enliven the material and present it in an engaging, persuasive manner rather than reading information from a script. Ensure that the presentation incorporates Powerpoint or Prezi slides (or similar) – and that these are of a professional standard. You should rehearse the pitch presentation to ensure it is well-paced and keeps within the allocated time. Rehearsing will also ensure that there is a smooth flow between presenters. Following the presentation and question-time, the peer team will then participate in a brief feedback process on their plan and pitch.</p>\n<p><strong>3. Peer Team Evaluation (Buddy Check)</strong></p>\n<p>Each student is to provide an evaluation of each member of the peer group via Buddy Check. This will be outlined further and will focus on contributions of each member to the group work and the outcomes the group achieved, the group's performance in presenting work as an integrated whole, the way in which the team members interacted and worked together.</p>\n<p><strong>Student use of AI in assessment 3</strong></p>\n<p>Assignments have been designed to be challenging, authentic and complex. Whilst students may use AI technologies, successful completion of assessments in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference AI or MT technologies use may constitute student misconduct under the Student Code of Conduct. If you are using AI or MT tools, collate all prompts and responses with the URL and date in a single PDF document as an appendix and submit it along with your assignments. To pass assessments for this course, students will be required to demonstrate detailed comprehension of their written submission independent of AI or MT tools.</p>\n<p><strong>Recording of Oral and Practical Assessment</strong> </p>\n<ul>\n<li>All presentations will be recorded for marking purposes via recording facilities available where the assessment takes place (eg. ECHO360, Zoom, camera device)  </li>\n<li>Recordings will be retained by the School of Communication and Arts for at least 12 months from the release of the final grade for the course.  </li>\n<li>Recordings will be stored in a secure manner and will only be accessed by authorised school staff for the purposes of: </li>\n<li>Moderation of marking;  </li>\n<li>Provision of feedback to the student(s) recorded; and/or  </li>\n<li>Re-marking following a successful re-mark application. </li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Campaign Pitch Presentation : In-class presentation in Week 12 tutorials (all must be prepared and ready to present week 12. Week 13 will only be used if time runs out).</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1 Lecture: Lecture Situational Analysis and Research</strong><br><p>The first lecture provides an overview of the course. Some focus will be given to unfolding what strategic communication is and clarify the specific focus and broad understanding of communication planning. We enter Phase One: Formative Research. The importance of primary and secondary research as the foundation of strategic planning is introduced. Readings: Silverman and Smith (2024) Introduction pp xxvi-xlvi; Step 1 Analyzing the Situation pp3 - 27; and Step 2 Choosing Research Methods pp 28-65</p></br></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Week 1 Lecture: Lecture Situational Analysis and Research</strong>",
            "topic_description": "Week 1 Lecture: Lecture Situational Analysis and Research The first lecture provides an overview of the course. Some focus will be given to unfolding what strategic communication is and clarify the specific focus and broad understanding of communication planning. We enter Phase One: Formative Research. The importance of primary and secondary research as the foundation of strategic planning is introduced. Readings: Silverman and Smith (2024) Introduction pp xxvi-xlvi; Step 1 Analyzing the Situation pp3 - 27; and Step 2 Choosing Research Methods pp 28-65",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1 Tutorial: Secondary Research and AI</strong><br><p>In the tutorial, students are introduced to the forms or research using a successful case study. Activities include an introduction to the process of gathering secondary research and how to critically assess AI aided research. The reflective journal entries as assignment #1 will be introduced.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 1 Tutorial: Secondary Research and AI</strong>",
            "topic_description": "Week 1 Tutorial: Secondary Research and AI In the tutorial, students are introduced to the forms or research using a successful case study. Activities include an introduction to the process of gathering secondary research and how to critically assess AI aided research. The reflective journal entries as assignment #1 will be introduced.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 3(03 Mar - 16 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2 Lecture: Analyzing the Organisation &amp; its Publics</strong><br><p>The focus of the lecture is on unfolding (campaign) planning frameworks and exploring the relationship dimensions of strategic communication. The problem as starting point of strategic communication is introduced as well. Readings: Silverman and Smith (2024) Step 3 Analyzing the Organisation pp 66-86 and Step 4 Analyzing the Publics pp 87-123</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 2 Lecture: Analyzing the Organisation &amp; its Publics</strong>",
            "topic_description": "Week 2 Lecture: Analyzing the Organisation & its Publics The focus of the lecture is on unfolding (campaign) planning frameworks and exploring the relationship dimensions of strategic communication. The problem as starting point of strategic communication is introduced as well. Readings: Silverman and Smith (2024) Step 3 Analyzing the Organisation pp 66-86 and Step 4 Analyzing the Publics pp 87-123",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 3(03 Mar - 16 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2-3 Tutorial: Analyzing the Organisation &amp; its Publics</strong><br><p>In the tutorial the focus is on the problem statement. Activities will include conducting preliminary desktop research to conduct a SWOT analysis and draw a concept map of primary/secondary publics. Secondary Research and AI Prompts part 2.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 2-3 Tutorial: Analyzing the Organisation &amp; its Publics</strong>",
            "topic_description": "Week 2-3 Tutorial: Analyzing the Organisation & its Publics In the tutorial the focus is on the problem statement. Activities will include conducting preliminary desktop research to conduct a SWOT analysis and draw a concept map of primary/secondary publics. Secondary Research and AI Prompts part 2.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4 Lecture: Establishing Goals &amp; Objectives</strong><br><p>We enter Phase 2: Strategy. The focus of this lecture is on examining the use of research to identify specific communication goals &amp; objectives and strategies to critically reflect on a campaign. Readings: Silverman and Smith (2024) Step 5 Creating Positioning Statements, Goals, and Objectives pp127-151</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 4 Lecture: Establishing Goals &amp; Objectives</strong>",
            "topic_description": "Week 4 Lecture: Establishing Goals & Objectives We enter Phase 2: Strategy. The focus of this lecture is on examining the use of research to identify specific communication goals & objectives and strategies to critically reflect on a campaign. Readings: Silverman and Smith (2024) Step 5 Creating Positioning Statements, Goals, and Objectives pp127-151",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4 Tutorial: Establishing Goals &amp; Objectives and Introduction to PRIA Criteria</strong><br/><p>In the tutorial, students are introduced to the criteria used to judge industry PR campaign awards will be used in analysing example PR plans. Students begin to critique strategies and the use of meaningful goals and SMART objectives.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 4 Tutorial: Establishing Goals &amp; Objectives and Introduction to PRIA Criteria</strong>",
            "topic_description": "Week 4 Tutorial: Establishing Goals & Objectives and Introduction to PRIA Criteria In the tutorial, students are introduced to the criteria used to judge industry PR campaign awards will be used in analysing example PR plans. Students begin to critique strategies and the use of meaningful goals and SMART objectives.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5 Lecture: Formulating Action and Response Strategies </strong><br/><p>In the lecture the core characteristics of effective messaging strategies are introduced through examining examples and case studies with a focus on action and response. Readings: Silverman and Smith (2024) Step 6 Choosing Proactive and Reactive Strategies pp 152-206</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 5 Lecture: Formulating Action and Response Strategies </strong>",
            "topic_description": "Week 5 Lecture: Formulating Action and Response Strategies In the lecture the core characteristics of effective messaging strategies are introduced through examining examples and case studies with a focus on action and response. Readings: Silverman and Smith (2024) Step 6 Choosing Proactive and Reactive Strategies pp 152-206",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5 Tutorial: Formulating Action and Response Strategies - Introducing the Best Practice Map, Create Presentation Groups</strong><br/><p>In the tutorial, students will analyse and map Best Practice PR plans. Feedback will be provided on students' campaign goals and objectives. Preparation and guidance for Assignment 2 Case Study will be given.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 5 Tutorial: Formulating Action and Response Strategies - Introducing the Best Practice Map, Create Presentation Groups</strong>",
            "topic_description": "Week 5 Tutorial: Formulating Action and Response Strategies - Introducing the Best Practice Map, Create Presentation Groups In the tutorial, students will analyse and map Best Practice PR plans. Feedback will be provided on students' campaign goals and objectives. Preparation and guidance for Assignment 2 Case Study will be given.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6 Lecture: Key Messages </strong><br/><p>The focus of the lecture is an in-depth unpacking of the components in a strategic communication plan including appeal to logic and emotion. Readings: Silverman and Smith (2024) Step 7 Developing the Messaging Strategy pp 207-262.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 6 Lecture: Key Messages </strong>",
            "topic_description": "Week 6 Lecture: Key Messages The focus of the lecture is an in-depth unpacking of the components in a strategic communication plan including appeal to logic and emotion. Readings: Silverman and Smith (2024) Step 7 Developing the Messaging Strategy pp 207-262.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6 Tutorial: Developing messaging strategy. Finalise Presentation Groups</strong><br/><p>Developing messaging strategy. Group Work formation for Assessment 3. Students are required to sign group conduct contracts in class.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 6 Tutorial: Developing messaging strategy. Finalise Presentation Groups</strong>",
            "topic_description": "Week 6 Tutorial: Developing messaging strategy. Finalise Presentation Groups Developing messaging strategy. Group Work formation for Assessment 3. Students are required to sign group conduct contracts in class.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7 Lecture: Communication Tactics</strong><br/><p>We enter Phase Three: Tactics. In this lecture the core characteristics of effective communication tactics are layered through examining examples and case studies. Readings: Silverman and Smith (2024) Phase 3 Tactics Step 8 pp 262-326 (includes Part 1 - Owned Media and Part 2 Earned Media).</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 7 Lecture: Communication Tactics</strong>",
            "topic_description": "Week 7 Lecture: Communication Tactics We enter Phase Three: Tactics. In this lecture the core characteristics of effective communication tactics are layered through examining examples and case studies. Readings: Silverman and Smith (2024) Phase 3 Tactics Step 8 pp 262-326 (includes Part 1 - Owned Media and Part 2 Earned Media).",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7 Tutorial: Assessment 3 - Document Building </strong><br/><p>In this tutorial Assessment 3 is further outlined, students confirm organisation choice with tutor and develop desktop research activities for the documents.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Week 7 Tutorial: Assessment 3 - Document Building </strong>",
            "topic_description": "Week 7 Tutorial: Assessment 3 - Document Building In this tutorial Assessment 3 is further outlined, students confirm organisation choice with tutor and develop desktop research activities for the documents.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8 Lecture: Implementing the Strategy</strong><br/><p>This lecture presents how to choose, package and implement the communication tactics. Readings: Silverman and Smith (2024) Continue with Step 8 Part 3 and 4 pp 328-365. Begin Step 9 pp 367 (extra time is given to finish Step 9 next week).</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 8 Lecture: Implementing the Strategy</strong>",
            "topic_description": "Week 8 Lecture: Implementing the Strategy This lecture presents how to choose, package and implement the communication tactics. Readings: Silverman and Smith (2024) Continue with Step 8 Part 3 and 4 pp 328-365. Begin Step 9 pp 367 (extra time is given to finish Step 9 next week).",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8: NO TUTORIALS</strong><br/><p> No tutorials due to public holiday. Finish Reading: Silverman and Smith (2024) Step 9, Implementing the Strategic Plan p 367-395.</p></p></div></td>",
            "topic_title": "<strong>Week 8: NO TUTORIALS</strong>",
            "topic_description": "Week 8: NO TUTORIALS No tutorials due to public holiday. Finish Reading: Silverman and Smith (2024) Step 9, Implementing the Strategic Plan p 367-395.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MID-SEMESTER BREAK</strong><br/></p></div></td>",
            "topic_title": "<strong>MID-SEMESTER BREAK</strong>",
            "topic_description": "MID-SEMESTER BREAK",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9 Lecture: Theoretical Frameworks and Introduction to Budgets</strong><br/><p>Students are introduced to theoretical frameworks that are used in strategic communication. Campaign budget tools are introduced (note a budget is part of Assessment 3 documentation).</p></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Week 9 Lecture: Theoretical Frameworks and Introduction to Budgets</strong>",
            "topic_description": "Week 9 Lecture: Theoretical Frameworks and Introduction to Budgets Students are introduced to theoretical frameworks that are used in strategic communication. Campaign budget tools are introduced (note a budget is part of Assessment 3 documentation).",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9 Tutorial: Assessment 3 - Document Building  </strong><br/><p>In the tutorial, students will work on the findings and documentation of their client project and start preparing what is needed for the pitch.</p></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Week 9 Tutorial: Assessment 3 - Document Building  </strong>",
            "topic_description": "Week 9 Tutorial: Assessment 3 - Document Building In the tutorial, students will work on the findings and documentation of their client project and start preparing what is needed for the pitch.",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10 Lecture: Evaluating the Strategy</strong><br/><p>In this lecture we enter Phase Four: how to evaluate the strategy. Readings: Silverman and Smith (2024) Step 10 pp 397-431.</p></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Week 10 Lecture: Evaluating the Strategy</strong>",
            "topic_description": "Week 10 Lecture: Evaluating the Strategy In this lecture we enter Phase Four: how to evaluate the strategy. Readings: Silverman and Smith (2024) Step 10 pp 397-431.",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10 Tutorial: Evaluating the Strategy, Check Presentations</strong><br/><p>Gannt charts and budgets are outlined in the tutorial. Final checks on documentation and needs for presentation.</p></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Week 10 Tutorial: Evaluating the Strategy, Check Presentations</strong>",
            "topic_description": "Week 10 Tutorial: Evaluating the Strategy, Check Presentations Gannt charts and budgets are outlined in the tutorial. Final checks on documentation and needs for presentation.",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11 Lecture: Pitching the Strategic Plan</strong><br/><p>Pitching PR Campaign Plans &amp; Evaluation: In this lecture, advice on campaign pitches and presentations will be shared.</p></p><p><strong>Learning outcomes:</strong> L02</p></div></td>",
            "topic_title": "<strong>Week 11 Lecture: Pitching the Strategic Plan</strong>",
            "topic_description": "Week 11 Lecture: Pitching the Strategic Plan Pitching PR Campaign Plans & Evaluation: In this lecture, advice on campaign pitches and presentations will be shared.",
            "learning_outcomes": [
                "L02"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11 Tutorial: Group Work Practice Presentation</strong><br/><p>Every group needs to practice presentation AV equipment in the room. Final check of campaign ppt and document requirements.</p></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Week 11 Tutorial: Group Work Practice Presentation</strong>",
            "topic_description": "Week 11 Tutorial: Group Work Practice Presentation Every group needs to practice presentation AV equipment in the room. Final check of campaign ppt and document requirements.",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12 Lecture: Theoretical Frameworks - Part 2 and Summary</strong><br/><p>A review of relevant strategic communication theoretical frameworks and futures, summary of the course.</p></p><p><strong>Learning outcomes:</strong> L02</p></div></td>",
            "topic_title": "<strong>Week 12 Lecture: Theoretical Frameworks - Part 2 and Summary</strong>",
            "topic_description": "Week 12 Lecture: Theoretical Frameworks - Part 2 and Summary A review of relevant strategic communication theoretical frameworks and futures, summary of the course.",
            "learning_outcomes": [
                "L02"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12 Tutorial: PR Campaign Plan Presentations</strong><br/><p>All groups to present campaigns in class.</p></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Week 12 Tutorial: PR Campaign Plan Presentations</strong>",
            "topic_description": "Week 12 Tutorial: PR Campaign Plan Presentations All groups to present campaigns in class.",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13 Lecture: No lecture, Consultation availability </strong><br/></p></div></td>",
            "topic_title": "<strong>Week 13 Lecture: No lecture, Consultation availability </strong>",
            "topic_description": "Week 13 Lecture: No lecture, Consultation availability",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13 Tutorial: PR Campaign Plans Presentations (if required)</strong><br/><p>Final week if required for groups to present pitches in class. Groups to be prepared to present in week 12, and week 13 only if needed due to timing e.g. for large classes.</p></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Week 13 Tutorial: PR Campaign Plans Presentations (if required)</strong>",
            "topic_description": "Week 13 Tutorial: PR Campaign Plans Presentations (if required) Final week if required for groups to present pitches in class. Groups to be prepared to present in week 12, and week 13 only if needed due to timing e.g. for large classes.",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Revision week(02 Jun - 08 Jun)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 14: NO LECTURE OR TUTORIALS</strong><br/></p></div></td>",
            "topic_title": "<strong>Week 14: NO LECTURE OR TUTORIALS</strong>",
            "topic_description": "Week 14: NO LECTURE OR TUTORIALS",
            "learning_outcomes": []
        }
    ]
}