{
    "course_title": "Intercultural Communication",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/COMU7311-22087-7520",
    "full_course_code": "COMU7311-22087-7520",
    "course_code": "COMU7311",
    "class_code": "22087",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate specialised, advanced and integrated knowledge of intercultural communication theories and skills."
        },
        {
            "number": "LO2.",
            "description": "Analyse critically the key role that communication plays in developing intercultural relations and in managing conflicts."
        },
        {
            "number": "LO3.",
            "description": "Evaluate how media and culture intersect to influence attitudes, perceptions and public opinions as well as cultural change."
        },
        {
            "number": "LO4.",
            "description": "Transmit knowledge and skills to specialist and non-specialist audiences."
        },
        {
            "number": "LO5.",
            "description": "Communicate effectively and appropriately with individuals, groups, and communities in diverse local, national and cultural contexts."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Reflective Essay",
            "special_indicators": [],
            "weighting": "<dd>20% 1000 words </dd>",
            "due_date": "<dd><p> 24/03/2025 4:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L05",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Assessment 1 (Reflective Essay) requires you to reflect on your own culture as an \"insider\". Your cultural group can be defined at a national level (e.g., Korean, Australian, or German) or at a subcultural level (e.g., religious groups). In your reflective essay, you should first state your cultural identification, position yourself as a member of the cultural group you identify with, be it national or a subcultural group. Then you explain how your cultural identification conveys a sense of identity to you; what beliefs, values, practices, traditions and so forth are considered important and why they are important to you and your cultural group. You may include examples of products or practices of your culture but your reflective essay should go beyond simply introducing or describing what the cultural products (e.g., costume) or practices (e.g., eating fish on new year eve) are; you should explain the cultural meanings of those products and practices and what they tell us about the cultural beliefs and values important to your cultural group and how those beliefs and values influence your thinking (attitude), doing (behaviour) and being (identity). Reflecting on your own culture will help you to appreciate differences as well as similarities between cultures, which prepares you for Assessment 2. You need to apply at least one theoretical concept or a theoretical model learned in the course in relation to culture, identity, and communication. Define all theoretical concepts you choose to use in your reflective essay to demonstrate your knowledge of the concepts and your ability to apply them. You may cite academic and non-academic references for your essay. Do not cite Wikipedia as references for your essay. Include all references cited within your essay in the references list at the end. APA 7th edition referencing style is required. The UQ Library website has APA 7th edition referencing style guide. Further information on this assessment will be provided in class sessions.</p>\n<p>Include the following sections in your reflective essay:</p>\n<ol>\n<li>Title of your reflective essay.</li>\n<li>Brief description of the cultural group(s) with which you identify.</li>\n<li>The theoretical concept and/or theoretical model you choose to frame the discussion of your culture.</li>\n<li>Your reflection on how your culture shapes your attitude and behaviour, as a member of the cultural group.</li>\n<li>References list: All references cited within the essay should be included in the references list.</li>\n</ol>\n<p>Note:</p>\n<ol>\n<li>This assessment should be submitted via Turnitin. Submission as email attachment will NOT be accepted.</li>\n<li>The word limit (1000) for this assessment is suggestive. No penalties will apply based on the sole reason that your assessment is over/under the word limit.</li>\n<li>You are not required to include pictures. However, if you do, please limit your pictures to maximum 2. You might experience problems submitting your assessment via Turnitin if your file size is too large.</li>\n<li>Your assessment is marked according to the marking criteria in this course, NOT assessed with reference to the achievement of other students or your performance in other courses.</li>\n</ol>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via TurnItIn on Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Intercultural Experience Report",
            "special_indicators": [],
            "weighting": "<dd>40% 1500 words </dd>",
            "due_date": "<dd><p> 28/04/2025 4:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Assessment 2 (Intercultural Experience Report) requires you to report on your experience of communicating with people from another culture as an \"outsider\". To accomplish this assessment task, you need to choose a culture or subculture other than your own, i.e. you are an \"outsider\" to this culture. You then need to search for information academic and non-academic sources to learn about this culture and cultural group. Based on your research, you identify some aspects of this culture (e.g., certain cultural practices, traditions, values, beliefs, etc.) that you want to learn more about and provide a justification for why you choose to learn more about them. For the interaction part, locate about three persons from this cultural group under study through personal, social, or academic networks (e.g., networks of friends or colleagues, classmates at UQ, or professional associations of which you are a member, etc.). Interview them via a suitable medium (face-to-face or online) to learn about their views regarding those aspects of the culture you are interested in learning more about. In other words, you learn about the culture under study through interacting with people who are insiders of that culture. Summarise your main findings. Identify one or a set of potential problems that might arise in communication between members of the cultural group under study and members of your own culture (e.g., stereotypes, different beliefs and values, communication styles, etc.). Apply at least one theory to analyse the identified intercultural problem(s) and provide specific possible solutions, not just general statements. The reflection part of your intercultural experience report presents your learning from this intercultural communication experience.</p>\n<p>Include the following sections in your report:</p>\n<ol>\n<li>Title of your intercultural report.</li>\n<li>Introduction: State your own cultural identity in the Introduction and the culture you have chosen to study as well as provide a justification for your choice of the culture to study as an outsider.</li>\n<li>Description of the culture under study: Provide a brief description of the specific aspects of culture you plan to focus on. </li>\n<li>Intercultural interaction: Provide 3 to 5 interview questions you plan to ask the members of the cultural group you have chosen to study. Describe the characteristics of the persons you have chosen to interview and explain the rationale for your choice (why you believe they are in the best position to answer your questions), and then provide a summary of your main findings in relation to your questions. There is no need to include the real names of the persons you have interviewed.</li>\n<li>Problem statement and application of theories: Identify one or a set of potential problems in communication between people from the cultural group under study and people from your own cultural group; analyse the problem(s) and provide specific possible solutions by drawing on theories and concepts learned in the course and the relevant literature you have searched.</li>\n<li>Reflection: Reflect on your experience of interacting with people from a different cultural group, and discuss what you have learned from this intercultural communication experience.</li>\n<li>References list: All references cited within the report should be included in the references list. APA 7th edition referencing style is required. The UQ Library website has APA 7th edition referencing style guide.</li>\n</ol>\n<p>Note:</p>\n<ol>\n<li>This assessment should be submitted via Turnitin. Submission as email attachment will NOT be accepted.</li>\n<li>The word limit (1500) for this assessment is suggestive. No penalties will apply based on the sole reason that your assessment is over/under the word limit.</li>\n<li>You are not required to include pictures. However, if you do, please limit your pictures to maximum 2. You might experience problems submitting your assessment via Turnitin if your file size is too large.</li>\n<li>Your assessment is marked according to the marking criteria in this course, NOT assessed with reference to the achievement of other students or your performance in other courses.</li>\n</ol>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via TurnItIn on Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Intercultural Training Program",
            "special_indicators": [],
            "weighting": "<dd>40% 1500 words </dd>",
            "due_date": "<dd><p> 9/06/2025 4:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This final assessment (Intercultural Training Program) requires you to apply and transmit knowledge and skills learned in the course to specialist and non-specialist audiences. It also assesses your ability to engage sensitively and confidently with individuals, groups, communities, and organisations in local, national and international communication environments. You are required to design an intercultural training program for a target group of trainees (e.g., public relation professionals; government officials; communication specialists; community workers; managers, etc.). The program aims to equip your trainees with intercultural competence to communicate appropriately and effectively with people from diverse cultures or with people from a specific culture other than their own. You will be required to search for relevant literature in addition to the readings provided in the course to inform your design of the intercultural training program. This final assessment task requires the application of cultural sensitivity, originality, and, where appropriate, the use of communication technologies. </p>\n<p>Your intercultural training program should include the following sections:</p>\n<ol>\n<li>Title of the training program: Give your training agency a name.</li>\n<li>Length of the training program: It should be at least a 5 full-day training program.</li>\n<li>Target trainees: Describe your trainees, the expected number of trainees in your program, their cultural backgrounds, and their needs for intercultural training.</li>\n<li>Learning objectives and resources: Describe the topics, theories related to the topics, activities, and learning materials you plan to provide to trainees on each day of your training program. You can use the relevant literature you have searched and course readings to inform your design of the training program and to justify the rationale for the program design.</li>\n<li>Training methods: Specify training methods (e.g., workshops, seminars, experiments, etc.) and explain the rationale for your choice of the training methods in terms of size of your training group and their characteristics.</li>\n<li>Sequencing of the program: Explain the sequence in which you order your topics and activities, and provide your rationale for the sequencing.</li>\n<li>Ethical issues: Describe any ethical issues you may need to consider in delivering your training program.</li>\n<li>Evaluation: Describe how you plan to evaluate the outcomes of your training program.</li>\n<li>References list: References cited within the text should be listed at the end. APA 7th edition referencing style is required. The UQ Library website has guides for different standard referencing styles. Be consistent in following one referencing style.</li>\n</ol>\n<p>Note:</p>\n<ol>\n<li>This assessment should be submitted via Turnitin. Submission as email attachment will NOT be accepted.</li>\n<li>The word limit (1500 words) is suggestive. No penalties will apply based on the sole reason that your assessment goes over/under the word limit.</li>\n<li>Your assessment is marked according to the marking criteria in this course, NOT assessed with reference to the achievement of other students or your performance in other courses.</li>\n</ol>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via TurnItIn on Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1 Lecture: Introduction to the Course</strong><br/><p>This first lecture provides an overview of the course structure, learning activities, assessments, requirements, and other course related information.</p></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Week 1 Lecture: Introduction to the Course</strong>",
            "topic_description": "Week 1 Lecture: Introduction to the Course This first lecture provides an overview of the course structure, learning activities, assessments, requirements, and other course related information.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1: NO TUTORIAL</strong><br/><p>Tutorials commence in Week 2.</p></p></div></td>",
            "topic_title": "<strong>Week 1: NO TUTORIAL</strong>",
            "topic_description": "Week 1: NO TUTORIAL Tutorials commence in Week 2.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2 Lecture: Dynamics of Culture</strong><br/><p>This lecture identifies characteristics of culture and discusses how culture influences our thinking, doing and being.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 2 Lecture: Dynamics of Culture</strong>",
            "topic_description": "Week 2 Lecture: Dynamics of Culture This lecture identifies characteristics of culture and discusses how culture influences our thinking, doing and being.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2 Tutorial: Culture and People</strong><br/><p>This tutorial discusses applications of theories and concepts of culture.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 2 Tutorial: Culture and People</strong>",
            "topic_description": "Week 2 Tutorial: Culture and People This tutorial discusses applications of theories and concepts of culture.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3 Lecture: Communication and Culture</strong><br/><p>This lecture explores models of communication and various ways in which communication reflects culture.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Week 3 Lecture: Communication and Culture</strong>",
            "topic_description": "Week 3 Lecture: Communication and Culture This lecture explores models of communication and various ways in which communication reflects culture.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3 Tutorial: Communicating Culture</strong><br/><p>This tutorial discusses ways in which communication and culture mutually influence each other.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Week 3 Tutorial: Communicating Culture</strong>",
            "topic_description": "Week 3 Tutorial: Communicating Culture This tutorial discusses ways in which communication and culture mutually influence each other.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4 Lecture: Social Categorisation and Perception</strong><br/><p>This lecture explores theories and processes of social categorisation and perception.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Week 4 Lecture: Social Categorisation and Perception</strong>",
            "topic_description": "Week 4 Lecture: Social Categorisation and Perception This lecture explores theories and processes of social categorisation and perception.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4 Tutorial: Perception and Culture</strong><br/><p>This tutorial discusses the influence of culture on how we see ourselves and others.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Week 4 Tutorial: Perception and Culture</strong>",
            "topic_description": "Week 4 Tutorial: Perception and Culture This tutorial discusses the influence of culture on how we see ourselves and others.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5 Lecture: Building Human Relationships</strong><br/><p>This lecture examines theories of human relationships and the development of intercultural relationships.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Week 5 Lecture: Building Human Relationships</strong>",
            "topic_description": "Week 5 Lecture: Building Human Relationships This lecture examines theories of human relationships and the development of intercultural relationships.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5 Tutorial: Intergroup and Intercultural Relations</strong><br/><p>This tutorial analyses cultural influences on human relationship development.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Week 5 Tutorial: Intergroup and Intercultural Relations</strong>",
            "topic_description": "Week 5 Tutorial: Intergroup and Intercultural Relations This tutorial analyses cultural influences on human relationship development.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6 Lecture: Media and Cultural Change</strong><br/><p>This lecture explores ways in which various types of media bring about change to society and culture.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Week 6 Lecture: Media and Cultural Change</strong>",
            "topic_description": "Week 6 Lecture: Media and Cultural Change This lecture explores ways in which various types of media bring about change to society and culture.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6 Tutorial: Media, Technology and Culture</strong><br/><p>This tutorial focuses on analysing media's influence on culture and intercultural relationships.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Week 6 Tutorial: Media, Technology and Culture</strong>",
            "topic_description": "Week 6 Tutorial: Media, Technology and Culture This tutorial focuses on analysing media's influence on culture and intercultural relationships.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7 Lecture: Immigration and Acculturation</strong><br/><p>This lecture discusses immigration and the dynamics of acculturation.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 7 Lecture: Immigration and Acculturation</strong>",
            "topic_description": "Week 7 Lecture: Immigration and Acculturation This lecture discusses immigration and the dynamics of acculturation.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7 Tutorial: Integration and Identity Negotiation</strong><br/><p>This tutorial applies theories of acculturation to analyse cross-cultural adaptation experiences of immigrants and refugees.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 7 Tutorial: Integration and Identity Negotiation</strong>",
            "topic_description": "Week 7 Tutorial: Integration and Identity Negotiation This tutorial applies theories of acculturation to analyse cross-cultural adaptation experiences of immigrants and refugees.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8 Lecture: Diversity in Workplaces</strong><br/><p>This lecture discusses how orientations to cultural dimensions influence behaviours in workplaces.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 8 Lecture: Diversity in Workplaces</strong>",
            "topic_description": "Week 8 Lecture: Diversity in Workplaces This lecture discusses how orientations to cultural dimensions influence behaviours in workplaces.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8 Tutorial: Business and Culture</strong><br/><p>This tutorial applies theories of cultural dimensions to analyse the influence of culture on attitudes and behaviours in workplaces.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 8 Tutorial: Business and Culture</strong>",
            "topic_description": "Week 8 Tutorial: Business and Culture This tutorial applies theories of cultural dimensions to analyse the influence of culture on attitudes and behaviours in workplaces.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-Semester Break</strong><br/><p>No lecture and no tutorials this week. Have a great mid-semester break!</p></p></div></td>",
            "topic_title": "<strong>Mid-Semester Break</strong>",
            "topic_description": "Mid-Semester Break No lecture and no tutorials this week. Have a great mid-semester break!",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9 Lecture: Working in Culturally Diverse Communities</strong><br/><p>This lecture explores challenges and benefits of working in diverse communities.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 9 Lecture: Working in Culturally Diverse Communities</strong>",
            "topic_description": "Week 9 Lecture: Working in Culturally Diverse Communities This lecture explores challenges and benefits of working in diverse communities.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9 Tutorial: Culture and Behaviour</strong><br/><p>This tutorial discusses culturally responsive communication strategies when engaging with culturally diverse communities.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 9 Tutorial: Culture and Behaviour</strong>",
            "topic_description": "Week 9 Tutorial: Culture and Behaviour This tutorial discusses culturally responsive communication strategies when engaging with culturally diverse communities.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10: NO LECTURE</strong><br/><p>This week is self-directed learning. No lecture. Monday 5 May is Labour Day Public Holiday.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 10: NO LECTURE</strong>",
            "topic_description": "Week 10: NO LECTURE This week is self-directed learning. No lecture. Monday 5 May is Labour Day Public Holiday.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10: NO TUTORIAL</strong><br/><p>This week is self-directed learning. No tutorials. </p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 10: NO TUTORIAL</strong>",
            "topic_description": "Week 10: NO TUTORIAL This week is self-directed learning. No tutorials.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11 Lecture: Intercultural Communication in Families</strong><br/><p>This lecture lecture discusses intercultural and intergenerational communication in family contexts.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 11 Lecture: Intercultural Communication in Families</strong>",
            "topic_description": "Week 11 Lecture: Intercultural Communication in Families This lecture lecture discusses intercultural and intergenerational communication in family contexts.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11 Tutorial: Intercultural Families</strong><br/><p>This tutorial analyses communication in intercultural and interracial families.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 11 Tutorial: Intercultural Families</strong>",
            "topic_description": "Week 11 Tutorial: Intercultural Families This tutorial analyses communication in intercultural and interracial families.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12 Lecture: Intercultural Competence Training</strong><br/><p>This lecture discusses how to design training programs to build intercultural competence in people working and living in diverse cultural contexts.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 12 Lecture: Intercultural Competence Training</strong>",
            "topic_description": "Week 12 Lecture: Intercultural Competence Training This lecture discusses how to design training programs to build intercultural competence in people working and living in diverse cultural contexts.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12 Tutorial: Questions and Answers</strong><br/><p>This final tutorial is a drop-in session for questions and answers about Assessment 3.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 12 Tutorial: Questions and Answers</strong>",
            "topic_description": "Week 12 Tutorial: Questions and Answers This final tutorial is a drop-in session for questions and answers about Assessment 3.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13: NO LECTURE</strong><br/><p>This week is self-directed learning. No lecture this week. You may use this time to work on your Assessment 3.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 13: NO LECTURE</strong>",
            "topic_description": "Week 13: NO LECTURE This week is self-directed learning. No lecture this week. You may use this time to work on your Assessment 3.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13: NO TUTORIAL</strong><br/><p>This week is self-directed learning. No tutorials. You may use this time to work on your Assessment 3.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 13: NO TUTORIAL</strong>",
            "topic_description": "Week 13: NO TUTORIAL This week is self-directed learning. No tutorials. You may use this time to work on your Assessment 3.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}