{
    "course_title": "Theories of Counselling",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/COUN7002-21431-7520",
    "full_course_code": "COUN7002-21431-7520",
    "course_code": "COUN7002",
    "class_code": "21431",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Discuss the role of theory in counselling practice"
        },
        {
            "number": "LO2.",
            "description": "Differentiate between modern, postmodern, and integrative theories"
        },
        {
            "number": "LO3.",
            "description": "Research the evidence supporting particular theoretical approaches"
        },
        {
            "number": "LO4.",
            "description": "Identify the significance each theory places on: affect; cognition; behaviour; relationships"
        },
        {
            "number": "LO5.",
            "description": "Outline the historical development of talk therapy from Psychoanalysis to Integrative approaches"
        },
        {
            "number": "LO6.",
            "description": "Apply the principles of each theory to your own life and experience"
        },
        {
            "number": "LO7.",
            "description": "Use theory as a framework and blueprint for your practice"
        },
        {
            "number": "LO8.",
            "description": "Critically analyse the strengths and limitations of each theory studied"
        },
        {
            "number": "LO9.",
            "description": "To synthesize and integrate theories into their own practice"
        },
        {
            "number": "LO10.",
            "description": "Critically review their own practice in the light of theory"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Online Multiple Choice Quiz",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30% Completion of four online learning modules through associated quizzes </dd>",
            "due_date": "<dd><p> 19/03/2025 - 14/05/2025</p>\n<p>\n</p><p>Quizzes to be completed throughout semester. See Task Description and Blackboard for specific due dates for each module.</p></dd>",
            "learning_objectives": "L01, L02, L04, L05",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Students are required to complete four online modules during this course. </strong>The modules relate to core concepts of the major theories of counselling and psychotherapy that you study within this course.</p>\n<p>The quizzes related to the COUN7002 Study Modules can be accessed through a link in the Assessment folder in the COUN7002 Blackboard site. Once students commence the quiz, they will have <strong>four (4) minutes to complete the five (5) questions</strong>. Each question will be worth five marks, meaning that each of the four quizzes will have a total of 25 possible marks. The questions are randomly drawn from a pool of comparable questions relating to the module’s topics. For each quiz, students will be able to prepare through a revision guide and a practise quiz relating to the module, which will be available in the Assessment Section of the Blackboard site for this course.</p>\n<p>Timely completion of each unit is required to keep up with the next stage of the course, and consequently need to be completed by a particular date in order to stay current with the course material. The specific dates are as follows: </p>\n<ul>\n<li>Quiz 1 - Module 1: Psychodynamic &amp; Gestalt Theory - due 1pm, Wednesday 26 March</li>\n<li>Quiz 2 - Module 2: CBT &amp; Solution-Focused Theory - due 1pm, Wednesday 9 April</li>\n<li>Quiz 3 - Module 3: Person-Centred &amp; Feminist Theory - due 1pm, Wednesday 30 April</li>\n<li>Quiz 4 - Module 4: Existential &amp; Narrative Theory - due 1pm, Wednesday 14 May</li>\n</ul>\n<p>The overall result in the quizzes will be worth 30% of the total grade.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The quizzes are completed online via the 'Assessment' section in the Blackboard site for this course.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Position Paper: The Science & Art of Two Theories",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                }
            ],
            "weighting": "<dd>60% 3000 words </dd>",
            "due_date": "<dd><p> 26/05/2025 1:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L07, L08, L09",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>General Task Description</strong></p>\n<p><em>Task</em>: Written Essay.</p>\n<p><em>Word limit</em>: 3000 words</p>\n<p><em>Penalty for word count outside the word limit</em>: + or - 10% (in text references will count toward your word count but your reference list will not). As per the School Assessment Policy - A word count that is within ±10% of the set length (word limit) is acceptable. A word count that is outside these will be penalised in the ‘Academic Writing’ criterion.</p>\n<p><em>Font</em>: Minimum 11 point Font. Arial or Times Romans or Calibri</p>\n<p><em>Line spacing</em>: Double Line Spacing</p>\n<p><em>Style and Reference System</em>: APA 7</p>\n<p><em>Contents of header and/or footer</em>: Student Name, Student Number and COUN7002</p>\n<p><em>Format of file for submission to Turnitin</em>: Word or PDF</p>\n<p><em>Use of emerging technology</em>. This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies in their background research, successful completion of this assessment will require students to critically engage in specific contexts and tasks, such as reading academic literature, critically synthesising a personal position, and demonstrating academic/professional writing skills. These are tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed research, comprehension and composition of their written submission independent of AI and MT tools. An unauthorised and/or unacknowledged use generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p><br/></p>\n<p><strong>Detailed Task Description</strong></p>\n<p><strong>Background/Brief</strong></p>\n<p>You are part of a counselling service that is receiving increased referrals about a particular issue (defined below). In order to guide practitioners in working with that issue, the director has tasked you with researching <em>how two different theoretical approaches conceptualise and work with this issue</em>.</p>\n<p>As a result of your research, you are to write a position paper. The director has made it clear that they want this paper to thoroughly address both the science and the art of each theory, and to make recommendations for practice. It is expected that submissions are of a high academic quality, i.e. your position must be supported by logical reasoning, coherent arguments, and with claims are backed up by literature (both theoretical and empirical).</p>\n<p><strong>Task</strong></p>\n<p>As a basis for the position paper:</p>\n<ul>\n<li>Choose <em>one</em> of the following issues: (1) Depression; (2) Anxiety; (3) Grief and loss; (4) Addiction; (5) Low self-esteem.</li>\n<li>Choose any <em>two</em> theories you have studied in this course.</li>\n</ul>\n<p>The position paper must include the following:</p>\n<ol>\n<li>A brief introduction to the importance of both science and art in counselling. What are the limitations of seeing counselling as only art or only science? What is to be gained by seeing it as both?</li>\n<li>A section on <em>each</em> theory covering: (a) An overview of the theory introducing its essential ideas; (b) An outline of how the theory conceptualises the issue from its theoretical standpoint (c) A summary of the evidence for its approach; and (d) The theory’s approach to the art of practice in therapy with this issue.</li>\n<li>Drawing on the material outlined in the previous sections, a concluding section which includes: (a) A critical comparison of the two theories’ strengths and limitations, and (b) Recommendations for practitioners on how to conceptualise and practice therapy relating to this issue. </li>\n</ol>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>All courses require students to submit an electronic version of their assignment via Blackboard. Please check the companion website assessment area for specific instructions on this process. A link will be made available in the assessment area of your Blackboard course to allow you to submit your assignment electronically.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Oral Exam: Case Conceptualisation Competency",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                }
            ],
            "weighting": "<dd>10% Hurdle requirement </dd>",
            "due_date": "<dd><p> 16/06/2025 - 18/06/2025</p></dd>",
            "learning_objectives": "L05, L06, L07, L08, L09, L10",
            "mode": "Oral",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The most practical application of counselling theory for the practice of counselling is through ‘case formulation’: a coherent set of hypotheses about the causes of the client’s issues and the possible solutions. Students will be taught the practicalities of developing a case formulation in the last two workshops of the course, in preparation for this exam.</p>\n<p>The oral exams will be scheduled in the second week of the university exam period (16-18 June 2025). Further details on time and venue will be confirmed before the end of semester.</p>\n<p><em>Task </em></p>\n<p>This task requires students to analyse a pre-recorded 10-minute section of their own counselling work (i.e. a counselling session with a client). (Students who are completing or have completed COUN7001 may also use their COUN7001 recording for this task. Please be sure to gain client consent through the attached form.)</p>\n<p><em>Preparation</em></p>\n<p>In preparation for the exam, students are to prepare a one-page summary of their formulation, according to the process outlined in the workshops and written guide. They are to submit this one-page formulation as well as their client consent form to Blackboard before the commencement of the first oral exam.</p>\n<p><em>Exam</em></p>\n<p>The exam will last no more than 30 minutes and will follow the following elements:</p>\n<ol>\n<li>Watch the 10min recording of the counselling session with the examiner/s</li>\n<li>Student to present a summary of their formulation of the client from the perspective of theory. This brief summary will be approximately 3 minutes and students are to emphasise their working hypotheses and plans for the client. (Students are also required to submit a ONE-PAGE written summary of this formulation which will provide more details.) </li>\n<li>Student to respond to questions to elaborate their formulation and consider alternative hypotheses</li>\n<li>Student to reflect upon their own counselling practice in light of theory, highlighting theories that may be informing personal approach.</li>\n</ol>\n<p>N.B. All oral exams will be recorded. </p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students are to submit their one-page formulation as well as their client consent form to Blackboard before the commencement of the first oral exam.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": null,
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction to Theory</strong><br><p>There's nothing as practical as theory: This workshop introduces students to the aims and requirements of the course, gives an overview of the history of modern psychotherapy, and presents the need for the complexity of counselling theory through discussion of a case demonstration.</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Introduction to Theory</strong>",
            "topic_description": "Introduction to Theory There's nothing as practical as theory: This workshop introduces students to the aims and requirements of the course, gives an overview of the history of modern psychotherapy, and presents the need for the complexity of counselling theory through discussion of a case demonstration.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction to Integrated &amp; Applied Theory</strong><br><p>Where theory fits into the therapeutic process: This workshops provides an introduction to neuro-biological science and existential philosophy as the basis for an integrated theory. Students will be introduced to the Power-Threat-Meaning(-Purpose) framework as a framework for theory and a process for case formulation.</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06, L08</p></div></td>",
            "topic_title": "<strong>Introduction to Integrated &amp; Applied Theory</strong>",
            "topic_description": "Introduction to Integrated & Applied Theory Where theory fits into the therapeutic process: This workshops provides an introduction to neuro-biological science and existential philosophy as the basis for an integrated theory. Students will be introduced to the Power-Threat-Meaning(-Purpose) framework as a framework for theory and a process for case formulation.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L08"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 4 To Week 5(17 Mar - 30 Mar)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Study Module 1: Psychoanalytic &amp; Gestalt Therapy</strong><br><p>Completion of Module 1: Textbook Reading (Chapters 4 &amp; 8); Revision Activity (Blackboard); ASSESSMENT: Online Quiz</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Study Module 1: Psychoanalytic &amp; Gestalt Therapy</strong>",
            "topic_description": "Study Module 1: Psychoanalytic & Gestalt Therapy Completion of Module 1: Textbook Reading (Chapters 4 & 8); Revision Activity (Blackboard); ASSESSMENT: Online Quiz",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The Science of Psychoanalytic &amp; Gestalt Therapy</strong><br><p>Core concepts of Psychoanalytic &amp; Gestalt Therapy. Problem-Based Learning: Power-Threat-Meaning formulation using Psychoanalytic &amp; Gestalt Therapy</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06, L08</p></div></td>",
            "topic_title": "<strong>The Science of Psychoanalytic &amp; Gestalt Therapy</strong>",
            "topic_description": "The Science of Psychoanalytic & Gestalt Therapy Core concepts of Psychoanalytic & Gestalt Therapy. Problem-Based Learning: Power-Threat-Meaning formulation using Psychoanalytic & Gestalt Therapy",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L08"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The Art of Psychoanalytic &amp; Gestalt Therapy</strong><br/><p>Psychoanalytic &amp; Gestalt Therapy methods and interventions. Demonstration of theories in action. Cutting edge theories: Expressive Therapies.</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06, L08, L09, L10</p></div></td>",
            "topic_title": "<strong>The Art of Psychoanalytic &amp; Gestalt Therapy</strong>",
            "topic_description": "The Art of Psychoanalytic & Gestalt Therapy Psychoanalytic & Gestalt Therapy methods and interventions. Demonstration of theories in action. Cutting edge theories: Expressive Therapies.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L08",
                "L09",
                "L10"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 6 To Week 7(31 Mar - 13 Apr)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Study Module 2: CBT &amp; Solution-Focused Therapy</strong><br><p>Completion of Module 2: Textbook Reading (Chapters 9, 10, and 'Solution-Focused' sections of Chapter 13); Revision Activity (Blackboard); ASSESSMENT: Online Quiz</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Study Module 2: CBT &amp; Solution-Focused Therapy</strong>",
            "topic_description": "Study Module 2: CBT & Solution-Focused Therapy Completion of Module 2: Textbook Reading (Chapters 9, 10, and 'Solution-Focused' sections of Chapter 13); Revision Activity (Blackboard); ASSESSMENT: Online Quiz",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The Science of Cognitive-Behavioural &amp; Solution-Focused Therapy</strong><br/><p>Core concepts of CBT and SFT. Problem-Based Learning: Power-Threat-Meaning formulation using CBT &amp; SFT</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06, L08</p></div></td>",
            "topic_title": "<strong>The Science of Cognitive-Behavioural &amp; Solution-Focused Therapy</strong>",
            "topic_description": "The Science of Cognitive-Behavioural & Solution-Focused Therapy Core concepts of CBT and SFT. Problem-Based Learning: Power-Threat-Meaning formulation using CBT & SFT",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L08"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The Art of CBT &amp; Solution-Focused Therapy</strong><br/><p>CBT &amp; SFT methods and interventions. Demonstration of theories in action. Cutting edge theories: Motivational Interviewing</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06, L08, L09, L10</p></div></td>",
            "topic_title": "<strong>The Art of CBT &amp; Solution-Focused Therapy</strong>",
            "topic_description": "The Art of CBT & Solution-Focused Therapy CBT & SFT methods and interventions. Demonstration of theories in action. Cutting edge theories: Motivational Interviewing",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L08",
                "L09",
                "L10"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 8 To Week 9(14 Apr - 04 May)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Study Module 3: Person-Centred &amp; Feminist Therapy</strong><br><p>Completion of Module 3: Textbook Reading (Chapters 7 and 12); Revision Activity (Blackboard); ASSESSMENT: Online Quiz</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Study Module 3: Person-Centred &amp; Feminist Therapy</strong>",
            "topic_description": "Study Module 3: Person-Centred & Feminist Therapy Completion of Module 3: Textbook Reading (Chapters 7 and 12); Revision Activity (Blackboard); ASSESSMENT: Online Quiz",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The Science of Person-Centred &amp; Feminist Therapy</strong><br/><p>Core concepts of Person-Centred and Feminist theories. Problem-Based Learning: Power-Threat-Meaning formulation using Person-Centred and Feminist </p></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06, L08</p></div></td>",
            "topic_title": "<strong>The Science of Person-Centred &amp; Feminist Therapy</strong>",
            "topic_description": "The Science of Person-Centred & Feminist Therapy Core concepts of Person-Centred and Feminist theories. Problem-Based Learning: Power-Threat-Meaning formulation using Person-Centred and Feminist",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L08"
            ]
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The Art of Person-Centred &amp; Feminist Therapy</strong><br/><p>Person-centred and Feminist methods and interventions. Demonstration of theories in action. Cutting Edge Theory: Interpersonal Psychotherapy</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06, L08, L09, L10</p></div></td>",
            "topic_title": "<strong>The Art of Person-Centred &amp; Feminist Therapy</strong>",
            "topic_description": "The Art of Person-Centred & Feminist Therapy Person-centred and Feminist methods and interventions. Demonstration of theories in action. Cutting Edge Theory: Interpersonal Psychotherapy",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L08",
                "L09",
                "L10"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 10 To Week 11(05 May - 18 May)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 4: Existential &amp; Narrative Therapy</strong><br><p>Completion of Module 3: Textbook Reading (Chapters 6 and 'Narrative Therapy' sections of Ch 13); Revision Activity (Blackboard); ASSESSMENT: Online Quiz</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Module 4: Existential &amp; Narrative Therapy</strong>",
            "topic_description": "Module 4: Existential & Narrative Therapy Completion of Module 3: Textbook Reading (Chapters 6 and 'Narrative Therapy' sections of Ch 13); Revision Activity (Blackboard); ASSESSMENT: Online Quiz",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The Science of Existential &amp; Narrative Therapy</strong><br/><p>Core concepts of Existential and Narrative theories. Problem-Based Learning: Power-Threat-Meaning formulation using Existential and Narrative Therapy</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06, L08</p></div></td>",
            "topic_title": "<strong>The Science of Existential &amp; Narrative Therapy</strong>",
            "topic_description": "The Science of Existential & Narrative Therapy Core concepts of Existential and Narrative theories. Problem-Based Learning: Power-Threat-Meaning formulation using Existential and Narrative Therapy",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L08"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The Art of Existential &amp; Narrative Therapy</strong><br/><p>Existential and Narrative therapy methods and interventions. Demonstration of theories in action. Cutting Edge Theory: Acceptance and Commitment Therapy (ACT).</p></p></div></td>",
            "topic_title": "<strong>The Art of Existential &amp; Narrative Therapy</strong>",
            "topic_description": "The Art of Existential & Narrative Therapy Existential and Narrative therapy methods and interventions. Demonstration of theories in action. Cutting Edge Theory: Acceptance and Commitment Therapy (ACT).",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Contrasting &amp; Integrating Theory in Practice</strong><br/><p>The workshop will revise the theories studied so far, with a focus on the 'cutting edge theories'. The process of contrasting and integrating theories in practice will be demonstrated by a live case demonstration.  </p></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L05, L08</p></div></td>",
            "topic_title": "<strong>Contrasting &amp; Integrating Theory in Practice</strong>",
            "topic_description": "Contrasting & Integrating Theory in Practice The workshop will revise the theories studied so far, with a focus on the 'cutting edge theories'. The process of contrasting and integrating theories in practice will be demonstrated by a live case demonstration.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L05",
                "L08"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>From Theory to Practice: Integrated Formulation I</strong><br/><p>This workshop will use a guided demonstration of problem-based learning to teach students an integrated model of case formulation that draws together the insights of the theories that they have learnt. The model directly prepares students for their final assessment item (exam).</p></p><p><strong>Learning outcomes:</strong> L01, L04, L06, L07, L08, L09, L10</p></div></td>",
            "topic_title": "<strong>From Theory to Practice: Integrated Formulation I</strong>",
            "topic_description": "From Theory to Practice: Integrated Formulation I This workshop will use a guided demonstration of problem-based learning to teach students an integrated model of case formulation that draws together the insights of the theories that they have learnt. The model directly prepares students for their final assessment item (exam).",
            "learning_outcomes": [
                "L01",
                "L04",
                "L06",
                "L07",
                "L08",
                "L09",
                "L10"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>From Theory to Practice: Integrated Formulation II</strong><br/><p>This workshop consolidates the case formulation process taught in the previous workshop through developing a working hypothesis from a case example. This exercise will directly prepare students for their final assessment piece (exam).</p>\n<p>We will also summarise the major parts of the course and discuss the ongoing process of integrating theory into a personal style.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L05, L06, L07, L09</p></div></td>",
            "topic_title": "<strong>From Theory to Practice: Integrated Formulation II</strong>",
            "topic_description": "From Theory to Practice: Integrated Formulation II This workshop consolidates the case formulation process taught in the previous workshop through developing a working hypothesis from a case example. This exercise will directly prepare students for their final assessment piece (exam). We will also summarise the major parts of the course and discuss the ongoing process of integrating theory into a personal style.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L05",
                "L06",
                "L07",
                "L09"
            ]
        }
    ]
}