{
    "course_title": "Interpersonal Skills in Counselling 1",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/COUN7001-21430-7520",
    "full_course_code": "COUN7001-21430-7520",
    "course_code": "COUN7001",
    "class_code": "21430",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand the underlying biological, social and intra-personal aspects that influence the use of interpersonal skills in counselling."
        },
        {
            "number": "LO2.",
            "description": "Explore the various forms of interpersonal communication that can exist within a counselling relationship."
        },
        {
            "number": "LO3.",
            "description": "Develop foundational counselling skills that will enhance the effective of the counselling relationship and enable therapeutic action."
        },
        {
            "number": "LO4.",
            "description": "Examine the significance of the therapeutic relationship and its impact on clinical outcomes as evidenced in the literature."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate the establishment of an effective therapeutic counselling encounter."
        },
        {
            "number": "LO6.",
            "description": "Critically reflect on the influence of culture and diversity on the counselling process."
        },
        {
            "number": "LO7.",
            "description": "Appraise the suitability of difference therapy modes of delivery for different contexts."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Journal and Reflections",
            "special_indicators": [],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 17/04/2025 1:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L04, L05, L06, L07, L08",
            "mode": "Written",
            "category": "Notebook/ Logbook",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assignment takes the form of a Personal/Professional Journal that is completed throughout the semester and submitted at the end of week 8.</p>\n<p><strong>The journal will contain two types of material:</strong></p>\n<p>1. Your task is to provide five short reflections from six tutorial sessions. The reflections can be a comment about your thoughts or feelings about the tutorial session or lecture, a new understanding of a professional or personal nature that has occurred during that week, a creative piece of writing or a report of an interaction that impacted on your thinking. The main criterion for inclusion is that what you include in your journal has had significant meaning for you, what you might even call an 'AHA!\" moment. This reflection need be no longer than a half a page to one page in length maximum (double-spaced). It is <strong>not</strong> the length of the reflection that is important but rather the communication of how it has added to your understandings of yourself, other people or psychotherapy. It is not necessary to have references for these reflections.</p>\n<p>2. In the second part of this Personal/Professional Journal your task is to respond to at least one or all of the following articles in terms of what thoughts and challenges they elicit in you. The aim here is for you to engage with the respective author’s ideas and to reflect on them with a view to informing your own practice of psychotherapy. While you might quote from an article to highlight a point, there is no need to provide extensive references to support your ideas.</p>\n<p><br/></p>\n<p>The key focus in both parts of the journal is the depth of reflection especially as it relates to you in your role as a therapist and to the prcoess of therapy.</p>\n<p><br/></p>\n<p>Your response to this second task need be no longer than two A4 pages double spaced.</p>\n<p><strong>Articles</strong></p>\n<p>Erskine, R. (2015). A therapy of contact-in-relationship. In R. G. Erskine (Ed.), <em>Relational Patterns, Therapeutic Presence: Concepts and Practice of Integrative Psychotherapy</em> (pp. 23-42). Routledge.</p>\n<p>Erskine, R. (2015). Attunement and involvement: therapeutic responses to relational needs. In R. G. Erskine (Ed.), <em>Relational Patterns, Therapeutic Presence: Concepts and Practice of Integrative Psychotherapy</em> (pp. 43-55). Routledge.</p>\n<p>Hatcher, R. L. (2021). Responsiveness, the relationship and the working alliance. In J. C. Watson and H. Wiseman (Ed.), <em>The Responsive Psychotherapist: Attuning to Clients in the Moment </em>(pp. 37-58). American Psychological Association.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission is via Turnitin found in the assessment link within Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Submission of Video and Commentary",
            "special_indicators": [],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 2/05/2025 1:00 pm</p></dd>",
            "learning_objectives": "L01, L03, L04, L05, L06, L07, L08",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Essay/ Critique, Practical/ Demonstration",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Task:</strong> Video and Written Essay.</p>\n<p><strong>Recorded Interviews and 2500 Word Commentary</strong></p>\n<p>This assignment is in two parts.</p>\n<p><strong>Part 1:</strong></p>\n<p>During the second half of the semester you will undertake a counselling interview (approximately 15-20 minutes) with a person who is not in in the course and not a close friend or relative. In this interview your aim is to join with the client in hearing their story and demonstrate appropriate counselling skills and approaches you have learnt and developed during the semester. This recording will be submitted as part of the assignment and will be reviewed, and feedback provided by the teaching staff. As well as feedback from staff, you will be required to have two classmates also complete a feedback form on your interview. These forms should be uploaded with the video. The aim here is to provide you with supportive feedback and also to aid you and your classmates in reflecting on the nature of counselling interviews. Each reviewer must sign a confidentiality agreement.</p>\n<p><strong>Part 2:</strong></p>\n<p>Also submitted to Turnitin and accompanying your recorded interview is to be a commentary of <strong>2500 words</strong> in which you are to make comment and reflect on a range of aspects of the interview. Comments you make and suggestions for improvements should show evidence of both reflection and reference to the literature, both theoretical and empirical. It is vital that your essay shows evidence that you not only know superficially what you do as a therapist but also that you know why you do it. Showing a strong theory-practice-research link will be vital to performing well in this essay.</p>\n<p><br/></p>\n<p>Your commentary should show reflection on the application on the skills and processes undertaken during the session with strong links to the existing literature concerning therapy. To guide your thinking, you may wish to consider issues such as those posed in the questions that follow. However, the structure of your commentary should not constitute a set of short answers to these questions. The essay should be a coherent, connected, well-researched and well-argued critique.</p>\n<p><br/></p>\n<p>The questions below are simply to stimulate your thinking. In other words, in writing your commentary you need to produce an integrated piece of academic writing. The essay should be written in the third person using the terms 'counsellor' or 'therapist' and ''client' not in the first person using 'I' and 'we'.</p>\n<p><em>1. How well did you facilitate the client’s telling of their story/problem? What evidence do you have to support this claim?</em></p>\n<p><em>2. What interpersonal skills were displayed in the interviews?</em></p>\n<p><em>3. What interpersonal skills did you struggle to apply? </em></p>\n<p><em>4. In terms of the process of therapy and theoretical frameworks, in what ways were you more organized in your thinking than in class practice sessions? How was this seen in the interview? Have you changed in any way in your thinking during the semester in your approach? If so, how was this seen in the interview?</em></p>\n<p><em>5. Did you notice any differences in your ability to ‘pick up on’ and respond to the emotional messages that were offered by the client during the interview compared to practice sessions earlier in the semester?</em></p>\n<p><em>6. If there were to be subsequent interviews with this subject, what areas would you anticipate you would need to explore, work on, or refer on?</em></p>\n<p><em>7. What theories did you notice you defaulted to when seeking to conceptualise the case? On further reflection, would there be other theories you would incorporate into your conceptualisation of the case? Why?</em></p>\n<p><em>8. What reactions or responses did you notice in yourself during the interview?</em></p>\n<p><em>Etc.</em></p>\n<p><strong>Confidentiality of the Recorded Interviews and Informed Consent</strong></p>\n<p>It is vital that the confidentiality of the 'client' of your interview is maintained throughout the process of completing Assignment 2. The interview is only to be viewed by the interviewee, the student, two other students (with signed confidentiality forms) and the course coordinator /tutor assessing the material.</p>\n<p>The 'client' should complete and sign the <em>Consent Form</em> and the two peer reviewers should complete the <em>Confidentiality Form</em> given as attachments in this Course Profile and which can also to be found on the COUN7001 Blackboard site. The <em>Consent Form</em> must be signed at the time of the interview and submitted with your recording.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Please submit the video via submission link in Blackboard. The written assignment must be submitted via Turnitin via Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Competency Interview",
            "special_indicators": [],
            "weighting": "<dd>25% Pass/Fail (hurdle) </dd>",
            "due_date": "<dd><p> 9/06/2025 - 12/06/2025</p>\n<p>\n</p><p>A schedule for the competency will be posted in Blackboard later in the semester</p></dd>",
            "learning_objectives": "L02, L04, L05, L06, L07, L08",
            "mode": "Activity/ Performance",
            "category": "Practical/ Demonstration",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>A live competency interview is scheduled in the first examination week between 9 June and 12 June 2025. Students will perform a 25-30 minute interview with a client. The interview will focus on the ability to demonstrate effective professional skills, first line assessment (hearing the story and generating hypotheses), development of a supportive therapeutic relationship, active listening, accurate paraphrasing, reflection of feelings and guidance towards outcomes only as appropriate for a first interview.</p>\n<p><br/></p>\n<p><strong>VERY IMPORTANT INFORMATION!!!!</strong></p>\n<p><strong>This interview is a hurdle requirement to pass the course offering a Pass/Fail result. In the event of an initial failure at the first attempt of the Competency interview, the student will be offered remediation and will be allowed to resit the Competency interview on one more occasion. Failure at this second attempt will indicate a failure of this hurdle requirement and hence a failure of this course COUN7001 overall.</strong></p>\n<p><br/></p>\n<p><strong>Results that can be obtained at the time of the Interview:</strong></p>\n<ul>\n<li><strong>Pass without intervention/coaching:</strong> 25%</li>\n<li><strong>Pass with one intervention of coaching:</strong>  20%</li>\n<li><strong>Conditional Pass:</strong> Watch the session with assessor for final coaching: 15%</li>\n<li><strong>Resit of competency interview:</strong> (Maximum 13% associated with second interview). A fail grade on the resit interview means failure of COUN7001. </li>\n</ul>\n<p><br/></p>\n<p><strong>Failure of of a resit interview will render no marks to be offered toward a final result (0%). As the Competency interview is a hurdle requirement, failure will also mean that the student fails the course overall.</strong></p>\n<p><strong>Further details and schedule information will be provided in Blackboard.</strong></p>\n<p>More details of the practical aspects of the interview will be given later in the semester.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction</strong><br><p>The COUN7001 Course</p>\n<p>Expectations of the Programs</p>\n<p>What is Therapy?</p>\n<p>What is 'The Self'</p>\n<p>Art and Science of Therapy</p>\n<p><strong>Reading</strong></p>\n<p>Chapter 1: In <em>The Practice of Counselling and Psychotherapy</em></p>\n<p><strong>Useful References:</strong></p>\n<p>Wampold, B. E. (2015). How important are the common factors in psychotherapy? An update. World Psychiatry,14(3), 270ﾖ277.</p>\n<p>Joyce, A.S., Wolfaardt, U., Sribney, C., &amp; Aylwin, A.S. (2006). Psychotherapy research at the start of the 21st century: the persistence of the art versus science controversy. Canadian Journal of Psychiatry, 51(13), 797-809.</p></br></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Introduction</strong>",
            "topic_description": "Introduction The COUN7001 Course Expectations of the Programs What is Therapy? What is 'The Self' Art and Science of Therapy Reading Chapter 1: In The Practice of Counselling and Psychotherapy Useful References: Wampold, B. E. (2015). How important are the common factors in psychotherapy? An update. World Psychiatry,14(3), 270ﾖ277. Joyce, A.S., Wolfaardt, U., Sribney, C., & Aylwin, A.S. (2006). Psychotherapy research at the start of the 21st century: the persistence of the art versus science controversy. Canadian Journal of Psychiatry, 51(13), 797-809.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Theory and Metatheory</strong><br><p>Integrating Concepts</p>\n<p>Metatheory and Psychotherapy</p>\n<p>Common Mechanisms</p>\n<p>Principles of Change</p>\n<p><strong>Reading</strong></p>\n<p>Chapter 2: In <em>The Practice of Counselling and Psychotherapy</em></p>\n<p><strong>Useful References:</strong></p>\n<p>Carey, T.A. &amp; Pilgrim, D. (2010). Diagnosis and formulation: what should we tell the students? <em>Clinical Psychology and Psychotherapy, 17</em>, 447-454.</p>\n<p>Duncan, B. L., &amp; Miller, S. D. (2000). The Client's theory of change: Consulting the client in the integrative process. <em>Journal of Psychotherapy Integration, 10,</em> 159-187.</p>\n<p>Deacon, B.J. (2013). The biomedical model of mental disorder: a critical analysis of its validity, utility, and effects on psychotherapy research. <em>Clinical Psychology Review, 33, </em>846-861.</p>\n<p>O'Hara, D. &amp; O'Hara, E. F. (2020). A metatheoretical framework for the integration In K. Andrews , F. A. Papps , et al (Eds.), <em>Innovations in a changing world</em> (pp. 247-258). Australian College of Applied Psychology.</p></br></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Theory and Metatheory</strong>",
            "topic_description": "Theory and Metatheory Integrating Concepts Metatheory and Psychotherapy Common Mechanisms Principles of Change Reading Chapter 2: In The Practice of Counselling and Psychotherapy Useful References: Carey, T.A. & Pilgrim, D. (2010). Diagnosis and formulation: what should we tell the students? Clinical Psychology and Psychotherapy, 17 , 447-454. Duncan, B. L., & Miller, S. D. (2000). The Client's theory of change: Consulting the client in the integrative process. Journal of Psychotherapy Integration, 10, 159-187. Deacon, B.J. (2013). The biomedical model of mental disorder: a critical analysis of its validity, utility, and effects on psychotherapy research. Clinical Psychology Review, 33, 846-861. O'Hara, D. & O'Hara, E. F. (2020). A metatheoretical framework for the integration In K. Andrews , F. A. Papps , et al (Eds.), Innovations in a changing world (pp. 247-258). Australian College of Applied Psychology.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Neurobiology of Counselling</strong><br><p>Basic Principles of Neurobiology</p>\n<p>Limbic Resonance &amp; Co-regulation</p>\n<p>Left and Right Brain</p>\n<p>Sensing and Perceiving</p>\n<p>Following rather than leading</p>\n<p><strong>Reading</strong></p>\n<p>Chapter 3: In <em>The Practice of Counselling and Psychotherapy</em></p>\n<p><strong>Useful References:</strong></p>\n<p>Dahlitz, M. (2017). <em>The psychotherapist's essential guide to the brain.</em> Dahlitz Media.</p>\n<p>Siegel. D.J. (2019) The mind in psychotherapy: An interpersonal neurobiology framework for understanding and cultivating mental health.<em> Psychology and Psychotherapy, 92</em>(2), 224-237.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Neurobiology of Counselling</strong>",
            "topic_description": "Neurobiology of Counselling Basic Principles of Neurobiology Limbic Resonance & Co-regulation Left and Right Brain Sensing and Perceiving Following rather than leading Reading Chapter 3: In The Practice of Counselling and Psychotherapy Useful References: Dahlitz, M. (2017). The psychotherapist's essential guide to the brain. Dahlitz Media. Siegel. D.J. (2019) The mind in psychotherapy: An interpersonal neurobiology framework for understanding and cultivating mental health. Psychology and Psychotherapy, 92 (2), 224-237.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The Client and the Therapeutic Relationship</strong><br><p>Client factors</p>\n<p>Relationship Factors</p>\n<p>Attending Skills</p>\n<p><strong>Useful References:</strong></p>\n<p>Aafjes-van Doorn, K., Bar-Sella, A., et al, (2021). Within-patient perceptions of alliance and attunement: Associations with progress in psychotherapy. <em>Clinical Psychology and Psychotherapy, 29, </em>1717ﾖ1727.</p>\n<p>Schirmer, J. (2018). The person of the counsellor in the outcome of counselling. <em>Counselling Australia,</em> 34-40.</p>\n<p>Miller, S.D., Hubble, M.A., &amp; Chow, D.L (2018). The question of expertise in psychotherapy. <em>Journal of Expertise, 1</em>(2), 121-129.</p>\n<p>Skovholt, T.M., &amp; Starkey, M.T. (2010). The three legs of the practitioners learning stool: Practice, research/theory and personal life. <em>Contemporary Psychotherapy, 40</em>, 125-130.</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>The Client and the Therapeutic Relationship</strong>",
            "topic_description": "The Client and the Therapeutic Relationship Client factors Relationship Factors Attending Skills Useful References: Aafjes-van Doorn, K., Bar-Sella, A., et al, (2021). Within-patient perceptions of alliance and attunement: Associations with progress in psychotherapy. Clinical Psychology and Psychotherapy, 29, 1717ﾖ1727. Schirmer, J. (2018). The person of the counsellor in the outcome of counselling. Counselling Australia, 34-40. Miller, S.D., Hubble, M.A., & Chow, D.L (2018). The question of expertise in psychotherapy. Journal of Expertise, 1 (2), 121-129. Skovholt, T.M., & Starkey, M.T. (2010). The three legs of the practitioners learning stool: Practice, research/theory and personal life. Contemporary Psychotherapy, 40 , 125-130.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The First Few Minutes: Welcoming the Other</strong><br><p>Confidentiality</p>\n<p>Structured First Session</p>\n<p>Intake Interviews/Assessment Interviews</p>\n<p>Measuring Alliance and Progress</p>\n<p><strong>Useful References:</strong></p>\n<p>Swift, J.K., Tompkins, K.A., &amp; Parkin, S.R. (2017). Understanding the client's perspective of helpful and hindering events in psychotherapy sessions: a micro-process approach. <em>Journal of Clinical Psychology, 73,</em> 1543-1555.</p>\n<p>Timulak, L., &amp; Keogh, D. (2017). The clients perspective on (experiences of) psychotherapy: a practice friendly review. <em>Journal of Clinical Psychology, 73, </em>1556-1567.</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>The First Few Minutes: Welcoming the Other</strong>",
            "topic_description": "The First Few Minutes: Welcoming the Other Confidentiality Structured First Session Intake Interviews/Assessment Interviews Measuring Alliance and Progress Useful References: Swift, J.K., Tompkins, K.A., & Parkin, S.R. (2017). Understanding the client's perspective of helpful and hindering events in psychotherapy sessions: a micro-process approach. Journal of Clinical Psychology, 73, 1543-1555. Timulak, L., & Keogh, D. (2017). The clients perspective on (experiences of) psychotherapy: a practice friendly review. Journal of Clinical Psychology, 73, 1556-1567.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Hearing the Story 1</strong><br><p>Basic listening skills</p>\n<p>Minimal encouragers</p>\n<p>Paraphrasing/Reflecting Feelings</p>\n<p>Summarizing</p>\n<p><strong>Reading</strong></p>\n<p>Chapter 4: In <em>The Practice of Counselling and Psychotherapy</em></p>\n<p><strong>Useful References:</strong></p>\n<p>Chapter 3: In <em>Intentional Interviewing and Counseling : Facilitating Client Development in a Multicultural Society</em></p></br></p><p><strong>Learning outcomes:</strong> L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Hearing the Story 1</strong>",
            "topic_description": "Hearing the Story 1 Basic listening skills Minimal encouragers Paraphrasing/Reflecting Feelings Summarizing Reading Chapter 4: In The Practice of Counselling and Psychotherapy Useful References: Chapter 3: In Intentional Interviewing and Counseling : Facilitating Client Development in a Multicultural Society",
            "learning_outcomes": [
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Hearing the Story 2</strong><br><p>Questioning</p>\n<p>Probing</p>\n<p>Focusing</p>\n<p>Immediacy</p>\n<p>Reflection of Meaning</p>\n<p><strong>Reading</strong></p>\n<p>Chapter 5: In <em>The Practice of Counselling and Psychotherapy</em></p>\n<p><strong>Useful Reference:</strong></p>\n<p>Chapters 5 &amp; 6: In <em>Intentional Interviewing and Counseling : Facilitating Client Development in a Multicultural Society</em></p></br></p><p><strong>Learning outcomes:</strong> L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Hearing the Story 2</strong>",
            "topic_description": "Hearing the Story 2 Questioning Probing Focusing Immediacy Reflection of Meaning Reading Chapter 5: In The Practice of Counselling and Psychotherapy Useful Reference: Chapters 5 & 6: In Intentional Interviewing and Counseling : Facilitating Client Development in a Multicultural Society",
            "learning_outcomes": [
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Confronting Times</strong><br><p>Challenging in Therapy</p>\n<p>Empathy</p>\n<p>Ruptures</p>\n<p><strong>Useful References:</strong></p>\n<p>Thwaites, R., &amp; Bennett-Levy, J. (2007). Conceptualizing empathy in Cognitive Behavior Therapy: making the implicit explicit. <em>Behavioural and Cognitive Psychotherapy, 35, </em>591-612.</p>\n<p>Safran, J.D., Muran, J.C., &amp; Eubanlks-Carter, C. (2011). <em>Repairing alliance ruptures. Psychotherapy, 48</em>(1), 80-87.</p>\n<p>Nelson-Jones, R. (2003). Offering challenges and feedback. (pp. 86-92). In <em>Basic Counselling Skills</em>. London: Sage.</p></br></p><p><strong>Learning outcomes:</strong> L01, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Confronting Times</strong>",
            "topic_description": "Confronting Times Challenging in Therapy Empathy Ruptures Useful References: Thwaites, R., & Bennett-Levy, J. (2007). Conceptualizing empathy in Cognitive Behavior Therapy: making the implicit explicit. Behavioural and Cognitive Psychotherapy, 35, 591-612. Safran, J.D., Muran, J.C., & Eubanlks-Carter, C. (2011). Repairing alliance ruptures. Psychotherapy, 48 (1), 80-87. Nelson-Jones, R. (2003). Offering challenges and feedback. (pp. 86-92). In Basic Counselling Skills . London: Sage.",
            "learning_outcomes": [
                "L01",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Finding a Way Forward</strong><br><p>Goal Setting</p>\n<p>Decision Making</p>\n<p>Re-storying</p>\n<p><strong>Reading</strong></p>\n<p>Chapter 7: In <em>The Practice of Counselling and Psychotherapy</em></p>\n<p><strong>Useful References:</strong></p>\n<p>McLeod, J., &amp; Mackrill, T. (2018). Philosophical, conceptual, and ethical perspectives on working with goals in therapy. In M. Cooper &amp; D. Law (Eds.), <em>Working with goals in psychotherapy and counselling.</em> Oxford University Press, pp-15-34.</p></br></p><p><strong>Learning outcomes:</strong> L01, L05, L06</p></div></td>",
            "topic_title": "<strong>Finding a Way Forward</strong>",
            "topic_description": "Finding a Way Forward Goal Setting Decision Making Re-storying Reading Chapter 7: In The Practice of Counselling and Psychotherapy Useful References: McLeod, J., & Mackrill, T. (2018). Philosophical, conceptual, and ethical perspectives on working with goals in therapy. In M. Cooper & D. Law (Eds.), Working with goals in psychotherapy and counselling. Oxford University Press, pp-15-34.",
            "learning_outcomes": [
                "L01",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Playing with Experience</strong><br><p>Interoception</p>\n<p>Metaphors and Symbols</p>\n<p><strong>Reading</strong></p>\n<p>Chapters 1, 2 &amp; 3: <em>The Metaphor of Play</em> (Meares, R)</p>\n<p><strong>Useful Reference:</strong></p>\n<p>Hendricks, T. M (2014). Play as Self-Realization: Toward a General Theory of Play. <em>American Journal of Play, 6</em>(2), 190-213.</p>\n<p>Mathieson, F., Jordan, J., Carter, J.D. &amp; Stubbe, M. (2015)The metaphoric dance: co-construction of metaphor in cognitive behaviour therapy. <em>The Cognitive Behaviour Therapist, 8</em>,(24), 1-12</p>\n<p>Legowski, T., &amp; Brownlee, K. (2001). Working with Metaphor in Narrative Therapy. <em>Journal of Family Psychotherapy, 12</em>(1), 19-28.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Playing with Experience</strong>",
            "topic_description": "Playing with Experience Interoception Metaphors and Symbols Reading Chapters 1, 2 & 3: The Metaphor of Play (Meares, R) Useful Reference: Hendricks, T. M (2014). Play as Self-Realization: Toward a General Theory of Play. American Journal of Play, 6 (2), 190-213. Mathieson, F., Jordan, J., Carter, J.D. & Stubbe, M. (2015)The metaphoric dance: co-construction of metaphor in cognitive behaviour therapy. The Cognitive Behaviour Therapist, 8 ,(24), 1-12 Legowski, T., & Brownlee, K. (2001). Working with Metaphor in Narrative Therapy. Journal of Family Psychotherapy, 12 (1), 19-28.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Reviewing and Planning</strong><br/><p>Reviewing goals and planning for action</p>\n<p>Readiness and commitment</p>\n<p>Checking direction</p>\n<p>Considering action</p>\n<p><strong>Useful References:</strong></p>\n<p>Law. D. Goal oriented practice, (2018). In M. Cooper &amp; D. Law (Eds.), <em>Working with goals in psychotherapy and counselling</em>. Oxford University Press, pp-161-180.</p>\n<p>McLeod, J (2013). <em>An introduction to counselling</em>. McGraw Hill, (pp. 431-470).</p></p><p><strong>Learning outcomes:</strong> L01, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Reviewing and Planning</strong>",
            "topic_description": "Reviewing and Planning Reviewing goals and planning for action Readiness and commitment Checking direction Considering action Useful References: Law. D. Goal oriented practice, (2018). In M. Cooper & D. Law (Eds.), Working with goals in psychotherapy and counselling . Oxford University Press, pp-161-180. McLeod, J (2013). An introduction to counselling . McGraw Hill, (pp. 431-470).",
            "learning_outcomes": [
                "L01",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Writing / Online Skills</strong><br/><p>Online Skills</p>\n<p>Telehealth</p>\n<p><strong>Useful References:</strong></p>\n<p>Stone, C.(2002). Counselling via email: applying therapeutic letter writing skills to new technologies. <em>Journal of the Australian and New Zealand Student Services Association</em>, 19, 61-77.</p>\n<p>Bucci, S., Schwannauer, M., &amp; Berry, N. (2019). The digital revolution and the impact on mental health care. <em>Psychology of Psychotherapy: Research and Practice, </em>92(2), 277-297</p></p><p><strong>Learning outcomes:</strong> L01, L05</p></div></td>",
            "topic_title": "<strong>Writing / Online Skills</strong>",
            "topic_description": "Writing / Online Skills Online Skills Telehealth Useful References: Stone, C.(2002). Counselling via email: applying therapeutic letter writing skills to new technologies. Journal of the Australian and New Zealand Student Services Association , 19, 61-77. Bucci, S., Schwannauer, M., & Berry, N. (2019). The digital revolution and the impact on mental health care. Psychology of Psychotherapy: Research and Practice, 92(2), 277-297",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Group/Multicultural Counselling</strong><br/><p>Group Skills</p>\n<p>Multicultural Counselling</p>\n<p>Indigenous Counselling</p>\n<p>Course Summary</p>\n<p><strong>Useful Reference:</strong></p>\n<p>Masson, R.L., Jacobs, E.E., Harviull, R.L. &amp; Schimmel, C.J. (2012). <em>Techniques and Leadership Skills in Group Counselling</em>. Cengage</p>\n<p>Nathan, P. (2019). Creating a safe supportive environment (CASSE): A psychodynamically informed community intervention for Aboriginal communities in Central Australia. In <em>Contemporary Psychodynamic Psychotherapy: Evolving Clinical Practice</em> pp. 361ﾖ372.</p>\n<p>Ypinazar, V.A., Margolis, S.A., et al (2007). Indigenous Australians' understandings regarding mental health and disorders. <em>Australian and New Zealand Journal of Psychiatry, 41</em>(6), 467-478.</p></p><p><strong>Learning outcomes:</strong> L01, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Group/Multicultural Counselling</strong>",
            "topic_description": "Group/Multicultural Counselling Group Skills Multicultural Counselling Indigenous Counselling Course Summary Useful Reference: Masson, R.L., Jacobs, E.E., Harviull, R.L. & Schimmel, C.J. (2012). Techniques and Leadership Skills in Group Counselling . Cengage Nathan, P. (2019). Creating a safe supportive environment (CASSE): A psychodynamically informed community intervention for Aboriginal communities in Central Australia. In Contemporary Psychodynamic Psychotherapy: Evolving Clinical Practice pp. 361ﾖ372. Ypinazar, V.A., Margolis, S.A., et al (2007). Indigenous Australians' understandings regarding mental health and disorders. Australian and New Zealand Journal of Psychiatry, 41 (6), 467-478.",
            "learning_outcomes": [
                "L01",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        }
    ]
}