{
    "course_title": "Design Computing Studio 3 - Proposal",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/DECO3800-21283-7520",
    "full_course_code": "DECO3800-21283-7520",
    "course_code": "DECO3800",
    "class_code": "21283",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Synthesise a significant digital solution to an identified problem in the world, overcoming challenges associated with implementing new designs and technologies leading to a clearly documented design proposal."
        },
        {
            "number": "LO2.",
            "description": "Apply and consolidate previous experience and skills in human-centred design and software development to develop representations of the design concept at different levels of fidelity in order to better communicate with stakeholders and to clarify and inform project requirements."
        },
        {
            "number": "LO3.",
            "description": "Apply sound project management methods and techniques to improve the outcomes of software design projects, where the relative merits of the methods are critiqued and adapted for the project context, making use of relevant tools for strategic planning and scheduling where appropriate"
        },
        {
            "number": "LO4.",
            "description": "Communicate effectively with stakeholders to gather requirements and understand the problem context, and to manage expectations over the course of a project."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate an ability to work successfully in a multi-disciplinary team, and reflectively apply methods and techniques for effective collaborative teamwork, including digital tools and platforms, resolving conflicts where they arise."
        },
        {
            "number": "LO6.",
            "description": "Examine and question ethical and professional issues associated with technology projects or products, and apply ethical thinking to your own work."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Design Journal",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> 2 (Individual) </dd>",
            "due_date": "<dd><p>Regular updates to your Design Journal are required throughout the semester in order to pass this assessment item Week 1 Thu - Week 13 Fri</p>\n<p>\n</p><p>To pass this assessment, students must regularly post updates to their Design Journal throughout the semester. You should aim for at least one entry per week throughout the semester, but multiple entries are encouraged. You must also ensure you have posted a project inspiration to your journal by the end of week 4.</p>\n<p>If students do not post for more than one week, a member of the teaching team will follow-up with the student during studio to discuss progress. If there are extenuating circumstances which prevent a student from updating their journal, they should inform the teaching team via the course mailbox. Note: Students will not be penalised for missing an entry in week 2 or 3 due to Cyclone Alfred interruptions</p>\n<p>The weekly deadline when checks will be made for regular posts is 3pm on the Wednesday (day before Studio).</p>\n<p>The final deadline for updates to the Design Journal is the end of Friday of week 13 (allowing for post-exhibit reflections)</p></dd>",
            "learning_objectives": "L01, L02, L03, L06",
            "mode": "Written",
            "category": "Notebook/ Logbook",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Keeping a journal or logbook of your work is an important aspect of good design and research practice. The ability to critically reflect on your work requires you to document it as you go, so that you are reflecting on the work in-the-moment, rather than only retrospectively many weeks or months later. Journal entries will be viewable only by the student posting them and by members of the teaching team.</p>\n<p><br/></p>\n<p>You will make use of the Class Notebook to do this, which is available in OneNote via Microsoft Teams. Here you will create and maintain a Design Journal in which you keep a record of your work as you make progress through the semester. These journal pages will be reviewed by the teaching team on a regular basis as part of weekly report-back in class to make sure that all students are making regular updates. If you are not updating your page regularly, this will trigger a closer engagement with the teaching team to make sure that you are not putting yourself at risk of failing the associated hurdle. Note: Students will not be penalised for missing an entry in week 2 or 3 due to Cyclone Alfred interruptions</p>\n<p><br/></p>\n<p>To pass the hurdle for the Design Journal, you must ensure you have posted a project inspiration to your journal by the end of week 4. Your inspiration could be anything from an explanation of a problem to investigate solutions for, through to a known problem with a technology which could be redesigned. The purpose of this post is to demonstrate your early engagement with the broad topic of the course and to provide you with a starting point for discussions around project topics with teammates.</p>\n<p><br/></p>\n<p>Machine Translation (MT) may support students in completing this assessment task. Students may appropriately use MT in completing this assessment task. Students must clearly reference any use of MT in each instance. Use of generative Artificial Intelligence (AI) in this task is prohibited. A failure to reference MT use and / or the use of generative AI may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Online submission via OneNote Class Notebook accessible through Microsoft Teams or directly in OneNote. All entries are time-stamped. It is a good idea to enter a new note each time you have an update for the journal rather than editing one single entry for the whole semester. </p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>100% Late Penalty after 1 hour grace period. The one-hour grace period is recorded from the time the submission is due. </p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Project",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> 4 (Team) </dd>",
            "due_date": "<dd><p>Problem Identification (in-class presentation) 27/03/2025 8:00 am</p>\n<p>Problem Identification Documentation 31/03/2025 1:00 pm</p>\n<p>Interim Project Critique (in-class presentation) 1/05/2025 8:00 am</p>\n<p>Interim Project Critique Documentation 6/05/2025 1:00 pm</p>\n<p>Exhibit 29/05/2025 8:00 am</p>\n<p>Final documentation 9/06/2025 1:00 pm</p>\n<p>\n</p><p>Presentations for checkpoints 1 &amp; 2  take place during timetabled Studio sessions, the week before the documentation deadline.</p>\n<p>Exhibit takes place during the timetabled studio session in week 13, with final documentation submission at the beginning of Exam Week 1</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Activity/ Performance, Written",
            "category": "Creative Production/ Exhibition, Presentation, Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The main focus of work in this Studio course is the team-based project where students work together to identify a problem or challenge, investigate and develop an understanding of the problem context and solution space, leading to a documented design that provides sufficient detail to allow a different team of students to complete the design process with the development of a working prototype (note, development of working prototype is the task of student teams in DECO3801/7381).</p>\n<p>Assessment for the project is a sequence of checkpoints that run throughout the semester. The main mode of assessment will be different on each checkpoint, but they will all involve the submission of project documentation which by the end of the semester will form the design/requirements document for the project which is of the form that can be the starting point for a different team to further design and develop into a working prototype.</p>\n<ol>\n<li>Problem Identification</li>\n<li>Interim Critique</li>\n<li>Exhibit and final documentation</li>\n</ol>\n<p>Grading and feedback on checkpoints 1 &amp; 2 will be formative, intended to provide students with an understanding of the quality of their work against the criteria, and to inform and support their subsequent work to refine and improve their project based on the feedback. The overall grade for the project will be considered holistically, examining work across the whole lifetime of the project, but with an emphasis in particular on the endpoint and on the quality of the process followed to get there. </p>\n<p><br/></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Project documents will be submitted via TurnItIn on Blackboard. Presentations and project exhibit will take place during scheduled studio sessions.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p><strong>Project documentation: </strong>100% Late Penalty after 1 hour grace period. The one-hour grace period is recorded from the time the submission is due. </p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Studio Portfolio",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> 4 (Individual) </dd>",
            "due_date": "<dd><p> 11/06/2025 3:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L06",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Creative Production/ Exhibition, Portfolio, Product/ Design, Project, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The main item of individual assessment for Studio 3 - Proposal is your Studio Portfolio. In Studio 3 where we do not have a final examination, this assessment item plays a similar role, where you are required to demonstrate what you have learned across the whole course.</p>\n<p>The main purpose of a portfolio in a design course is for you to gather together examples and evidence of the work that you have done throughout the course. Traditionally, portfolios are collections of work that individuals can share with prospective employers or potential collaborators as examples of the work that they have done. In a course like DECO3800, the work you contribute to your team's outcome will be heavily influenced by your skills and background, as well as by the nature of the project you have worked on. The contents of your portfolio might therefore include design work related to any number of things, including: project inspirations from existing products or services; user research to learn more about the context of use; sketches and schematics relating to data structures; visual designs of interface elements; reports on technology spikes; code snippets to explore functionality, etc.</p>\n<p>A studio portfolio will show off not only what work you have done, but also what you learned as a result of doing it. This reflective component is important so that you can demonstrate deeper learning. Your reflections will feature in this studio portfolio through a combination of how you provide a commentary on the work that you are featuring, along with the inclusion of a reflection section accompanying each topic covered in the portfolio. The reflection will be an opportunity for you to connect the work you have collected for display with what you have learned through working on it.</p>\n<p><br/></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<p><br/></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submissions to the Studio Portflio are via the Studio 3 - Proposal Wiki platform. All entries are logged and time-stamped. Any edits that are later than 3pm on the deadline day (with 1 hour grace period allowed) will be ignored when grading takes place.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>100% Late Penalty after 1 hour grace period The one-hour grace period is recorded from the time the submission is due.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Studio",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Studio</strong><br><p>Students will work in teams with teaching staff on their team projects and on activities related to their projects.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Studio</strong>",
            "topic_description": "Studio Students will work in teams with teaching staff on their team projects and on activities related to their projects.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        }
    ]
}