{
    "course_title": "Design Computing Studio 1 -  Interactive Technology",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/DECO7180-22598-7520",
    "full_course_code": "DECO7180-22598-7520",
    "course_code": "DECO7180",
    "class_code": "22598",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Analyse and propose design computing solutions that aligns with the objectives and constraints of a project scope."
        },
        {
            "number": "LO2.",
            "description": "Understand key course concepts and studio workflow and apply those principles in an iterative development process."
        },
        {
            "number": "LO3.",
            "description": "Apply design and technical skills within a multidisciplinary team to build a minimal viable prototype."
        },
        {
            "number": "LO4.",
            "description": "Apply critical thinking to reflect on and analyse the project’s development and outcomes, evaluating how well they align with user needs and the project brief."
        },
        {
            "number": "LO5.",
            "description": "Understand ethical concerns related to design decisions and apply ethical principles to assess their impact on users, communities, and stakeholders."
        },
        {
            "number": "LO6.",
            "description": "Apply effective team collaboration skills by demonstrating communication, problem-solving, and conflict-resolution strategies to achieve project goals."
        },
        {
            "number": "LO7.",
            "description": "Understand communication and documentation strategies to effectively convey design ideas and track project development."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Exploratory Research Report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd> 1 </dd>",
            "due_date": "<dd><p> 21/03/2025 3:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L04, L07",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Both the design process and effective teamwork require clear goals and objectives. This assessment is designed to help you define your goals. It’s important to note that a goal isn’t always about building something or solving a specific problem. In this assessment, you will explore potential avenues of concern and examine the impact of specific data sets. While your oral presentation and design guide due in Week 9 will focus on what you're building, this report delves into the underlying \"why,\" helping you set clear, purposeful goals for your project.</p>\n<p>This report should outline your intended domain, the challenges and impacts you may face, and the knowledge you need to acquire in order to move forward. Additionally, you will define your design goals and establish what you hope to achieve as a team. This document serves as a starting point, outlining your objectives and providing a clear vision of what the project could become. It is something that you will refer back to during the semester.</p>\n<p><strong>Artificial Intelligence (AI) and Machine Translation (MT)</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission is on BlackBoard.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Initial Pitch Presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> 2 </dd>",
            "due_date": "<dd><p> 10/04/2025 12:00 pm</p></dd>",
            "learning_objectives": "L01, L04, L05, L07",
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>As a designer, one of your primary roles will be to explain and justify comprehensive design solutions to the people who will use or implement them. Strong communication skills are essential for conveying your ideas persuasively, justifying your design choices, and explaining the rationale behind your work. You will also need the ability to articulate your design concepts clearly and succinctly, not only for collaborating with your peers and ensuring internal alignment, but also for presenting your vision to external stakeholders.  </p>\n<p>For this task, you will deliver an oral presentation (with slides) to the class, outlining the design approach you have chosen for your project. The presentation should provide a clear and cohesive overview of your design journey, highlighting not only what you aim to achieve but also the reasoning behind why your approach is the most appropriate. You should describe the envisioned final product, explaining its intended use and how it will meet the needs of your users. Additionally, you should address any potential ethical concerns related to your design. Finally, you will outline the key steps needed to reach a Minimal Viable Prototype by the end of the semester.</p>\n<p><strong>Before Studio in Week 7:</strong></p>\n<ul>\n<li>Submit your slides and script for your presentation.</li>\n</ul>\n<p><strong>In Studio during Week 7:</strong></p>\n<ul>\n<li>Deliver a 5-minute presentation, followed by 10 minutes for Questions and Answers.</li>\n</ul>\n<p><strong>Artificial Intelligence (AI) and Machine Translation (MT)</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Presentation will take place during the scheduled studio session. Slides and Design Guide must be submitted to BlackBoard before the Studio starts. A printed version of your design guide will need to be handed to the Teaching Staff before your presentation begins.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>100% Late Penalty after 1 hour grace period. The one-hour grace period is recorded from the time the submission is due.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Prototype Development Sequence",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> 3 </dd>",
            "due_date": "<dd><p>Team Report is due on BlackBoard 23/05/2025 3:00 pm</p>\n<p>Tradeshow in the scheduled Studio 29/05/2025 12:00 pm</p></dd>",
            "learning_objectives": "L01, L04, L05, L07",
            "mode": "Activity/ Performance, Oral, Product/ Artefact/ Multimedia, Written",
            "category": "Computer Code, Creative Production/ Exhibition, Paper/ Report/ Annotation, Practical/ Demonstration",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The development process is rarely a one-time effort; it requires continuous refinement and adaptation, driven by feedback, testing, and evolving requirements. Through this iterative process, designers have the opportunity to refine their ideas, address challenges more effectively, and ultimately create solutions that better meet the needs of users. One of the core elements of this process is collecting data from prototypes, which helps inform decisions, validate assumptions, and guide the next steps of development. You will need to develop and strengthen interpersonal skills, particularly in time management, project understanding, and inter-team communication and collaboration. Studio 1 provides students with the opportunity to practice these skills while working together to explore a problem space.</p>\n<p>This sequence is broken down into two major deliverables:</p>\n<ol>\n<li>Week 12: Minimal Viable Prototype and Project Handover Document.</li>\n<li>Week 13: Tradeshow.</li>\n</ol>\n<p>This assessment is designed to run through the entire design process and provides an opportunity for students to receive feedback from teaching staff allowing them to make changes based on that feedback. By the end of the semester, your team will have developed a small, functional prototype of your proposed design. While this is still a prototype and does not need to be polished, its primary focus should be on demonstrating the core functionality of what you have created.</p>\n<p><strong>Minimal Viable Prototype and Project Handover Document.</strong></p>\n<p>For this assessment, you will submit your final MVP along with a Handover Document that explains what you built, how you built it, your design decisions, and the goals you aimed to achieve. The prototype serves to showcase the first step in your design process, illustrating how, with more time and refinement, what you could achieve. The submission for this task is divided into three deliverables: </p>\n<ol>\n<li>You will submit your final codebase to BlackBoard by the end of Week 13. </li>\n<li>Along with your code, you will submit a comprehensive report (details below). </li>\n<li>You will demonstrate your Minimal Viable Prototype (MVP) at the tradeshow during Week 13 studio.</li>\n</ol>\n<p>Along with your codebase, you will submit a Project Report that details your design process and final MVP. The report should provide an overview of the project, including the problem space, target users, and how your design fits within the broader domain. It should also outline the roles and responsibilities of each team member, highlighting the contributions made by each individual. The report should include a critical analysis of how well your design approach addressed user needs, reflecting on both the strengths and weaknesses of your solution. Additionally, it should break down the individual components of your MVP, including user flow and experience, along with the rationale behind your design decisions. You should also discuss the ethical concerns related to your project, focusing on how your design may impact its users and the world at large. This includes considering potential unintended consequences, privacy concerns, accessibility, and how your design fits within broader societal contexts. If applicable, you can incorporate individual documentation created by members of team, provided you reference the creator of the media. </p>\n<p><strong>Tradeshow</strong></p>\n<p>In Week 13 studio, you will demonstrate your project to your peers and teaching staff in a tradeshow/exhibit format. Each team will be allocated a brief time slot during the exhibit to showcase and provide a short demonstration of their final prototype. Following the demonstration, there will be a question-and-answer session designed to explore your understanding of your project’s domain, the specific contributions of each team member, and how your project fits within the broader context of the field. It is important that each team member is prepared to answer questions, as everyone must be able to articulate their role, the design decisions made and showcase their understanding of the project as a whole. </p>\n<p><strong>Artificial Intelligence (AI) and Machine Translation (MT)</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p><strong>Team Tradeshow Final Prototype: </strong>100% Late Penalty (no grace period)</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Individual Project Analysis Report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> 4 </dd>",
            "due_date": "<dd><p> 9/06/2025 3:00 pm</p></dd>",
            "learning_objectives": "L01, L04, L05, L07",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Critical reflection is an essential skill for designers, enabling them to objectively evaluate their work and identify what was successful and what areas need improvement. This process supports ongoing personal and professional growth, and to foster deeper understanding of the impact on their users and society in general. </p>\n<p>To help facilitate this reflection, students are required to document their work throughout the semester, starting in Week 6. This documentation will serve as scaffolding, enabling students to reflect on and recall design decisions and key development activities they undertook throughout the semester. It can take various forms, including written notes, photographs, video footage, or audio recordings. You will be able to share this documentation with teaching staff during studio sessions, where feedback and discussion will help you refine your process. </p>\n<p>At the end of semester, you will take this documentation and use it as evidence of the work that you have done throughout the semester in the form of an Individual Reflection Report. This report will highlight the work that you did throughout the semester in relation to your project. This is not a journal of what you did, rather critical analysis of the project through from your point of view. Topics of conversation should include what steps you took, what you built and why, what went right/wrong and the impact on the end result and should always take the bigger picture into account. The report needs to be able to stand on its own, briefly explaining to the reader your concept, your role within the team, the problem space, target user, and potential solution.  </p>\n<p><strong>Artificial Intelligence (AI) and Machine Translation (MT)</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission is on BlackBoard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Studio",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Studios</strong><br><p>Studios introduce both theoretical and practical design content, which students explore and apply first through individual tasks and then in team projects. Support is provided for project work, including assessments, project-based presentations, and exercises. This culminates in the final in-studio tradeshow presentations.</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Studios</strong>",
            "topic_description": "Studios Studios introduce both theoretical and practical design content, which students explore and apply first through individual tasks and then in team projects. Support is provided for project work, including assessments, project-based presentations, and exercises. This culminates in the final in-studio tradeshow presentations.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Practicals</strong><br><p>Practicals offer activities and tasks that help students build on the technical skills learned in other subjects. These sessions are designed to develop technical abilities for the Major Project (Team) and provide support for technical aspects of the project. Practical exercises aim to inform and refine concepts that can be applied to projects.</p></br></p><p><strong>Learning outcomes:</strong> L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Practicals</strong>",
            "topic_description": "Practicals Practicals offer activities and tasks that help students build on the technical skills learned in other subjects. These sessions are designed to develop technical abilities for the Major Project (Team) and provide support for technical aspects of the project. Practical exercises aim to inform and refine concepts that can be applied to projects.",
            "learning_outcomes": [
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        }
    ]
}