{
    "course_title": "Dental Practice V A",
    "study_period": "Sem 1 2025",
    "location": "Herston",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/DENT5100-22122-7520",
    "full_course_code": "DENT5100-22122-7520",
    "course_code": "DENT5100",
    "class_code": "22122",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Professionalism, Communication, Health Promotion - Consistently demonstrate the ability to work cooperatively, safely, ethically and communicate effectively to provide patient centered care using a reflective approach"
        },
        {
            "number": "LO2.",
            "description": "Clinical Information Gathering - Collect and record information that is necessary and relevant for patient care"
        },
        {
            "number": "LO3.",
            "description": "Critical Thinking, Diagnosis & Management Planning - With support identify disease or abnormalities that require treatment or investigation and applies evidence, clinical reasoning and judgement to plan appropriately sequenced oral health care"
        },
        {
            "number": "LO4.",
            "description": "Clinical Treatment & Evaluation - With support apply evidence, clinical reasoning and judgement to manage oral conditions, pathology and medically related disorders and diseases associated with the dentition, mouth and associated structures"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Online Case-based activity (two quizzes)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> P/F MUST PASS </dd>",
            "due_date": "<dd><p> 17/02/2025 - 11/04/2025</p></dd>",
            "learning_objectives": "L01",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>17 - 21 February: Quiz 1 </p>\n<p><br/></p>\n<p>7 - 11 April: Quiz 2</p>\n<p><br/></p>\n<p>Both quizzes will present a clinical case study for review exploring different disciplines on Blackboard. Clinical questions in relation to the clinical case will be presented in each Blackboard quiz.</p>\n<p><br/></p>\n<p>The case will include a description of the clinical presentation and related items such as the examination findings, charts, images, radiographs and findings from diagnostic testing.</p>\n<p><br/></p>\n<p>Different question styles will be used in each quiz such as (but not limited to) single-best answers, extended matching questions and true/false.</p>\n<p><br/></p>\n<p>These two online quizzes are Pass/Fail assessment items. Students who do not pass (one or both of the quizzes), will then have (ONE MORE ATTEMPT OVERALL) to resit an in-class quiz during the workshop week.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Case based Critical Self Reflection",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> P/F MUST PASS </dd>",
            "due_date": "<dd><p> 3/03/2025 - 14/03/2025</p></dd>",
            "learning_objectives": "L01",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Introduction</strong></p>\n<p>A newly qualified dental graduate is expected to develop competency in critical thinking which is described in the Australian Dental Council's 'Professional competencies of the newly qualified dental practitioner' (see https://adc.org.au/files/accreditation/competencies/ADC_Professional_Competencies_of_the_Newly_Qualified_Practitioner.pdf), as “1. Locate, critically appraise and evaluate evidence in a scientific manner to support and deliver oral health care, 2. Apply clinical reasoning and judgement in a reflective practice approach to oral health care, and 3. Demonstrate an understanding of research processes and the role of research in advancing knowledge and clinical practice”. </p>\n<p><br/></p>\n<p><strong>Assessment requirement </strong></p>\n<p>This assessment task will require the students to complete an online reflection on a specific case or task they completed during the placement in the second half of the semester, where they received a grade of expectation not met or where the student themselves perceived a lack of understanding or a gap in knowledge.</p>\n<p><br/></p>\n<p>Students should use the reflection template provided on Blackboard (Assessment folder) to submit a reflection on a case or a task as identified above. The reflection template is based on UQ employability framework SEAL (Situation, Effect, Actions taken and Learning) reflection model. </p>\n<p><br/></p>\n<p>Students must select and reflect on an experience from the first half of the semester. </p>\n<p>There are 4 fields to complete: (250 word limit each)</p>\n<p>1. <strong>Situation</strong>: Describe what happened during your chosen patient interaction. </p>\n<p>2. <strong>Effect</strong>: List or explain the challenges faced and the impact they made on the student. </p>\n<p>3. <strong>Action</strong>: Explain the actions taken or strategies employed to deal with the challenges, and the rationale for taking the actions. </p>\n<p>4.<strong> Learning</strong>: Explain what was learnt from this case or patient interaction. The student must explain what they can now do as a result and what do they need to do to handle a similar situation again in the future? How has the experience added to the ones the student has already had in terms of their professional development? Can they identify particular skills or personal attributes that they drew on in this situation?</p>\n<p><br/></p>\n<p>This is a MUST PASS assessment, and any feedback provided for the first attempt must be used to pass this reflection task in the one resubmission attempt allowed.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Via Blackboard course site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Final Clinical Competence Assessment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> P/F MUST PASS </dd>",
            "due_date": "<dd><p> 3/03/2025 - 30/05/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Notebook/ Logbook",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Assessment requirements:</strong></p>\n<p>Students submit an online version of their clinical portfolio of work, via UQ Blackboard and complete their electronic logbooks for submission in the final on-site week in the semester. This must be completed in all aspects as detailed in the electronic logbook until the date of submission of the portfolio. Please note:</p>\n<ol>\n<li>All details within the electronic daily treatment logbook must be completed with regards to patient information (deidentified) and treatment codes for the appointments.</li>\n<li>Verbal feedback provided must be recorded and signed off by supervisor at the end of the session. </li>\n<li>A short 2-4 line reflection must be recorded in the logbook daily, and a weekly structured reflection must be written around a specific case undertaken during the week, particularly where the supervisor(s) have provided constructive feedback, or a grade of expectations not met was received. </li>\n<li>For students at QH clinics these reports must be signed off as complete by the Principal Dentist: 1) Clinical Records 2) Missing Treatment Items and 3) CCC: Client identified, informed consent, site identified, final team check.</li>\n</ol>\n<p><br/></p>\n<p>The logbook/ portfolio records can be audited randomly by the course coordinator to verify authenticity of assessment and signature of supervisor.</p>\n<p><br/></p>\n<p>Assessment of the FINAL clinical practice performance will be by the clinical supervisory team at each placement facility, in discussion with the course coordinator. This is based on student's performance and the quality of the critical self-reflections following each session/day, during the assessment period from the interim time point to the submission of this assessment task. Additionally, the effort made by the student to take on board the interim report feedback will be considered while this report is being finalised. </p>\n<p><br/></p>\n<p><strong>Assessment objectives</strong></p>\n<p>Four domains will be assessed to an expectations met or not met standard and mapped to the Professional competency requirements for the accreditation body for this program - The Australian Dental Council (https://adc.org.au/files/accreditation/competencies/ADC_Professional_Competencies_of_the_Newly_Qualified_Practitioner.pdf) </p>\n<p>The domains being assessed are: </p>\n<p>1. Social responsibility and professionalism </p>\n<p>2. Communication and leadership</p>\n<p>3. Critical thinking</p>\n<p>4. Health promotion</p>\n<p>5. Scientific and clinical knowledge</p>\n<p>6. Person-centred care</p>\n<p><br/></p>\n<p><strong>Passing requirement</strong></p>\n<p>To pass this assessment, students must achieve a pass on this FINAL report. This is a SUMMATIVE must pass assessment on clinical performance progress at this stage. </p>\n<p>To achieve a pass, the criteria are as follows:</p>\n<ul>\n<li>All domains are weighted equally, and student must achieve a pass in each domain, and an overall pass.</li>\n</ul>\n<p>- A pass in each domain will involve a student receiving 2 or less \"expectations not met\" (ENM) mark in Domain 1, and 1 or less \"expectation not met\" (ENM) in Domains 2-4. </p>\n<p>- An overall pass for the report will involve a student receiving 4 or less \"expectations not met\" (ENM) mark across the 4 domains.</p>\n<p>There will be opportunity for feedback and improvement when the audit report is conducted to students, and students must have reflected on the feedback provided to improve their clinical performance in the latter part of the semester and use it to improve in areas identified as lacking or borderline. Both comments and grades must be taken into account. </p>\n<p><br/></p>\n<p>There is no resubmission or resit available for this componen</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Via Blackboard course site and hardcopy</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Case-based Presentation and Discussion",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> P/F MUST PASS </dd>",
            "due_date": "<dd><p> 2/06/2025 - 6/06/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Assessment requirement</strong></p>\n<p>This task requires students to select a patient from their logbooks in Semester 1, who required or will require treatment from three or more of the following dental disciplines: periodontics, endodontics, oral surgery, restorative dentistry, fixed prosthodontics, removable prosthodontics, oral medicine, oral pathology, and orthodontics.</p>\n<p><br/></p>\n<p>Using a previously provided PowerPoint template on Blackboard, students will describe the histories, any presenting complaint/s, the clinical examination, and diagnostic work up, the care plan including a discussion of rationale and decisions specific to the components and sequencing of the plan and the delivery of care. A discussion of outcomes and prognosis, and a critical reflection on personal learning from the activity should be included. Detailed information on completing the PowerPoint slides will be available on the Blackboard course site at the start of semester. </p>\n<p><br/></p>\n<p><strong>Assessment submission date </strong></p>\n<p>Students <strong>must </strong>submit this via email to the course coordinator in the week prior to the presentation.</p>\n<p>Students will then present the case to a panel of two examiners between <strong>2th and 6th May </strong>on this submitted case.</p>\n<p><br/></p>\n<p><strong>Assessment Method</strong></p>\n<p>The 20-minute oral examination and presentation will assess each student's knowledge, understanding and ability in general dentistry including patient evaluation and examination, selection and interpretation of appropriate diagnostic tests, clinical decision making, care planning and sequencing treatment, rationale for treatment, and other clinical skills including choice of materials and techniques, patient management, ethics, and professionalism. </p>\n<p><br/></p>\n<p>Examiners will pose questions relating to diagnosis, rationale for clinical decisions, procedures and aspects of clinical treatment. </p>\n<p><br/></p>\n<p><strong>Assessment objectives </strong></p>\n<p>The assessment will assess four aspects</p>\n<ol>\n<li>Clinical information Gathering</li>\n<li>Critical thinking, Diagnosis and Management Planning </li>\n<li>Clinical treatment and Evaluation </li>\n<li>Discussion and Reflection </li>\n</ol>\n<p><br/></p>\n<p><strong>Passing requirement </strong></p>\n<p>A pass in this assessment, is achieved by performance at an meets expectations standard for ALL four criteria. Performance which does not meet expectations in any one of the criteria will be deemed a Fail.</p>\n<p><br/></p>\n<p>There is ONE resit option available if a student does not achieve a pass. Students must take into consideration the criteria and comments from the first attempt in resitting this assessment. </p>\n<p><br/></p>\n<p>This is a <strong>Must Pass</strong> assessment for this course. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Via Blackboard course site and on the day of the presentation</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 19(13 Jan - 01 Jun)",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Clinical placement and professional development</strong><br><p>Students will generally undertake four days per week clinical placement (mix of clinical work and assisting hours) for up to 16 weeks with a one-week break during the extended clinical semester. Hours may vary by placement working hours.<br/><br/>Students will record the work they complete in an electronic treatment record book, as well as write structured self reflections on developing professional practice over the semester. The Course Coordinator will carry out periodic audits to evaluate students' performance during the semester. Meetings can be scheduled ad hoc, which presents an opportunity to engage with the course coordinator and other students. Studentﾒs performance, reflective activities and studentﾒs progression will be the focus of these meetings.</p></br></p></div></td>",
            "topic_title": "<strong>Clinical placement and professional development</strong>",
            "topic_description": "Clinical placement and professional development Students will generally undertake four days per week clinical placement (mix of clinical work and assisting hours) for up to 16 weeks with a one-week break during the extended clinical semester. Hours may vary by placement working hours. Students will record the work they complete in an electronic treatment record book, as well as write structured self reflections on developing professional practice over the semester. The Course Coordinator will carry out periodic audits to evaluate students' performance during the semester. Meetings can be scheduled ad hoc, which presents an opportunity to engage with the course coordinator and other students. Studentﾒs performance, reflective activities and studentﾒs progression will be the focus of these meetings.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Workshop(02 Jun - 08 Jun)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Case based Presentation and Discussion</strong><br><p>This activity is based on students developing their self-learning skills, for which the student will be required to select a patient who required or will require treatment from three or more of the following dental disciplines: periodontics, endodontics, oral surgery, restorative dentistry, fixed prosthodontics, removable prosthodontics, oral medicine, oral pathology, and orthodontics.<br/><br/>Using a previously provided PowerPoint template on Blackboard, students will describe the histories, any presenting complaint/s, the clinical examination and diagnostic work up, the care plan including a discussion of rationale and decisions specific to the components and sequencing of the plan and the delivery of care. A discussion of outcomes and prognosis, and a critical reflection on personal learning from the activity should be included.<br/><br/>This learning activity will focus on developing student self-learning skills, problem solving skills, and critical thinking. Students must be able to answer common clinical questions in relation to diagnosis, rationale for clinical decisions, procedures and aspects of clinical treatment.</p></br></p></div></td>",
            "topic_title": "<strong>Case based Presentation and Discussion</strong>",
            "topic_description": "Case based Presentation and Discussion This activity is based on students developing their self-learning skills, for which the student will be required to select a patient who required or will require treatment from three or more of the following dental disciplines: periodontics, endodontics, oral surgery, restorative dentistry, fixed prosthodontics, removable prosthodontics, oral medicine, oral pathology, and orthodontics. Using a previously provided PowerPoint template on Blackboard, students will describe the histories, any presenting complaint/s, the clinical examination and diagnostic work up, the care plan including a discussion of rationale and decisions specific to the components and sequencing of the plan and the delivery of care. A discussion of outcomes and prognosis, and a critical reflection on personal learning from the activity should be included. This learning activity will focus on developing student self-learning skills, problem solving skills, and critical thinking. Students must be able to answer common clinical questions in relation to diagnosis, rationale for clinical decisions, procedures and aspects of clinical treatment.",
            "learning_outcomes": []
        }
    ]
}