{
    "course_title": "Thesis",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/ECON7930-20913-7520",
    "full_course_code": "ECON7930-20913-7520",
    "course_code": "ECON7930",
    "class_code": "20913",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate that you can conduct independent research work."
        },
        {
            "number": "LO2.",
            "description": "Write up your research undertaken at a high academic standard."
        },
        {
            "number": "LO3.",
            "description": "Think critically and make informed judgement."
        },
        {
            "number": "LO4.",
            "description": "Communicate what you do in the written form."
        },
        {
            "number": "LO5.",
            "description": "Achieve a comprehensive and in-depth knowledge in your field."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Thesis Submission",
            "special_indicators": [],
            "weighting": "<dd>100%</dd>",
            "due_date": "<dd><p> 30/05/2025 1:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Thesis",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Artificial Intelligence (AI) provides emerging tools that may support students in completing this assessment task. Students are permitted to use AI appropriately in their work; however, all instances of AI usage must be clearly referenced. Failure to do so may constitute academic misconduct under the Student Code of Conduct.</p>\n<h3>Research Approach</h3>\n<p>Your thesis may be empirical or conceptual. However, bear in mind that conceptual research is often more challenging.</p>\n<p>A strong thesis should exhibit a clear thematic structure. The introduction must clearly outline the research objectives and the techniques employed. It may also be beneficial to include a brief literature review on directly relevant topics. Arguments should be presented systematically in a logical and coherent manner. Each chapter should begin with an explanation of its role within the thesis to guide the reader effectively. The progression of the thesis should be structured to lead as directly as possible to a logical conclusion.</p>\n<p>Assessment will be based not only on the discussion and conclusions but also on the research process, the strength of the argument, and the overall presentation quality.</p>\n<h3>Thesis Structure</h3>\n<p>Every thesis must include the following components in addition to the main research exposition:</p>\n<ol>\n<li><strong>Introduction:</strong> Includes background information, research objectives, significance of the study, research questions and/or hypotheses, and an outline of the thesis structure.</li>\n<li><strong>Theoretical Framework:</strong> Discusses the relevant economic theories underpinning the research. If no established economic theory applies, this section should justify why economic expertise is necessary and relevant.</li>\n<li><strong>Literature Review:</strong> Critically examines recent economic and related literature. This section should be more focused than the broader literature review presented in the Research Methods report.</li>\n<li><strong>Data Analysis (if applicable):</strong> Describes data sources, potential limitations, and the analytical techniques employed.</li>\n<li><strong>Results:</strong> Presents findings from the analysis.</li>\n<li><strong>Discussion and Conclusion:</strong> Analyzes the implications and limitations of the research. The conclusion should not merely summarize previous chapters but should include policy recommendations (if applicable) and suggestions for future research.</li>\n</ol>\n<h3>Language and Writing Standards</h3>\n<p>A high standard of English is expected. You are encouraged to consult academic writing resources. Your advisor can offer guidance but will not correct poor writing. Non-native English speakers should seek proofreading assistance from peers.</p>\n<h3>Draft Submission</h3>\n<p>You should submit a draft to your advisor at least two weeks before the due date to receive feedback. It is advisable to submit individual chapters progressively throughout the semester. Last-minute submissions often result in avoidable errors and may impact grading.</p>\n<h3>Length</h3>\n<p>The thesis should be <strong>20,000 words</strong>, including footnotes but excluding tables, figures, and references.</p>\n<h3>Formatting Guidelines</h3>\n<p><strong>Paper Size:</strong> A4 (297 x 210 mm)</p>\n<ul>\n<li><strong>Font:</strong> Preferably 12-point (minimum 11-point for body text; smaller fonts acceptable in tables/figures)</li>\n<li><strong>Line Spacing:</strong> Double spacing (1.5 spacing is allowed)</li>\n<li><strong>Margins:</strong> Left: 3cm; Right: 2cm; Top and Bottom: 2cm</li>\n<li><strong>Pagination:</strong> Consecutive page numbering</li>\n<li><strong>Submission:</strong> Electronic submission via Turnitin on Blackboard (no hard copies required)</li>\n</ul>\n<h3>Required Thesis Sections</h3>\n<ol>\n<li><strong>Title Page</strong></li>\n</ol>\n<ul>\n<li>The University of Queensland</li>\n<li>Faculty of Business, Economics and Law</li>\n<li>School of Economics</li>\n<li>Thesis title (in full)</li>\n<li>Course name and degree program</li>\n<li>Candidate's name and previous degrees</li>\n</ul>\n<ol>\n<li><strong>Acknowledgements</strong></li>\n<li><strong>Declaration Statement</strong> <em>(Signed copy required)</em></li>\n</ol>\n<ul>\n<li>Confirms originality of work and specifies thesis length</li>\n</ul>\n<ol>\n<li><strong>Abstract</strong> <em>(Max: 200 words)</em></li>\n</ol>\n<ul>\n<li>Outlines the research aims, scope, conclusions, and key terms (up to six)</li>\n</ul>\n<ol>\n<li><strong>Table of Contents</strong></li>\n<li><strong>Lists of Figures, Tables, Illustrations, and Diagrams</strong></li>\n<li><strong>Acronyms and Abbreviations</strong></li>\n<li><strong>Main Thesis Chapters</strong></li>\n<li><strong>References</strong> <em>(Consistent citation style required, Harvard preferred)</em></li>\n<li><strong>Appendices (if applicable)</strong></li>\n</ol>\n<h3>Footnotes, Tables, and Figures</h3>\n<ul>\n<li>Footnotes should be used sparingly and are included in the word count.</li>\n<li>Tables, figures, and references are excluded from the word count.</li>\n<li>Large tables should be placed in an appendix.</li>\n</ul>\n<h3>Referencing and Plagiarism</h3>\n<p>Proper referencing is mandatory. Failure to acknowledge sources may result in penalties. Examiners may recognize unreferenced quotations, which can affect your grade.</p>\n<ul>\n<li>The School of Economics does not mandate a specific citation style, but consistency is required throughout the document.</li>\n<li>The UQ Library provides comprehensive referencing guides.</li>\n<li>Acts of plagiarism are taken seriously. Carefully review <strong>Section 6 of the ECP</strong> regarding plagiarism and academic misconduct.</li>\n</ul>\n<h3>Using Previous Research</h3>\n<p>If your thesis builds upon your <strong>ECON7950 Research Proposal</strong>, you must clearly reference specific sections rather than copying large portions of text. Citation format:</p>\n<p><em>(Your surname, year, p. ?)</em> e.g., <em>(Anthony, 2018, p. 3)</em></p>\n<p><strong>Example reference entry: Anthony, J. (2019). </strong><em>Food security in India: Achievements and challenges.</em> Research proposal submitted for ECON7950 (Research Methods in Economics).</p>\n<p>Ensure compliance with <strong>PPL 3.60.04 – Section 2[e]</strong> regarding recycled work.</p>\n<h3>Submission and Assessment</h3>\n<ul>\n<li>Only electronic submissions via Turnitin on Blackboard are accepted.</li>\n<li>The marking criteria can be accessed via Learn.UQ or mySI-net.</li>\n<li>Late submissions may incur penalties.</li>\n</ul>\n<p><strong>Exercise utmost caution in using both your own and external sources to avoid academic misconduct.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>ONLY an electronic copy must be submitted via the Turnitin link on the course Blackboard site by the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Meeting with Coordinator</strong><br/><p>Discussion regarding requirements of thesis, guidelines for the presentation of thesis, choice of supervisor, milestones due, contact details for assistance. For assistance with the various datasets available at UQ or for an introduction to Endnote, please contact Economics' Librarian Debbie Martin (d.martin@library.uq.edu.au).</p></p></div></td>",
            "topic_title": "<strong>Meeting with Coordinator</strong>",
            "topic_description": "Meeting with Coordinator Discussion regarding requirements of thesis, guidelines for the presentation of thesis, choice of supervisor, milestones due, contact details for assistance. For assistance with the various datasets available at UQ or for an introduction to Endnote, please contact Economics' Librarian Debbie Martin (d.martin@library.uq.edu.au).",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 13(03 Mar - 01 Jun)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Research and Write thesis</strong><br><p>Conduct research, undertake analysis and write thesis.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Research and Write thesis</strong>",
            "topic_description": "Research and Write thesis Conduct research, undertake analysis and write thesis.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}