{
    "course_title": "English: Curriculum Studies",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC7636-21034-7520",
    "full_course_code": "EDUC7636-21034-7520",
    "course_code": "EDUC7636",
    "class_code": "21034",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate understanding of relevant content and analysis of recent disciplinary developments in scholarship and professional practice in the teaching of English."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate the ability to apply knowledge of how students learn and knowledge of relevant curriculum documents to the development of appropriate discipline based learning goals and teaching strategies for students of varying abilities."
        },
        {
            "number": "LO3.",
            "description": "Demonstrate the ability to design, implement and evaluate learning and teaching sequences and discipline specific assessment tasks that draw on relevant curriculum documents, a range of effective teaching resources, a range of assessment and reporting strategies, and ICT knowledge that enables teaching strategies that expands learning."
        },
        {
            "number": "LO4.",
            "description": "Demonstrate knowledge and understanding of literacy and numeracy teaching strategies and their application in English."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate the ability to respond to feedback, and identify and design discipline specific opportunities for professional learning engagement and communication within the school context, teaching networks and the broader community and understand the rationale for this professional practice in relation to improved student learning."
        },
        {
            "number": "LO6.",
            "description": "Demonstrate clear, fluent and coherent communication skills in English consistent with personal, professional and academic conventions."
        },
        {
            "number": "LO7.",
            "description": "Work effectively and collaboratively in teams to make informed team decisions, demonstrate interpersonal, leadership and communication skills, and critically evaluate personal and peer contributions to team processes."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Unit overview, lesson plan & microteaching task",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30% 2500 words </dd>",
            "due_date": "<dd><p> 11/04/2025 2:00 pm</p>\n<p>\n</p><p>Microteaching presentations during scheduled tutorials and/or lecture in the week beginning 7 April 2025.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L06",
            "mode": "Oral, Written",
            "category": "Practical/ Demonstration, Product/ Design",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You are preparing Junior Secondary students for an assessment task - creating either a narrative or a persuasive speech. This preparation involves three parts:</p>\n<ul>\n<li>A concise overview of a six-week teaching and learning sequence that prepares students to complete the assessment task.</li>\n<li>A lesson plan aligned with the year level and relevant sub-strand/s from the AC:E (version 9)</li>\n<li>A microteaching demonstration of a lesson segment (performed in small groups).</li>\n</ul>\n<p><br/></p>\n<p><strong>Part 1: Overview of a six-week teaching and learning sequence (individual written response) (800 – 1000 words)</strong></p>\n<p>The focus in AT1 is on creating tasks (as opposed to responding tasks). Choose one of the assignment task sheets provided on Blackboard (either a narrative or persuasive speech). Backward mapping from this task, plan a six-week teaching and learning sequence overview using the template and guided by the examples provided on Blackboard. This overview should be organised according to the five stages of the teaching and learning cycle and provide a concise overview of the teaching and learning strategies to be used in each stage of the cycle leading up to and preparing students for the assessment task you have selected. Clearly identify the lesson you are submitting as your detailed lesson plan (see Part 2, below).</p>\n<p><br/></p>\n<p><strong>Part 2: Lesson plan (individual written response) (1200 – 1500 words)</strong></p>\n<p>Using the lesson plan template provided on Blackboard, develop a comprehensive 70-minute lesson plan from the Modelling / Deconstruction stage of your unit overview. Your lesson must be focused on one or a few related specific language features of either the narrative OR persuasive speech. Your goal is to support students to analyse the language feature/s so they can deploy the language feature/s in their summative assessment (Independent construction).</p>\n<ul>\n<li>Your lesson plan should deploy teaching and learning strategies that showcase your capacity to support student learning and be inclusive of diverse learners across a range of abilities. </li>\n<li>You should explain and justify your chosen teaching strategies and learning experiences, supported by appropriate scholarly and professional sources. </li>\n<li>Your lesson plan should incorporate appropriate resources, including ICT and a high-quality model text. If you cannot find an appropriate model text online, you can use AI to produce one. Note that you will need to ‘tweak’ what is produced to ensure it is fit for purpose. You also need to acknowledge any use of AI in relation to the model text (and/or any other aspect of your submission). </li>\n<li>You can also draw on other relevant resources, as appropriate. Include resources either as an appendix (acknowledging any sources as appropriate), or as hyperlinks within the lesson plan (or a combination of both). Appendixes are preferable to hyperlinks in the Turn It In platform. </li>\n<li>Use APA style referencing as appropriate e.g., for teaching strategies gleaned from books or journal articles.</li>\n<li>You must use the lesson plan template provided on Blackboard.</li>\n</ul>\n<p><br/></p>\n<p><strong>Part 3: Microteaching activity (group task, individual pass/fail grade)</strong></p>\n<p><em>N.B. This is a hurdle requirement – you cannot pass the assignment unless this activity is completed.</em></p>\n<p>Working in groups of four, present a segment from one of the lesson plans developed by one of your group members. You should collaboratively decide which segment to present.</p>\n<p>Your presentation should go for a maximum of 15 minutes and should consist of:</p>\n<ul>\n<li>a brief (two or three minute) overview which (i) outlines where and how your segment fits into the lesson and (ii) how the task/s in your segment tightly backmap to the summative assessment task. </li>\n<li>delivery of a segment of the lesson (approximately 12 minutes).</li>\n</ul>\n<p>Please note:</p>\n<ul>\n<li>You are not required to present the full lesson in the workshop – just a segment of the lesson</li>\n<li>All group members must contribute equally – both in terms of planning and organisation as well as to the presentation itself i.e., each person presents for the same amount of time.</li>\n</ul>\n<p><br/></p>\n<p><strong>A note about group work</strong></p>\n<p>All group members should contribute equally to the design and delivery of microteaching segment. However, the phenomenon of ‘social loafing’ is acknowledged as a frustration to some students. Social loafing is also known as ‘free-riding’ i.e., when one or more group members contributes little and ‘rides’ on the extra efforts of their co-workers (Walker &amp; Angelo, 1998).</p>\n<p>If your small group is experiencing dysfunction, including ‘social loafing’ by one or more members, it is your responsibility to bring this promptly to the attention of your tutor/course coordinator, who will then support the group to resolve the problems in a respectful way. If no resolution can be found, the tutor/course coordinator can remove the non-contributing student/s from the group and require student/s to complete the task either individually or in another small group with other ‘social loafers’.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Upload the individual written component of AT1 to TII as one file. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Teaching learning and assessment plan (TLAP)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>35% 3000 words </dd>",
            "due_date": "<dd><p> 8/08/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L06",
            "mode": "Written",
            "category": "Product/ Design",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Context</strong></p>\n<p>In meeting the unit specifications and requirements of senior syllabuses, schools often choose to prepare semester-long units for Years 11 and 12 using Teaching and Learning Plans (TLPs). Framed by the relevant syllabus and developed to meet the unique context of a school and student cohort, these documents provide a common direction and purpose for a school’s subject teachers and students. For example, using the unit specifications and requirements of the <em>English General Senior Syllabus</em> (2025), a school may plan TLPs for Semester 1 and Semester 2 of Year 11, by backward-mapping to their school-designed assessment instruments and the syllabus text requirements for <em>Unit 1: Perspectives and texts</em> and <em>Unit 2: Texts and Culture</em>. These TLPs would use texts, resources, and teaching and learning experiences that cater to the needs and interests of the school’s Year 11 students in subject English. For AT2, you will develop a teaching and learning sequence for a Year 11 English class, using an assessment instrument and a TLP scaffold, as provided on Blackboard. </p>\n<p><br/></p>\n<p><strong>Description of task</strong></p>\n<p>Using the Unit 1 or<strong> </strong>Unit 2 assessment instrument and Teaching and Learning Plan (TLP) scaffold, develop an eight-week teaching and learning sequence that you and fellow Senior English teachers could implement.</p>\n<p>Your teaching and learning sequence needs to:</p>\n<p>1.     tightly backward-map to the assessment instrument you select from Blackboard. Both assessment instruments:</p>\n<ul>\n<li>focus on responding to texts (as opposed to creating texts) in Year 11</li>\n<li>require study of a novel or collection of short stories that have been sourced from the <em>English/EAL General senior syllabus prescribed text list </em>(2026-2029)</li>\n<li>require students to submit/complete their assessment responses by Week 9 of your teaching and learning sequence </li>\n</ul>\n<p>2.     use the TLP scaffold on Blackboard to:</p>\n<ul>\n<li>develop a teaching and learning sequence comprising 24 lessons (3 x 70 minute lessons per week)</li>\n<li>include a description of the social context of your own mixed ability Year 11 English class, including their strengths and needs, based on existing assessment information and your own observations. You might draw on a real class you have taught on practicum or describe a fictitious but authentic-sounding class (150-200 words).</li>\n<li>provide a rationale that describes and justifies the value of your chosen focus for students at this point in their English studies. To justify your focus, you should draw on the relevant unit learning objectives and subject matter, as well as your understanding of relevant learner characteristics (150-200 words)</li>\n<li>ensure that all parts of your submission are uploaded to TurnitIn as ONE file only (your completed TLP).</li>\n</ul>\n<p>3.     <strong>For the first five weeks (Lessons 1 to 15)</strong>, provide an explicit teaching and learning sequence for Stages 1 and 2 of the teaching and learning cycle (Building knowledge of the field              and Supported reading of the focus text/s).</p>\n<p>4.     <strong>For the final three weeks (Lessons 16 to 24)</strong>, provide a more succinct overview of how you will support learning in the final three stages of the teaching and learning cycle (Modelling/Deconstruction, Joint Construction, and Independent Construction). </p>\n<p>5.     Reference all text-based sources using APA style (e.g., to reference the novel or collection of short stories for study, other texts or sections of texts for use). Online sources can be acknowledged either by creating a hyperlink to that source or using APA conventions. </p>\n<p><br/></p>\n<p>In completing this task, ensure that your teaching and learning sequence includes experiences that:</p>\n<ul>\n<li>tightly backward-map to the task throughout the teaching and learning cycle</li>\n<li>provide evidence of relevant pedagogical models (e.g., gradual release of responsibility model)</li>\n<li>use ICTs to support and expand teaching and learning experiences</li>\n<li>provide specific opportunities to develop literacy and numeracy skills</li>\n<li>provide specific opportunities for diagnostic and formative assessment</li>\n<li>cater to the needs of diverse learners across the full range of abilities.</li>\n</ul>\n<p><br/></p>\n<p>And, because TLPs are sizeable documents, do NOT prepare or approach this task by preparing individual lesson plans:</p>\n<ul>\n<li>include only enough information to allow another teacher to understand and implement the common goals and plans of your teaching and learning sequence</li>\n<li>view the model TLP on Blackboard as a guide to the amount of detail required in Weeks 1 to 5 (explicit sequence) and Weeks 6 to 8 (succinct overview) </li>\n<li>you may find it helpful to use the AT1 unit overview template as an ‘at a glance’ planning tool (but don’t include this in your TLP submission)</li>\n<li>briefly describe accompanying resources, provide them in appendixes or as hyperlinks, or snip and paste them into the TLP ‘Resources’ column, as appropriate. For example, if you are using a PowerPoint, you aren’t expected to develop accompanying slides, but you might state that you’ll display the learning goals using PowerPoint, or that you’ll display a selection of writing prompts. If you are adapting a retrieval chart from<em> The Beginning Teacher's Companion</em>, you could create this in Word and then, providing it is still legible, snip and paste this as a small jpg file in the Resources column. If you are using an online resource, you can include this as an appendix or a hyperlink (please note, appendixes are preferable to hyperlinks in Turn-It-In)</li>\n</ul>\n<p>Extension requests must be made using the official online procedures before the due date.</p>\n<p><br/></p>\n<p>APST: 1.5, 2.1, 2.2, 2.3, 2.5, 2.6, 3.1, 3.2, 3</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Upload to TII as ONE FILE ONLY. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Multimodal Professional Learning Plan",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>25% Video: 4-5 mins; Annotated Bibliography: 800-1000 words </dd>",
            "due_date": "<dd><p> 31/10/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L05, L06",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This task recognises your learning and practice as a soon-to-be graduate teacher of secondary English. It requires you to create a<strong> multimodal professional learning plan (PLP)</strong> for your first year of teaching that (i) outlines and reflects on a focus area you need to further develop, and (ii) details the professional learning you will undertake to develop your knowledge and practice in this area.</p>\n<p><br/></p>\n<p>Your PLP will be documented as a <strong>video and annotated bibliography</strong>, and will need to <strong>focus on</strong> <strong>one</strong> of the following areas:</p>\n<p>Area 1: teaching works created by Aboriginal Australian and Torres Strait Islander peoples.</p>\n<p>Area 2: for a specific text type of your choice (e.g. poetry, novels, plays, film, other), teaching students to analyse:</p>\n<ol>\n<li>perspectives and representations of concepts, identities, times, and places in texts <strong>OR</strong></li>\n<li>use and effects of aesthetic features and stylistic devices in texts <strong>OR</strong></li>\n<li>the ways cultural assumptions, attitudes, values, and beliefs underpin texts and position audiences.</li>\n</ol>\n<p>Area 3: teaching students to create texts in a specific text type of your choice (e.g., analytical essay, feature article, short story, persuasive speech, other).</p>\n<p>Area 4: an alternative focus of your choosing, in negotiation with your tutor.</p>\n<p><br/></p>\n<p><strong>Part 1: Video component</strong></p>\n<p>The video component of your PLP is to be <strong>4-5 minutes</strong> in length. <strong>It must include:</strong></p>\n<ul>\n<li>a brief introduction and overview of your chosen focus area, including how you identified it as an area in which you need further development APST 1.2; APST 6.3). <em>This could include e.g. feedback from your supervisor/s and other teachers, critical self-reflection from practicum and/or coursework, feedback on assessment tasks.</em></li>\n<li>why this focus area is important to students’ educational outcomes in secondary English (APST 1.2). <em>You will need to justify your focus and support your contentions by:</em></li>\n<li><em>making links to relevant curriculum documents and</em></li>\n<li><em>identifying impacts for teaching and learning, using current and relevant academic and professional sources.</em></li>\n<li>description and justification of 3–4 strategies, specific to your chosen focus area, which you will use to develop your professional knowledge and skills in your first year of teaching (APST 6.3; APST 6.4; APST 7.4). <em>This should include how you will engage with others, e.g., teaching colleagues, professional teaching networks and/or other communities as relevant.</em></li>\n<li><em>explanation of how you will evaluate your professional learning and demonstrate improved teaching practices in this focus area. (APST 6.3; APST 6.4), e.g., seeking and applying feedback from supervisors, colleagues, students, parents/carers, the broader community; analysing student responses.</em></li>\n<li><em>a brief conclusion/summary statement.</em></li>\n</ul>\n<p>In producing your video, you will need to:</p>\n<ul>\n<li>select and use a range and balance of multimodal elements to communicate your subject matter and engage your audience (e.g., images, text, narration, animation, video, other)</li>\n<li>narrate using your own spoken, recorded delivery of original script (video and/or audio)</li>\n<li>if included, ensure any photos of student work or other artefacts are de-identified</li>\n<li>use APA7 referencing conventions and attribute multimodal elements appropriately</li>\n<li>select and learn how to use production software as required.</li>\n</ul>\n<p>Please note:</p>\n<ul>\n<li>Your video can use but is not limited to the sources required in your annotated bibliography. </li>\n<li>No time will be provided on how to use software to produce your video. Many online tutorials are available for this purpose.</li>\n<li>Select and learn how to use appropriate software before returning from your final practicum, to ensure you have enough time for this task.</li>\n<li>You are not expected to purchase production software. There is free software that will meet the requirements of this task, e.g. PowerPoint, PhotoStory 3, iMovie and others. </li>\n<li>Some online tools only offer a limited free trial (e.g., VideoScribe and Powtoon). Carefully check subscription details before investing too much time. </li>\n</ul>\n<p><br/></p>\n<p><strong>Part 2: Annotated bibliography</strong></p>\n<p>To support and extend your professional learning in teaching secondary school English, Part 2 of your PLP requires you to select and annotate six sources you will use to further develop your knowledge and skills in your stated focus area.</p>\n<p>When choosing and documenting your sources:</p>\n<ul>\n<li>they must be current (published within the last five years) unless you are including a foundational text on which more recent scholarship is built</li>\n<li>at least four must be scholarly, peer-reviewed books, book chapters or articles</li>\n<li>include no more than two reliable professional or government sources (e.g., articles, blogs, podcast transcripts)</li>\n<li>if they meet requirements and will be key in implementing your PLP, consider whether you need to include sources used in your video component (Part 1)</li>\n<li>follow APA 7 formatting guidelines (provided in the template on Blackboard).</li>\n</ul>\n<p>To annotate your chosen sources:</p>\n<ul>\n<li>you have 800-1000 words (total) for annotations, excluding bibliographic details</li>\n<li>provide an annotation for each, summarising the chosen source and detailing why it will be of significant value in developing your professional knowledge and skills in your chosen focus area</li>\n<li>annotations should continue to develop your PLP beyond the content of your video, rather than simply restating it.</li>\n</ul>\n<p><br/></p>\n<p><strong>Referencing other sources</strong></p>\n<p>You will need to acknowledge sources used in researching and preparing your PLP, additional to those chosen for your annotated bibliography.</p>\n<p>To do this:</p>\n<ul>\n<li>as well as in-text referencing of sources and attribution of multimodal elements in Part 1, bibliographic details of sources should be included in a reference list at the end of your video.</li>\n<li>include any other sources used in researching and preparing your PLP in a reference list after your annotated bibliography.  </li>\n<li>in all instances, use APA 7 formatting guidelines (provided in the template on Blackboard).</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Online engagement with learning modules",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p> 25/02/2025 - 27/10/2025</p>\n<p>\n</p><p>Due every Tuesday at 5pm during teaching weeks.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Participation/ Student contribution, Quiz, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Task description</strong></p>\n<p>Most weeks, in place of a lecture, there will be a learning module comprising short videos and activities in Blackboard (e.g., quizzes, polls, reflections).<strong> Because this content replaces a lecture, engagement with the learning modules is critical to your success in this course</strong>.</p>\n<p><br/></p>\n<p><strong>Criteria &amp; Marking</strong></p>\n<p>Each completed activity is worth one point. The overall grade for this task is calculated as a percentage by taking the points scored across all the graded items and comparing it to the total points possible e.g.,</p>\n<ul>\n<li>42 activities completed out of 50 total activities: 42/50 x 100 = 84%</li>\n</ul>\n<p>This percentage is mapped to the UQ grading schema to display a grade (1 - 7).</p>\n<p><br/></p>\n<p><strong>Submission</strong></p>\n<p>Completed each week via the relevant learning modules in Blackboard. To receive credit, the activities must be completed by 5pm on the following Tuesday i.e., Week 1’s online learning module must be completed by Tuesday 5pm of Week 2. Ideally, however, you should complete the learning module before attending that week's tutorial so that you are prepared to participate fully. </p>\n<p><br/></p>\n<p>APST: 1.2, 1.5, 2.1, 2.5, 3.3, 3.4, 6.4</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Using Blackboard's learning module function, organised according to each week's focus.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>Any activities in the learning modules not completed by the due date and time will be regarded as incomplete and no points given. There is no additional penalty for non-submission. If an extension is needed, students can apply for an extension as usual. </p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction to English Curriculum Studies - online lecture</strong><br><p>On Monday, we will meet for an introductory lecture online via Zoom to ensure shared understanding of course structure and expectations. There is also an online learning module, which should be completed before the Week 1 tutorial. </p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Introduction to English Curriculum Studies - online lecture</strong>",
            "topic_description": "Introduction to English Curriculum Studies - online lecture On Monday, we will meet for an introductory lecture online via Zoom to ensure shared understanding of course structure and expectations. There is also an online learning module, which should be completed before the Week 1 tutorial.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>What is English anyway? | Functional model</strong><br><p>We explore the evolution of various models of and theoretical/philosophical approaches to English teaching. Please ensure you have completed the Week 1 online learning module prior to attending the tutorial. </p>\n<p><br/></p>\n<p>APST: 1.2 2.1 2.2 2.5 3.3 7.4</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L06, L07</p></div></td>",
            "topic_title": "<strong>What is English anyway? | Functional model</strong>",
            "topic_description": "What is English anyway? | Functional model We explore the evolution of various models of and theoretical/philosophical approaches to English teaching. Please ensure you have completed the Week 1 online learning module prior to attending the tutorial. APST: 1.2 2.1 2.2 2.5 3.3 7.4",
            "learning_outcomes": [
                "L01",
                "L02",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Backward mapping | T&amp;L cycle: Field building</strong><br><p>The teaching and learning cycle - which underpins all teaching and learning in English - is introduced. We review backward mapping, a concept you will have encountered in previous education courses, but specifically in relation to English. The first stage of the teaching and learning cycle, Building knowledge of the field, is then explored. Please ensure you have completed the Week 2 online learning module prior to attending the tutorial - this is in place of a synchronous lecture this week. </p>\n<p><br/></p>\n<p>APST: 1.2, 2.1, 2.5, 3.3</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L07</p></div></td>",
            "topic_title": "<strong>Backward mapping | T&amp;L cycle: Field building</strong>",
            "topic_description": "Backward mapping | T&L cycle: Field building The teaching and learning cycle - which underpins all teaching and learning in English - is introduced. We review backward mapping, a concept you will have encountered in previous education courses, but specifically in relation to English. The first stage of the teaching and learning cycle, Building knowledge of the field, is then explored. Please ensure you have completed the Week 2 online learning module prior to attending the tutorial - this is in place of a synchronous lecture this week. APST: 1.2, 2.1, 2.5, 3.3",
            "learning_outcomes": [
                "L02",
                "L03",
                "L07"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The T&amp;L Cycle - Supported reading</strong><br><p>We explore the second stage of the t&amp;l cycle, Supported reading. We will understand that in secondary English, supported reading and text analysis go hand-in-hand. Please ensure you have completed the Week 3 online learning module prior to attending the tutorial - this is in place of a synchronous lecture this week. </p>\n<p><br/></p>\n<p>APST 1.2, 2.1, 2.5, 3.3</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L07</p></div></td>",
            "topic_title": "<strong>The T&amp;L Cycle - Supported reading</strong>",
            "topic_description": "The T&L Cycle - Supported reading We explore the second stage of the t&l cycle, Supported reading. We will understand that in secondary English, supported reading and text analysis go hand-in-hand. Please ensure you have completed the Week 3 online learning module prior to attending the tutorial - this is in place of a synchronous lecture this week. APST 1.2, 2.1, 2.5, 3.3",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L07"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Modelling and deconstruction | Joint Construction | Independent Construction</strong><br><p>We will explore the third stage of the t/l cycle and consider how a functional view of language informs grammar teaching and learning. We also explore the final two stages of the t/l cycle. Please ensure you have completed the Week 4 online learning module prior to attending the tutorial - this is in place of a synchronous lecture this week. </p>\n<p><br/></p>\n<p>APST: 1.5 2.1 2.3 3.2 3.3 3.4</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06, L07</p></div></td>",
            "topic_title": "<strong>Modelling and deconstruction | Joint Construction | Independent Construction</strong>",
            "topic_description": "Modelling and deconstruction | Joint Construction | Independent Construction We will explore the third stage of the t/l cycle and consider how a functional view of language informs grammar teaching and learning. We also explore the final two stages of the t/l cycle. Please ensure you have completed the Week 4 online learning module prior to attending the tutorial - this is in place of a synchronous lecture this week. APST: 1.5 2.1 2.3 3.2 3.3 3.4",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Guest lecture with the QCAA Learning Area Manager - English</strong><br><p>During the online lecture time, we will be joined by the QCAA Learning Area Manager, who will provide an overview of the English suite of syllabuses. **Valuable to include in your CV** There is also an online learning module. </p></br></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Guest lecture with the QCAA Learning Area Manager - English</strong>",
            "topic_description": "Guest lecture with the QCAA Learning Area Manager - English During the online lecture time, we will be joined by the QCAA Learning Area Manager, who will provide an overview of the English suite of syllabuses. **Valuable to include in your CV** There is also an online learning module.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lesson planning and diversity</strong><br><p>The process of lesson planning is unpacked and connected to Task 1 requirements. Catering for diverse learners is also explored. Please ensure you have completed the Week 5 online learning module prior to attending the tutorial.</p>\n<p><br/></p>\n<p>APST 1.2, 1.3, 1.4, 1.5, 2.1, 2.5, 3.1, 3.3, 3.4</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L07</p></div></td>",
            "topic_title": "<strong>Lesson planning and diversity</strong>",
            "topic_description": "Lesson planning and diversity The process of lesson planning is unpacked and connected to Task 1 requirements. Catering for diverse learners is also explored. Please ensure you have completed the Week 5 online learning module prior to attending the tutorial. APST 1.2, 1.3, 1.4, 1.5, 2.1, 2.5, 3.1, 3.3, 3.4",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L07"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Teaching literary texts - novels and plays</strong><br><p>In the tutorial, we explore strategies for teaching and learning literary texts with a focus on novels and plays (we explore poetry in a later workshop). No online learning module this week - please use your time to make progress with AT1.  </p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L07</p></div></td>",
            "topic_title": "<strong>Teaching literary texts - novels and plays</strong>",
            "topic_description": "Teaching literary texts - novels and plays In the tutorial, we explore strategies for teaching and learning literary texts with a focus on novels and plays (we explore poetry in a later workshop). No online learning module this week - please use your time to make progress with AT1.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L07"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Microteaching presentations during lecture and tutorial time | AT1 due 11 April 2pm</strong><br><p>Microteaching presentations will be presented during the scheduled lecture and tutorial times in your usual tutorial groups. </p>\n<p>AT1 (individual written component) due 11 April 2pm.</p>\n<p><br/></p>\n<p>APST: 1.2 2.1 2.2 2.6 3.2 3.3 3.4 6.3</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L06, L07</p></div></td>",
            "topic_title": "<strong>Microteaching presentations during lecture and tutorial time | AT1 due 11 April 2pm</strong>",
            "topic_description": "Microteaching presentations during lecture and tutorial time | AT1 due 11 April 2pm Microteaching presentations will be presented during the scheduled lecture and tutorial times in your usual tutorial groups. AT1 (individual written component) due 11 April 2pm. APST: 1.2 2.1 2.2 2.6 3.2 3.3 3.4 6.3",
            "learning_outcomes": [
                "L02",
                "L03",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-semester break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-semester break</strong>",
            "topic_description": "Mid-semester break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Mid-sem break (first semester) To Week 13(21 Apr - 01 Jun)",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Break for Professional Experience</strong><br/></p></div></td>",
            "topic_title": "<strong>Break for Professional Experience</strong>",
            "topic_description": "Break for Professional Experience",
            "learning_outcomes": []
        },
        {
            "learning_period": "Revision week (first semester)(02 Jun - 08 Jun)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Assessment practices | Unit Planning | AT2 task requirements</strong><br><p>This week, in a synchronous online lecture via Zoom, we explore assessment practices, unit planning and AT2. </p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Assessment practices | Unit Planning | AT2 task requirements</strong>",
            "topic_description": "Assessment practices | Unit Planning | AT2 task requirements This week, in a synchronous online lecture via Zoom, we explore assessment practices, unit planning and AT2.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Revision week (first semester)(02 Jun - 08 Jun)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Sustainable feedback practices</strong><br><p>In the tutorial, we explore sustainable practices to support effective feedback in the English classroom. </p>\n<p><br/></p>\n<p>APST 1.5; 2.1 - 2.3; 2.5; 2.6; 3.1 - 3.6; 4.1 - 4.3; 5.1; 6.3, 6.2,</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L05, L07</p></div></td>",
            "topic_title": "<strong>Sustainable feedback practices</strong>",
            "topic_description": "Sustainable feedback practices In the tutorial, we explore sustainable practices to support effective feedback in the English classroom. APST 1.5; 2.1 - 2.3; 2.5; 2.6; 3.1 - 3.6; 4.1 - 4.3; 5.1; 6.3, 6.2,",
            "learning_outcomes": [
                "L01",
                "L03",
                "L05",
                "L07"
            ]
        },
        {
            "learning_period": "O-Week (second semester)(21 Jul - 27 Jul)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Unit planning - Guest workshop with QCAA Principal Education Officer | English</strong><br><p>For the tutorial this week, both groups are combined and QCAA officers will lead a tutorial focused on unit design in Senior English; this will be very helpful for AT2. Please ensure you have completed the online learning module prior to the tutorial.</p>\n<p><br/></p>\n<p>APST: 2.1, 2.2, 3.1, 3.2, 6.2, 6.3</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Unit planning - Guest workshop with QCAA Principal Education Officer | English</strong>",
            "topic_description": "Unit planning - Guest workshop with QCAA Principal Education Officer | English For the tutorial this week, both groups are combined and QCAA officers will lead a tutorial focused on unit design in Senior English; this will be very helpful for AT2. Please ensure you have completed the online learning module prior to the tutorial. APST: 2.1, 2.2, 3.1, 3.2, 6.2, 6.3",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 14(28 Jul - 03 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Oral language, Numeracy, Poetry</strong><br><p>The online learning module explores (i) the importance of and strategies for developing students' oral language skills, and (ii) numeracy. In the tutorial, we explore teaching and learning of poetry. Please ensure you have completed the online learning module prior to the tutorial. </p>\n<p><br/></p>\n<p><br/></p>\n<p>APST: 2.1, 2.2, 2.4, 3.3, 3.4</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L07</p></div></td>",
            "topic_title": "<strong>Oral language, Numeracy, Poetry</strong>",
            "topic_description": "Oral language, Numeracy, Poetry The online learning module explores (i) the importance of and strategies for developing students' oral language skills, and (ii) numeracy. In the tutorial, we explore teaching and learning of poetry. Please ensure you have completed the online learning module prior to the tutorial. APST: 2.1, 2.2, 2.4, 3.3, 3.4",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L07"
            ]
        },
        {
            "learning_period": "Week 15(04 Aug - 10 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Cognitive verbs: Scaffolding for success</strong><br><p>No online learning module this week; instead, we are available online during our lecture contact time for you to drop in with any questions about AT2. In the tutorial, Gerard Alford, one of the authors of The Beginning Teacher's Companion, will deliver a guest workshop focused on scaffolding learning with cognitive verbs. This will be very helpful for Task 2 and for your second block of prac. **Valuable to include in your CV**</p>\n<p><br/></p>\n<p>AT2 TLAP due Friday 8 August 2pm.</p>\n<p><br/></p>\n<p>APST 2.1, 2.2, 2.4, 2.5, 3.3, 3.4</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L07</p></div></td>",
            "topic_title": "<strong>Cognitive verbs: Scaffolding for success</strong>",
            "topic_description": "Cognitive verbs: Scaffolding for success No online learning module this week; instead, we are available online during our lecture contact time for you to drop in with any questions about AT2. In the tutorial, Gerard Alford, one of the authors of The Beginning Teacher's Companion, will deliver a guest workshop focused on scaffolding learning with cognitive verbs. This will be very helpful for Task 2 and for your second block of prac. **Valuable to include in your CV** AT2 TLAP due Friday 8 August 2pm. APST 2.1, 2.2, 2.4, 2.5, 3.3, 3.4",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L07"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 16 To Week 21(11 Aug - 21 Sep)",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Break for Professional Experience</strong><br/></p></div></td>",
            "topic_title": "<strong>Break for Professional Experience</strong>",
            "topic_description": "Break for Professional Experience",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 22(22 Sep - 28 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Online lecture - Unpacking AT3 requirements</strong><br><p>During the synchronous online lecture, we unpack the final assessment task.</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Online lecture - Unpacking AT3 requirements</strong>",
            "topic_description": "Online lecture - Unpacking AT3 requirements During the synchronous online lecture, we unpack the final assessment task.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 22(22 Sep - 28 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Multimodal and visual texts</strong><br><p>In the tutorial, we explore teaching and learning strategies for multimodal/visual texts.</p>\n<p><br/></p>\n<p>APST: 2.1, 2.6 6.2, 6.4, 7.4</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L07</p></div></td>",
            "topic_title": "<strong>Multimodal and visual texts</strong>",
            "topic_description": "Multimodal and visual texts In the tutorial, we explore teaching and learning strategies for multimodal/visual texts. APST: 2.1, 2.6 6.2, 6.4, 7.4",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L07"
            ]
        },
        {
            "learning_period": "Mid-sem break (second semester)(29 Sep - 05 Oct)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-semester break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-semester break</strong>",
            "topic_description": "Mid-semester break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 23(06 Oct - 12 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Literature &amp; Essential English</strong><br><p>The short online learning module will help familiarise you with the Literature and Essential English syllabus documents ahead of the tutorial. In the tutorial, QCAA officers will deliver a seminar about these syllabuses. **Valuable for your CV**</p>\n<p><br/></p>\n<p><br/></p>\n<p>APST 4.5, 4.4, 3.4, 3.3, 2.6,</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Literature &amp; Essential English</strong>",
            "topic_description": "Literature & Essential English The short online learning module will help familiarise you with the Literature and Essential English syllabus documents ahead of the tutorial. In the tutorial, QCAA officers will deliver a seminar about these syllabuses. **Valuable for your CV** APST 4.5, 4.4, 3.4, 3.3, 2.6,",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 24(13 Oct - 19 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Special guest: Professor Anita Heiss - Building capacity to plan and enact teaching and learning of Aboriginal and Torres Strait Islander works</strong><br><p>In this workshop, we are very lucky to welcome Professor Anita Heiss, who will lead you in a series of activities designed to help you to expand your cultural capability as English teachers. This tutorial will help you build your confidence to plan and deliver teaching and learning in relation to works authored by Aboriginal and Torres Strait Islander peoples in respectful, inclusive, and meaningful ways. </p>\n<p><br/></p>\n<p><strong>About Professor Anita Heiss</strong></p>\n<p><em>Dr Anita Heiss AM is a proud member of the Wiradyuri nation of central New South Wales and one of Australia’s most prolific and well-known authors publishing across genres including non-fiction, historical fiction, commercial fiction and children’s fiction. Anita’s non-fiction works include Am I Black Enough for You?, Dhuuluu-Yala (To Talk Straight) – Publishing Aboriginal Literature, and as editor, Growing Up Aboriginal in Australia and The Macquarie PEN Anthology of Aboriginal Literature which she co-edited with Peter Minter. Her adult fiction includes Not Meeting Mr Right, Avoiding Mr Right, Manhattan Dreaming, Paris Dreaming and Tiddas. Her novel Barbed Wire and Cherry Blossoms was shortlisted for the QLD Literary Awards, longlisted for the Dublin International Literary Prize and was the University of Canberra 2020 Book of the Year. Bila Yarrudhanggalangdhuray won the 2022 NSW Premier’s Literary Prize for Indigenous Writing, was shortlisted for the 2021 HNSA ARA Historical Novel (Adult Category) and the 2022 ABIA Awards, and longlisted for the 2022 Stella Prize. In 2004 Anita was listed in The Bulletin magazine’s “Smart 100”. Her memoir Am I Black Enough for You? was a finalist in the 2012 Human Rights Awards and she was a finalist in the 2013 Australian of the Year Awards (Local Hero). As an advocate for Indigenous literacy, Anita has worked in remote communities as a role model and encouraging young Indigenous Australians to write their own stories. On an international level she has performed her own work and lectured on Aboriginal literature across the globe at universities and conferences, consulates and embassies in the USA, Canada, the UK, Tahiti, Fiji, New Caledonia, Spain, Japan, Austria, Germany, China, India and New Zealand. Anita is a Lifetime Ambassador for the Indigenous Literacy Foundation, and a proud Ambassador of Worawa Aboriginal College, the GO Foundation and the Sydney Swans. Anita is a Professor of Communications at the University of QLD and is on the board of the National Justice Project, Aboriginal Art Co and Circa Contemporary Theatre. Anita’s first play Tiddas, produced by La Boite Theatre had its world premiere at the 2022 Brisbane Festival.</em></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Special guest: Professor Anita Heiss - Building capacity to plan and enact teaching and learning of Aboriginal and Torres Strait Islander works</strong>",
            "topic_description": "Special guest: Professor Anita Heiss - Building capacity to plan and enact teaching and learning of Aboriginal and Torres Strait Islander works In this workshop, we are very lucky to welcome Professor Anita Heiss, who will lead you in a series of activities designed to help you to expand your cultural capability as English teachers. This tutorial will help you build your confidence to plan and deliver teaching and learning in relation to works authored by Aboriginal and Torres Strait Islander peoples in respectful, inclusive, and meaningful ways. About Professor Anita Heiss Dr Anita Heiss AM is a proud member of the Wiradyuri nation of central New South Wales and one of Australia’s most prolific and well-known authors publishing across genres including non-fiction, historical fiction, commercial fiction and children’s fiction. Anita’s non-fiction works include Am I Black Enough for You?, Dhuuluu-Yala (To Talk Straight) – Publishing Aboriginal Literature, and as editor, Growing Up Aboriginal in Australia and The Macquarie PEN Anthology of Aboriginal Literature which she co-edited with Peter Minter. Her adult fiction includes Not Meeting Mr Right, Avoiding Mr Right, Manhattan Dreaming, Paris Dreaming and Tiddas. Her novel Barbed Wire and Cherry Blossoms was shortlisted for the QLD Literary Awards, longlisted for the Dublin International Literary Prize and was the University of Canberra 2020 Book of the Year. Bila Yarrudhanggalangdhuray won the 2022 NSW Premier’s Literary Prize for Indigenous Writing, was shortlisted for the 2021 HNSA ARA Historical Novel (Adult Category) and the 2022 ABIA Awards, and longlisted for the 2022 Stella Prize. In 2004 Anita was listed in The Bulletin magazine’s “Smart 100”. Her memoir Am I Black Enough for You? was a finalist in the 2012 Human Rights Awards and she was a finalist in the 2013 Australian of the Year Awards (Local Hero). As an advocate for Indigenous literacy, Anita has worked in remote communities as a role model and encouraging young Indigenous Australians to write their own stories. On an international level she has performed her own work and lectured on Aboriginal literature across the globe at universities and conferences, consulates and embassies in the USA, Canada, the UK, Tahiti, Fiji, New Caledonia, Spain, Japan, Austria, Germany, China, India and New Zealand. Anita is a Lifetime Ambassador for the Indigenous Literacy Foundation, and a proud Ambassador of Worawa Aboriginal College, the GO Foundation and the Sydney Swans. Anita is a Professor of Communications at the University of QLD and is on the board of the National Justice Project, Aboriginal Art Co and Circa Contemporary Theatre. Anita’s first play Tiddas, produced by La Boite Theatre had its world premiere at the 2022 Brisbane Festival.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 25(20 Oct - 26 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Latched-on: Introduction to an approach to supporting students with significant learning needs</strong><br><p>Latched On</p>\n<p><br/></p>\n<p>APST 6.3, 6.4, 7.4</p></br></p><p><strong>Learning outcomes:</strong> L02, L04, L05</p></div></td>",
            "topic_title": "<strong>Latched-on: Introduction to an approach to supporting students with significant learning needs</strong>",
            "topic_description": "Latched-on: Introduction to an approach to supporting students with significant learning needs Latched On APST 6.3, 6.4, 7.4",
            "learning_outcomes": [
                "L02",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 26(27 Oct - 02 Nov)",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Critical reflection | Online drop-in session</strong><br><p>There is a short online learning module that involves you in critical reflection on the English Curriculum Studies course and your own learning. The tutorial will be an online drop-in session for any support you need with AT3. Please see the Zoom links for each tutorial group on Zoom. </p>\n<p>AT3 due Friday 31 October</p>\n<p><br/></p>\n<p>APST 6.4, 6.2, 6.1</p></br></p><p><strong>Learning outcomes:</strong> L05, L06</p></div></td>",
            "topic_title": "<strong>Critical reflection | Online drop-in session</strong>",
            "topic_description": "Critical reflection | Online drop-in session There is a short online learning module that involves you in critical reflection on the English Curriculum Studies course and your own learning. The tutorial will be an online drop-in session for any support you need with AT3. Please see the Zoom links for each tutorial group on Zoom. AT3 due Friday 31 October APST 6.4, 6.2, 6.1",
            "learning_outcomes": [
                "L05",
                "L06"
            ]
        }
    ]
}