{
    "course_title": "Digital Technologies: STEM Connections",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC4730-20429-7520",
    "full_course_code": "EDUC4730-20429-7520",
    "course_code": "EDUC4730",
    "class_code": "20429",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Identify the knowledge, concepts, skills, and inquiry processes required for effective, contemporary learning and teaching of Technologies and ICT through an integrated process."
        },
        {
            "number": "LO2.",
            "description": "Apply the knowledge and understanding, process and production skills learnt to the teaching of Design and Digital Technologies."
        },
        {
            "number": "LO3.",
            "description": "Make purposeful connections among the general capabilities of literacy, numeracy, critical and creative thinking, personal and social capability, ethical understanding, and intercultural understanding throughout teaching programs and activities."
        },
        {
            "number": "LO4.",
            "description": "Demonstrate the technical and communication skills needed to design, evaluate, implement, analyse and theorise curriculum, pedagogy and assessment in the Technologies and STEM."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate discipline content knowledge of science, technology and mathematics for connected learning and teaching of Design and Digital Technologies and ICT through a STEM focus."
        },
        {
            "number": "LO6.",
            "description": "Work effectively and collaboratively in teams to make informed team decisions, demonstrate interpersonal and communication skills, and critically evaluate personal and peer contributions to team processes."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Professional Learning Session: ICT in STEAM",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>30% Presentation </dd>",
            "due_date": "<dd><p> 20/03/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L03, L04, L05, L06",
            "mode": "Activity/ Performance",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Length:</strong> 20 minute in-class facilitation + 1-3 page annotated session outline + session materials (unlimited) + work log (~1 page) + references (unlimited). Annotations are unlimited.</p>\n<p><strong>Task Context</strong></p>\n<p>As teachers of Technologies, you will explore various forms of technology and make decisions about technology resources in your classroom. In this context, a professional learning session, you will present to your colleagues a specific technology and/or information and communications technology (ICT) tool in your teaching. In completing this task, you will deepen your appreciation of educational technologies, including ICTs, and enrich your perspectives of technology, its impacts and consequences. The task requires you to demonstrate a knowledge and deep understanding of technology, including as intended and described by the Australian Curriculum: Technologies, which will form a solid foundation for the planning of learning and teaching experiences for your students at any year level.</p>\n<p><strong>Task Description</strong></p>\n<p>In small groups, you will collaboratively design and facilitate a professional learning (PL) session for your fellow preservice teachers. Your interactive PL session will involve implementing appropriate teaching and learning principles to support your colleagues in understanding how to use your chosen ICT tool to expand curriculum learning opportunities for students in STEAM learning area(s) of the Australian Curriculum. All group members must collaboratively engage in decision-making, planning, and in-class facilitation. The ICT tool should be applied in this context primarily for student learning, rather than management, teacher presentation, etc. Additionally, the ICT tool should be accessible to students during the workshop.</p>\n<p>This assessment task consists of five parts:</p>\n<ul>\n<li>(1) Professional Learning session - Facilitated during class on March 20th </li>\n<li>20-minute session facilitation applying appropriate teaching and learning techniques for teachers as learners (e.g., do not lecture; do include hands-on activities; do discuss at the end). During the session:</li>\n<li>Equip your colleagues (i.e., teachers as learners) with 1-2 ways to use the ICT tool to expand curriculum learning opportunities for primary students in relation to your chosen ICT and STEAM learning areas.</li>\n<li>Clearly identify learning area(s) and content descriptors directly relevant to your ICT tool and use (consult the Australian Curriculum, version 9).</li>\n<li>Clearly identify the teacher as learner learning objectives you are targeting (consult Australian Professional Standards for Teachers (APST).</li>\n<li>Teachers as learners should engage with the ICT tool.</li>\n<li>(2) Annotated session outline (1-3 pages with unlimited annotations using Comments)</li>\n<li>Dot-point outline of your plan for the session for your use.</li>\n<li>Annotations using Comments with scholarly references to provide evidence and justification of addressing the following:</li>\n<li>Demonstrate your knowledge and understanding of research into how (primary) students learn and the implications for teaching.</li>\n<li>Demonstrate knowledge and understanding of the concepts, substance and structure of the content and teaching strategies of the teaching areas: ICT and your chosen STEAM area.</li>\n<li>Implementing ICT as part of expanding STEAM-related curriculum learning opportunities for primary students.</li>\n<li>Plan lesson sequences using knowledge of student learning, content and effective teaching strategies as applied to teachers as learners.</li>\n<li>Demonstrate a range of verbal and non-verbal communication strategies to support student (i.e., teachers as learners) engagement.</li>\n<li>Demonstrate the capacity to organise classroom activities and provide clear directions for your teachers as learners.</li>\n<li>(3) Session materials (unlimited)</li>\n<li>Include materials created for use during the session (e.g., handouts, slides, posters, etc.) or readable images thereof.</li>\n<li>Optional: You may create annotations using Comments to further support addressing the points in 2.</li>\n<li>(4) Work log (~1 page)</li>\n<li>Create work log providing evidence of collaboration and fair distribution of effort during the task.</li>\n<li>See Group Work policy below.</li>\n<li>(5) References (unlimited)</li>\n<li>Create a reference list for all works cited</li>\n<li>Use APA format.</li>\n</ul>\n<p><strong>Submission</strong></p>\n<p>One group member submits the full document (i.e., 2-5 above) in Word or PDF form via Blackboard. Each other group member submits a single page stating the composition of the group and indicating the group member who submitted the full document.</p>\n<p><strong>Group Work Policy</strong></p>\n<p>You will receive a single group mark for this task, as all group members should collaborate and fairly contribute to completing this assessment task. However, exceptions can be made in the event of group dysfunction. If your group is experiencing dysfunction, it is your responsibility to promptly bring this to the attention of the course coordinator, who will then support the group to attempt to respectfully resolve the issues. If no timely group resolution is found, the course coordinator can take steps including, but not limited to:</p>\n<ol>\n<li>Assigning new working arrangements for task completion, including re-grouping and/or requiring students to work individually</li>\n<li>Deducting one grade from the overall group score for student(s) who the course coordinator determine(s) to be responsible for the dysfunction, using evidence from the work log and / or communications with students</li>\n</ol>\n<p><strong>Criteria &amp; Weighting</strong></p>\n<p>Please refer to the accompanying criteria sheet posted on Blackboard.</p>\n<p><strong>Page Limit / Word Count Note</strong></p>\n<p>Due to the nature of this task, the page limits and word counts are recommendations, not strict requirements. However, being concise contributes to Communication.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit the assessment electronically via Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Design Activities: Evaluate, Reflect, Adapt",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>40% 1500 words </dd>",
            "due_date": "<dd><p> 17/04/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L06",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Length: ~</strong>1500 words</p>\n<p><strong>Task Context</strong></p>\n<p>For this assignment, we will operate on the assumption that you may join a primary school with a makerspace when you eventually become a teacher. When you do this, you should be prepared to use the tools and technologies in the makerspace to implement activities with your students that are hands-on, innovative, and connected to the Australian Curriculum: Technologies. With this in mind, we will tour UQ's makerspace, UQ Innovate, and explore the tools and technologies available for use. We will follow by using those tools and technologies to create personalised artefacts. </p>\n<p><strong>Task Description</strong></p>\n<p>Working in pairs, your task is to use some combination of digital and physical tools available in UQ Innovate to create a personalised artefact. While all of the tools and technologies in the makerspace will be available for you to use, it is recommended that you focus on creating an artefact using the 3D printers, laser cutters, or vinyl cutter. Examples of personalised artefacts include, 3D printed phone holders, laser cut earrings, and unique laptop stickers. After you create your personalised artefact, you will: (a) reflect on the experience of creating a personalised artefact in the makerspace, (b) evaluate your personalised artefact in relation to one of the three kinds of thinking in the Australian Curriculum: Technologies (e.g., systems thinking, design thinking, computational thinking), and (c) adapt the core ideas of your activity in the makerspace for use in a primary classroom. When we meet for class on Thursday, April 17th, please bring your personalised artefact to share it with your classmates in a round robin activity. Be prepared to speak about the tools you used and the processes you engaged in to create your personalised artefact. </p>\n<p>In addition to creating a personalised artefact in UQ's makerspace, you will will also produce ~1500 words of text. In this text, you should:</p>\n<ul>\n<li>(a) Reflect on the experience. For this part of the task, consider the following prompts: </li>\n<li>What tools and technologies did you use to create your personalised artefact?</li>\n<li>What was it like to do work in the makerspace? What issues did you have when creating your product? How did you solve those issues? </li>\n<li>Describe how you grew your technological pedagogical content knowledge (TPACK) during the time you spent in UQ's makerspace. Please use evidence from your activity in the makerspace (e.g., pictures of digital and/or physical artefacts) to support your claims.</li>\n<li>(b) Evaluate your artefact in relation to one of the three kinds of thinking in the Australian Curriculum: Technologies. For this part of the task, consider the following prompts:</li>\n<li>Describe the work flow that you followed to create your personalised artefact.</li>\n<li>Explain how creating your personalised artefact facilitated engaging with systems thinking, design thinking, or computational thinking. Be sure to make concrete connections to the Technologies curriculum in this section. </li>\n<li>(c) Adapt core ideas of the activity for primary classroom use. For this part of the task, consider the following prompts: </li>\n<li>Explain 1-2 adaptations to your experience so that it could become appropriate for primary students.</li>\n<li>Provide 1-2 examples of how you will account for safe, ethical, and responsible use of technology during the adapted activities.</li>\n</ul>\n<p><strong>Submission</strong></p>\n<p>One group member should submit the full document in Word or PDF form via Blackboard. The document should include the names of both group members. </p>\n<p><strong>Criteria &amp; Weighting</strong></p>\n<p>Please refer to the accompanying criteria sheet posted on Blackboard.</p>\n<p><strong>Page Limit / Word Count Note</strong></p>\n<p>A range of word count is intentionally permitted; however, the expectation is for concise writing.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit the assessment electronically via Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Digital Technologies Unit Plan Foundations",
            "special_indicators": [],
            "weighting": "<dd>30% 2500 words </dd>",
            "due_date": "<dd><p> 12/06/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Length: ~</strong>2500 words of student-generated content (i.e., excludes template, AC quotes, appendices, and references (if applicable)) + unlimited annotations</p>\n<p><strong>Task Context</strong></p>\n<p>Effective learning and teaching in any subject area requires skilful planning. Unit plans prepared by teachers guide them through a logical and effective sequence for the development of children’s technical skills, conceptual ideas, and knowledge and understanding of a subject. For this assessment task, you will prepare the foundations of a unit plan for the integrated teaching of Technologies and supply annotations which explain and justify your choices regarding learning and teaching activities and strategies.</p>\n<p><strong>Task Description</strong></p>\n<p>Your task is to develop an inquiry-based Technologies unit plan using the template provided. The main content is to be from the Technologies Curriculum (Design or Digital) but the unit should also integrate subject matter from one additional STEAM subject. You must also include annotations explaining your decisions and alignment with assessment criteria. In the body of your unit plan, explicitly attend to items such as:</p>\n<ul>\n<li>Unit plan essentials – title, year level, length of unit, concise overview</li>\n<li>Australian Curriculum: Technologies and relevant integrated content to be addressed</li>\n<li>Australian Curriculum: General Capabilities (e.g., literacy, numeracy, ICT) and Cross-Curriculum Priorities (e.g., sustainability)</li>\n<li>Differentiation and responsiveness</li>\n<li>Assessment</li>\n<li>Phases of teaching and learning sequence, organised by Design Process phases</li>\n<li>Outlines of inquiry-based lesson activities</li>\n<li>Lists and descriptions of lesson resources and materials</li>\n<li>General goals and specific objectives</li>\n<li>Safety considerations (as needed)</li>\n</ul>\n<p>You are not required to develop complete and detailed lesson plans for this unit. Instead, concise outlines should identify the key objectives and activities of each lesson. Learning experiences should be developmentally appropriate, enable student agency for creative decision-making and expression, and be intellectually engaging. Ideas explored in course workshops and related materials should be evident in the unit plan and annotations. The sources for any ideas, strategies, activities, resources, and justifications should be acknowledged and appropriately referenced using APA Style.</p>\n<p>You must also include two types of concise annotations in an accompanying word document (or using the comments feature in Word). The first type of annotation should provide details of your decision-making in planning sequenced learning experiences pertaining to:</p>\n<ul>\n<li>Diverse student knowledge(s), experiences, characteristics, and cultures</li>\n<li>Understanding of how students learn</li>\n<li>Content knowledge and pedagogical content knowledge for Technologies and the integrated STEAM subject</li>\n<li>Integrating subjects and linking to general capabilities and cross-curriculum priorities</li>\n<li>Formal and informal assessment of student learning for diagnostic, formative, and summative purposes</li>\n<li>Sequencing lessons informed by curriculum, assessment, and reporting knowledge</li>\n<li>Setting appropriate and varied learning goals</li>\n<li>Differentiation and responsiveness to support inclusive participation</li>\n<li>Selection and use of appropriate resources</li>\n</ul>\n<p>When possible, these annotations should also link applications in this assessment task with important ideas from the course.</p>\n<p>The second type of annotation should draw attention to key passages where you believe you have addressed the assessment task criteria and explain your perceptions of how you met the criteria to the degree specified.</p>\n<p><strong>Submission</strong></p>\n<p>Submit the assessment electronically via Blackboard. Please use .docx or .doc format.</p>\n<p><strong>Criteria &amp; Weighting</strong></p>\n<p>Please refer to the accompanying criteria sheet posted on Blackboard.</p>\n<p><strong>Page Limit / Word Count Note</strong></p>\n<p>Due to the nature of this assessment task, the word count is a recommendation, not a strict requirement. However, being concise is part of the Communication criterion. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit the assessment electronically via Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>What Is Technology?</strong><br><p>We will begin to explore key ideas and perspectives related to technology and technology education.</p>\n<p>ACTIVITY: Hex bug playground</p>\n<p>LAUNCH: AT1</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L05</p></div></td>",
            "topic_title": "<strong>What Is Technology?</strong>",
            "topic_description": "What Is Technology? We will begin to explore key ideas and perspectives related to technology and technology education. ACTIVITY: Hex bug playground LAUNCH: AT1",
            "learning_outcomes": [
                "L01",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Perspectives on Technology</strong><br/><p>We will examine the links between technology and culture and consider how to integrate appropriate technology into primary school lessons.</p>\n<p>ACTIVITY: Shadow puppets and/or stop-motion animation</p></p><p><strong>Learning outcomes:</strong> L02, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Perspectives on Technology</strong>",
            "topic_description": "Perspectives on Technology We will examine the links between technology and culture and consider how to integrate appropriate technology into primary school lessons. ACTIVITY: Shadow puppets and/or stop-motion animation",
            "learning_outcomes": [
                "L02",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The Changing Face of Technologies Education</strong><br/><p>We will explore the relationship between technology and other STEM subjects within the Australian Curriculum.</p>\n<p>ACTIVITY: Smart phone sound amplification system</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>The Changing Face of Technologies Education</strong>",
            "topic_description": "The Changing Face of Technologies Education We will explore the relationship between technology and other STEM subjects within the Australian Curriculum. ACTIVITY: Smart phone sound amplification system",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Professional Learning Session Presentations</strong><br/><p>We will present our Professional Learning Sessions and give constructive feedback to our classmates.</p>\n<p>ACTIVITY: Professional learning sessions</p>\n<p>DUE: AT1</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Professional Learning Session Presentations</strong>",
            "topic_description": "Professional Learning Session Presentations We will present our Professional Learning Sessions and give constructive feedback to our classmates. ACTIVITY: Professional learning sessions DUE: AT1",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>UQ Innovate Tour and Orientation</strong><br/><p>We will do a tour and orientation at UQ Innovate (UQ's makerspace) and begin our multi-week collaborative Design Process: Design and Technologies experience.</p>\n<p>ACTIVITY: UQ Innovate tour</p>\n<p>LAUNCH: AT2</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>UQ Innovate Tour and Orientation</strong>",
            "topic_description": "UQ Innovate Tour and Orientation We will do a tour and orientation at UQ Innovate (UQ's makerspace) and begin our multi-week collaborative Design Process: Design and Technologies experience. ACTIVITY: UQ Innovate tour LAUNCH: AT2",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Technologies Education Curriculum</strong><br/><p>We will explore the Australian Curriculum: Technologies and continuing our multi-week collaborative Design Process: Design and Technologies experience.</p>\n<p>ACTIVITY: 2D and 3D design tutorial</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L06</p></div></td>",
            "topic_title": "<strong>Technologies Education Curriculum</strong>",
            "topic_description": "Technologies Education Curriculum We will explore the Australian Curriculum: Technologies and continuing our multi-week collaborative Design Process: Design and Technologies experience. ACTIVITY: 2D and 3D design tutorial",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Independent/Group Makerspace Work Time</strong><br/><p>We will use this time to get access to UQ Innovate and create our artefacts using the tools in the space.</p>\n<p>ACTIVITY: Makerspace work time</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L06</p></div></td>",
            "topic_title": "<strong>Independent/Group Makerspace Work Time</strong>",
            "topic_description": "Independent/Group Makerspace Work Time We will use this time to get access to UQ Innovate and create our artefacts using the tools in the space. ACTIVITY: Makerspace work time",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L06"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Understanding Design and Technologies</strong><br/><p>We will explore the relationship between the design and technologies strands in the Australian Curriculum.</p>\n<p>ACTIVITY 1: Sharing personalised artefacts</p>\n<p>ACTIVITY 2: Cool Maker mock unit plan</p>\n<p>DUE: AT2 (also bring your personalised artefact to share)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Understanding Design and Technologies</strong>",
            "topic_description": "Understanding Design and Technologies We will explore the relationship between the design and technologies strands in the Australian Curriculum. ACTIVITY 1: Sharing personalised artefacts ACTIVITY 2: Cool Maker mock unit plan DUE: AT2 (also bring your personalised artefact to share)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-Semester Break</strong><br/><p>Mid-Semester Break: No class. </p></p></div></td>",
            "topic_title": "<strong>Mid-Semester Break</strong>",
            "topic_description": "Mid-Semester Break Mid-Semester Break: No class.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Intelligent Use of AI in Primary Classrooms</strong><br/><p>We will explore ways in which teachers and students can use generative AI productively in classrooms. </p>\n<p>ACTIVITY: Using AI to build rubrics and help manage classrooms </p></p><p><strong>Learning outcomes:</strong> L01, L04, L06</p></div></td>",
            "topic_title": "<strong>Intelligent Use of AI in Primary Classrooms</strong>",
            "topic_description": "Intelligent Use of AI in Primary Classrooms We will explore ways in which teachers and students can use generative AI productively in classrooms. ACTIVITY: Using AI to build rubrics and help manage classrooms",
            "learning_outcomes": [
                "L01",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Understanding Digital Technologies</strong><br/><p>We will investigate how and where digital technologies are present in the Australian Curriculum.<br/>ACTIVITY: Bee Bots and Scratch<br/>LAUNCH: AT3</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Understanding Digital Technologies</strong>",
            "topic_description": "Understanding Digital Technologies We will investigate how and where digital technologies are present in the Australian Curriculum. ACTIVITY: Bee Bots and Scratch LAUNCH: AT3",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Design Process and Pedagogies</strong><br><p>We will examine the nature of creativity and its connection to the design process in the Australian Curriculum. </p>\n<p>ACTIVITY: Sphero robots</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Design Process and Pedagogies</strong>",
            "topic_description": "Design Process and Pedagogies We will examine the nature of creativity and its connection to the design process in the Australian Curriculum. ACTIVITY: Sphero robots",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Pedagogies and Planning Part I</strong><br><p>We will discuss inquiry-based pedagogies and reflect on best practices for implementing technologies instruction. </p>\n<p>ACTIVITY 1: Design thinking</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L06</p></div></td>",
            "topic_title": "<strong>Pedagogies and Planning Part I</strong>",
            "topic_description": "Pedagogies and Planning Part I We will discuss inquiry-based pedagogies and reflect on best practices for implementing technologies instruction. ACTIVITY 1: Design thinking",
            "learning_outcomes": [
                "L01",
                "L02",
                "L06"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Pedagogies and Planning Part II</strong><br/><p>We will continue our discussions related to best practices in technologies education. We will also explore the Digital Technologies Hub.</p>\n<p>ACTIVITY: Unit plan brainstorming session</p>\n<p>ACTIVITY 2: Drone storytelling</p>\n<p>AT3: Due June 12th</p></p><p><strong>Learning outcomes:</strong> L01, L04, L05</p></div></td>",
            "topic_title": "<strong>Pedagogies and Planning Part II</strong>",
            "topic_description": "Pedagogies and Planning Part II We will continue our discussions related to best practices in technologies education. We will also explore the Digital Technologies Hub. ACTIVITY: Unit plan brainstorming session ACTIVITY 2: Drone storytelling AT3: Due June 12th",
            "learning_outcomes": [
                "L01",
                "L04",
                "L05"
            ]
        }
    ]
}