{
    "course_title": "An Introduction to the Science of Learning in Practice",
    "study_period": "Sem 1 2025",
    "location": "External",
    "attendance": "Online",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC7079-21449-7520",
    "full_course_code": "EDUC7079-21449-7520",
    "course_code": "EDUC7079",
    "class_code": "21449",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Reflect upon and explain how the science of learning informs their own learning and/or practice"
        },
        {
            "number": "LO2.",
            "description": "Assess the value and relevance of the science of learning principles to their own and others’ learning and wellbeing"
        },
        {
            "number": "LO3.",
            "description": "Design contextually relevant applications of the science of learning to address an authentic problem of practice"
        },
        {
            "number": "LO4.",
            "description": "Critique and collate a variety of educational resources that evidence the science of learning principles and research"
        },
        {
            "number": "LO5.",
            "description": "Review literature and communicate findings to a wider audience"
        },
        {
            "number": "LO6.",
            "description": "Implement science of learning principles into meaningful applied contexts"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Annotated Bibliography on Topic of Interest",
            "special_indicators": [],
            "weighting": "<dd>30% 1500-2000 words </dd>",
            "due_date": "<dd><p> 11/04/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>EDUC7079: An Introduction to the Science of Learning in Practice</p>\n<p>Assessment 1: Annotated Bibliography</p>\n<p><strong>Weighting:</strong>       30%</p>\n<p><strong>Due Date:</strong>         Friday April 11, 2025, 2pm</p>\n<p><strong>Length: </strong>            1500-2000 words (6-8 resources)</p>\n<p><strong>The Aim of the Assessment: </strong>To curate an AI-supported annotated bibliography of quality resources and literature related to a Science of Learning inquiry question.</p>\n<p><strong>SEE TASK SHEET FOR FULL TASK DETAILS</strong></p>\n<p><strong>Task Outline:</strong></p>\n<p><strong><em>Step 1: Devise and clearly state your Inquiry Question</em></strong></p>\n<p>Devise an inquiry question on a topic of interest related to the Science of Learning and your own teaching, learning, or working context. This question is to be drafted in class and shared with the lecturer for feedback.</p>\n<p><br/></p>\n<p><strong>Step 2: Curate Annotated Bibliography.</strong> <strong>(approx. 100 words per resource)<em>: </em></strong>Generate and curate an annotated bibliography of 6-8 QUALITY sources using AI that can assist in answering this question. Your annotated bibliography needs to include the following for each source:</p>\n<p>a)   <strong>Full Citation</strong>: This should be in APA 7 (Not included in word count).</p>\n<p>b)   <strong>Aims/ Research Questions and/ or Research Problem: </strong>Outline of the aims/ questions of the article/ research.</p>\n<p>c)   <strong>Description of the methodology</strong>:<strong> </strong>This should include a brief description of the research methods used including details of participants, research design, measures, analysis.</p>\n<p>d)   <strong>Summary of Main Ideas/ Findings/ Arguments</strong>: A brief overview of the main findings or arguments presented in the source</p>\n<p>e)   You must include the AI prompts that you use to generate your bibliography (include in Appendix – not included in word count).</p>\n<p>You must also ensure that you <strong>read and revise each AI-generated annotation</strong> to check for accuracy and relevance to your inquiry question. This means thoroughly and critically reading and engaging with each of the resources you have curated for inclusion in your annotated bibliography.</p>\n<p><br/></p>\n<p><strong>Step 3: Evaluation and Justification (approx. 100 words per resource)</strong>. Once your bibliography is generated, you need to (<strong>without</strong> the assistance of AI):</p>\n<p><strong>Evaluate the quality and reliability</strong> of the sources and content generated by AI, and <strong>justify the inclusion</strong> of each source in your final annotated bibliography (i.e. provide a rationale for why it is a valuable resource in relation to your inquiry question).</p>\n<p><br/></p>\n<p><strong>Step 4: Synthesis (approx. 100 words). </strong>Draw on the sources and their content to compose a brief synthesised response to your inquiry question.</p>\n<p><br/></p>\n<p><strong>Step 5: Reflection (approx. 100 words). </strong>Reflect on your personal learning about the topic and about sourcing quality literature through completing this task. This may include a critical reflection of gaps in your own knowledge and understanding of concepts or methodological processes that have been addressed in the literature included in your bibliography.</p>\n<p><strong><em> </em></strong></p>\n<p><strong>Presentation</strong></p>\n<p>The presentation of your Annotated Bibliography can be in a format that is relevant and useful to you, but must address all parts of the task as outlined above.</p>\n<p><br/></p>\n<p>No more than 3 resources can be from the EDUC7079 Reading List, but you may not present an annotation that has been developed by the class participants or lecturer.</p>\n<p><br/></p>\n<p>This task will be assessed on the quality and relevance of the curated resources to your context and inquiry question, and on the quality of the critical evaluations and justifications for the sources inclusion in your curated list, and on your personal reflections of learning in this task (see Criteria Sheet for details). </p>\n<p><strong>Please see Task Sheet for full details.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via TurnItIn</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Leading the Science of Learning in Practice",
            "special_indicators": [],
            "weighting": "<dd>35% 1500-2000 words or equivalent </dd>",
            "due_date": "<dd><p> 9/05/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Essay/ Critique, Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>EDUC7079: An Introduction to the Science of Learning in Practice</p>\n<p>Assessment 2: Leading the Science of Learning</p>\n<p><strong>Weighting:</strong>       35%</p>\n<p><strong>Due Date:</strong>         Friday May 9, 2025, 2pm</p>\n<p><strong>Length: </strong>             1500-2000 words (or equivalent media presentation)</p>\n<p><br/></p>\n<p><strong>The Aim of the Assessment: </strong>to present a response to a stimulus question that informs others about the contributions that the learning sciences can make to support school or organisational leader decision making. </p>\n<p><br/></p>\n<p><strong>The Task:</strong> </p>\n<p>In this task you are required to draw on resources and readings from within this course and additional resources to form a response to a stimulus question about leading the Science of Learning in either educational or workplace learning contexts. The purpose of your response is to inform your audience about the contributions that the Science of Learning can make to support school or organisational leader decision making. In the interests of authenticity, the intended audience will be simulated as a school or organisational leadership team, which allows for direct transfer of this assessment task to the practice of professional learning and capability improvement within schools or other organisations. </p>\n<p><br/></p>\n<p><strong>Guiding question</strong></p>\n<p><strong><em>How can insights from the Science of Learning make us better leaders of learning in our organisations?</em></strong></p>\n<p>Drawing upon research, use the following sub questions to develop your response.:</p>\n<ul>\n<li><strong>Learning Context and Challenge: </strong>Describe your context in which this task is being situated. This might be a school, educational, training, or workplace learning context, but it must be specific to you. Describe whose learning you are leading in this context – it does not have to be in a formal leadership role (students, peers, teachers, trainers, others).</li>\n<li>What is a learning need or challenge in this context that you would like to lead positive change in?   </li>\n<li><strong>Rationale:</strong> Why could it be beneficial to you as a learning leader to engage with research from the Science of Learning to understand and address the identified learning need or challenge? </li>\n<li><strong>Challenges: </strong>What are some challenges outlined in the literature that might prevent you as a learning leader from engaging with research from the Science of Learning? </li>\n<li><strong>Framing Problems: </strong>How can the Science of Learning help you as a learning leader to frame problems in your educational or workplace contexts?</li>\n<li><strong>Reviewing Evidence: </strong>How can you as a learning leader draw upon the Science of Learning to review evidence in the literature and in your context?</li>\n<li><strong>Taking action:</strong> How can you as a learning leaders use a Science of Learning approach to take action and lead learning in your team/ class/ organisation?</li>\n</ul>\n<p><br/></p>\n<p><strong>SEE TASK SHEET FOR FULL DETAILS OF THE TASK</strong></p>\n<p><br/></p>\n<p><br/></p>\n<p> </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via TurnItIn</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Professional Reflection and Application",
            "special_indicators": [],
            "weighting": "<dd>35% 1500-2000 words </dd>",
            "due_date": "<dd><p> 9/06/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>EDUC7079: An Introduction to the Science of Learning in Practice</p>\n<p>Assessment 3: Professional Reflection and Applications to Practice</p>\n<p><br/></p>\n<p><strong>Weighting:</strong>       35%</p>\n<p><strong>Due Date:</strong>         Monday 9th June, 2025, 2pm</p>\n<p><strong>Length: </strong>             1500-2000 words (or approx. 10 minutes if Audio Visual option selected)</p>\n<p><br/></p>\n<p><strong>The Aim of the Assessment: </strong>To reflect on the key learnings across the course and present a final reflection on the implications of the Science of learning for your own professional learning and your practice.</p>\n<p><strong>SEE TASK SHEET FOR FULL DETAILS</strong></p>\n<p><strong>The Task:</strong> This task requires you to reflect on your learning and how it has evolved and draw upon this to consider ways to translate the Science of Learning into your professional practice, now or in the future. </p>\n<p> </p>\n<p>In this task you are required to respond to the following: </p>\n<p>1.   Reflect on key ideas from the course and describe one overarching Science of Learning principle or concept that has resonated with you as a learner, teacher, trainer, and/or as a leader of learning, drawing on relevant literature explored in the course to support your discussion of this principle and why it is important to you.</p>\n<p>2.   What teaching, learning, or leadership need or challenge is the principle or concept intended to address in your context and what are the mechanisms to support this, drawing on evidence from the literature to explain these mechanisms? </p>\n<p>3.   Explain how this principle or concept could be applied into your practice, identifying what some of the implementation or mobilisation challenges might be, and how you could overcome or mitigate these. </p>\n<p>4.   Describe ways in which you could evaluate the impact (gather evidence) of the above principle or concept in your context (refer to Module 4 in particular). </p>\n<p>5.   How has your understanding of the Science of Learning and its application to practice evolved over the course?</p>\n<p>6.   How could you draw upon the Science of Learning to sustain <em>your</em> professional growth and learning beyond this course?</p>\n<p><br/></p>\n<p>The task can be presented as a written response, a video, or an audio presentation. </p>\n<p>A draft of your key principle/ concept and of your responses to questions 2, 3 and 4 will be shared in the weekly workshop in Weeks 12 and 13 for peer and lecturer feedback.  </p>\n<p>The tone of the response can be conversational but must utilise quality academic references, cited using APA 7 style. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 1 - Introduction to the SoL in Practice</strong><br><p>Students will be introduced to the Science of Learning in Practice, including some key overarching principles from the field and the science underpinning them. We will explore current definitions of the Science of Learning. They will be introduced to the purpose and value of meta-learning and reflective tasks, and provided with an overview of the course and assessments.</p></br></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Module 1 - Introduction to the SoL in Practice</strong>",
            "topic_description": "Module 1 - Introduction to the SoL in Practice Students will be introduced to the Science of Learning in Practice, including some key overarching principles from the field and the science underpinning them. We will explore current definitions of the Science of Learning. They will be introduced to the purpose and value of meta-learning and reflective tasks, and provided with an overview of the course and assessments.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 1: The factors involved in how people learn</strong><br><p>WEEK 2: In the second week of Module 2, students will have the chance to develop their understanding of the science of learning research that underpins our understanding of how people learn and the factors that affect learning. We will draw from research across the key disciplines of the science of learning and explore learning in educational and workplace contexts.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Module 1: The factors involved in how people learn</strong>",
            "topic_description": "Module 1: The factors involved in how people learn WEEK 2: In the second week of Module 2, students will have the chance to develop their understanding of the science of learning research that underpins our understanding of how people learn and the factors that affect learning. We will draw from research across the key disciplines of the science of learning and explore learning in educational and workplace contexts.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 1: Applying the SoL into practice</strong><br><p>WEEK 3: In the final week of Module 1 students will focus on some important principles of the science of learning and how these can be applied into practice, and consider these within wider holistic learning frameworks in different learning contexts including educational and workplace environments.</p></br></p></div></td>",
            "topic_title": "<strong>Module 1: Applying the SoL into practice</strong>",
            "topic_description": "Module 1: Applying the SoL into practice WEEK 3: In the final week of Module 1 students will focus on some important principles of the science of learning and how these can be applied into practice, and consider these within wider holistic learning frameworks in different learning contexts including educational and workplace environments.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 2: Diving Deep into the SoL</strong><br><p>WEEK 4: Module 2 will focus on building deep understanding in individually identified topics. In Week 1, students will identify a topic of particular interest for individual exploration, and be introduced to ways to narrow scope of an investigation.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Module 2: Diving Deep into the SoL</strong>",
            "topic_description": "Module 2: Diving Deep into the SoL WEEK 4: Module 2 will focus on building deep understanding in individually identified topics. In Week 1, students will identify a topic of particular interest for individual exploration, and be introduced to ways to narrow scope of an investigation.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 2: Diving Deep into the SoL</strong><br><p>WEEK 5: This week students will be focusing on developing skills in sourcing, evaluating and annotating quality resources relevant to their focus area.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Module 2: Diving Deep into the SoL</strong>",
            "topic_description": "Module 2: Diving Deep into the SoL WEEK 5: This week students will be focusing on developing skills in sourcing, evaluating and annotating quality resources relevant to their focus area.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 2: Diving Deep into the SoL</strong><br><p>WEEK 6: In this final week of Module 2 students will be developing their skills in the evaluation of sources and how these can be communicated in a way that is useful for an educational context. There will be a focus on completing Assessment 1 and some links to reflective questions in Assessment 3.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Module 2: Diving Deep into the SoL</strong>",
            "topic_description": "Module 2: Diving Deep into the SoL WEEK 6: In this final week of Module 2 students will be developing their skills in the evaluation of sources and how these can be communicated in a way that is useful for an educational context. There will be a focus on completing Assessment 1 and some links to reflective questions in Assessment 3.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 3: Leading the SoL in Practice</strong><br><p>WEEK 7: This week we will explore current models of leadership in educational and workplace contexts, with a particular emphasis on Instructional and Transformational Leadership. We will then examine how selected models of learning leadership fit with principles from the Science of Learning. This week provides the context for Assessment 2 by examining leadership within the lens of the Science of Learning.</p></br></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Module 3: Leading the SoL in Practice</strong>",
            "topic_description": "Module 3: Leading the SoL in Practice WEEK 7: This week we will explore current models of leadership in educational and workplace contexts, with a particular emphasis on Instructional and Transformational Leadership. We will then examine how selected models of learning leadership fit with principles from the Science of Learning. This week provides the context for Assessment 2 by examining leadership within the lens of the Science of Learning.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Assessment 1</strong><br><p>Annotated Bibliography due</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Assessment 1</strong>",
            "topic_description": "Assessment 1 Annotated Bibliography due",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 3: Leading the SoL in Practice</strong><br><p>WEEK 8: In the second week of Module 3 we will explore one of the fundamentals of learning leadership in the Science of Learning ﾖ problem framing. We will examine how learning leaders frame problems and set objectives. We will also recap the use of evidence in making informed decisions as learning leaders. The focus on problem framing and examining evidence is mapped directly to Assessment 2.<br/>Readings/Ref: Tokuhama 2019 ;</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Module 3: Leading the SoL in Practice</strong>",
            "topic_description": "Module 3: Leading the SoL in Practice WEEK 8: In the second week of Module 3 we will explore one of the fundamentals of learning leadership in the Science of Learning ﾖ problem framing. We will examine how learning leaders frame problems and set objectives. We will also recap the use of evidence in making informed decisions as learning leaders. The focus on problem framing and examining evidence is mapped directly to Assessment 2. Readings/Ref: Tokuhama 2019 ;",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-Semester break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-Semester break</strong>",
            "topic_description": "Mid-Semester break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 3: Leading the SoL in Practice</strong><br><p>WEEK 9: This week we will examine how learning leaders can be informed by principles of the Science of Learning when they take action. We will explore some useful frameworks for leading learning in educational and workplace contexts, with explicit links made to Knowledge of these Science of Learning actions will be transferred to Assessment 2.</p>\n<p>Readings/Ref: Darling 2020 ;</p></br></p></div></td>",
            "topic_title": "<strong>Module 3: Leading the SoL in Practice</strong>",
            "topic_description": "Module 3: Leading the SoL in Practice WEEK 9: This week we will examine how learning leaders can be informed by principles of the Science of Learning when they take action. We will explore some useful frameworks for leading learning in educational and workplace contexts, with explicit links made to Knowledge of these Science of Learning actions will be transferred to Assessment 2. Readings/Ref: Darling 2020 ;",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Independent Study Week - Week 10</strong><br><p>Independent Study Week</p></br></p></div></td>",
            "topic_title": "<strong>Independent Study Week - Week 10</strong>",
            "topic_description": "Independent Study Week - Week 10 Independent Study Week",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 4: Evaluating the SoL in practice</strong><br><p>WEEK 11: In Module 4, we will start to delve deeper into the barriers and enablers for mobilising science of learning research into real-world practice.</p></br></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Module 4: Evaluating the SoL in practice</strong>",
            "topic_description": "Module 4: Evaluating the SoL in practice WEEK 11: In Module 4, we will start to delve deeper into the barriers and enablers for mobilising science of learning research into real-world practice.",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 4: Evaluating the SoL in practice</strong><br><p>WEEK 12: This week we will take a look at some common ways in which research in the science of learning is conducted, and do a quick tour of some methodologies and analysis techniques that are frequently utilised in science of learning research. The aim of this week will be to build up student knowledge of common qualitative and quantitative methods so as to continue to develop individual efficacy around how to critically engage with and mobilise knowledge into your own context.</p>\n<p><br/></p></br></p></div></td>",
            "topic_title": "<strong>Module 4: Evaluating the SoL in practice</strong>",
            "topic_description": "Module 4: Evaluating the SoL in practice WEEK 12: This week we will take a look at some common ways in which research in the science of learning is conducted, and do a quick tour of some methodologies and analysis techniques that are frequently utilised in science of learning research. The aim of this week will be to build up student knowledge of common qualitative and quantitative methods so as to continue to develop individual efficacy around how to critically engage with and mobilise knowledge into your own context.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The SoL in Practice - a reflection</strong><br><p>WEEK 13: The final week of the course will synthesise the 4 modules and key ideas from each. It will also be an opportunity to share ideas and engage in dialogue with peers about how the key learnings can be applied in practice.</p></br></p></div></td>",
            "topic_title": "<strong>The SoL in Practice - a reflection</strong>",
            "topic_description": "The SoL in Practice - a reflection WEEK 13: The final week of the course will synthesise the 4 modules and key ideas from each. It will also be an opportunity to share ideas and engage in dialogue with peers about how the key learnings can be applied in practice.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Exam week 1(09 Jun - 15 Jun)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Assessment 3</strong><br><p>Professional Reflection and Application</p></br></p></div></td>",
            "topic_title": "<strong>Assessment 3</strong>",
            "topic_description": "Assessment 3 Professional Reflection and Application",
            "learning_outcomes": []
        }
    ]
}