{
    "course_title": "Teaching Humanities and Social Sciences Curriculum",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC3707-20013-7520",
    "full_course_code": "EDUC3707-20013-7520",
    "course_code": "EDUC3707",
    "class_code": "20013",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (17/02/2025 - 14/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate substantive content knowledge and deep understanding of the concepts, dispositions, skills and inquiry processes required for effective contemporary learning and teaching of the Humanities and Social Sciences, Cross Curriculum Priorities (Aboriginal and Torres Strait Islander Histories and Cultures, Asia and Australia's engagement with Asia, and Sustainability), and identified General Capabilities (Critical and Creative thinking, Personal and Social Capability, Ethical Understanding, and Intercultural Understanding) across the primary school years."
        },
        {
            "number": "LO2.",
            "description": "Show broad knowledge and understanding of, and respect for Aboriginal and Torres Strait Islander histories, cultures and languages in ways that evidence the ability to promote reconciliation between Indigenous and non-Indigenous Australians."
        },
        {
            "number": "LO3.",
            "description": "Select and organise content, teaching strategies and resources including the use of Information and Communication Technology suitable for students with diverse linguistic, cultural, religious and socioeconomic backgrounds including Aboriginal and Torres Strait Islander students."
        },
        {
            "number": "LO4.",
            "description": "Demonstrate the ability to individually and collaboratively set goals, plan, develop, deliver learning experiences (e.g., organise classroom activities and provide clear directions), employ different assessment strategies (e.g., diagnostic, observation, consultation, peer/self, focused analysis, formative and summative assessment), and reflect on and use feedback to improve learning and teaching sequences in the Humanities and Social Sciences Learning Area."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate knowledge and understanding of literacy and numeracy teaching strategies and their application in the Humanities and Social Sciences Learning Area."
        },
        {
            "number": "LO6.",
            "description": "Describe a range of effective strategies to meaningfully engage parents in the Humanities and Social Sciences curriculum to maximise education outcomes for students, parents and teachers."
        },
        {
            "number": "LO7.",
            "description": "Demonstrate clear, fluent and coherent communication skills consistent with personal, professional and academic conventions in traditional and digital texts."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Theory to Practice Essay",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>30% 1500 words </dd>",
            "due_date": "<dd><p> 11/04/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L07",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Rationale</strong></p>\n<p>This assessment is designed to give preservice teachers the opportunity to thoughtfully and reflexively link their HaSS teaching with the range of evidence-based strategies and research, with a particular focus on ensuring the learning needs of Aboriginal and Torres Strait Islander students are met. The assessment allows pre-service teachers an opportunity to engage with HaSS teaching theory as established in the set readings and contribute meaningfully to the question of how to turn theory into classroom practice. </p>\n<p> </p>\n<p><strong>Task</strong></p>\n<p>Preservice teachers must choose one (1) of the following sub-strands of the Australian Curriculum: HASS and associated set readings below:</p>\n<ul>\n<li>Teaching History in HaSS | Reynolds (2019). <em>History</em> (Chapter 7), pp. 256-303.</li>\n<li>Teaching Geography in HaSS | Reynolds (2019). <em>Geography</em> (Chapter 6), pp.198-255.</li>\n<li>Teaching Economics and Business in HaSS | Reynolds (2019). <em>Economics and Business</em> (Chapter 5), p. 172-197.</li>\n<li>Teaching Civics in HaSS | Reynolds (2019). <em>Civics and Citizenship</em> (Chapter 4), pp. 144-171.</li>\n</ul>\n<p><br/></p>\n<p>Write a 1500-word essay of your chapter and discussion, being guided by the following questions:</p>\n<p><br/></p>\n<p><em>Part A: Theory to Practice</em></p>\n<ul>\n<li>What are the <strong>key themes/learning theories</strong> present in your chosen chapter, how can teachers <strong>practically incorporate</strong> these into a primary school classroom, and what <strong>challenges</strong> might they face?</li>\n</ul>\n<p><br/></p>\n<p><em>Part B: Aboriginal and Torres Strait Islander Students</em></p>\n<ul>\n<li>What <strong>postcolonial education strategies</strong> might primary teachers use for ensuring the learning needs of Aboriginal and Torres Strait Islander students in your sub-strand are met, and which allows for all students to deepen their knowledge of Aboriginal and Torres Strait Islander Histories and Cultures?</li>\n</ul>\n<p> </p>\n<p><em>The task is considered the equivalent of a 1500 word written assignment.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The essay is to be individually submitted via Blackboard on the due date. Please ensure all submitted materials are clearly identified with preservice teacher name/s and number/s on each page.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Co-Teaching Demonstration",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>30% 1500 words </dd>",
            "due_date": "<dd><p> 9/04/2025 - 28/05/2025</p>\n<p>\n</p><p>Weeks 7 - 13 as negotiated in Week 1.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L07",
            "mode": "Activity/ Performance",
            "category": "Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Rationale</strong></p>\n<p>The aim of EDUC3707 is to develop the knowledge, dispositions and skills required to plan, teach and assess the Humanities and Social Sciences (HaSS) curriculum in primary school classrooms. To achieve this aim, preservice teachers are encouraged to improve their practice by building collaborative relationships with others while adopting a critically reflective attitude toward their work. By combining these aspects, this assessment is designed to give preservice teachers an authentic experience of using the Australian Curriculum to improve their pedagogy and meet the Australian Professional Standards for Teachers through planning, delivering and reflecting on an appropriate HaSS classroom activity. </p>\n<p><br/></p>\n<p><strong>Task</strong></p>\n<p>In groups of four, preservice teachers are required to collaborate to research, design, organise and ultimately co-teach a highly engaging <strong>25-minute learning activity</strong> on a specified topic/concept that links directly to their group’s Group Unit Plan (Assessment Task 3). Note: this aspect of the assignment is not a presentation but a “hands-on” activity that matches the target year level as outlined in the Group Unit Plan. Preservice teacher peers will act as students of that year level throughout the activity. Each group is also required to produce a <strong>1-page lesson plan</strong> using the supplied template found in the EDUC3707 Assessment Planning template to show how their classroom activity fits within the broader lesson focus. </p>\n<p><br/></p>\n<p>During the classroom activity, individual preservice teachers are required to demonstrate their knowledge of the HaSS topic/concept, their advancement of relevant HaSS learning objectives, the use of inquiry-driven, constructivist pedagogy for teaching in HaSS, and appropriate classroom management strategies (e.g. clear instructions, questioning techniques, confidence and enthusiasm) to encourage inclusive participation and effectively engage their peers.</p>\n<p><br/></p>\n<p>Following the classroom activity, preservice teachers are required to write a <strong>critical reflection of 500 words</strong> that analyses the benefits and challenges they experienced while working collaboratively on their co-teaching demonstration, and in light of the informal feedback they will receive from peers. This reflection must also draw on the literature surrounding collaborative teaching practice, including the Australian Professional Standards for Teachers (APST). </p>\n<p><br/></p>\n<p><strong>Groups must ensure technical issues (e.g. IT) are resolved prior to completing their co-teaching demonstration. </strong></p>\n<p><br/></p>\n<p><em>The task is considered the equivalent of a 1500 word written assignment.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Groups will be scheduled to complete their activity during tutorials between (and including) the above due dates. The one-page lesson plan (group) is due the same day and must be individually submitted by 2:00pm via Blackboard. </p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Group Unit Plan",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>40% 2500 words </dd>",
            "due_date": "<dd><p> 9/06/2025 2:00 pm</p>\n<p>\n</p><p>Students have the opportunity to submit a DRAFT Unit Plan (Curriculum Alignment) in Week 10 in order to be provided feedback on their Unit Plan progress.  </p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07",
            "mode": "Written",
            "category": "Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Rationale</strong></p>\n<p>Critical and creative thinking, enhanced through professional collaboration, is an essential aspect of effective teaching and learning in the Humanities and Social Sciences Learning Area (HaSS). Nowhere is this aspect of teaching more important than when creating HaSS unit plans. The unit plan is the most important curriculum pivot upon which all teacher practice rests, providing an essential link between the intended curriculum (in this case, the official Australian Curriculum: HaSS) and the enacted curriculum (teaching in the classroom). This assessment task is designed to provide preservice teachers with practical opportunities to demonstrate how students’ conceptual understanding can be developed creating a unit of work for use by teachers in primary school HaSS classrooms. </p>\n<p><br/></p>\n<p><strong>Task</strong></p>\n<p>Using the relevant Australian Curriculum documents for HaSS, preservice teachers are required to work in groups of four to design and plan a well-sequenced HaSS unit (8 weeks). To encourage a deep and narrow approach to planning, preservice teachers will be asked to choose content descriptors for one particular year level (e.g. Year 5) and sub-strand (e.g. Geography). In developing the unit, preservice teachers are required to demonstrate knowledge of a range of effective inquiry-based, constructivist teaching and assessment strategies. These strategies need to incorporate ways to make purposeful connections with other curriculum priorities such as literacy and numeracy; cater for diversity including Aboriginal and Torres Strait Islander students; use a range of essential resources including ICTs; and encourage parent-school-community communication.</p>\n<p><br/></p>\n<p>The DRAFT Unit Plan <strong>(1-page)</strong> will include:</p>\n<p><br/></p>\n<p>A <strong>Curriculum Alignment </strong>of the unit. This is an overview that indicates how the unit plan will align with the Australian Curriculum: HaSS, including:</p>\n<p><br/></p>\n<ul>\n<li>Relevant sub-strand and year-level content descriptors (from the knowledge and understanding strand)</li>\n<li>Eight focus questions (based on the content descriptors)</li>\n<li>Summative assessment synopsis</li>\n<li>Field trip proposal.</li>\n</ul>\n<p><br/></p>\n<p><strong>The FINAL Unit Plan must be designed using the template provided on Blackboard, and will include:</strong></p>\n<p><br/></p>\n<p>1.     <strong>Unit rationale (1-page) </strong>which briefly details:</p>\n<ul>\n<li>School context (the learner profile, community milieu, school culture and priorities)</li>\n<li>HaSS mandates, demonstrating fidelity to the Australian Curriculum (including content descriptors, achievement standard, General Capabilities, and Cross Curriculum Priorities</li>\n<li>Pedagogical approach which explains and justifies the application of inquiry-based, constructivist teaching strategies used in the unit. </li>\n</ul>\n<p>Your unit rationale must be referenced using correct APA7 format. Your unit rationale must be completed as a GROUP.</p>\n<p><br/></p>\n<p>2.     <strong>Curriculum Alignment</strong> (1-page) which briefly details the school context, the community milieu, and the pedagogical approach that informs the unit. Note well, this section of your unit plan should be developed from the DRAFT curriculum alignment submitted earlier. Your curriculum alignment must be completed as a GROUP. </p>\n<p><br/></p>\n<p>3.     <strong>Summative assessment task</strong> (1-page) for the unit that includes student task sheet. Ensure the assessment task tests students’ knowledge of relevant HaSS content, aligns with learning objectives (based on the standards matrix) and which is suitable in scope and scale for the age-cohort in question. Your summative assessment task must be completed as a GROUP.</p>\n<p><br/></p>\n<p>4.     <strong>Standards Matrix</strong> (A-E criteria sheet) that aligns with Australian Curriculum: HaSS (Version 9.0) Achievement Standard for your relevant year level. Your standards matrix must be completed INDIVIDUALLY. </p>\n<p><br/></p>\n<p>5.     <strong>Teaching and learning sequence</strong> detailing the phases of the unit, including focus questions, learning objectives, key content to be taught, the application of General Capabilities and Cross Curriculum Priorities, essential resources (including ICTs) to assist teachers’ individual planning, and sample learning activities. The teaching and learning sequence must be completed as a GROUP. </p>\n<p><br/></p>\n<p>6.     <strong>A letter to parents/carers</strong> (1-page) designed to facilitate engagement by encouraging parental participation in their child’s HaSS learning, building effective parent-school-community relationships, and including information about, and a justification for, the proposed field trip. The parent letter must be completed as a GROUP.</p>\n<p><br/></p>\n<p><em>The task is considered the equivalent of a 2500 word written assignment. </em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>One group representative (as allocated in the tutorial) must submit the <strong>DRAFT Curriculum Alignment </strong>to Blackboard by 2:00pm on Friday of Week 10. Preservice teachers should each individually submit the <strong>FINAL Unit Plan</strong> to Blackboard by 2:00pm on the due date (Monday of Exam Week 1).</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 01 | Intro to Humanities and Social Sciences</strong><br><p>This lecture invites students to revisit their own experiences as a student learning HaSS (or HSIE or SOSE or Social Science or Social Studies!). We will then complete a vivisection of the</p>\n<p>Australian Curriculum and consider its strengths and weaknesses in light of the criticisms and commentary that have been made about HaSS in Australia and abroad. APST: 1.2, 2.1, 2.2, 2.3, 3.1, 3.2, 3.3, 3.4, 4.2, 6.2.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 01 | Intro to Humanities and Social Sciences</strong>",
            "topic_description": "Week 01 | Intro to Humanities and Social Sciences This lecture invites students to revisit their own experiences as a student learning HaSS (or HSIE or SOSE or Social Science or Social Studies!). We will then complete a vivisection of the Australian Curriculum and consider its strengths and weaknesses in light of the criticisms and commentary that have been made about HaSS in Australia and abroad. APST: 1.2, 2.1, 2.2, 2.3, 3.1, 3.2, 3.3, 3.4, 4.2, 6.2.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 02 | Inquiry Teaching and Learning in HaSS</strong><br><p>This lecture will encourage preservice teachers to consider the deep-rooted place of inquiry learning and teaching in HaSS. We will consider some key phases of inquiry-based learning and teaching and explore how we as teachers can leverage off students' innate curiosity to make learning authentic and engaging. APST: 1.2, 2.1, 2.2, 2.3, 3.1, 3.2, 3.3, 3.4, 4.2, 6.2.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06, L07</p></div></td>",
            "topic_title": "<strong>Week 02 | Inquiry Teaching and Learning in HaSS</strong>",
            "topic_description": "Week 02 | Inquiry Teaching and Learning in HaSS This lecture will encourage preservice teachers to consider the deep-rooted place of inquiry learning and teaching in HaSS. We will consider some key phases of inquiry-based learning and teaching and explore how we as teachers can leverage off students' innate curiosity to make learning authentic and engaging. APST: 1.2, 2.1, 2.2, 2.3, 3.1, 3.2, 3.3, 3.4, 4.2, 6.2.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>WEEK 03 | Constructivist Learning in HaSS (Lecture)</strong><br><p>Constructivism is the bedfellow of inquiry-based learning. For many teachers, to teach through a constructivist lens means breaking with not only their own experiences at school, but with wide held and over-exposed traditional approaches to teaching. In this lecture we will consider constructivist strategies that build student capacity, while perhaps most importantly, showing them that learning can be an important path towards empowerment. APST: 1.2, 2.1, 2.2, 2.3, 3.1, 3.2, 3.3, 3.4, 4.2, 6.2.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>WEEK 03 | Constructivist Learning in HaSS (Lecture)</strong>",
            "topic_description": "WEEK 03 | Constructivist Learning in HaSS (Lecture) Constructivism is the bedfellow of inquiry-based learning. For many teachers, to teach through a constructivist lens means breaking with not only their own experiences at school, but with wide held and over-exposed traditional approaches to teaching. In this lecture we will consider constructivist strategies that build student capacity, while perhaps most importantly, showing them that learning can be an important path towards empowerment. APST: 1.2, 2.1, 2.2, 2.3, 3.1, 3.2, 3.3, 3.4, 4.2, 6.2.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>WEEK 04 | Post-colonial Approach to HaSS</strong><br><p>HaSS is perhaps the one subject area that consistently, even stubbornly, requires students to look at the world beyond their local horizon. This lecture introduces a post-colonial approach to teaching that will help teachers align with the Cross Curriculum priorities of including Indigenous perspectives and engaging with Asia. APST: 1.3, 1.4, 2.1, 2.2, 2.4, 2.5, 3.2, 6.2, 6.3.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>WEEK 04 | Post-colonial Approach to HaSS</strong>",
            "topic_description": "WEEK 04 | Post-colonial Approach to HaSS HaSS is perhaps the one subject area that consistently, even stubbornly, requires students to look at the world beyond their local horizon. This lecture introduces a post-colonial approach to teaching that will help teachers align with the Cross Curriculum priorities of including Indigenous perspectives and engaging with Asia. APST: 1.3, 1.4, 2.1, 2.2, 2.4, 2.5, 3.2, 6.2, 6.3.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 05 | Critical Pedagogy in HaSS</strong><br><p>Perhaps more than any other subject area, HaSS has been subject to the slings and arrows of various ideological pundits who would use HaSS to further their visions for society. Building on our Week 3 focus on post-colonialism, in this lecture we will consider how a teacher might take a 'critical turn' in their teaching to help students develop dispositions towards peace, sustainability, democracy and justice.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06, L07</p></div></td>",
            "topic_title": "<strong>Week 05 | Critical Pedagogy in HaSS</strong>",
            "topic_description": "Week 05 | Critical Pedagogy in HaSS Perhaps more than any other subject area, HaSS has been subject to the slings and arrows of various ideological pundits who would use HaSS to further their visions for society. Building on our Week 3 focus on post-colonialism, in this lecture we will consider how a teacher might take a 'critical turn' in their teaching to help students develop dispositions towards peace, sustainability, democracy and justice.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 06 | Teaching History in HaSS (Lecture)</strong><br><p>This lecture considers the place of History as a discrete sub-strand of the Australian Curriculum: HaSS with its own theory and tradition. The lecture looks at the place of sources and evidence in ensuring high quality inquiry learning. APST: 1.2, 1.4, 2.1, 2.2, 2.3, 2.4, 2.5, 3.1, 3.2, 3.3, 3.4, 4.2.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Week 06 | Teaching History in HaSS (Lecture)</strong>",
            "topic_description": "Week 06 | Teaching History in HaSS (Lecture) This lecture considers the place of History as a discrete sub-strand of the Australian Curriculum: HaSS with its own theory and tradition. The lecture looks at the place of sources and evidence in ensuring high quality inquiry learning. APST: 1.2, 1.4, 2.1, 2.2, 2.3, 2.4, 2.5, 3.1, 3.2, 3.3, 3.4, 4.2.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>WeeK 08 | Teaching Civics &amp; Citizenship in HaSS</strong><br><p>This lecture explores the place of Civics and Citizenship in the Australian Curriculum: HaSS. We will consider how the teaching of civics and citizenship provides students' opportunities to explore their rights and responsibilities as citizens which are the foundation of our Australian democracy. APST: 1.2, 1.3, 2.1, 2.2, 2.3, 2.4, 2.5, 3.1, 3.2, 3.3, 3.4, 4.2, 6.2, 6.3.</p></br></p></div></td>",
            "topic_title": "<strong>WeeK 08 | Teaching Civics &amp; Citizenship in HaSS</strong>",
            "topic_description": "WeeK 08 | Teaching Civics & Citizenship in HaSS This lecture explores the place of Civics and Citizenship in the Australian Curriculum: HaSS. We will consider how the teaching of civics and citizenship provides students' opportunities to explore their rights and responsibilities as citizens which are the foundation of our Australian democracy. APST: 1.2, 1.3, 2.1, 2.2, 2.3, 2.4, 2.5, 3.1, 3.2, 3.3, 3.4, 4.2, 6.2, 6.3.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-semester Break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-semester Break</strong>",
            "topic_description": "Mid-semester Break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 09 | Teaching Economics &amp; Business in HaSS</strong><br><p>There is little doubt that we are \"living in a material world\" (Ciccone, 1984). In this lecture we will explore the Economics and Business sub-strand of the Australian Curriculum: HaSS and consider how students might become better equipped to navigate the sometimes predatory world of consumerism. APST: 1.2, 1.3, 2.1, 2.2, 2.3, 2.4, 2.5, 3.1, 3.2, 3.3, 3.4, 4.2, 6.2, 6.3.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Week 09 | Teaching Economics &amp; Business in HaSS</strong>",
            "topic_description": "Week 09 | Teaching Economics & Business in HaSS There is little doubt that we are \"living in a material world\" (Ciccone, 1984). In this lecture we will explore the Economics and Business sub-strand of the Australian Curriculum: HaSS and consider how students might become better equipped to navigate the sometimes predatory world of consumerism. APST: 1.2, 1.3, 2.1, 2.2, 2.3, 2.4, 2.5, 3.1, 3.2, 3.3, 3.4, 4.2, 6.2, 6.3.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10 | Experiential Learning in HaSS</strong><br><p>This lecture explores an approach to teaching called experiential learning. Because HaSS has such a focus on personal and social capacity, empathy and intercultural understanding, an experiential approach gives students insight into considering real-life problems in real-life contexts using their lived experience as a catalyst for refection and change. APST: 1.2, 1.3, 1.4, 2.1, 2.2, 2.3, 2.4, 3.1, 3.2, 3.3, 3.4, 3.7, 4.2, 6.2, 6.3.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 10 | Experiential Learning in HaSS</strong>",
            "topic_description": "Week 10 | Experiential Learning in HaSS This lecture explores an approach to teaching called experiential learning. Because HaSS has such a focus on personal and social capacity, empathy and intercultural understanding, an experiential approach gives students insight into considering real-life problems in real-life contexts using their lived experience as a catalyst for refection and change. APST: 1.2, 1.3, 1.4, 2.1, 2.2, 2.3, 2.4, 3.1, 3.2, 3.3, 3.4, 3.7, 4.2, 6.2, 6.3.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11 | Values Clarification in HaSS</strong><br><p>We continue our lecture series on the Australian Curriculum: HaSS with an exploration into the teaching of values. There will be a specific focus on teaching controversial issues, a dihcult and sometimes high-stakes activity which is central to effective HaSS teaching. APST: 1.2, 1.3, 1.4, 2.1, 2.2, 2.3, 2.4, 2.5, 3.1, 3.2, 3.3, 3.4, 3.7, 5.1, 6.2, and 6.3.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 11 | Values Clarification in HaSS</strong>",
            "topic_description": "Week 11 | Values Clarification in HaSS We continue our lecture series on the Australian Curriculum: HaSS with an exploration into the teaching of values. There will be a specific focus on teaching controversial issues, a dihcult and sometimes high-stakes activity which is central to effective HaSS teaching. APST: 1.2, 1.3, 1.4, 2.1, 2.2, 2.3, 2.4, 2.5, 3.1, 3.2, 3.3, 3.4, 3.7, 5.1, 6.2, and 6.3.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12 | Education for Sustainability in HaSS</strong><br><p>For most primary teachers, there will come a time when integrating the sub-strands of HaSS unit will make the most sense. Sustainability education is one way to integrate various sub-strands of HaSS while at the same time ensuring authentic engagement with another key Cross Curriculum Priority. Perhaps more than any other subject area, HaSS has a responsibility to work with students to consider how we might quickly move towards a sustainable future. APST: 1.3, 1.4, 2.1, 2.2, 2.4, 2.5, 3.3, 6.2, 6.3.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 12 | Education for Sustainability in HaSS</strong>",
            "topic_description": "Week 12 | Education for Sustainability in HaSS For most primary teachers, there will come a time when integrating the sub-strands of HaSS unit will make the most sense. Sustainability education is one way to integrate various sub-strands of HaSS while at the same time ensuring authentic engagement with another key Cross Curriculum Priority. Perhaps more than any other subject area, HaSS has a responsibility to work with students to consider how we might quickly move towards a sustainable future. APST: 1.3, 1.4, 2.1, 2.2, 2.4, 2.5, 3.3, 6.2, 6.3.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13 | Futures Education in HaSS</strong><br><p>It is an inescapable truism that a study of the world is a sometimes frightening proposition for our young students. It is beholden on us as teachers to keep the spring of hope flowing in our young charges, despite the challenges that society unquestionably faces. Hope leads to action, and action leads to change. We will conclude our course with a concerted effort to consider how young people view their futures. We will explore how introducing a futures education, and tapping into the vein of utopia, are important ways we might \"make hope practical, and despair unconvincing\" (Aronowitz &amp; Giroux, 1985). APST: 1.3, 1.4, 2.1, 2.2, 2.4, 2.5, 3.3, 6.2, 6.3.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 13 | Futures Education in HaSS</strong>",
            "topic_description": "Week 13 | Futures Education in HaSS It is an inescapable truism that a study of the world is a sometimes frightening proposition for our young students. It is beholden on us as teachers to keep the spring of hope flowing in our young charges, despite the challenges that society unquestionably faces. Hope leads to action, and action leads to change. We will conclude our course with a concerted effort to consider how young people view their futures. We will explore how introducing a futures education, and tapping into the vein of utopia, are important ways we might \"make hope practical, and despair unconvincing\" (Aronowitz & Giroux, 1985). APST: 1.3, 1.4, 2.1, 2.2, 2.4, 2.5, 3.3, 6.2, 6.3.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}