{
    "course_title": "Dilemmas of Development: Risks of Youth",
    "study_period": "Sem 1 2025",
    "location": "External",
    "attendance": "Online",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC7000-21003-7520",
    "full_course_code": "EDUC7000-21003-7520",
    "course_code": "EDUC7000",
    "class_code": "21003",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Consider adolescent development through a range of theoretical models and frameworks of human development."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate some knowledge and understanding of the complex interplay between biological, cognitive and psychosocial developments in adolescence especially as they relate to behaviour and identity formation."
        },
        {
            "number": "LO3.",
            "description": "Consider adolescence as a rapid transitional period for young people and demonstrate some understanding of the salience of this in working with young people."
        },
        {
            "number": "LO4.",
            "description": "Identify how parents, families, peers, schools, communities and contemporary culture affect adolescent development and behaviour."
        },
        {
            "number": "LO5.",
            "description": "Identify some social, economic and cultural factors in contemporary Australia and how these create particular stresses for adolescents today."
        },
        {
            "number": "LO6.",
            "description": "Demonstrate some knowledge of the practices and programs in relation to working with adolescents in relation to both normative, problematic and developmental behaviours."
        },
        {
            "number": "LO7.",
            "description": "Better understand the subsequent dilemmas and risks young people deal with in transitioning to adulthood."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Essay Plan",
            "special_indicators": [],
            "weighting": "<dd>20% 1000 words </dd>",
            "due_date": "<dd><p> 24/03/2025 2:00 pm</p></dd>",
            "learning_objectives": "L02, L03, L04",
            "mode": "Written",
            "category": "Product/ Design",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Assessment 1: Essay Plan </strong></p>\n<p><strong>Description:</strong></p>\n<p>This assignment represents the planning stage for Assessment 3 which aims to develop your theoretical and empirical understanding of a chosen adolescent dilemma in a major socialisation context (family, peers, school or community). The Essay Plan will engage you with the literature and analysis process of an adolescent dilemma and offers a feedback opportunity in the planning stages of your major essay.</p>\n<p><br/></p>\n<p><strong>The aim of the Essay Plan is to:</strong></p>\n<ul>\n<li>Select an adolescent dilemma that interests you. You should choose a topic covered in this course and do some initial reading on the risks and challenges on the dilemma of interest.</li>\n<li>Plan a set of specific questions to guide your larger project.</li>\n<li>Identify relevant scholarly resources, including at least one theoretical paper (that puts forward an explanation for the dilemma) and at least one empirical article investigating an intervention for your chosen dilemma in context.</li>\n<li>Write a short synthesis review of each reading.</li>\n</ul>\n<p><br/></p>\n<p><strong>Your Essay Plan must include:</strong></p>\n<p><strong>Introduction</strong> (approx. 100-150 words). A short description of your topic, that is, the adolescent dilemma and the context (e.g., you might choose to investigate suicide prevention in the school context)</p>\n<p><strong>Research Questions</strong> (approx. 100-150 words). Develop a clearly articulated set of questions that you will address in your essay for Assessment 3.</p>\n<ul>\n<li>For example, if your topic was to investigate suicide prevention in schools:</li>\n</ul>\n<ol>\n<li>What are the risks facing adolescents in relation to suicide and suicidal thoughts/ideation? (include definitions)</li>\n<li>Does suicide ideation differ for males/females or across ages (younger vs older adolescents)?</li>\n<li>Is suicide ideation more pronounced in specific socioeconomic and/or cultural groups? Is it related to media, policy changes, sexuality and young people?</li>\n<li>What theory or theories have been proposed to explain suicide ideation in adolescence?</li>\n<li>What school-based initiatives or prevention programs have been deployed based on this theory or these theories?</li>\n<li>What have studies investigating the efficacy of these interventions found? i.e., are the programs effective?</li>\n<li>What are the limitations and/or strengths of these programs or the research?</li>\n<li>What are the practical implications of the research? i.e., the take-home messages.</li>\n</ol>\n<p><strong>Theory article</strong> (approx. 300-400 words). Include the following:</p>\n<ul>\n<li>Citation details in APA 7th edition format</li>\n<li>A short statement that explains the theory, a brief summary of the theory’s main assumptions and/or suggestions, and an evaluative comment to describe how the theory will fit into the research topic you chose (i.e., description of usefulness or relevance of the information for your chosen topic)</li>\n</ul>\n<p><strong>Empirical article </strong>(approx. 300-400 words). Include the following:</p>\n<ul>\n<li>Citation details in APA 7th edition format. </li>\n<li>A brief one paragraph summary of the study i.e., theory the work was premised on (hint: hopefully the theory you reviewed above). The summary should typically include NO MORE THAN ONE SENTENCE on each of the following: participants, intervention, control or waitlist condition, findings, strengths/limitations, directions for future research, practical implications. Do NOT include headings in the summary of the empirical study.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students must upload their reflection by 2pm on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Poster - Child Behaviour or Development Issue",
            "special_indicators": [],
            "weighting": "<dd>35% 1500 words </dd>",
            "due_date": "<dd><p> 14/04/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Poster",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Assessment 2: Poster - Child Behaviour or Development Issue</strong></p>\n<p><strong>Description:</strong></p>\n<p>This assignment involves identifying a question about some aspect of child behaviour or development that might interest parents attending an orientation night at a local high school. There are lots of ways to come up with an appropriate question. For example:</p>\n<p>·        Do some basic research to identify trending topics in education or psychology.</p>\n<p>·        Reflect on your own high school journey. What challenges did your parents have about your behaviour or development?</p>\n<p>·        Reflect of what your concerns might be if you were a parent of an adolescent today e.g., stress management, academic pressure, social dynamics, technology use.</p>\n<p>·        Talk to a person who has regular contact with a child or adolescent (e.g., teacher, parent).</p>\n<p>Your task is to design and prepare a poster which is suitable to be displayed at a ‘Parents’ Orientation Night’, therefore your audience are parents whose child (aged approx. 12-13 years) is commencing high school. Your poster must be written in non-technical (i.e., lay-person) language.</p>\n<p>The list of potential questions is endless, but here are some examples:</p>\n<p>•     How can I encourage open communication with my child while respecting their independence?</p>\n<p>•     How can I help my child find a healthy balance of screen time for schoolwork, social media, and fun?</p>\n<p>•     How can I encourage my child to develop good time management and study habits?</p>\n<p>•     What strategies can I use to ensure my child gets enough quality sleep in their teenage years?</p>\n<p><br/></p>\n<p><strong>The aim of the assignment is to:</strong></p>\n<p>•     Identify an appropriate question (just one question) for parents of children commencing high school.</p>\n<p>•     Design a poster which is interesting, informative, easy-to-read and has visual impact.</p>\n<p>•     Prepare a poster which contains information to answer the question, provides implications for parents, and includes references and resources to help a parent navigate the sometimes- difficult period of adolescence. </p>\n<p><br/></p>\n<p><strong>Your poster must:</strong></p>\n<p>•     Make a professional (and aesthetic) impression</p>\n<p>•     Be prepared in PowerPoint A0 size</p>\n<p>•     Have a clear heading which identifies the question your poster is addressing</p>\n<p>•     Be divided into clearly recognisable segments or subheadings</p>\n<p>•     Contain body text which is written in non-technical (i.e., lay-person) language</p>\n<p>•     Contain neatly arranged graphic elements and an appropriate colour scheme</p>\n<p>•     Provide sufficient and scientifically sound information to answer the question</p>\n<p>•     Contain references and resources for further reading </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students must upload their reflection by 2pm on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Essay - Adolescent Dilemma in Context",
            "special_indicators": [],
            "weighting": "<dd>45% 3000 words </dd>",
            "due_date": "<dd><p> 26/05/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Assessment 3: Essay - Adolescent Dilemma in Context</strong></p>\n<p><strong>Topic:   </strong>       Chosen by student </p>\n<p><strong>Description:</strong></p>\n<p>This assignment completes your plan from Assessment 1, to investigate and report on a specific and relevant adolescent dilemma in a socialisation context (family, peers, school or community). You should synthesise relevant theories and empirical literature to understand the dilemma in context.</p>\n<p><br/></p>\n<p><strong>The aim of the Essay is to:</strong></p>\n<ul>\n<li>Investigate an adolescent dilemma in context. Assessment 1 required you to select an appropriate dilemma; Assessment 3 requires you to complete the investigation.</li>\n<li>Critically review the theoretical and empirical literature and answer the research questions you planned (and received feedback on) in Assessment 1.</li>\n<li>Draw clear conclusions summarizing the main points of your investigation</li>\n</ul>\n<p><br/></p>\n<p><strong>Your Essay must include:</strong></p>\n<p><strong>Introduction</strong> (approx. 200 words). This can be an edited version of your original description from Assessment 1, including definitions and rationale. </p>\n<p><strong>Research Questions</strong> (as appropriate for each question). Address a set of comprehensive questions proposed in Assessment 1, edited where necessary. Covert your questions into subheadings and provide a thorough analyses of the theoretical and empirical literature for the dilemma in context. See also Essay Plan Task and Criteria Sheet for more details. </p>\n<p><strong>Conclusion</strong> (approx. 200 words). Draw logical conclusions from the literature regarding the directions for future research and practical implications for your findings.</p>\n<p><strong>References</strong> (as required). References must be used throughout your essay and listed in APA 7th edition format.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students must upload their reflection by 2pm on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1 - Introduction</strong><br><p>This week will provide an overview of the course content and assessment requirements. We will also begin our learning journey as we examine adolescence from an historical perspective, and define adolescence within a contemporary biological, social, and cultural context.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Week 1 - Introduction</strong>",
            "topic_description": "Week 1 - Introduction This week will provide an overview of the course content and assessment requirements. We will also begin our learning journey as we examine adolescence from an historical perspective, and define adolescence within a contemporary biological, social, and cultural context.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2 - Early life development</strong><br><p>This week introduces some of the major biological influences and early nurturing experiences, genes, gestation, birth, attachment theory and parenting styles.</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L07</p></div></td>",
            "topic_title": "<strong>Week 2 - Early life development</strong>",
            "topic_description": "Week 2 - Early life development This week introduces some of the major biological influences and early nurturing experiences, genes, gestation, birth, attachment theory and parenting styles.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L07"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3 - Adverse childhood experiences</strong><br><p>This week we investigate the effects of trauma, complex trauma, adverse childhood experiences, impact on adolescent learning, and examine trauma informed classrooms.</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 3 - Adverse childhood experiences</strong>",
            "topic_description": "Week 3 - Adverse childhood experiences This week we investigate the effects of trauma, complex trauma, adverse childhood experiences, impact on adolescent learning, and examine trauma informed classrooms.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4 - Theoretical perspectives</strong><br><p>This week introduces some of the major theoretical perspectives of adolescence, taking a particular emphasis on Bronfenbrenner's ecological framework of human development. We also examine the approach of Positive Youth Development (PYD).</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Week 4 - Theoretical perspectives</strong>",
            "topic_description": "Week 4 - Theoretical perspectives This week introduces some of the major theoretical perspectives of adolescence, taking a particular emphasis on Bronfenbrenner's ecological framework of human development. We also examine the approach of Positive Youth Development (PYD).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5 - Adolescence - biology and neurology</strong><br><p>This week we investigate the cognitive changes that occur during adolescence, and the implications of this development on the young person. We will cover historical theories of adolescent cognitive development and the emerging neurobiological model for adolescent cognitive development.</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Week 5 - Adolescence - biology and neurology</strong>",
            "topic_description": "Week 5 - Adolescence - biology and neurology This week we investigate the cognitive changes that occur during adolescence, and the implications of this development on the young person. We will cover historical theories of adolescent cognitive development and the emerging neurobiological model for adolescent cognitive development.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6 - Adolescence - identity</strong><br><p>This week we explore the formation of identity, development of self-concept, self-esteem, and autonomy. We examine social transitions, the role of peers and social media.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Week 6 - Adolescence - identity</strong>",
            "topic_description": "Week 6 - Adolescence - identity This week we explore the formation of identity, development of self-concept, self-esteem, and autonomy. We examine social transitions, the role of peers and social media.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7 - Adolescent mental health I</strong><br/></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Week 7 - Adolescent mental health I</strong>",
            "topic_description": "Week 7 - Adolescent mental health I",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8 - Adolescent mental health II</strong><br><p>This week provides an introduction to mental health issues for adolescents. It will also discuss common disorders in the Australian context (focus on anxiety &amp; depression) literacy.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L07</p></div></td>",
            "topic_title": "<strong>Week 8 - Adolescent mental health II</strong>",
            "topic_description": "Week 8 - Adolescent mental health II This week provides an introduction to mental health issues for adolescents. It will also discuss common disorders in the Australian context (focus on anxiety & depression) literacy.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L07"
            ]
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid Semester Break</strong><br><p>This week continues to explore mental health issues for adolescents. It will discuss some more common mental health issues (eating disorders, self-harm, suicidality, gaming addiction, substance abuse).</p></br></p></div></td>",
            "topic_title": "<strong>Mid Semester Break</strong>",
            "topic_description": "Mid Semester Break This week continues to explore mental health issues for adolescents. It will discuss some more common mental health issues (eating disorders, self-harm, suicidality, gaming addiction, substance abuse).",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9 - Adolescents at risk</strong><br/><p>Work on Assessment 3</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Week 9 - Adolescents at risk</strong>",
            "topic_description": "Week 9 - Adolescents at risk Work on Assessment 3",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Case-based learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10 - Own Topic</strong><br/><p>This week looks at Australian Indigenous youth, youth from other cultures, and youth with disabilities.</p></p></div></td>",
            "topic_title": "<strong>Week 10 - Own Topic</strong>",
            "topic_description": "Week 10 - Own Topic This week looks at Australian Indigenous youth, youth from other cultures, and youth with disabilities.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11 - School-based suicide prevention</strong><br/><p>This week we examine the problem of youth suicide and explore what schools can do and the importance of mental health literacy.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Week 11 - School-based suicide prevention</strong>",
            "topic_description": "Week 11 - School-based suicide prevention This week we examine the problem of youth suicide and explore what schools can do and the importance of mental health literacy.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12 - Adolescent engagement</strong><br/><p>This week we use theories such as motivation, feedback, goal theory and self-efficacy to investigate ways of engaging adolescents.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Week 12 - Adolescent engagement</strong>",
            "topic_description": "Week 12 - Adolescent engagement This week we use theories such as motivation, feedback, goal theory and self-efficacy to investigate ways of engaging adolescents.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13 - Review</strong><br/><p>This week will be an opportunity to review key concepts and provide a discussion forum.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Week 13 - Review</strong>",
            "topic_description": "Week 13 - Review This week will be an opportunity to review key concepts and provide a discussion forum.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        }
    ]
}