{
    "course_title": "Cross-curricular Perspectives",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC7114-21755-7520",
    "full_course_code": "EDUC7114-21755-7520",
    "course_code": "EDUC7114",
    "class_code": "21755",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Apply concepts and models of curriculum theory within a practical context to demonstrate an understanding of curriculum beyond its conceptualization as a document, plan or content to be taught."
        },
        {
            "number": "LO2.",
            "description": "Compare the organisation of school knowledge in terms of disciplinary and interdisciplinary approaches to curriculum, including the purposes and implications of each."
        },
        {
            "number": "LO3.",
            "description": "Demonstrate insights into curriculum as a political instrument in both historical and contemporary contexts in Australia and abroad."
        },
        {
            "number": "LO4.",
            "description": "Consider the epistemological relationship between knowledge and curriculum and how this relates to the purpose and enactment of curriculum."
        },
        {
            "number": "LO5.",
            "description": "Use concepts from critical theory to inquire into issues of equity, ethics and social implications of choices made in designing and implementing the curriculum."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "'Lived curriculum' journal",
            "special_indicators": [],
            "weighting": "<dd>40% 2000 words </dd>",
            "due_date": "<dd><p> 4/04/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Context</strong></p>\n<p>There are multiple ways to understand and make sense of what we call “the curriculum”. This course invites you to become critical curriculum thinkers. This means unpacking your current curriculum context – what we call your “lived curriculum” – and analysing it, seeing it in another light, and consciously deconstructing it. This requires you to take pause on what you think you know about your current curriculum context and being open to investigating it along different lines to what you are used to. Your \"current curriculum context\" may be the school you are working at, the place you are studying at, or the workplace you will return to once you finish studying. </p>\n<p><strong>Task</strong></p>\n<p>Each week we will discuss different ways to think about curriculum. <strong>Drawing from the weekly readings and ideas discussed in class during weeks 1-5, you are to write 4 x 500 word responses to questions 1-4 listed below. </strong>The questions are in<strong> bold. </strong>There are prompts below each question to help get you started.</p>\n<p><strong>For each of the 4 x 500 word responses, you must have a clear and coherent answer to the question being asked by analysing YOUR OWN current “lived curriculum” context.</strong> In other words, you must read the question and respond to it by analysing and reflecting upon <em>your own</em> current curriculum situation. </p>\n<p>The purpose of this task is for you to:</p>\n<p>(a) Demonstrate understanding of the key curriculum ideas discussed each week</p>\n<p>(b) Analyse and reflect upon your own curriculum context via the prism of ideas discussed each week and</p>\n<p>(c) Write a coherent argument, using supporting evidence, in response to each of the four questions.</p>\n<p>Question 1</p>\n<p>In week 2, you were introduced to multiple ways to define curriculum. <strong>Which of these curriculum conceptualisations best applies to your current context and why?</strong> Make sure you use evidence from your local context to support your claims. In your response, I want you to think deeply about and reflect upon the curriculum culture in your current context.</p>\n<p>In thinking about this question, you may wish to talk with some of your colleagues. You may also wish to read over school documents, local policy papers and/or talk with your students. What kinds of ideas about curriculum dominate, and do you agree with them? If you find them problematic, why? Have any of the ideas you were introduced to in week 2 made you really stop and think about your current curriculum context in a new and/or different way? Have any of the ideas we discussed in weeks 2 affirmed your ideas about your current curriculum context?</p>\n<p>Question 2</p>\n<p><strong>If you had (or have!) the freedom to choose, what kind of curriculum model or curriculum design would you like to implement (trial) and why?</strong></p>\n<p>In week 3, we talked and read about different models of curriculum design that are possible, was there any particular type that caught your attention? Was there any design that you felt you would like to try in your current setting? What learning possibilities could your selected curriculum model generate? What would be productive about it? What would it help to foster and facilitate?</p>\n<p>Question 3</p>\n<p>In week 4, we explored avenues for being more inclusive when assessing student understandings of the curriculum. We explored the ideas of culturally relevant assessment, culturally responsive assessment and socio-culturally responsive assessment, with all three terms being similar in nature.</p>\n<p><strong>Explain what one of these terms means (or what they mean collectively), and whether you think your current curriculum context caters for diversity when assessing student work. Provide evidence and/or examples from your curriculum context to support your response.</strong></p>\n<p>You can think about the teaching area you are trained in, or perhaps the local context you are currently working in (eg. the school that you currently work in). Alternatively, you can think about the state/territory or national level that is relevant to you. I suggest picking just one level (local, state or national) and framing your response in regards to that. </p>\n<p>Question 4</p>\n<p>In week 5, we discussed how curriculum is currently influenced by a range of various stakeholders, not just within Australia but also from organisations around the globe. <strong>Should commercial and/or external-to-the-school interests be allowed to influence curriculum?</strong> <strong>Why/why not? What do you base your argument on?</strong></p>\n<p>In week 5, we discussed many obvious curriculum influences/ers, but are there others within your local site that we didn’t discuss and how do you feel about them having a stake in curriculum decision-making? You may like to discuss commercial interests from business, or perhaps philanthropic groups that make donations. What about alumni associations? Do they influence school curriculum in any way? Does your current school have donors who make their financial contributions contingent on certain expectations? Remember that curriculum isn’t just the ‘intended curriculum’ but also includes the ‘hidden curriculum’ and ‘enacted curriculum’ as well.</p>\n<p><strong>Tips/suggestions</strong></p>\n<p>To help with workload, I suggest you start your lived curriculum journal in week 2 and draft a response each week from there until you have a full 2000 word draft (so 4 x 500 word entries. 1 x 500 word entry for each question). Then, in week 6, take the time to refine, potentially rework and/or edit all of your responses. Your ideas may evolve as we progress through the course, so you may wish to rework some of your responses before you submit. Week 6 is geared toward giving you an opportunity to do this. Making space to reflect on your ideas and arguments is important.</p>\n<p>You are most welcome to talk with your fellow class members about this assignment and share your experiences. Many of you will be currently working in a school, or, temporarily away from working in a school but have classroom experience. This assignment is centered upon you taking the ideas we discuss in class and within readings, and using them as a lens to reflect upon your own curriculum context. Class is thus a curriculum community for us to bounce ideas around. You will, however, be writing your own individual responses.</p>\n<p>Please ensure you stay within the designated word limit. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Making a case for curriculum change",
            "special_indicators": [],
            "weighting": "<dd>60% 3000 words OR a 15min recorded presentation </dd>",
            "due_date": "<dd><p> 29/05/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Oral, Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Context</strong></p>\n<p>You currently work and study in contexts that have and enact particular understandings, either explicitly or implicitly, about curriculum. In this course, we have discussed a range of curriculum issues, some will resonate more with you than others, but regardless, the point of this course is to get you thinking critically and reflectively about them.</p>\n<p><strong>Task</strong></p>\n<p>Your task for assignment 2 is to <strong>make a case for curriculum change in the context you currently find yourself working or studying in.</strong></p>\n<p><strong>You have the choice to present your ‘case for curriculum change’ in either written OR oral format.</strong></p>\n<p>If you choose to submit this assignment in written format, then it needs to be 3000 words in length. If you choose to submit this assignment in oral format, then it needs to be a 15 minute video recorded presentation. Please select only ONE format.</p>\n<p>What you need to do:</p>\n<ol>\n<li><strong>Select a context</strong> that you wish to focus on (your current workplace, the workplace you will be returning to after study, or, this university). Select a context that is relevant to you. For most of you, that will be where you currently work.</li>\n<li><strong>Identify a curriculum change</strong> that you would like to implement. Select a curriculum issue that you are really passionate about. Make sure this is a curriculum issue and not a general education issue (so be guided by the curriculum ideas and debates discussed in class).</li>\n<li><strong>Find information</strong> about the change you wish to make, ensuring this information can be used as supporting evidence. This will likely require you to undertake research via a range of platforms (depending of course on the curriculum change you select to make a case for).</li>\n<li><strong>Analyse the information</strong> you have found and extract key points/ideas.</li>\n<li><strong>Synthesise your ideas</strong> into a main argument with supporting sub-points.</li>\n<li><strong>Create a case</strong> for making the curriculum change.</li>\n<li>Stay within the word or time limit.</li>\n</ol>\n<p><strong>Tips/suggestions</strong></p>\n<p>Select a curriculum change you are genuinely interested in wanting to implement. You are most welcome to be creative and dream big! The possibilities are endless as to what this curriculum change could be. Use the topics we have discussed each week to help inspire you. Perhaps there is a controversial topic you wish to have included in your program of study? Perhaps there is a curriculum model you would like to trial at your school? Is there an influence on curriculum that you would like to see your school or place of study not listen to anymore? Is there an approach to the use of technology in curriculum that you would like to see your school or place of study adopt/stop doing? This assignment is all about you making a case for why your workplace or place of study should take up the curriculum change you are suggesting. How will students, staff or anyone else in your chosen context benefit from your suggested curriculum change? What will it help to improve? Why is this good and/or productive? Make sure you have a main argument and supporting sub-points. Ensure you weave evidence into your response. ‘Evidence’ comes in many forms. Just make sure the evidence you select to use is relevant and commensurate with the points you are making.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Becoming critical curriculum thinkers</strong><br/></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Becoming critical curriculum thinkers</strong>",
            "topic_description": "Becoming critical curriculum thinkers",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Curriculum and its multiple meanings and purposes</strong><br><p>There are so many ways to define and think about this thing that we call 'curriculum'. In this seminar, we explore a multitude of definitions and their histories.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Curriculum and its multiple meanings and purposes</strong>",
            "topic_description": "Curriculum and its multiple meanings and purposes There are so many ways to define and think about this thing that we call 'curriculum'. In this seminar, we explore a multitude of definitions and their histories.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Different curriculum models and designs</strong><br><p>Interdisciplinary, transdisciplinary, cross-disciplinary. There are many ways to design curriculum other than the often dominant disciplinary approaches. In this workshop, we explore a variety of curriculum models and designs used both within Australia and overseas.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Different curriculum models and designs</strong>",
            "topic_description": "Different curriculum models and designs Interdisciplinary, transdisciplinary, cross-disciplinary. There are many ways to design curriculum other than the often dominant disciplinary approaches. In this workshop, we explore a variety of curriculum models and designs used both within Australia and overseas.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Assessing the curriculum</strong><br><p>What are the issues concerning assessment that impact curriculum inclusion? Are tests an effective method for assessing curriculum knowledges and skills? In this workshop, we delve deeply into these questions and more.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Assessing the curriculum</strong>",
            "topic_description": "Assessing the curriculum What are the issues concerning assessment that impact curriculum inclusion? Are tests an effective method for assessing curriculum knowledges and skills? In this workshop, we delve deeply into these questions and more.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Curriculum influences/ers</strong><br><p>Who creates the curriculum? Who influences the curriculum? In this seminar, we will explore the official and unofficial influences/ers on curriculum creation. We explore this at the local level, but we will also cast our gaze toward the international influences that are shaping curriculum development.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Curriculum influences/ers</strong>",
            "topic_description": "Curriculum influences/ers Who creates the curriculum? Who influences the curriculum? In this seminar, we will explore the official and unofficial influences/ers on curriculum creation. We explore this at the local level, but we will also cast our gaze toward the international influences that are shaping curriculum development.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Working on Assignment 1 in class</strong><br/><p>Bring your assignment to class (in-person or online) so you can work on it. You may wish to talk with Christina and/or receive feedback from a peer.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Working on Assignment 1 in class</strong>",
            "topic_description": "Working on Assignment 1 in class Bring your assignment to class (in-person or online) so you can work on it. You may wish to talk with Christina and/or receive feedback from a peer.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Examining the place of technology in curriculum</strong><br/><p>Covid 19 has seen the influence of technology in curriculum enactment become even more pronounced. What is current research saying about the role and place of technology in curriculum design and implementation?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Examining the place of technology in curriculum</strong>",
            "topic_description": "Examining the place of technology in curriculum Covid 19 has seen the influence of technology in curriculum enactment become even more pronounced. What is current research saying about the role and place of technology in curriculum design and implementation?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Decolonising and Indigenising the curriculum</strong><br/><p>Decolonising the curriculum is emphasised in a multitude of ways throughout this course, but this week is especially dedicated to exploring why it is important to, and how we can action, embedding Indigenous ideas, understandings and values into our curriculums.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Decolonising and Indigenising the curriculum</strong>",
            "topic_description": "Decolonising and Indigenising the curriculum Decolonising the curriculum is emphasised in a multitude of ways throughout this course, but this week is especially dedicated to exploring why it is important to, and how we can action, embedding Indigenous ideas, understandings and values into our curriculums.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-Semester Break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-Semester Break</strong>",
            "topic_description": "Mid-Semester Break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Current curriculum contentions and debates</strong><br/><p>In this seminar, we explore the range of State, national and international debates about curriculum that are currently in play.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Current curriculum contentions and debates</strong>",
            "topic_description": "Current curriculum contentions and debates In this seminar, we explore the range of State, national and international debates about curriculum that are currently in play.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>How to plan your curriculum change</strong><br/><p>Hands on session focusing on (a) identifying and selecting the curriculum change you wish to advocate for, and (b) finding relevant research about the curriculum change you wish to implement. BYO device to class! A laptop or tablet is ideal. I strongly recommend selecting a curriculum issue that you genuinely wish to implement in your local context.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>How to plan your curriculum change</strong>",
            "topic_description": "How to plan your curriculum change Hands on session focusing on (a) identifying and selecting the curriculum change you wish to advocate for, and (b) finding relevant research about the curriculum change you wish to implement. BYO device to class! A laptop or tablet is ideal. I strongly recommend selecting a curriculum issue that you genuinely wish to implement in your local context.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Developing your case for curriculum change</strong><br/><p>In this hands on session, we will focus on ensuring you have a strong structure underpinning your case for curriculum change. BYO device! Preferably a laptop or tablet since you will be writing and planning. Also bring along your work in progress thus far.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Developing your case for curriculum change</strong>",
            "topic_description": "Developing your case for curriculum change In this hands on session, we will focus on ensuring you have a strong structure underpinning your case for curriculum change. BYO device! Preferably a laptop or tablet since you will be writing and planning. Also bring along your work in progress thus far.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>New curriculum imaginaries</strong><br/><p>What new curriculum imaginaries are possible?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>New curriculum imaginaries</strong>",
            "topic_description": "New curriculum imaginaries What new curriculum imaginaries are possible?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Working on Assignment 2 in class</strong><br/><p>Bring your assignment to class (either in-person or online) and talk with Christina about it. You may also wish to work with a partner and look over each other's work. You may also wish to use this time to record your presentation (if you are choosing this genre to submit assignment 2 in).</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Working on Assignment 2 in class</strong>",
            "topic_description": "Working on Assignment 2 in class Bring your assignment to class (either in-person or online) and talk with Christina about it. You may also wish to work with a partner and look over each other's work. You may also wish to use this time to record your presentation (if you are choosing this genre to submit assignment 2 in).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}