{
    "course_title": "Teaching English 1",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC7550-21685-7520",
    "full_course_code": "EDUC7550-21685-7520",
    "course_code": "EDUC7550",
    "class_code": "21685",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate research-informed knowledge, understanding and analysis of literacy teaching and assessment strategies and their application in teaching the primary school English Curriculum in ways that enhance inclusive participation of all students including those from diverse backgrounds (linguistic, cultural, religious and socioeconomic). (APST: 1.3, 2.1, 2.2, 2.3, 2.5, 3.1, 3.3, 5.1)"
        },
        {
            "number": "LO2.",
            "description": "Identify teaching strategies that include a range of verbal and non-verbal communication strategies and resources  including ICTs  that support inclusive student participation and engagement in English Curriculum primary classroom activities and learning. (APST: 3.3, 3.4, 3.5, 4.1)"
        },
        {
            "number": "LO3.",
            "description": "Demonstrate the capacity to effectively engage in assessment moderation and interpret student assessment data to evaluate student learning, provide timely and appropriate student feedback, and modify teaching practices to improve student learning. (APST: 5.2, 5.3, 5.4)"
        },
        {
            "number": "LO4.",
            "description": "Demonstrate an understanding of the relevant and appropriate sources of professional learning for primary school English teachers and provide justification for continued professional learning in light of implications for improved student learning and teaching in the English Curriculum Learning Area. (APST: 6.2, 6.4)"
        },
        {
            "number": "LO5.",
            "description": "Demonstrate clear, fluent, and coherent communication skills consistent with personal, professional, and academic conventions."
        }
    ],
    "assessments": [],
    "learning_activities": []
}