{
    "course_title": "Teaching English 2",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC4720-20428-7520",
    "full_course_code": "EDUC4720-20428-7520",
    "course_code": "EDUC4720",
    "class_code": "20428",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Develop a resource portfolio with accompanying rationale for planning, teaching and assessment in English and Literacy based on critical knowledge and understanding of student learning and evidence-based curriculum frameworks in the English Curriculum Learning Area.(APST: 1.2, 2.1, 3.3, 3.4, 4.1, 5.1)"
        },
        {
            "number": "LO2.",
            "description": "Demonstrate the ability to support inclusive student participation and engagement for all students across the full range of abilities including those with diverse backgrounds such as Aboriginal and Torres Strait Islander and English as an Additional Language or Dialect (EAL/D) students.(APST: 1.2, 1.3, 1.4, 1.5, 4.1)"
        },
        {
            "number": "LO3.",
            "description": "Demonstrate critical knowledge and communication skills to analyse, theorise and reflect on effective strategies and practices for learning, teaching, and assessment in English and Literacy in primary schools. (APST: 2.1, 2.5, 3.3, 4.1, 5.1)"
        },
        {
            "number": "LO4.",
            "description": "Identify professional learning needs, set goals, and develop plans for professional learning that include participation in and contribution to professional learning communities to evidence breadth and depth in professional knowledge, understanding, and expertise for learning, teaching, and assessment in English and literacy in primary schools. (APST: 6.1, 6.2, 6.3, 7.1, 7.4)"
        },
        {
            "number": "LO5.",
            "description": "Use knowledge of student learning in the English Curriculum Area and evidence-based curriculum frameworks to individually and collaboratively plan units of work and lesson sequences that include setting goals, suitable content, effective teaching strategies, a range of assessment approaches and appropriate resources to not only support inclusive student participation and engagement but also expand learning opportunities for all students including those with English as an Additional Language or Dialect (EAL/D) and diverse backgrounds. (APST: 1.2, 1.3, 2.1, 2.2, 2.3, 2.6, 3.1, 3.2, 3.3, 3.4, 4.1, 4.5, 5.1)"
        },
        {
            "number": "LO6.",
            "description": "Demonstrate clear, fluent and coherent communication skills consistent with personal, professional and academic conventions"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Professional learning plan",
            "special_indicators": [],
            "weighting": "<dd>15% 500 word equivalent </dd>",
            "due_date": "<dd><p> 21/03/2025 2:00 pm</p></dd>",
            "learning_objectives": "L02, L03, L05, L06",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>During the first three weeks, you will identify the strengths and weaknesses in your teaching of English and literacy in primary schools. From this process you will develop professional goal/s and a learning plan for achieving these goal/s throughout the semester. You will also participate in activities during class, a professional learning community, designed to help you share your goals and develop your learning to meet your professional needs throughout the semester.</p>\n<p>Your professional learning plan will include:</p>\n<ul>\n<li> The strengths and weaknesses in the teaching of English and literacy that you have identified</li>\n<li> A clearly achievable goal to address at least one of these weaknesses over the semester</li>\n<li> A brief discussion of your thinking and reasoning that helped you select your goal and develop your plan which includes how you will participate in and contribute to professional learning opportunities throughout the semester (drawing on readings, classroom experiences, previous courses, supervisor feedback, workshop activities etc)</li>\n</ul>\n<p><br/></p>\n<p>You will be assessed on your ability to clearly and succinctly explain:</p>\n<ul>\n<li>Your identified strengths in the teaching of English and literacy</li>\n<li>Your identified weaknesses in the teaching of English and literacy</li>\n<li>The area/s of weakness that you will focus on for further investigation and learning</li>\n<li>At least one learning goal related to this area of focus</li>\n<li>The thinking and reasoning that helped you develop your goal/s and plan for professional learning</li>\n</ul>\n<p><br/></p>\n<p><strong>Submission</strong></p>\n<p>Assessment Task 1 should be submitted on the due date by 2:00pm via the submission link in Blackboard. Preservice teachers are reminded of the School of Education’s policy regarding late submission of assignments (please see Section 5.3 of the ECP for EDUC4720). Please ensure all submitted materials are clearly identified with your name and student number on each page.</p>\n<p><br/></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>On Blackboard</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Unit plan and lesson sequence",
            "special_indicators": [],
            "weighting": "<dd>45% 2000 word equivalent </dd>",
            "due_date": "<dd><p> 17/04/2025 2:00 pm</p></dd>",
            "learning_objectives": "L02, L03, L05, L06",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>PART 1</strong> (20%)</p>\n<p>In this task you are required to work in a group to use your knowledge of student learning in the English Curriculum Learning Area to collaboratively design a unit (macro) plan for an allocated year level in primary school. Your unit plan needs to be based on the teaching and learning cycle and draw on contemporary curriculum frameworks. Your unit plan needs to include:</p>\n<ul>\n<li>Contextual considerations (e.g., your students – prior experiences/knowledge); the school setting/context/priorities/imperatives)</li>\n<li>Curriculum connections (i.e., English Content Descriptions, other Learning Areas, Cross Curriculum Priorities, General Capabilities)</li>\n<li>Learning goals, learning experiences, teaching strategies and assessment approaches to expand learning opportunities for all students including those with English as an Additional Language or dialect (EAL/D) and diverse backgrounds.</li>\n<li>Resources both traditional and online and including ICT to engage all students in their learning and support teaching (e.g., literary &amp; non-literary texts, kits, videos)</li>\n<li>Conceptual links (e.g.., Four Resources Model; Multiliteracies Pedagogy)</li>\n</ul>\n<p>Your response will reflect your knowledge and understanding of the course content and relevant research, curriculum and policy documents as derived from the readings, lectures and tutorials.</p>\n<p><strong>Questions to Scaffold Unit Plan Development</strong></p>\n<p>Answers to the following questions may assist critical alignment among knowledge of curriculum, teaching, student learning and assessment as well as decision-making about planning:</p>\n<ul>\n<li>What content will enthuse/interest/motivate your students? Why? (relevance to students/English Curriculum/EAL/D students and students from diverse backgrounds)</li>\n<li>What are your goals for student learning? Why?</li>\n<li>How will your goals, learning experiences and teaching strategies expand learning opportunities for all students?</li>\n<li>What texts will you select to build/deepen knowledge and promote substantive classroom/student conversations?</li>\n<li>How will you select and use resources to engage all students in their learning?</li>\n<li>What concepts/frameworks will inform your thinking about planning?</li>\n<li>How will students demonstrate their learning and achievement throughout the unit? (What outcome tasks will students produce and what assessment strategies – formal/informal, diagnostic, summative – will you use throughout the unit to enable student learning?)</li>\n</ul>\n<p><br/></p>\n<p>You will present/display your group unit plan on one side of an A3 sheet of paper (references may be listed overleaf using the required APA style). Font size must be no smaller than 11. The nature of planning documents calls for economic use of words and space hence well-constructed notes/dot points are expected and appropriate exploitation of layout, headings, colour, tables, codes etcetera is encouraged.</p>\n<p><br/></p>\n<p><strong>PART 2</strong> (25%)</p>\n<p>Based on your group’s unit plan for an allocated year level in the primary school, you will develop a coherent sequence of three lessons. These lessons need to provide evidence of explicit teaching of key concepts in two of the following areas of the English Curriculum:</p>\n<ul>\n<li>Reading comprehension</li>\n<li>Guided writing</li>\n<li>Functional grammar</li>\n<li>Vocabulary development</li>\n</ul>\n<p> </p>\n<p>Your lesson sequence needs to include:</p>\n<ul>\n<li>Student learning goals and lesson objectives</li>\n<li>Teaching strategies that support inclusive student participation and engagement</li>\n<li>Teaching strategies that include using ICT to expand curriculum learning for students</li>\n<li>Classroom organisation and management information</li>\n<li>Resources including ICT to engage all students in their learning</li>\n<li>A range of suitable assessment approaches – including formal/informal, diagnostic, summative – to assess student learning</li>\n<li>Ways to differentiate learning and teaching to cater for students with EAL/D and diverse backgrounds.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>On Blackboard</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Resource portfolio and pedagogical statement",
            "special_indicators": [],
            "weighting": "<dd>40% 2500 word equivalent </dd>",
            "due_date": "<dd><p> 9/06/2025 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Essay/ Critique, Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Throughout the semester you will collect a wide range of resources (20-30) that could be used in learning, teaching, and assessment in English and literacy. You need to focus on your professional learning goal but may include other resources you consider will assist you to become a highly effective English and literacy teacher. For the purposes of this assessment task, a <em>resource</em> is defined as a teaching aid, for example, an iPad app that has been designed to teach decoding skills to pre-schoolers, a board game that is designed for development of writing skills, a website that has lesson plans for the teaching of comprehension, an online digital storytelling tool, or an online digital educational game designed to teach grammar. A resource could also be a digital application or software that, although not designed for educational purposes, could be used in a classroom to enhance the teaching of English, for example, Minecraft, Google Tools or SecondLife.</p>\n<p>It is expected that you will be able to describe and explain the strategies you might use with each resource to support inclusive student participation and engagement of all school students including across the full range of abilities and from diverse backgrounds (e.g., Aboriginal and Torres Strait Islander and English as an Additional Language or Dialect (EAL/D) students). Please note: It is a resource that you would use in the classroom. It is not a picture book or a piece of literature. It is not a text book.</p>\n<p>You need to begin this collection as early as possible. We will share and plan some of these resources during workshops.</p>\n<p> </p>\n<p>For this assessment task you will:</p>\n<ul>\n<li>Use an online curating tool to store your resource portfolio. Examples of curating tools include: Pinterest, Flipboard, Evernote, and Diigo. Use the categorisation tools (such as tags) to organise your portfolio. Think carefully about this organisation to ensure it is thoughtfully set out and user-friendly.  </li>\n<li>Describe the resource portfolio including an online address (you do not submit the portfolio) and directions for navigation that show how it is organised.</li>\n<li>Describe the criteria you used to select and organise the resources. For example: Which key ideas/theories on your topic informed your selection? Why? Justify your selection with reference to the Australian Curriculum: English and literacy education literature/set text and refer to examples of your selected resources.</li>\n<li> Write a Statement of Pedagogical Practices in which you demonstrate your knowledge and understanding of learning, teaching, and assessment in your selected focus area across all the primary school years. In your Statement describe and explain how different resources (include at least six examples) in your portfolio enable strategies to support inclusive participation and engagement for all students across the full range of abilities including those with diverse backgrounds such as Aboriginal and Torres Strait Islander and English as an Additional Language or Dialect (EAL/D) students.</li>\n</ul>\n<p> </p>\n<p>You will be assessed on your ability to:</p>\n<ul>\n<li>Describe your resource portfolio and its organisation and directions for navigation</li>\n<li>Describe and explain the criteria for categorisation when selecting and organising your resources</li>\n<li>Write a Statement of Pedagogical Practices which describes and explains how learning, teaching, and assessment occur in your focus area. Include an explication of how different resources (at least six examples) lend themselves to strategies to support inclusive participation and engagement for all primary school students. (750 to 1,000 words)</li>\n<li>Demonstrate appropriate technical and presentation skills, and communicate using appropriate text structures and linguistic features</li>\n</ul>\n<p> </p>\n<p><em>This assignment is considered to be the equivalent of a 2,500-word essay.</em></p>\n<p><strong>Submission</strong></p>\n<p>This task should be submitted on the due date by 2:00pm via the submission link in Blackboard. Preservice teachers are reminded of the School of Education’s policy regarding late submission of assignments (please see Section 5.3 of the ECP for EDUC4720). Please ensure all submitted materials are clearly identified with your name and student number on each page.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>On Blackboard</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction: Examining Literacy in the 21st Century</strong><br><p>APST: 1.2, 1.3, 1.5, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4</p>\n<p><strong>Reading: Chapter 1, Literacy in Australia (4th edition)</strong></p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L05, L06</p></div></td>",
            "topic_title": "<strong>Introduction: Examining Literacy in the 21st Century</strong>",
            "topic_description": "Introduction: Examining Literacy in the 21st Century APST: 1.2, 1.3, 1.5, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4 Reading: Chapter 1, Literacy in Australia (4th edition)",
            "learning_outcomes": [
                "L02",
                "L03",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Digital Literacies and the AC:E</strong><br><p>APST: 1.2, 1.3, 1.5, 2.1, 2.3, 2.5, 2.6, 3.1, 3.2, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4</p>\n<p><strong>Reading: Chapter 10, Literacy in Australia (4th edition)</strong></p></br></p></div></td>",
            "topic_title": "<strong>Digital Literacies and the AC:E</strong>",
            "topic_description": "Digital Literacies and the AC:E APST: 1.2, 1.3, 1.5, 2.1, 2.3, 2.5, 2.6, 3.1, 3.2, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4 Reading: Chapter 10, Literacy in Australia (4th edition)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Oral Language</strong><br><p>APST: 1.2, 1.3, 1.5, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4</p>\n<p><strong>Reading: Chapter 3, Literacy in Australia (4th edition)</strong></p></br></p></div></td>",
            "topic_title": "<strong>Oral Language</strong>",
            "topic_description": "Oral Language APST: 1.2, 1.3, 1.5, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4 Reading: Chapter 3, Literacy in Australia (4th edition)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Responsive and Relational Teaching</strong><br><p>APST: 1.2, 1.3, 1.5, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4</p>\n<p><strong>Reading: Chapter 7, Literacy in Australia (4th edition)</strong></p></br></p></div></td>",
            "topic_title": "<strong>Responsive and Relational Teaching</strong>",
            "topic_description": "Responsive and Relational Teaching APST: 1.2, 1.3, 1.5, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4 Reading: Chapter 7, Literacy in Australia (4th edition)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Theories of Literacy Development</strong><br><p>APST: 1.2, 1.3, 1.5, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4</p>\n<p><strong>Reading: Chapter 2, Literacy in Australia (4th edition)</strong></p></br></p></div></td>",
            "topic_title": "<strong>Theories of Literacy Development</strong>",
            "topic_description": "Theories of Literacy Development APST: 1.2, 1.3, 1.5, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4 Reading: Chapter 2, Literacy in Australia (4th edition)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Teaching Reading</strong><br><p>APST: 1.2, 1.3, 1.4, 1.5, 2.1, 2.3, 2.5, 2.6, 3.1, 3.2, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4</p>\n<p><strong>Reading: Chapter 4, Literacy in Australia (4th edition)</strong></p></br></p></div></td>",
            "topic_title": "<strong>Teaching Reading</strong>",
            "topic_description": "Teaching Reading APST: 1.2, 1.3, 1.4, 1.5, 2.1, 2.3, 2.5, 2.6, 3.1, 3.2, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4 Reading: Chapter 4, Literacy in Australia (4th edition)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Teaching Writing</strong><br><p>APST: 1.2, 1.3, 1.5, 2.1, 2.3, 2.5, 2.6, 3.1, 3.2, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4</p>\n<p><strong>Reading: Chapter 5, Literacy in Australia (4th edition)</strong></p></br></p></div></td>",
            "topic_title": "<strong>Teaching Writing</strong>",
            "topic_description": "Teaching Writing APST: 1.2, 1.3, 1.5, 2.1, 2.3, 2.5, 2.6, 3.1, 3.2, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4 Reading: Chapter 5, Literacy in Australia (4th edition)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Literature and Becoming Literate</strong><br><p>APST: 1.2, 1.3, 1.4, 1.5, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4</p>\n<p><strong>Reading: Chapter 6, Literacy in Australia (4th edition)</strong></p></br></p></div></td>",
            "topic_title": "<strong>Literature and Becoming Literate</strong>",
            "topic_description": "Literature and Becoming Literate APST: 1.2, 1.3, 1.4, 1.5, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4 Reading: Chapter 6, Literacy in Australia (4th edition)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-Semester Break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-Semester Break</strong>",
            "topic_description": "Mid-Semester Break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Effective Assessment</strong><br><p>APST: 1.2, 1.3, 1.5, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4</p>\n<p><strong>Reading: Chapter 9, Literacy in Australia (4th edition)</strong></p></br></p></div></td>",
            "topic_title": "<strong>Effective Assessment</strong>",
            "topic_description": "Effective Assessment APST: 1.2, 1.3, 1.5, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4 Reading: Chapter 9, Literacy in Australia (4th edition)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Labour Day Public Holiday</strong><br/></p></div></td>",
            "topic_title": "<strong>Labour Day Public Holiday</strong>",
            "topic_description": "Labour Day Public Holiday",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Working with Struggling Readers and Writers</strong><br><p>APST: 1.2, 1.3, 1.5, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4</p>\n<p><strong>Reading: Chapter 8, Literacy in Australia (4th edition)</strong></p></br></p></div></td>",
            "topic_title": "<strong>Working with Struggling Readers and Writers</strong>",
            "topic_description": "Working with Struggling Readers and Writers APST: 1.2, 1.3, 1.5, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4 Reading: Chapter 8, Literacy in Australia (4th edition)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Diversity, Inclusion, and Student Agency</strong><br><p>APST: 1.2, 1.3, 1.4, 1.5, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4</p>\n<p><strong>Reading: Chapter 12, Literacy in Australia (4th edition)</strong></p></br></p></div></td>",
            "topic_title": "<strong>Diversity, Inclusion, and Student Agency</strong>",
            "topic_description": "Diversity, Inclusion, and Student Agency APST: 1.2, 1.3, 1.4, 1.5, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 4.5, 5.1, 6.1, 6.2, 6.3, 7.4 Reading: Chapter 12, Literacy in Australia (4th edition)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Bringing It All Together: The Primary Literacy Classroom</strong><br><p><strong>Course Wrap Up</strong></p>\n<p>APST: 1.2, 1.3, 1.4, 1.5, 2.1, 2.2, 2.3, 2.5, 2.6, 3.1, 3.2, 3.3, 3.4, 4.1, 4.5, 5.1, 6.1, 6.2, 6.3, 7.1, 7.4</p>\n<p><strong>Reading: Malpique et al. (2023), Merga &amp; Gardiner (2018) on Blackboard</strong></p></br></p></div></td>",
            "topic_title": "<strong>Bringing It All Together: The Primary Literacy Classroom</strong>",
            "topic_description": "Bringing It All Together: The Primary Literacy Classroom Course Wrap Up APST: 1.2, 1.3, 1.4, 1.5, 2.1, 2.2, 2.3, 2.5, 2.6, 3.1, 3.2, 3.3, 3.4, 4.1, 4.5, 5.1, 6.1, 6.2, 6.3, 7.1, 7.4 Reading: Malpique et al. (2023), Merga & Gardiner (2018) on Blackboard",
            "learning_outcomes": []
        }
    ]
}