{
    "course_title": "Teaching English 2",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC7555-21010-7520",
    "full_course_code": "EDUC7555-21010-7520",
    "course_code": "EDUC7555",
    "class_code": "21010",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Use knowledge of student learning in the English Curriculum Area and evidence-based curriculum frameworks to individually and collaboratively plan units of work and lesson sequences that include setting goals, suitable content, effective teaching strategies, a range of assessment approaches and appropriate resources to not only support inclusive student participation and engagement but also expand learning opportunities for all students including those with English as an Additional Language or Dialect (EALD/D) and diverse backgrounds"
        },
        {
            "number": "LO2.",
            "description": "Produce a research informed, critically-framed written account about unit planning and lesson sequencing demonstrating how they aligned knowledge of curriculum, teaching strategies, student learning, assessment and reporting, and relevant policy documents."
        },
        {
            "number": "LO3.",
            "description": "Demonstrate the ability, individually and collaboratively, to effectively organise classroom activities, provide clear directions, and a range of verbal and non-verbal communication strategies to support student engagement."
        },
        {
            "number": "LO4.",
            "description": "Demonstrate technical and communication knowledge and skills to implement teaching strategies for using Information Communication Technology to expand curriculum learning opportunities for students."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate critical knowledge and communication skills to analyse, theorise and reflect about the selection and use of resources in learning and teaching English."
        },
        {
            "number": "LO6.",
            "description": "Demonstrate a critical understanding of the role of external professionals and community representatives in broadening teachers' knowledge of teaching, practice and resources and an understanding of the rationale for continued professional learning and the implications for improved student learning."
        },
        {
            "number": "LO7.",
            "description": "Demonstrate clear, fluent and coherent communication skills consistent with personal, professional and academic conventions"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Unit Plan and Lesson Sequence",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>40% 2000 words equivalent </dd>",
            "due_date": "<dd><p> 28/03/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L07",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>PART 1 (20%)</p>\n<p>In this task you are required to work in a group to use your knowledge of student learning in the English Curriculum Learning Area to collaboratively design a unit (macro) plan for an allocated year level in primary school. Your unit plan needs to be based on the teaching and learning cycle and draw on contemporary curriculum frameworks. Your unit plan needs to include:</p>\n<ul>\n<li>Contextual considerations (e.g., your students – prior experiences/knowledge); the school setting/context/priorities/imperatives)</li>\n<li>Curriculum connections (i.e., English Content Descriptions, other Learning Areas, Cross Curriculum Priorities, General Capabilities)</li>\n<li>Learning goals, learning experiences, teaching strategies and assessment approaches to expand learning opportunities for all students including those with English as an Additional Language or dialect (EAL/D) and diverse backgrounds.</li>\n<li>Resources both traditional and online and including ICT to engage all students in their learning and support teaching (e.g., literary &amp; non-literary texts, kits, videos)</li>\n<li>Conceptual links (e.g.., Four Resources Model; Multiliteracies Pedagogy)</li>\n</ul>\n<p>Your response will reflect your knowledge and understanding of the course content and relevant research, curriculum and policy documents as derived from the readings, lectures and tutorials.</p>\n<p>Questions to Scaffold Unit Plan Development</p>\n<p>Answers to the following questions may assist critical alignment among knowledge of curriculum, teaching, student learning and assessment as well as decision-making about planning:</p>\n<ul>\n<li> What content will enthuse/interest/motivate your students? Why? (relevance to students/English Curriculum/EAL/D students and students from diverse backgrounds)</li>\n<li>What are your goals for student learning? Why?</li>\n<li>How will your goals, learning experiences and teaching strategies expand learning opportunities for all students?</li>\n<li>What texts will you select to build/deepen knowledge and promote substantive classroom/student conversations?</li>\n<li>How will you select and use resources to engage all students in their learning?</li>\n<li>What concepts/frameworks will inform your thinking about planning?</li>\n<li>How will students demonstrate their learning and achievement throughout the unit? (What outcome tasks will students produce and what assessment strategies – formal/informal, diagnostic, summative – will you use throughout the unit to enable student learning?)</li>\n</ul>\n<p>Presentation</p>\n<p>You will present your group unit plan on one side of an A3 sheet of paper (references may be listed overleaf using the required APA style). Font size must be no smaller than 11. The nature of planning documents calls for economic use of words and space hence well-constructed notes/dot points are expected and appropriate exploitation of layout, headings, colour, tables, codes etcetera is encouraged.</p>\n<p><br/></p>\n<p>PART 2 (20%)</p>\n<p>Based on your group’s unit plan for an allocated year level in the primary school, you will develop a coherent sequence of three lessons. These lessons need to provide evidence of explicit teaching of key concepts in two of the following areas of the English Curriculum:</p>\n<ul>\n<li>Reading comprehension</li>\n<li> Guided writing</li>\n<li>Functional grammar</li>\n<li>Vocabulary development.</li>\n</ul>\n<p>Your lesson sequence needs to include:</p>\n<ul>\n<li>Student learning goals and lesson objectives</li>\n<li> Teaching strategies that support inclusive student participation and engagement</li>\n<li>Teaching strategies that include using ICT to expand curriculum learning for students</li>\n<li>Classroom organisation and management information</li>\n<li>Resources including ICT to engage all students in their learning</li>\n<li>A range of suitable assessment approaches – including formal/informal, diagnostic, summative – to assess student learning</li>\n<li>Ways to differentiate learning and teaching to cater for students with EAL/D and diverse backgrounds.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit the assessment electronically via the assignment link on the course website/Blackboard. By submitting your assignment, you and your group are certifying that it is your original work and that is has not been previously submitted for assessment in any other course at university (unless resubmission is part of the requirements for the course assessment). You need to ensure you have completed UQ’s academic integrity module before you submit your assignment. The module can be found at: <a href=\"https://www/uq.edu.au/integrity\">https://www/uq.edu.au/integrity</a>. Always keep a copy of your submitted assignment.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Classroom Activities and Presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>25% 1500 words equivalent </dd>",
            "due_date": "<dd><p> 9/04/2025 1:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L07",
            "mode": "Activity/ Performance, Written",
            "category": "Paper/ Report/ Annotation, Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>For this task, you are required to work with your unit plan group to develop a set of 4 rotation hands-on activities suitable for use in the English Curriculum classroom. Ideas for the activities should be drawn from the lesson sequences you developed and must include an activity to teach:</p>\n<ul>\n<li>Reading comprehension</li>\n<li>Guided writing</li>\n<li>Functional grammar</li>\n<li>Vocabulary development.</li>\n</ul>\n<p>*At least one of your groups' activities must include teaching strategies for using ICT to expand curriculum learning opportunities for students.</p>\n<p><br/></p>\n<p>The group will present one of their activities (no more than 10 minutes long) to the class. Your group set of activities need to:</p>\n<ul>\n<li>Demonstrate strategies to support inclusive student participation and engagement</li>\n<li>Demonstrate the capacity to organise the classroom and learning activities and provide clear directions</li>\n<li>Demonstrate a range of verbal (e.g., critical questioning) and non-verbal (teacher-student interactions) communication strategies to support student engagement</li>\n<li>Contribute equally to teaching and learning</li>\n<li>Select and use a range of resources – including ICT – to effectively engage students in their learning</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>On Blackboard and in-person during class. You must submit your Classroom Activities electronically via the assignment link on the course website. In-class presentations will occur the same week the assignment is due. By submitting your assignment, you are certifying that it is your original work and that is has not been previously submitted for assessment in any other course at university (unless resubmission is part of the requirements for the course assessment). You need to ensure you have completed UQ’s academic integrity module before you submit your assignment. The module can be found at: https://www.uq.edu.au/integrity Always keep a copy of your submitted assignment.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Resource Portfolio and Critical Reflection",
            "special_indicators": [],
            "weighting": "<dd>35% 2000 words equivalent </dd>",
            "due_date": "<dd><p> 13/06/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L03, L04, L05, L06, L07",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Essay/ Critique, Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>At the beginning of the semester, you will be expected to articulate your goals for professional learning and teaching in English Curriculum. To help you work toward your goals, throughout the semester you will be expected to participate in and contribute to an online community of learners involving your peers, lecturer and tutors. You also will have several opportunities to engage in professional teaching networks and broader communities such as professional English teacher associations. Through these opportunities you are expected to develop an understanding of the role of external professionals and community representatives as well as broaden your professional knowledge of teaching, practices and resources for effective teaching of the English Curriculum Learning Area in primary schools.</p>\n<p><br/></p>\n<p>For the purposes of this assessment task a ‘resource’ is defined as a teaching aid, for example, an iPad app that has been designed to teach decoding skills to pre-schoolers, a board game that is designed for development of writing skills, a website that has lesson plans for the teaching of comprehension, an online digital storytelling tool, or an online digital educational game designed to teach grammar. A resource could also be a digital application or software that, although not designed for educational purposes, could be used in a classroom to enhance the teaching of English, for example, Minecraft, Google Tools or SecondLife. It is expected that a resource will heighten engagement of students in their learning.</p>\n<p>Please note: It is a resource that you would use in the classroom. It is not a textbook.</p>\n<p><br/></p>\n<p>For this task you are required to:</p>\n<ul>\n<li>Briefly outline your professional learning goals for, and strengths and weaknesses in, English teaching, practices and resources at the beginning of the semester.</li>\n<li>Collect a variety of resources (20 – 30) over the semester to be included in an electronic Resource Portfolio (Your participation in different learning communities and engagement with future colleagues will assist you in collecting your resources.).</li>\n<li>Briefly describe the resource collection.</li>\n<li>Describe the criteria you used to select the resources (Which key ideas/theories on your topic informed your selection? Why? Justify your selection with reference to English curriculum and literacy education literature and refer to examples of your selected resources.).</li>\n<li>Write a Critical Reflection of your learning journey of participating in and contributing to the different learning communities throughout the semester. Focus on how your participation has contributed to you achieving your professional learning goals and understanding the role of external professionals and community representatives in relation to your knowledge of teaching, practices and resources. Based on your knowledge and experiences, include a justification of the need for continued professional learning once you graduate and the implications for improved student learning.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit the assessment electronically via the assignment link on the course website. By submitting your assignment, you are certifying that it is your original work and that is has not been previously submitted for assessment in any other course at university (unless resubmission is part of the requirements for the course assessment). You need to ensure you have completed UQ’s academic integrity module before you submit your assignment. The module can be found at: <a href=\"https://www.uq.edu.au/integrity\">https://www.uq.edu.au/integrity</a>. Always keep a copy of your submitted assignment.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Course Introduction: Examining literacy 21st Century</strong><br><p>APST: 1.2, 1.3, 1.5, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 5.1, 6.4, 7.4 </p>\n<p><strong>Readings: Literacy in Australia Chapter 1</strong></p></br></p><p><strong>Learning outcomes:</strong> L01, L04, L05, L07</p></div></td>",
            "topic_title": "<strong>Course Introduction: Examining literacy 21st Century</strong>",
            "topic_description": "Course Introduction: Examining literacy 21st Century APST: 1.2, 1.3, 1.5, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 5.1, 6.4, 7.4 Readings: Literacy in Australia Chapter 1",
            "learning_outcomes": [
                "L01",
                "L04",
                "L05",
                "L07"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Digital Literacies and the AC:E</strong><br><p>APST: 1.2, 1.3, 2.1, 2.2, 2.3, 2.5, 2.6, 3.1, 3.2, 3.3, 3.4, 4.1, 4.2, 5.1, 6.4, 7.4 </p>\n<p><strong>Readings: Literacy in Australia Chapter 10</strong></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Digital Literacies and the AC:E</strong>",
            "topic_description": "Digital Literacies and the AC:E APST: 1.2, 1.3, 2.1, 2.2, 2.3, 2.5, 2.6, 3.1, 3.2, 3.3, 3.4, 4.1, 4.2, 5.1, 6.4, 7.4 Readings: Literacy in Australia Chapter 10",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Teaching Reading</strong><br><p>APST: 1.2, 1.3, 2.1, 2.2, 2.3, 2.5, 2.6, 3.1, 3.2, 3.3, 3.4, 4.1, 4.2, 5.1, 6.4, 7.4</p>\n<p><strong>Readings: Literacy in Australia Chapter 4</strong></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Teaching Reading</strong>",
            "topic_description": "Teaching Reading APST: 1.2, 1.3, 2.1, 2.2, 2.3, 2.5, 2.6, 3.1, 3.2, 3.3, 3.4, 4.1, 4.2, 5.1, 6.4, 7.4 Readings: Literacy in Australia Chapter 4",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Teaching Writing</strong><br><p>APST: 1.2, 1.3, 2.1, 2.2, 2.3, 2.5, 2.6, 3.1, 3.2, 3.3, 3.4, 4.1, 4.2, 5.1, 6.4, 7.4</p>\n<p><strong>Readings: Literacy in Australia Chapter 5</strong></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Teaching Writing</strong>",
            "topic_description": "Teaching Writing APST: 1.2, 1.3, 2.1, 2.2, 2.3, 2.5, 2.6, 3.1, 3.2, 3.3, 3.4, 4.1, 4.2, 5.1, 6.4, 7.4 Readings: Literacy in Australia Chapter 5",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Responsive and Relational Teaching</strong><br><p><strong> </strong>APST: 1.2, 1.3, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 5.1, 6.4, 7.4 </p>\n<p><strong>Readings: Literacy in Australia Chapter 7</strong></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Responsive and Relational Teaching</strong>",
            "topic_description": "Responsive and Relational Teaching APST: 1.2, 1.3, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 5.1, 6.4, 7.4 Readings: Literacy in Australia Chapter 7",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Diversity, Inclusion, and Student Agency</strong><br><p>APST: 1.2, 1.3, 2.1, 2.2, 2.3, 2.5, 2.6, 3.3, 3.4, 4.1, 4.2, 5.1, 6.4, 7.4</p>\n<p><strong>Readings: Literacy in Australia Chapter 12</strong></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Diversity, Inclusion, and Student Agency</strong>",
            "topic_description": "Diversity, Inclusion, and Student Agency APST: 1.2, 1.3, 2.1, 2.2, 2.3, 2.5, 2.6, 3.3, 3.4, 4.1, 4.2, 5.1, 6.4, 7.4 Readings: Literacy in Australia Chapter 12",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Effective Assessment</strong><br><p>APST: 1.2, 1.3, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 5.1, 6.4, 7.4</p>\n<p><strong>Readings: Literacy in Australia Chapter 9</strong></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Effective Assessment</strong>",
            "topic_description": "Effective Assessment APST: 1.2, 1.3, 2.1, 2.3, 2.5, 2.6, 3.3, 3.4, 5.1, 6.4, 7.4 Readings: Literacy in Australia Chapter 9",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-semester Break</strong><br><p>For Semester 1, 2025, the mid-semester break for this course will be relocated to university week 8.</p></br></p></div></td>",
            "topic_title": "<strong>Mid-semester Break</strong>",
            "topic_description": "Mid-semester Break For Semester 1, 2025, the mid-semester break for this course will be relocated to university week 8.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Mid-sem break To Week 13(21 Apr - 01 Jun)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Break for Professional Experience</strong><br><p>‘No classes scheduled while undertaking professional experience (placement) in an accompanying course’.</p></br></p></div></td>",
            "topic_title": "<strong>Break for Professional Experience</strong>",
            "topic_description": "Break for Professional Experience ‘No classes scheduled while undertaking professional experience (placement) in an accompanying course’.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Revision week(02 Jun - 08 Jun)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Bringing it All Together: The Primary Literacy Classroom</strong><br><p><strong>Course Wrap Up</strong></p>\n<p>APST: 1.2, 1.3, 2.1, 2.2, 2.3, 2.5, 2.6, 3.1, 3.2, 3.3, 3.4, 3.5, 4.1, 4.2, 5.1, 6.4, 7.4</p>\n<p><strong>Readings: Malpique et al (2023) and Merga &amp; Gardiner (2018), on Blackboard</strong></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Bringing it All Together: The Primary Literacy Classroom</strong>",
            "topic_description": "Bringing it All Together: The Primary Literacy Classroom Course Wrap Up APST: 1.2, 1.3, 2.1, 2.2, 2.3, 2.5, 2.6, 3.1, 3.2, 3.3, 3.4, 3.5, 4.1, 4.2, 5.1, 6.4, 7.4 Readings: Malpique et al (2023) and Merga & Gardiner (2018), on Blackboard",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        }
    ]
}