{
    "course_title": "A Sociological Orientation to Education",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC1710-21663-7520",
    "full_course_code": "EDUC1710-21663-7520",
    "course_code": "EDUC1710",
    "class_code": "21663",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate an understanding of key sociological concepts in education."
        },
        {
            "number": "LO2.",
            "description": "Critically examine key sociological issues within the context of education."
        },
        {
            "number": "LO3.",
            "description": "Develop a reasoned argument supported by appropriate evidence."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "The importance of teachers seeing sociologically: Recorded video response",
            "special_indicators": [],
            "weighting": "<dd>40% 15 minutes </dd>",
            "due_date": "<dd><p> 3/04/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Context</strong></p>\n<p>In module 1 of this course, you have been exposed to a variety of sociological concepts which we have discussed in relation to education. We have explored in detail the importance of teachers seeing, thinking and talking sociologically about education and what occurs in schools.</p>\n<p><strong>Task</strong></p>\n<p>Using the relevant weekly readings, along with other readings given to you in the weekly lectures, you are to <strong>select 3 questions</strong> from the list below and <strong>create a recorded video response of 5 minutes for each question</strong> (3 x 5 minutes = 15 minute video).</p>\n<p><strong>Questions</strong></p>\n<p>1.     What does ‘decolonising knowledge’ mean in the context of classroom teaching and learning, and why is it important for teachers to enact in their classroom? Provide example/s and/or scenarios to help support your response.</p>\n<p>2.     What does the concept ‘intersectionality’ mean, and why is it important for teachers to apply it to their everyday practices in school? Provide example/s and/or scenarios to illustrate and support your response.</p>\n<p>3.     The following quote is from Santoro (2009, p. 41):</p>\n<p>…teachers need to come to know themselves as ethnic and encultured if they are to understand their students and engage with the complexities of teaching for diversity. This means understanding how their own ethnic identities shape their teaching identities, their classroom practices and their relationships with students.</p>\n<p>Explain what the term ‘positionality’ means and why it is important for teachers to appreciate their ‘ethnic and encultured’ selves. Provide example/s and/or scenarios to help illustrate and support your answer.</p>\n<p>4.     What are ‘deficit discourses’, and why is it a problem for teachers to draw from them? Use example/s and/or scenarios to support your response.</p>\n<p>5.     What does the term ‘hidden curriculum’ mean, and why is it important for teachers to know about it? Integrate example/s and/or scenarios in your answer to support your response.</p>\n<p><strong>Please note:</strong></p>\n<ul>\n<li>You need to draw from the relevant weekly readings AND relevant additional readings given to you in the lectures. ‘Readings’ means journal articles, policy reports and other academic learning resources, NOT lecture notes. Do not cite lecture slides. </li>\n<li>To receive a higher grade in criterion 1 you need to find and appropriately use academic materials from key scholars using your selected sociological terms. This will mean doing some of your own research.</li>\n<li>This recorded video assignment is focused on you demonstrating your knowledge and understanding of the sociological concepts embedded in the questions you select to answer, so you need to cite academic sources in your responses.</li>\n<li>You are being assessed on your ability to apply the sociological concepts through the integration of relevant examples and/or scenarios in your responses. <strong>Do not use examples or scenarios given out in your lectures or tutorials.</strong> You need to come up with your own. Better quality examples will come from the public domain and will not be made up hypotheticals.</li>\n<li>The third criterion assesses communication, so there is an expectation that your responses will be suitable for the genre of video recording. Use visual aids to help communicate your ideas (e.g. power point slides) and think about how you can best design them to communicate your responses effectively and clearly. Don't read off a script. Strive to be engaging. Reading off a script will not score highly in the communication criterion.</li>\n<li>Submit your 3 x 5 minute responses in the one 15 minute video.</li>\n<li>Do not leave your submission to the last minute! Uploading video can sometimes take a long time, depending on where you are uploading from. Give yourself enough time to ensure that your submission isn’t late. IT issues are not grounds for an acceptable late submission. </li>\n<li>We recommend uploading your video assignment on campus since UQ facilities are optimised to make this quick and efficient. </li>\n<li>The submission link will also be opened early to ensure you can have a practice submission if you would like to. We assess the last submitted video.</li>\n<li>Per UQ policy, timely submission is the responsibility of students. Course staff cannot check your video submission for you.</li>\n</ul>\n<p><br/></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Sociological investigation and position paper",
            "special_indicators": [],
            "weighting": "<dd>60% 2000 words </dd>",
            "due_date": "<dd><p> 28/05/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Written",
            "category": "Essay/ Critique, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Context</strong></p>\n<p>Schools are experiencing unprecedented levels of diversity, and it is important for pre-service teachers to investigate the everyday complexities of schooling opportunity and to consider how these issues can be navigated appropriately and respectfully in order to improve the lived experiences of all people in the education sector.</p>\n<p>This assessment item requires you to investigate and critically examine an educational issue from a sociological perspective and then form a reasoned argument about how the issue you have selected can be respectfully addressed and/or navigated in schools.</p>\n<p><strong>Task</strong></p>\n<p>You are to select and investigate an issue in education from a sociological perspective and <strong>write a 2000 word position paper</strong> on the issue you select. To achieve this, you must:</p>\n<ol>\n<li><strong>Select </strong>a question. A list of possible questions will be uploaded to Blackboard at the beginning of week 7. These will relate to content covered in module 2 of the course (weeks 7-12).</li>\n<li><strong>Investigate</strong> and research the question. Make sure you <strong>identify</strong> and <strong>analyse</strong> (extract) the key ideas from the information you find.</li>\n<li><strong>Synthesise</strong> the key ideas stemming from your research and shape them into a reasoned argument.</li>\n<li><strong>Plan</strong> your response. Make sure you have a clearly reasoned argument that answers the question you have selected. You must also use supporting academic literature/evidence from your research. This is a position paper – what is your position in response to the question? How can the issue be respectfully addressed and navigated in school?</li>\n<li><strong>Write</strong> a 2000 word position paper. Ensure you properly use APA referencing, which includes you submitting a reference list. The reference list does NOT count toward the word count for this assignment.</li>\n<li><strong>Proofread</strong> and edit your position paper to ensure it is clear and well reasoned. Use sub-headings if you wish.</li>\n</ol>\n<p><strong>Tips</strong></p>\n<ul>\n<li>Take the time to become familiar with the research facilities available through UQ's Central Library. Ensure you know how to find quality information about the issue you have selected to investigate.</li>\n<li>Research the issue until you feel like you have reached saturation point. It is important for you to know the field of research in this area well since that will enable you to identify the key points, and then synthesise these ideas into an argument of your own. It is anticipated that you will spend at least 15-20 hours researching your question.</li>\n<li>Make sure you develop a position paper that you can support with evidence.</li>\n<li>UQ Library has online referencing style guides for all of the different referencing formats used across UQ (there are many). In the School of Education, we use APA style referencing. Make sure you consult the APA style guide. It outlines how you must format both your reference list (not bibliography - there is a difference) AND in-text references.</li>\n<li>You should use relevant course readings as a springboard for your research. Use relevant course readings in your assignment, but don't rely solely on these. You need to go beyond the course readings and draw from further sociological research/evidence in order to do well in criterion 2, which relates to the \"quality of evidence used to support chosen argument\" (see criteria sheet for task 2). </li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>What is Sociology? Why is it important to see, think and talk sociologically about education?</strong><br><p>Why is it important to see, talk and think sociologically about education? For the first 6 weeks of this course, you will learn key sociological ideas and concepts needed for understanding the complexities of schooling and the social processes that often go on within them. </p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>What is Sociology? Why is it important to see, think and talk sociologically about education?</strong>",
            "topic_description": "What is Sociology? Why is it important to see, think and talk sociologically about education? Why is it important to see, talk and think sociologically about education? For the first 6 weeks of this course, you will learn key sociological ideas and concepts needed for understanding the complexities of schooling and the social processes that often go on within them.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Decolonising, expanding and diversifying knowledge</strong><br><p>Who has a voice about what we know is key to understanding schooling from a sociological perspective. This week, we delve into the history of knowledge production in sociology, and explore the need to decolonise, expand and diversify what we know about schools and the processes that go on in them.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Decolonising, expanding and diversifying knowledge</strong>",
            "topic_description": "Decolonising, expanding and diversifying knowledge Who has a voice about what we know is key to understanding schooling from a sociological perspective. This week, we delve into the history of knowledge production in sociology, and explore the need to decolonise, expand and diversify what we know about schools and the processes that go on in them.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Recognising the complexities of identity: Positionality and intersectionality</strong><br><p>Who we are is not one dimensional. How we have come to see and think the way we do about school has been shaped by a myriad of factors. This week, we delve into the complexities surrounding identity and problematise homogenising claims and categories.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Recognising the complexities of identity: Positionality and intersectionality</strong>",
            "topic_description": "Recognising the complexities of identity: Positionality and intersectionality Who we are is not one dimensional. How we have come to see and think the way we do about school has been shaped by a myriad of factors. This week, we delve into the complexities surrounding identity and problematise homogenising claims and categories.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The problematics of 'othering' and 'deficit discourses'</strong><br><p>This week we explore the problematics of 'othering' and how 'deficit discourses' often label and script young people in unproductive ways.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>The problematics of 'othering' and 'deficit discourses'</strong>",
            "topic_description": "The problematics of 'othering' and 'deficit discourses' This week we explore the problematics of 'othering' and how 'deficit discourses' often label and script young people in unproductive ways.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The 'hidden curriculum' and its socialising effect</strong><br/><p>Schools and education systems are full of socialising practices. This week, we explore the concept of a 'hidden curriculum' and the multiple ways this concept is useful for thinking about the unintended consequences of schooling. </p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>The 'hidden curriculum' and its socialising effect</strong>",
            "topic_description": "The 'hidden curriculum' and its socialising effect Schools and education systems are full of socialising practices. This week, we explore the concept of a 'hidden curriculum' and the multiple ways this concept is useful for thinking about the unintended consequences of schooling.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Learner diversity and school practices</strong><br/><p>This week is a transitional week from module 1 into module 2. We explore how schools contain many social processes. We also examine the changing and contested construction of 'youth'.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Learner diversity and school practices</strong>",
            "topic_description": "Learner diversity and school practices This week is a transitional week from module 1 into module 2. We explore how schools contain many social processes. We also examine the changing and contested construction of 'youth'.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Expanding notions of sex, gender and sexuality</strong><br/><p>How have understandings about sex, gender and sexuality changed over time? How does this impact the lives of young people who identify as LGBTQIA+? How have/do young people who identify as LBGTQIA+ experience schooling? Importantly, how can schools be more supportive?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Expanding notions of sex, gender and sexuality</strong>",
            "topic_description": "Expanding notions of sex, gender and sexuality How have understandings about sex, gender and sexuality changed over time? How does this impact the lives of young people who identify as LGBTQIA+? How have/do young people who identify as LBGTQIA+ experience schooling? Importantly, how can schools be more supportive?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Cultural and language diversity</strong><br/><p>Australia is becoming increasingly diverse. How can we value this diversity and productively work with it in schools?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Cultural and language diversity</strong>",
            "topic_description": "Cultural and language diversity Australia is becoming increasingly diverse. How can we value this diversity and productively work with it in schools?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-semester break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-semester break</strong>",
            "topic_description": "Mid-semester break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Technology and learning in schools</strong><br/><p>Technology is ever-present in schools. How does it shape the experiences of young people in school and how should we as teachers approach it? </p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Technology and learning in schools</strong>",
            "topic_description": "Technology and learning in schools Technology is ever-present in schools. How does it shape the experiences of young people in school and how should we as teachers approach it?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Information technology session",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Labor Day public holiday week</strong><br/><p>Due to the Labor Day public holiday, there will be no lecture on Monday. Students are, however, expected to start researching for assignment 2. Now is the perfect opportunity to start practicing your research skills. Your tutors will be available via email for you to ask questions about assignment 2.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Labor Day public holiday week</strong>",
            "topic_description": "Labor Day public holiday week Due to the Labor Day public holiday, there will be no lecture on Monday. Students are, however, expected to start researching for assignment 2. Now is the perfect opportunity to start practicing your research skills. Your tutors will be available via email for you to ask questions about assignment 2.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Assessment, testing and post-schooling advice</strong><br/><p>All students in school do assessment. How does this shape the lives of young people? Moreover, testing, especially standardised testing, is becoming more prevalent across all year levels. This week we examine these key aspects of schooling and the various ways they shape the lived experiences of young people.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Assessment, testing and post-schooling advice</strong>",
            "topic_description": "Assessment, testing and post-schooling advice All students in school do assessment. How does this shape the lives of young people? Moreover, testing, especially standardised testing, is becoming more prevalent across all year levels. This week we examine these key aspects of schooling and the various ways they shape the lived experiences of young people.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Young carers and parents</strong><br/><p>There is a larger number of young carers than we realise, yet the needs of these students is often forgotten. This week we bring attention to this student population and discuss how schools can better cater for their needs.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Young carers and parents</strong>",
            "topic_description": "Young carers and parents There is a larger number of young carers than we realise, yet the needs of these students is often forgotten. This week we bring attention to this student population and discuss how schools can better cater for their needs.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Assistance with Assignment 2</strong><br/><p>This week is dedicated to you working on assignment 2. Assistance in class will be available. BEd Primary students will be on placement for the week, but an online alternative will be made available for you prior to placement (so the end of week 12 - this will be posted on our course Blackboard site well in advance).</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Assistance with Assignment 2</strong>",
            "topic_description": "Assistance with Assignment 2 This week is dedicated to you working on assignment 2. Assistance in class will be available. BEd Primary students will be on placement for the week, but an online alternative will be made available for you prior to placement (so the end of week 12 - this will be posted on our course Blackboard site well in advance).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        }
    ]
}