{
    "course_title": "Music: Curriculum Studies",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC4645-20946-7520",
    "full_course_code": "EDUC4645-20946-7520",
    "course_code": "EDUC4645",
    "class_code": "20946",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate understanding of relevant content and critical analysis of recent disciplinary developments in scholarship and professional practice in the teaching of Music. APST 2.1"
        },
        {
            "number": "LO2.",
            "description": "Demonstrate ability to apply knowledge and understanding of research into how students learn and knowledge of relevant curriculum documents to the development of appropriate discipline based learning goals and teaching strategies for students of varying abilities. APST 1.2, 1.5, 2.1, 3.1"
        },
        {
            "number": "LO3.",
            "description": "Demonstrate the application of knowledge and skills to practice through the design, implementation and evaluation of effective learning and teaching sequences and discipline specific assessment tasks that draw on relevant curriculum documents, range of effective teaching resources, a full range of assessment and reporting strategies, and ICT knowledge that enables teaching strategies that expands learning. APST 2.2, 2.3, 2.6, 3.2, 3.3, 3.4, 5.1"
        },
        {
            "number": "LO4.",
            "description": "Demonstrate comprehensive and in-depth knowledge and understanding of literacy and numeracy teaching strategies and their application in Music. APST 2.5"
        },
        {
            "number": "LO5.",
            "description": "Demonstrate application of knowledge and skills to practice through responding to feedback, and identifying and designing discipline specific opportunities for professional learning engagement and communication within the school context, teaching networks and the broader community and understand the rationale for this professional practice in relation to improved student learning. APST 6.3, 6.4, 7.4"
        },
        {
            "number": "LO6.",
            "description": "Demonstrate clear, fluent and coherent communication skills in English consistent with personal, professional and academic convention. APST 2.1"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Planning for the future",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                }
            ],
            "weighting": "<dd>40% 15-20 min. presentation + Approx 2000 words </dd>",
            "due_date": "<dd><p>Part A 7/04/2025 - 11/04/2025</p>\n<p>Part B - Due 2pm 7/08/2025</p>\n<p>\n</p><p>Part A (Presentations) will occur during class. Part B is due in week 11 of classes. Detailed dates are on Blackboard.</p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L06",
            "mode": "Activity/ Performance, Product/ Artefact/ Multimedia, Written",
            "category": "Paper/ Report/ Annotation, Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Task Description: </strong>In consultation with your lecturer and in response to the feedback you have received from supervising teachers, identify an issue or question relating to your future practice as a teacher of music.</p>\n<p> </p>\n<p>Your topic should be linked to your own identified professional learning needs and should make a clear contribution to improving the impact you can make on student learning.</p>\n<p> </p>\n<p>Topics should address <strong>practical responses</strong> to contemporary pedagogical, philosophical or curriculum challenges faced by music teachers, and respond to recent research related to the teaching of classroom music. Responses (both Part A and Part B) must reference Queensland curriculum documents. </p>\n<p> </p>\n<p><strong>Part A Workshop and YouTube style resource (15%)</strong></p>\n<p>As a new graduate, you are well placed to engage colleague teachers with new approaches/ideas in music education, sharing innovative ways that your chosen issue can be applied to practice in the school environment. Thus, for this assessment, you will engage your peers in investigating your chosen issue through a ‘professional development’ seminar. Assist them in coming to their own conclusions through participation in a thought-provoking workshop presented by you in a small discussion group (15-20 minutes). Your workshop should be highly interactive, engaging your peers with your chosen topic, and should keep strictly to the time limit. You must incorporate a YouTube-style resource created by you. This online learning resource should be able to be utilised by school students, demonstrating your understanding of the issue, and how it can be addressed in practice. You must also provide your peers with a page of notes summarising your review, and justifying your suggestions for practice.</p>\n<p> </p>\n<p>Submission is to be through the discussion board on Blackboard AND TurnItIn, and must include:</p>\n<p>-Online resource demonstrating application of theory to practice created for student use.</p>\n<p>-One page of notes (referenced) summarising your review for teacher use.</p>\n<p> </p>\n<p>Students are required to video record their presentation, and keep a copy until the end of the year.</p>\n<p> </p>\n<p><strong> </strong></p>\n<p><strong>Part B Written (40%).</strong></p>\n<p>Structure your review as follows:</p>\n<p><strong>Title: </strong>Your title should succinctly encapsulate the question or issue examined.</p>\n<p><strong> </strong></p>\n<p><strong>Rationale: </strong>Introduce your topic, providing a rationale for the issue or question you are researching through your literature review (why this topic is important). Make relevant links between feedback you have received from supervising teachers, the workshop and online resource that you created, your own professional learning and imagined future impact on student learning. Your rationale should include consideration of the importance of ongoing professional learning for teachers </p>\n<p>(200 words).</p>\n<p><br/></p>\n<p><strong>Literature review: </strong>Critically review a minimum of ten recent (last 10 years) peer-reviewed research articles or book chapters. What findings and recommendations about the topic emerge from the review? What key questions or issues arise for music education in relation to your topic?</p>\n<p>Be sure to synthesise the approaches found in the literature (how the literature suggests teachers should respond to your identified issue or question)</p>\n<p>(800 words).</p>\n<p><strong> </strong></p>\n<p><strong>Application to practice:</strong></p>\n<p>1.    Discuss the application of your review to QCAA and/or the Australian Curriculum;</p>\n<p>2.    What are the main implications of the review for your teaching or your approach to music teaching? (You should refer to academic literature in this section of the paper as well);</p>\n<p>3.    Evaluate an example of the way your issue applies in practice (examples may be drawn from your experience on practicum, discussion with colleague teachers, analysis of a resource, the learning from the workshop and online resource created earlier in the year);</p>\n<p>4.    Discuss how you consider professional associations, peers and community representatives could support your ongoing engagement with this issue in ways that will inform and guide your professional practice (800words).</p>\n<p><strong> </strong></p>\n<p><strong>Conclusion: </strong>Conclude with a statement of intent regarding steps you will take towards managing this issue/topic in your future practice (200 words).</p>\n<p> </p>\n<p><strong>References: </strong>A list of all references cited in your report should be included at the end of your report. Use the APA style of referencing.</p>\n<p> </p>\n<p><strong>Appendices: </strong>This is where you include any relevant supporting data.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Part A:</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Junior Unit Plan",
            "special_indicators": [],
            "weighting": "<dd>30% Approx 2850 words </dd>",
            "due_date": "<dd><p> 13/06/2025 2:00 pm</p></dd>",
            "learning_objectives": "L03, L04, L06",
            "mode": "Written",
            "category": "Product/ Design",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You are required to develop a unit plan suitable for Years 7-10 classroom music as part of the Australian Curriculum. The document should represent an overview of 9 weeks of planning (for a school where students get 4x30-minute lessons per week), incorporating 2-3 hours of detailed planning (lesson plans) and repertoire to be studied. Ensure that your teaching strategies are varied, integrate making and responding and incorporate some music technology. Please note that while you may use topics taught during your own Music Education experience, and even develop and adapt a unit of work from ACARA or QCAA , the work included for this assessment needs to be your own</p>\n<p>All Unit Plans should include the following:</p>\n<p><strong>Unit title</strong></p>\n<p><strong>Introductory information   </strong></p>\n<p>Include</p>\n<p>·     Intended year level</p>\n<p>·     Context Statement: Briefly describe the school context applicable to the learning experiences described in your learning sequence.</p>\n<p>·     Anticipated prior music knowledge, understanding and skills needed to ensure student success.</p>\n<p><strong>Rationale </strong>(drawing on relevant academic literature and the curriculum)      </p>\n<p>Detail the purpose and value of this unit of work, and justification of the approach chosen.</p>\n<p><strong>Learning Objectives</strong>                              </p>\n<p>Include specific learning objectives - linked to Curriculum.</p>\n<p><strong>Repertoire</strong>    </p>\n<p>You are required to collect five (5) pieces of music appropriate for use in a classroom context for this unit. It is intended that you use this opportunity to extend your personal repertoire and source interesting works that are new to you, which will be useful in your own classroom practice. For each piece of repertoire, you should:</p>\n<p>1.    Justify your selection of the repertoire, giving a brief explanation of its relevance to the development of the student musician (approx 100 words).</p>\n<p>2.    Identify how it relates to the knowledge and skills for the relevant year level (referring specifically to the Australian Curriculum)</p>\n<p>3.    Provide at least one learning activity to be associated with the repertoire, worded as it would be for students. A worksheet/activity is a good example of this. Ensure that across the repertoire selected, you provide examples of activities in making and responding to music.  </p>\n<p><strong>Assessment tasks</strong>                                 </p>\n<p>Two assessment tasks that enable the demonstration of relevant content descriptors. Attach the relevant standards matrix to each.</p>\n<p><strong>Outline of intended learning </strong></p>\n<p>Provide the overview of the learning (9 weeks) A unit overview in table form using dot points. Provide sufficient detail so that lesson objectives, lesson activities, and links to curriculum are all clear to a reader.</p>\n<p>Provide evidence of varied and authentic learning experiences</p>\n<p>Include due dates for draft and final submission of two assessment tasks</p>\n<p>Suggested resources/repertoire (provide copies/links to these in appendices)</p>\n<p><strong>Detailed lesson plans</strong> (4 X 30-minute lessons) </p>\n<p>Ensure the style of learning/teaching and the focus of the lesson is varied across these lessons. They do not have to be sequential. You may use a lesson planning template that you are familiar with, or the ones provided in class.</p>\n<p><strong>Appendices</strong>                                             </p>\n<p>Include resources, original worksheets and scores/link to recordings of repertoire used, and/or suitable extensions. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit the assessment electronically via the assignment link on the course website. By submitting your assignment, you are certifying that is it your original work and that it has not been previously submitted for assessment in any other course at university. You need to ensure you have completed the university’s academic integrity module before you submit your assignment. The module can be found at <a href=\"http://www.uq.edu.au/integrity\">http://www.uq.edu.au//integrity</a></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Senior Unit of Work",
            "special_indicators": [],
            "weighting": "<dd>30% Approx 2850 words </dd>",
            "due_date": "<dd><p> 31/10/2025 2:00 pm</p></dd>",
            "learning_objectives": "L03, L04, L06",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Product/ Design",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><br/></p>\n<ol>\n<li>Using the Unit 1 <em>Designs </em>(see Section 2, General Music Syllabus), create a coherent and exciting 10-week unit of work suitable for teaching from either Term 1 or 2, in Year 11.  The unit needs to demonstrate alignment with the pedagogical and conceptual frameworks in the syllabus. It must include and feature varied and authentic learning strategies, innovative resources and some music technology. The o<em>utline of intended learning </em>should be provided in table form.</li>\n<li>Include a composition or performance task that aligns with the General Music Syllabus. Active and focused teaching of composition and/or performance concepts and skills should be evident in the plan.</li>\n<li>Provide three integrated and detailed lesson plans. </li>\n</ol>\n<p>Here is the suggested outline:</p>\n<p><strong>Rationale.</strong></p>\n<p>Justification for a chosen focus (include references)</p>\n<p>The school context, which may impact upon the unit design, resources and other considerations (this can include references)</p>\n<p>Detailed identification of the subject matter to be taught (refer specifically to syllabus, as well as other references)</p>\n<p>An overview of how your unit incorporates imaginative and innovative learning design to engage students (include references)</p>\n<p>Detailed identification of strategies to differentiate teaching to meet the specific learning needs of students across the full range of abilities (refer specifically to syllabus, as well as other references)</p>\n<p>An overview of the relationship between the selected assessment tools and the appropriate and authentic provision of learning in music education (refer specifically to syllabus, as well as other references)</p>\n<p><strong>Unit Objectives </strong>    </p>\n<p>Include the relevant unit objectives for this 10 week plan. </p>\n<p><strong>Resources</strong>             </p>\n<p>List and link to core resources (for example 3-5 pieces or extracts from larger works, online interaction spaces, in-person scheduled concerts).</p>\n<p><strong>Outline of intended learning</strong> - a sequence of contextualized learning experiences. Table form using dot points, but with sufficient detail to demonstrate the following:</p>\n<p>1.    evidence of strategies which align with pedagogical and conceptual frameworks highlighted in the syllabus</p>\n<p>2.    evidence of imaginative and varied learning experiences</p>\n<p>3.       evidence of authentic learning experiences</p>\n<p>4.       alignment to syllabus objectives and subject matter.</p>\n<p>Include due dates for draft and final submission of one assessment task</p>\n<p><strong>Detailed lesson plans</strong> </p>\n<p>Three lesson plans all demonstrating an integrated learning design. </p>\n<p><strong>Assessment tasks</strong>      </p>\n<p>One assessment task, either composition or performance that enables the demonstration of the assessment objectives.</p>\n<p>Relevant syllabus conditions aligned to the task.</p>\n<p>APSTS: 1.2; 1.5; 2.1; 2.2; 2.3; 2.5; 2.6; 3.1; 3.2; 3.3; 3.4; 5.1</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit the assessment electronically via the assignment link on the course website. By submitting your assignment, you are certifying that is it your original work and that it has not been previously submitted for assessment in any other course at university. You need to ensure you have completed the university’s academic integrity module before you submit your assignment. The module can be found at <a href=\"http://www.uq.edu.au/integrity\">http://www.uq.edu.au//integrity</a></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 26(24 Feb - 02 Nov)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Yearlong learning</strong><br><p>2 hour workshops will occur twice a week. Detailed information on the topics for each of these workshops, required readings, and preparation required is found on Blackboard.</p>\n<p>Students should consult the detailed outline on Blackboard for more details.</p>\n<p><br/></p>\n<p>APST: 1.2, 1.5, 2.1, 2.2, 2.3, 2.5, 2.6,</p>\n<p>3.1, 3.2, 3.3, 3.4, 5.1, 6.3, 6.4, 7.4</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Yearlong learning</strong>",
            "topic_description": "Yearlong learning 2 hour workshops will occur twice a week. Detailed information on the topics for each of these workshops, required readings, and preparation required is found on Blackboard. Students should consult the detailed outline on Blackboard for more details. APST: 1.2, 1.5, 2.1, 2.2, 2.3, 2.5, 2.6, 3.1, 3.2, 3.3, 3.4, 5.1, 6.3, 6.4, 7.4",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-Semester break</strong><br><p>For Semester 1, 2025, the mid-semester break for this course will be relocated to university week 8</p></br></p></div></td>",
            "topic_title": "<strong>Mid-Semester break</strong>",
            "topic_description": "Mid-Semester break For Semester 1, 2025, the mid-semester break for this course will be relocated to university week 8",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Mid-sem break (first semester) To Week 13(21 Apr - 01 Jun)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Break for Professional Experience</strong><br><p>No classes scheduled while undertaking professional experience (placement) in an accompanying course</p></br></p></div></td>",
            "topic_title": "<strong>Break for Professional Experience</strong>",
            "topic_description": "Break for Professional Experience No classes scheduled while undertaking professional experience (placement) in an accompanying course",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 16 To Week 21(11 Aug - 21 Sep)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Break for Professional Experience</strong><br><p>No classes scheduled while undertaking professional experience (placement) in an accompanying course</p></br></p></div></td>",
            "topic_title": "<strong>Break for Professional Experience</strong>",
            "topic_description": "Break for Professional Experience No classes scheduled while undertaking professional experience (placement) in an accompanying course",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid-sem break (second semester)(29 Sep - 05 Oct)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-Semester Break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-Semester Break</strong>",
            "topic_description": "Mid-Semester Break",
            "learning_outcomes": []
        }
    ]
}