{
    "course_title": "Teaching Mathematics in Primary Contexts 2",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC3720-20919-7520",
    "full_course_code": "EDUC3720-20919-7520",
    "course_code": "EDUC3720",
    "class_code": "20919",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate an understanding of key mathematical concepts and structures, how those concepts and structures are developed across the primary school curriculum and the range of teaching strategies to develop students depth of conceptual knowledge and understanding in mathematics. (APST: 2.1, 2.2, 3.3)"
        },
        {
            "number": "LO2.",
            "description": "Critically analyse theoretical and practical knowledge of investigative and inquiry-based teaching and learning strategies to provide opportunities for students to address problems; promote higher-order thinking skills, creativity, imagination, intellectual risk-taking, problem solving and reflection, in relevant contexts. (APST: 1.2, 2.1, 3.3)"
        },
        {
            "number": "LO3.",
            "description": "Select and organise content, teaching strategies and resources  including the use of Information and Communication Technology  suitable for students with diverse linguistic, cultural, religious and socioeconomic backgrounds including Aboriginal and Torres Strait Islander students. (APST: 1.3, 1.4, 2.6, 3.3, 3.4)"
        },
        {
            "number": "LO4.",
            "description": "Analyse and use student assessment data to design teaching and learning sequences that provide learning goals and achievable challenges for diverse learners and students of varying abilities in mathematics (APST: 1.3, 2.3, 3.1, 3.2, 5.1)"
        },
        {
            "number": "LO5.",
            "description": "Demonstrate the ability to  individually and collaboratively  set learning goals, plan, develop, deliver learning experiences (e.g., organise classroom activities and provide clear directions), employ different assessment strategies (e.g., diagnostic, observation, consultation, peer/self, focused analysis, formative and summative assessment), and reflect on and use feedback to improve learning and teaching sequences in Mathematics. (APST: 2.2, 3.1, 3.2, 4.2, 5.1, 6.3)"
        },
        {
            "number": "LO6.",
            "description": "Demonstrate clear, fluent and coherent communication skills consistent with personal, professional and academic conventions in traditional and digital texts."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Task 1 - Designing a sequence of three lessons",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>40% 3000 words </dd>",
            "due_date": "<dd><p> 3/04/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L06",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Product/ Design",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Rationale:</strong> Lesson planning is at the heart of being an effective teacher. To develop deep conceptual understanding of mathematical concepts, it is often essential to design a series of lessons to provide opportunity for students to develop scope and depth of the content area. </p>\n<p><br/></p>\n<p><strong>Task</strong>: In this task, you will individually develop a sequence of three lessons for engaging a class in an effective mathematics learning and teaching sequence, using knowledge of effective student learning, content and teaching strategies for the Primary Years (P-6). You will communicate learning goals, plan and evaluate learning experiences, select and use strategies to meet specific learning goals, build awareness of forms of diversity, and plan individual and small group learning tasks to cater for diverse needs. The lesson will demonstrate creativity and initiative.</p>\n<p><br/></p>\n<p>You will then use curriculum, assessment and reporting knowledge and research literature to justify your decisions by completing a rationale. The rationale will be assessed according to critical engagement with relevant literature.</p>\n<p><br/></p>\n<p>In this task, students will develop a sequence of three lessons for engaging students in mathematics. The lesson plans will include a literature-informed rationale that justifies the lesson; highlights the importance of its content and processes for mathematical learning; outlines and justifies the pedagogical approaches, and details the epistemological theoretical framework. Through this task, students will:</p>\n<p>•\tcommunicate learning goals</p>\n<p>•\testablish learning goals and learning plans</p>\n<p>•\tplan and evaluate learning experiences</p>\n<p>•\tbuild awareness of policy and procedures</p>\n<p>•\tselect and use strategies to meet specific learning goals</p>\n<p>•\tbuild awareness of the socially, culturally, and historically constructed nature of knowledge</p>\n<p>•\tplan individual and small group learning tasks to cater to diverse needs</p>\n<p>•\tidentify a range of teaching strategies for promoting numeracy</p>\n<p>•\tconsider the impact of ICT upon numeracy development</p>\n<p>•\tplan small group learning tasks</p>\n<p>•\tbuild knowledge of evidence-informed theories on mathematics teaching and learning; cater to individual learning needs through development of investigative mathematics lessons</p>\n<p>•\tdemonstrate understanding of the characteristics and needs of students in the primary school phase of learning plan and monitor group work; and </p>\n<p>•\tcater for a range of learning approaches in planning.</p>\n<p><br/></p>\n<p>This assessment should follow this format:</p>\n<p><strong>THE LESSON PLAN</strong></p>\n<p>•\tIntroduce the year level and the chosen topic (a few sentences)</p>\n<p>•\tComplete a lesson sequence plan using an agreed format including the following elements.</p>\n<p><strong>1. Plan for effective learning and teaching. Ensure your plan:</strong></p>\n<p>•\tAddresses the Australian Curriculum: Mathematics content descriptor/s for an effective mathematics learning and teaching sequence </p>\n<p>•\tDemonstrates a variety of teaching strategies and activities including some individual and group work</p>\n<p>•\tNotes possible cross-curricular links for numeracy development based on the chosen topic</p>\n<p>•\tDemonstrates knowledge of a range of resources including ICT that engage students in their learning. </p>\n<p><strong>2. Know the content and how to teach it. Ensure your plan:</strong></p>\n<p>•\tDemonstrates knowledge and understanding of the concepts, substance and structure of the content and teaching strategies of the teaching area</p>\n<p>•\tOrganises content into an effective learning and teaching sequence</p>\n<p>•\tUses curriculum, assessment and reporting knowledge to design learning sequences and lesson plans</p>\n<p>•\tIncludes in your teaching strategies ICT applications that expand learning opportunities for students.</p>\n<p><strong>3. Know students and how they learn, and how to support inclusive participation. Ensure your plan:</strong></p>\n<p>•\tDemonstrates knowledge of strategies for differentiating teaching to meet three (choose 3) specific learning needs of students </p>\n<p>•\tIdentifies strategies to support inclusive participation and engagement in classroom activities.</p>\n<p><strong>4. Assess student learning</strong></p>\n<p>•\tIncludes formative assessments with success criteria for feedback that would allow for consistent and comparable judgements of student learning within the class and across year level cohorts.</p>\n<p><br/></p>\n<p><strong>THE RATIONALE</strong></p>\n<p>In your planning, you had to make many professional decisions. In this section, you must demonstrate research informed knowledge and understanding of how your decisions help students learn and the implications for teaching. Take the important aspects of your plan and use them as subheadings as listed in Part 1 above (approx. 1000 words).</p>\n<p><br/></p>\n<p><strong>Criteria</strong></p>\n<p>You will be assessed on your ability to:</p>\n<p>•\tDesign teaching and learning sequences using knowledge of student learning, content, and effective teaching strategies</p>\n<p>•\tImplement teaching strategies that incorporate ICT and cross-curricular links to expand student learning opportunities</p>\n<p>•\tSelect and use a range of resources, including ICT, that engage students in their learning</p>\n<p>•\tDemonstrate knowledge and understanding of the concepts, substance and structure of the content and teaching strategies</p>\n<p>•\tDemonstrate knowledge and understanding of differentiation strategies to meet student learning needs/abilities</p>\n<p>•\tDemonstrate understanding of a range of assessment strategies and purposes (e.g., informal and formal, diagnostic, formative and summative)</p>\n<p>•\tSelect and use literature to justify teaching decisions</p>\n<p>•\tDemonstrate communication including written and visual representations skills consistent with personal, professional and academic conventions in traditional and digital texts.</p>\n<p><br/></p>\n<p><strong>Submission</strong></p>\n<p>You must submit the assessment electronically via the assignment link on the course website. By submitting your assignment, you are certifying that it is your original work and that is has not been previously submitted for assessment in any other course at university (unless resubmission is part of the requirements for the course assessment). You need to ensure you have completed UQ’s academic integrity module before you submit your assignment. The module can be found at: https://www.uq.edu.au/integrity. Always keep a copy of your submitted assignment.</p>\n<p><br/></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Task 2a - Presentation of draft unit plan",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd> Pass / Fail - 15-minute group presentation </dd>",
            "due_date": "<dd><p> 28/04/2025</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Rationale:</strong> As an early career teacher, you will discuss your planning with more experienced teaching partners or coaches. This presentation will be an opportunity to practice engaging in an authentic and valuable aspect of the planning process. It will also serve as an opportunity to receive formal feedback on your final unit plan and rationale. </p>\n<p><br/></p>\n<p><strong>Task</strong></p>\n<p>This will be a short oral presentation (15 minutes) where your group will: </p>\n<p>•\tExplain how the analysed data informed the selection of a mathematical focus</p>\n<p>•\tExplain how ideas taken from the literature informed your planning</p>\n<p>•\tExplain the design and sequencing of lessons across the unit</p>\n<p>•\tExplain the alignment of the summative assessment task and marking rubric</p>\n<p>A slide template will be provided to you. These presentations will be run in tutorial sessions. While you might have some prepared explanations, the discussion will largely include informal questioning and discussion between you and your tutor.  </p>\n<p><br/></p>\n<p><strong>Important information about group work</strong></p>\n<p>You will receive a single group mark for this task, as all group members should contribute equally to the design and delivery of the assessment task. However, exceptions can be made in the event of one or more group members engaging in ‘social loafing’ (also known as ‘free-riding’):</p>\n<p>Free riding is a form of social loafing seen in a group when one or more members slacks off and ‘rides’ on the extra efforts of their co-workers (Walker &amp; Angelo, 1998).</p>\n<p>If your small group is experiencing dysfunction, including ‘social loafing’ by one or more members, it is your responsibility to bring this promptly to the attention of your tutor / course coordinator, who will then support the group to resolve the problems in a respectful way. If no resolution can be found, the tutor / course coordinator can take steps including:</p>\n<p>•\tRemoval of the non-contributing student/s from the group and require student/s to complete the task either individually or in another small group with other ‘social loafers’</p>\n<p><br/></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>This will occur during the tutorial time for Week 9. In the event of disruption during the semester that prevents the scheduled assessment occurring as planned, the assessment will be changed to an alternative form of assessment such as a zoom presentation. The timing of the assessment may also be impacted.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Task 2b - Unit plan, assessment and rubric",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>60% 9000 words (4500 words per student in group) </dd>",
            "due_date": "<dd><p> 22/05/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Product/ Design",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Rationale</strong>: As teachers, you will need to use collect, analyse, and interpret data with respect to your students’ understanding of particular mathematics concepts. Once this data has been analysed, you will plan units of work, lessons, and assessments to provide students with the opportunity to develop knowledge and understanding of the content as well as to demonstrate what they have learnt. This assessment task is designed to provide preservice teachers with practical opportunities to individually and collaboratively demonstrate how creating a unit of work in mathematics can develop student conceptual understanding. </p>\n<p><strong>Task:</strong></p>\n<p>For this task, you are to design a unit of work that promotes students' mathematical understanding and supports numeracy development. </p>\n<p>You will work in pairs to select a class set of data from a particular Year level. This is pre-assessment Mathematics data which links each question and the corresponding students’ responses to a content descriptor in mathematics. You are to analyse this data to determine your students’ strengths and identify concepts in mathematics that need to be taught or consolidated in the future. As a pair, you will need to write a short report of the analysed data, and finalise the report indicating the focus area of mathematics for your unit. </p>\n<p>Your final unit plan, including a summative assessment task, will be submitted in Week 12. For this final part of the assessment you will: </p>\n<ul>\n<li>Use the QCAA unit plan template and the assessment matrix available through Blackboard. </li>\n<li>Write a unit rationale in which you and your partner will briefly describe and explain the selection of the mathematical area as well as selection of topic and key concepts for the unit. The rationale will also justify the pedagogical approach, goals for students across the full range of abilities and how teaching strategies are differentiated to meet their specific needs. </li>\n<li>Work collaboratively to revise your unit plan and develop a powerful teaching and learning sequence from the feedback received in Week 9. This teaching and learning sequence will be set out using the QCAA template. It will demonstrate achievable yet challenging student learning goals, suggested teaching and learning episodes (lessons), possible teaching and learning activities, ways to meet the needs of students with diverse linguistic, cultural, religious and socioeconomic backgrounds including Indigenous students, and assessment opportunities (e.g., diagnostic, observation, consultation, peer/self, focused analysis, formative and summative assessment). The document should show logical development for student conceptual development based on your chosen mathematical content area. Relevant high-quality classroom resources (including Information Communication Technology) should be detailed (links to documents or online resources should be included) – all need to be suitably referenced in one alphabetical list at the end of the assignment.</li>\n<li>Develop a culminating unit assessment piece that includes a student task sheet as well as an appropriate standards and criteria sheet. Ensure that the assessment task is designed to assess not only what but also how the unit will be taught (i.e., check alignment across content, concepts, skills, mathematical proficiencies, year-level specific curriculum content descriptors – including elaborations and achievement standards, student learning goals, and all teaching and learning activities). Demonstrate your knowledge and understanding of the different purposes and instruments of assessment by including different forms such as diagnostic, observation, consultation, peer/self, focused analysis, formative and summative assessment. </li>\n<li>Include annotations on a set of six or more research articles from among the relevant literature (i.e., book chapters or journal articles) and/or sources of professional learning to explicitly support planning, teaching and assessment of the different concepts, dispositions, skills and inquiry processes in their unit. These annotations need to specifically evidence research-informed knowledge and understanding of ways to promote the teaching and learning of the mathematical concept. </li>\n<li>Write an individual personal reflection - a short written critical reflection (500 words maximum) to show how your continued research and professional learning throughout the course developed and changed your thinking and understanding to improve your teaching and student learning in the Mathematics.</li>\n<li>Include a complete reference list using correct APA format that includes all academic references as well as any resources used within the unit (one list).</li>\n</ul>\n<p><br/></p>\n<p><strong>Important information about group work</strong></p>\n<p>You will receive a single group mark for this task, as all group members should contribute equally to the design and delivery of the assessment task. However, exceptions can be made in the event of one or more group members engaging in ‘social loafing’ (also known as ‘free-riding’):</p>\n<p>Free riding is a form of social loafing seen in a group when one or more members slacks off and ‘rides’ on the extra efforts of their co-workers (Walker &amp; Angelo, 1998).</p>\n<p>If your small group is experiencing dysfunction, including ‘social loafing’ by one or more members, it is your responsibility to bring this promptly to the attention of your tutor / course coordinator, who will then support the group to resolve the problems in a respectful way. If no resolution can be found, the tutor / course coordinator can take steps including:</p>\n<ul>\n<li>Removal of the non-contributing student/s from the group and require student/s to complete the task either individually or in another small group with other ‘social loafers’</li>\n<li>Deducting one grade from the overall group score for non-contributing student/s, as evidenced in the task planner or work log (see criteria sheet).</li>\n</ul>\n<p><br/></p>\n<p><br/></p>\n<p><br/></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>One member of the collaborative group will submit the unit plan on behalf of the group. The unit plan will be submitted electronically as a word document via the Assignment link on Blackboard in the Assessment folder.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Using student data to plan maths teaching</strong><br><p>This week we consider the different ways in which you can use student assessment data to inform your planning. We examine class and school sets of data and consider how you can use this to inform and design a unit of work. (APST 1.3, 2.2, 2.3, 3.1, 3.2, 4.2, 5.1, 6.3)</p></br></p><p><strong>Learning outcomes:</strong> L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Using student data to plan maths teaching</strong>",
            "topic_description": "Using student data to plan maths teaching This week we consider the different ways in which you can use student assessment data to inform your planning. We examine class and school sets of data and consider how you can use this to inform and design a unit of work. (APST 1.3, 2.2, 2.3, 3.1, 3.2, 4.2, 5.1, 6.3)",
            "learning_outcomes": [
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Developing fraction concepts</strong><br><p>This week will focus on the underpinning conceptual understanding and mathematical structures that are needed to teach and develop fraction concepts. In particular, different fraction models, understanding fractional parts (iteration and partitioning), using fraction models to develop the concept of equivalence and comparing and describing fractions. (APST 1.2; 2.1; 2.2; 3.3)</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L06</p></div></td>",
            "topic_title": "<strong>Developing fraction concepts</strong>",
            "topic_description": "Developing fraction concepts This week will focus on the underpinning conceptual understanding and mathematical structures that are needed to teach and develop fraction concepts. In particular, different fraction models, understanding fractional parts (iteration and partitioning), using fraction models to develop the concept of equivalence and comparing and describing fractions. (APST 1.2; 2.1; 2.2; 3.3)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L06"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Planning for successful maths teaching</strong><br><p>This week we focus on the role of planning, use of curriculum documents, constructive alignment, using the proficiencies in your planning, considering potential impacts on your planning. In the tutorial you will critically analyse and critique mathematics lessons. In addition, you will begin to plan a series of learning experiences demonstrating constructive alignment (learning objectives, curriculum, proficiencies). Considerations will also need to be made for formative assessment strategies in the lesson. (APST 1.2, 1.3, 1.4, 2.1, 2.2, 2.6, 3.1, 3.2, 3.3, 3.4, 4.2, 5.1, 6.3)</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Planning for successful maths teaching</strong>",
            "topic_description": "Planning for successful maths teaching This week we focus on the role of planning, use of curriculum documents, constructive alignment, using the proficiencies in your planning, considering potential impacts on your planning. In the tutorial you will critically analyse and critique mathematics lessons. In addition, you will begin to plan a series of learning experiences demonstrating constructive alignment (learning objectives, curriculum, proficiencies). Considerations will also need to be made for formative assessment strategies in the lesson. (APST 1.2, 1.3, 1.4, 2.1, 2.2, 2.6, 3.1, 3.2, 3.3, 3.4, 4.2, 5.1, 6.3)",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Developing decimals and percentages</strong><br><p>This week will focus on building an understanding in relation to how the place-value system links to decimal fractions. There will be a focus on the use of multiple representations and models to connect fractions, decimals and percentages. Multiple strategies will be explored when computing with decimals. (APST 1.2; 2.1; 2.2; 3.3)</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L06</p></div></td>",
            "topic_title": "<strong>Developing decimals and percentages</strong>",
            "topic_description": "Developing decimals and percentages This week will focus on building an understanding in relation to how the place-value system links to decimal fractions. There will be a focus on the use of multiple representations and models to connect fractions, decimals and percentages. Multiple strategies will be explored when computing with decimals. (APST 1.2; 2.1; 2.2; 3.3)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L06"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Sequencing lessons and formative assessment</strong><br><p>This week we will focus on creating a sequence of lessons from one of the mathematics strands. Consideration will be given for the: content knowledge being developed; teaching strategies implemented; selection of resources and ICT; and catering for a diverse range of students. In addition, formative assessment strategies will be designed to link to the sequence of lessons (APST 1.2, 1.3, 1.4, 2.1, 2.2, 2.6, 3.1, 3.2, 3.3, 3.4, 4.2, 5.1, 6.3)</p></br></p><p><strong>Learning outcomes:</strong> L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Sequencing lessons and formative assessment</strong>",
            "topic_description": "Sequencing lessons and formative assessment This week we will focus on creating a sequence of lessons from one of the mathematics strands. Consideration will be given for the: content knowledge being developed; teaching strategies implemented; selection of resources and ICT; and catering for a diverse range of students. In addition, formative assessment strategies will be designed to link to the sequence of lessons (APST 1.2, 1.3, 1.4, 2.1, 2.2, 2.6, 3.1, 3.2, 3.3, 3.4, 4.2, 5.1, 6.3)",
            "learning_outcomes": [
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Developing Fraction Operations</strong><br><p>This week we focus on how you teach fraction operations to promote student understanding. There will be a focus on the role of multiple representations and language to support the teaching of addition, subtraction, multiplication and division of fractions. (APST 1.2; 2.1; 2.2; 3.3)</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L06</p></div></td>",
            "topic_title": "<strong>Developing Fraction Operations</strong>",
            "topic_description": "Developing Fraction Operations This week we focus on how you teach fraction operations to promote student understanding. There will be a focus on the role of multiple representations and language to support the teaching of addition, subtraction, multiplication and division of fractions. (APST 1.2; 2.1; 2.2; 3.3)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L06"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Planning units and designing summative assessment</strong><br><p>This week we focus on the role of constructive alignment when creating a mathematics unit for primary school classrooms. We will consider the interplay and constructive alignment between the data, curriculum documents, contemporary research, planning and sequencing learning experiences, anticipating student responses, and aligning assessment and rubrics (APST 1.2, 1.3, 1.4, 2.1, 2.2, 2.6, 3.1, 3.2, 3.3, 3.4, 4.2, 5.1, 6.3)</p></br></p><p><strong>Learning outcomes:</strong> L02, L05, L06</p></div></td>",
            "topic_title": "<strong>Planning units and designing summative assessment</strong>",
            "topic_description": "Planning units and designing summative assessment This week we focus on the role of constructive alignment when creating a mathematics unit for primary school classrooms. We will consider the interplay and constructive alignment between the data, curriculum documents, contemporary research, planning and sequencing learning experiences, anticipating student responses, and aligning assessment and rubrics (APST 1.2, 1.3, 1.4, 2.1, 2.2, 2.6, 3.1, 3.2, 3.3, 3.4, 4.2, 5.1, 6.3)",
            "learning_outcomes": [
                "L02",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Early algebra and mathematical modelling</strong><br><p>This week will focus on early algebraic thinking. In particular, we will explore how algebra can be used in the mathematical modelling in problem solving. We will also explore the important role of reasoning, justifying and generalising in early algebraic thinking. (APST 1.2; 2.1; 2.2; 3.3)</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L06</p></div></td>",
            "topic_title": "<strong>Early algebra and mathematical modelling</strong>",
            "topic_description": "Early algebra and mathematical modelling This week will focus on early algebraic thinking. In particular, we will explore how algebra can be used in the mathematical modelling in problem solving. We will also explore the important role of reasoning, justifying and generalising in early algebraic thinking. (APST 1.2; 2.1; 2.2; 3.3)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L06"
            ]
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid Semester Break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid Semester Break</strong>",
            "topic_description": "Mid Semester Break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In-class presentation HURDLE TASK</strong><br><p>In-class unit plan presentations (Hurdle presentation for Assessment 2 unit plan): This week you will present your unit plan during the allocated lecture and tutorial times. Feedback will be provided to you for consideration for your final submission. (APST 1.2, 1.3, 1.4, 2.1, 2.2, 2.3, 2.6, 3.1, 3.2, 3.3, 3.4, 4.2, 5.1, 6.3)</p></br></p><p><strong>Learning outcomes:</strong> L05, L06</p></div></td>",
            "topic_title": "<strong>In-class presentation HURDLE TASK</strong>",
            "topic_description": "In-class presentation HURDLE TASK In-class unit plan presentations (Hurdle presentation for Assessment 2 unit plan): This week you will present your unit plan during the allocated lecture and tutorial times. Feedback will be provided to you for consideration for your final submission. (APST 1.2, 1.3, 1.4, 2.1, 2.2, 2.3, 2.6, 3.1, 3.2, 3.3, 3.4, 4.2, 5.1, 6.3)",
            "learning_outcomes": [
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Proportional thinking</strong><br><p>THIS WILL BE AN INDEPENDENT STUDY WEEK DUE TO THE LABOUR DAY PUBLIC HOLIDAY. This week will focus on building conceptual and structural understanding in relation to ratio, proportions and proportional reasoning. In particular, understanding how ratio connects to fractions; contrasting proportional and non-proportional situations; and how to teach children to solve proportional problems. (APST 1.2; 2.1; 2.2; 3.3)</p>\n<p>All materials will be provided on Blackboard.</p></br></p><p><strong>Learning outcomes:</strong> L01, L06</p></div></td>",
            "topic_title": "<strong>Proportional thinking</strong>",
            "topic_description": "Proportional thinking THIS WILL BE AN INDEPENDENT STUDY WEEK DUE TO THE LABOUR DAY PUBLIC HOLIDAY. This week will focus on building conceptual and structural understanding in relation to ratio, proportions and proportional reasoning. In particular, understanding how ratio connects to fractions; contrasting proportional and non-proportional situations; and how to teach children to solve proportional problems. (APST 1.2; 2.1; 2.2; 3.3) All materials will be provided on Blackboard.",
            "learning_outcomes": [
                "L01",
                "L06"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Teaching statistical thinking</strong><br><p>This week will focus on teaching and learning activities that support the development of statistical thinking. In particular, exploring techniques for collecting data, sampling, considering which questions are statistical questions; examining different graphical displays; illustrating and explaining meaning of measures of centre and variability. There will also be a focus on supporting students to interpret data and consider statistics from a social justice perspective. The role of technology to teach statistics will also be explored (APST 1.2; 1.3; 1.4; 2.1; 2.2; 2.6; 3.3; 3.4)</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L06</p></div></td>",
            "topic_title": "<strong>Teaching statistical thinking</strong>",
            "topic_description": "Teaching statistical thinking This week will focus on teaching and learning activities that support the development of statistical thinking. In particular, exploring techniques for collecting data, sampling, considering which questions are statistical questions; examining different graphical displays; illustrating and explaining meaning of measures of centre and variability. There will also be a focus on supporting students to interpret data and consider statistics from a social justice perspective. The role of technology to teach statistics will also be explored (APST 1.2; 1.3; 1.4; 2.1; 2.2; 2.6; 3.3; 3.4)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L06"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Teaching probability</strong><br><p>This week will focus on how to teach probability in the primary school including, the probability continuum; theoretical probability; and, experimental probability. Opportunities for exploring this with a focus on technology will also be included this week. (APST 1.2; 2.1; 2.2; 2.6. 3.3; 3.4)</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L06</p></div></td>",
            "topic_title": "<strong>Teaching probability</strong>",
            "topic_description": "Teaching probability This week will focus on how to teach probability in the primary school including, the probability continuum; theoretical probability; and, experimental probability. Opportunities for exploring this with a focus on technology will also be included this week. (APST 1.2; 2.1; 2.2; 2.6. 3.3; 3.4)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L06"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Building professional communities</strong><br><p>The final week in this course will focus on how you can build and develop your professional networks in mathematics education both within Australia and Internationally. Building a sense of community within teaching is essential for growth in your teaching career. (APST 1.2; 2.1; 3.3)</p></br></p><p><strong>Learning outcomes:</strong> L05, L06</p></div></td>",
            "topic_title": "<strong>Building professional communities</strong>",
            "topic_description": "Building professional communities The final week in this course will focus on how you can build and develop your professional networks in mathematics education both within Australia and Internationally. Building a sense of community within teaching is essential for growth in your teaching career. (APST 1.2; 2.1; 3.3)",
            "learning_outcomes": [
                "L05",
                "L06"
            ]
        }
    ]
}