{
    "course_title": "Team Project I",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/ENGG2800-21376-7520",
    "full_course_code": "ENGG2800-21376-7520",
    "course_code": "ENGG2800",
    "class_code": "21376",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "work effectively as a member of a team to design and build a functional electronic product on-budget and on-time."
        },
        {
            "number": "LO2.",
            "description": "demonstrate specific electronic design and/or software skills required to produce a simple analog and digital system fit-for-purpose."
        },
        {
            "number": "LO3.",
            "description": "design a simple schematic diagram, produce associated PCB artwork for fabrication and construct a working circuit."
        },
        {
            "number": "LO4.",
            "description": "effectively use software tools to aid project management, product design, version control and communication tasks."
        },
        {
            "number": "LO5.",
            "description": "summarise relevant aspects of the product design and design process to technical audiences via a seminar and report."
        },
        {
            "number": "LO6.",
            "description": "describe issues that should be considered regarding sustainability of the product design."
        },
        {
            "number": "LO7.",
            "description": "reflect on your learning practices or development process to identify areas for personal improvement."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Team Code of Ethics and Code of Conduct",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 14/03/2025 3:00 pm</p>\n<p>\n</p><p>As long as the task is submitted on time, resubmission will be possible if a passing mark is not awarded. Details of the resubmission time will be made available to teams individually.</p></dd>",
            "learning_objectives": "L01",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Each team is to create and submit a team code of ethics and code of conduct outlining how team members will conduct themselves over the course of the semester.</p>\n<p>The code of ethics must outline the principles that the team will adhere to during the semester. It is recommended that this is informed by the codes of ethics for relevant professional societies (e.g. Engineers Australia and IEEE).</p>\n<p>The code of conduct must outline the expected (and/or prohibited) behaviour of team members and must include statements on expected communication modes / frequencies and attendance expectations.</p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission via Blackboard</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>100% late penalty after 1 hour grace period. The one-hour grace period is recorded from the time the submission is due.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Individual PCB task (working circuit module on PCB & pdf of schematic)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>5% (Pass/Fail) </dd>",
            "due_date": "<dd><p> 3/03/2025 - 4/04/2025</p>\n<p>\n</p><p>Demonstrations occur during scheduled practical sessions only - just ask a member of the teaching staff to assess your PCB in one of these sessions. (PCB manufacturing submissions need to be submitted earlier for manufacturing purposes, see task description for details). Your schematic and PCB artwork must be uploaded to Blackboard before you are marked by a member of the teaching staff.</p></dd>",
            "learning_objectives": "L02, L03",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Practical/ Demonstration",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>ALL students are to individually complete a working circuit element from a supplied design specification. This will require a simple, documented circuit design (schematic), component choices, PCB artwork, assembly and testing. </p>\n<p>Submission of the PCB artwork for production by external service providers will be required<strong> well before the due date to allow for manufacturing time (see below)</strong>. Return of the physical PCB is expected in approximately 7-10 days, although this manufacturing is done externally to the university and as such no guarantees are possible. Please see <a href=\"https://pinecone2.uqcloud.net\">pinecone</a> for the details of submitting a board for manufacture. You are not permitted to submit PCBs that were manufactured outside of pinecone, or you will receive zero marks for this assessment.</p>\n<p>Individual assessments of the working circuits and schematics will occur in any practical session up to and including the last practical session of week 6. You will be provided with a single kit of components which is intended to be used to build your circuit. If these components are consumed, damaged, or otherwise no longer usable, you are expected to source your own equivalent components. More details are available in the project task sheet.</p>\n<p>You will have an individual budget available at ETSG which can be used to purchase PCBs and other components. You may only order a maximum of 1 PCB per week using this budget, and the budget will expire at the end of week 6.<strong> </strong>After the budget expires, it will no longer be possible for you to order PCBs individually or purchase components for this assessment from ETSG. In addition, there is no mechanism to \"top-up\" your ETSG budget with your own funds. You may still purchase components (other than the PCB) externally if your budget runs out. You <strong>must</strong> have a PCB to submit with your identifying information, even if it doesn't work. <strong>Submissions of PCBs for external manufacturing for this task are only possible up to 11:59pm (one minute before midnight) on Sunday at the end of week 3</strong>; no submissions of PCBs for this task will be accepted after that.  If the PCB does not work and it is no longer possible to order another PCB, your only option to unlock the grade hurdle is to hand-in the PCB as-is and additionally build a working circuit on a breadboard. </p>\n<p>Only your first submission will be used in determining the marks awarded.</p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>As described in the task specification on Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Product demonstration sequence",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>80%</dd>",
            "due_date": "<dd><p>Week 5 - Demo 1 (Preliminary)</p>\n<p>Week 9 - Demo 2 (Intermediate)</p>\n<p>Week 13 - Final demo. All projects are due at 10am on Monday of week 13</p>\n<p>Signup polls will be distributed in the weeks before demonstrations.</p></dd>",
            "learning_objectives": "L01, L02, L04",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Computer Code, Practical/ Demonstration, Product/ Design, Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Over the duration of the semester, teams are to implement a hardware and software product that meets the published specification and associated TP-STD standards available on Blackboard. </p>\n<p>You will demonstrate your product at three separate points during semester. You will be assessed for participation as well as your progress (hardware, firmware or software) based on the evidence presented using a marksheet available on the course Blackboard site. The demonstrations will occur at the following points in semester:</p>\n<ul>\n<li>Preliminary demonstration 1 (weighting: 10%)</li>\n<li>Intermediate demonstration 2 (weighting: 10%)</li>\n<li>Final demo (weighting: 60%)</li>\n</ul>\n<p>For all three demonstrations, a poll will be sent to all teams in the weeks before the due date in order to allow them to sign up for a time slot. Further details about the process will be available on Blackboard.</p>\n<p>The <strong>final</strong> submission requires the team to submit the following in an Australia Post BX1, BX2, Small (SKU: 44862) or Medium (SKU: 44863) box (or equivalent) to staff in 47-209 by 10 AM on Monday of week 13:</p>\n<ul>\n<li>your product, including any cables, batteries (which should be uninstalled) etc. as required for the product to be tested. All of these parts must be budgeted for (any exceptions will be explicitly noted in the specification).</li>\n<li>printed copy of all schematic files documenting all electrical components (resistors, capacitors, integrated circuits, connectors etc).</li>\n<li>any other required documentation (details will be provided) </li>\n<li>a USB drive containing a software installer and any required files/documents (details will be provided). The USB drive will be returned to you after your demonstration.</li>\n<li>a declaration signed by all team members validating all submitted contents (provided as a label to stick on your submission box)</li>\n</ul>\n<p>More details on the submission process will be provided via Blackboard.</p>\n<p>In general, all members of the team are expected to attend the marking sessions. If you are not able to attend, your product will be marked in your absence, and you will not be able to provide critical clarifications to the marker about the functionality implemented in your product. Given that the circumstances of any absence may be considered as part of the moderation process, it is important to let your team and the teaching staff know if you are unable to attend the demonstration.</p>\n<p>While marks will be given for working subsystems, the assessment scheme is biased towards completeness. To get a good grade the product must be sufficiently implemented for the customer to be able to use it in its operational environment, even if it might not quite meet the specifications. If your final product does not work, you will be better off submitting working prototypes. Anything not submitted at submission time cannot be assessed.</p>\n<p>The system must be delivered in a testable form by the due date. Penalties will apply for missing or inaccurate files/documentation submitted with the product (and for inconsistencies between printed and electronic documentation). These penalties will be outlined in the marksheet on blackboard. Penalties apply for not meeting the TP-STD standards - your final product mark will be limited to a maximum of 50%. Your team's printed circuit board(s) (PCBs) must be manufactured via pinecone, or your final product mark will be limited to a maximum of 50%. </p>\n<p>The product mark will be based mainly on the performance of the product during evaluation. It is very important that your product is functioning correctly during the demonstration session, and that clear instructions are provided as to how the product is operated. However, you may not use operating instructions as a way to require the user to perform more complex/onerous actions than those that are required by the specification.</p>\n<p><strong><em>Consideration of past performance or re-evaluation of the product at a later date will not be available.</em></strong></p>\n<p>Based on staff observation and/or team request and/or the team’s performance in an interim demonstration and/or responses to a peer assessment, the teaching staff may require your team to attend regular meetings with a teaching staff member. This is intended to support teams that are perceived to be struggling in some way. Failure to participate in such meetings will be taken into account during the moderation process and may therefore result in a lower product mark.</p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The preliminary and intermediate demonstrations will occur during the scheduled prac sessions in the respective weeks.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Assessment of Individual Performance (Formative/incorporated into product mark)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> Incorporated into product mark </dd>",
            "due_date": "<dd><p> 24/03/2025 4:00 pm</p>\n<p> 28/04/2025 4:00 pm</p>\n<p> 26/05/2025 4:00 pm</p></dd>",
            "learning_objectives": "L01, L07",
            "mode": "Activity/ Performance",
            "category": "Participation/ Student contribution, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You will undertake three evaluations of each member of your team through the semester. They will also be evaluating you. The purpose of the first two evaluations is to give formative feedback to all team members on their performance to that point. Results from the third evaluation will be used if moderation takes place (see below).</p>\n<p>The peer assessment scores will not directly moderate the product mark but may serve as a prompt to teams to request a moderation meeting. The absolute values and trends across the three evaluations may be used as evidence of the team performance of individuals in a moderation meeting.</p>\n<p>The default Peer Assessment Factor (PAF) which will moderate the product mark will be 1.0. If any members of the team wish to change this distribution, a moderation meeting will be required with teaching staff. Students must indicate this intention by email to the course coordinator by 4pm, Friday Week 13. It is recommended that you wait until after your final demonstration to apply for moderation, as moderation meetings cannot be cancelled once requested.</p>\n<p>A moderation meeting will require attendance of all members. Every opportunity will be given to the team to derive an acceptable distribution of PAFs. If no resolution within the meeting is possible, teaching staff will allocate PAFs on the basis of responses to questions, history of performance, demonstrator feedback and marked product. A document describing the moderation process can be found on Blackboard.</p>\n<p>A PAF of 1.0 indicates that you are making a satisfactory/expected contribution to the team. A PAF less than 1.0 indicates your contribution is less than expected. A PAF greater than 1.0 indicates you are contributing more than expected. Failure to complete a formative peer assessment will result in you receiving a PAF of 0.5 for that evaluation, i.e. it will be assumed that your contribution to the team up to that point has been much less than expected.</p>\n<p>Your overall PAF will determine a Product Scaling Factor (PSF) as follows:</p>\n<ul>\n<li>for a team of 4 or 5, PSF = PAF if your PAF is &lt;= 1 and PSF = (1+PAF)/2 if your PAF is &gt; 1</li>\n<li>for a team of 3, PSF = 1.1 * PAF if your PAF is &lt;= 1 and PSF = 1.1*(1+PAF)/2 if your PAF is &gt; 1</li>\n<li>for a team of 2, PSF = 1.25 * PAF if your PAF is &lt;= 1 and PSF = 1.25*(1+PAF)/2 if your PAF is &gt; 1</li>\n</ul>\n<p>Your product mark will be scaled (multiplied) by this PSF (and then capped at the maximum possible product mark where applicable).</p>\n<p>Submission of formative PAFs at each timepoint is your responsibility. Submission after the due date is not possible, and a lack of submission may be considered negatively toward you in a moderation meeting.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submitted online via the provided tool (Blackboard link will be provided)</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-4",
            "assessment_title": "Seminar Presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p> 7/04/2025 - 11/04/2025</p>\n<p>\n</p><p>Presentations will be scheduled based on the availability of participants and suitable presentation spaces.</p></dd>",
            "learning_objectives": "L01, L02, L05, L06",
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>A demonstration of progress by means of a brief presentation (e.g. PowerPoint) by each team member is expected. Physical artefacts such as breadboards, PCBs and components may also be used along with software demonstrations. This will take about 2.5 minutes per person. It is expected that you will identify problems and propose solutions. Presentations will be open to all students and a schedule will be determined in the week prior to seminars. </p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Presentations will be performed in-person by your team. See Blackboard for more details.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-5",
            "assessment_title": "Final Report and Reflection",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>5%</dd>",
            "due_date": "<dd><p> 9/06/2025 4:00 pm</p></dd>",
            "learning_objectives": "L05, L06, L07",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The final report will consist of a brief re-statement of the team's roles and an individual summary of the background, methods and results of your work. The report must also address sustainability issues around your design. The report is an individual item of assessment - all parts must be completed individually.  </p>\n<p>In addition, a reflection describing your group work experience over the duration of the semester is required. The goal of this part of the assignment is to prompt reflective thoughts about the interactive aspects of the engineering project you have participated in. The reflection is an opportunity for you to consider the inter-personal mechanics of group work, and your experiences working as part of a team, and to document particular challenges you may have faced which did not form part of any technical reports or presentations. </p>\n<p>Discuss what you have learned about how to work in a group.</p>\n<p>Describe what worked well within your group, what did not work well, and why. </p>\n<p>How might you organise team work differently to improve performance? </p>\n<p>If your group had conflicts or problems in working as a team, describe them and give insights into how such problems were resolved, or could be avoided in the future.</p>\n<p>This report is not assessed solely on the basis of technical outcomes of the team, but also on the identification of interactions, personality types and organisational tools which formed part of the successes (or failures!) of your team.  </p>\n<p>The document will be submitted through Turnitin on the Blackboard site.</p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via Blackboard (Turnitin).</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 6(24 Feb - 06 Apr)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Altium - schematic design &amp; PCB artwork production</strong><br><p>Online modules are provided for an introduction to the Altium software package. Mastery of this package will be essential for production of interpretable schematics and manufacturable printed circuit boards.</p></br></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Altium - schematic design &amp; PCB artwork production</strong>",
            "topic_description": "Altium - schematic design & PCB artwork production Online modules are provided for an introduction to the Altium software package. Mastery of this package will be essential for production of interpretable schematics and manufacturable printed circuit boards.",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lectures and self-study series</strong><br><p>The lecture series will cover the course structure and organisation, product specifications, project planning, practical electronics and software design relevant to the product in the first few weeks of semester. Lecture notes will be posted on Blackboard and lectures will be recorded. Pre-recorded lectures are available on various topics. Further reading materials are available through tp-info.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Lectures and self-study series</strong>",
            "topic_description": "Lectures and self-study series The lecture series will cover the course structure and organisation, product specifications, project planning, practical electronics and software design relevant to the product in the first few weeks of semester. Lecture notes will be posted on Blackboard and lectures will be recorded. Pre-recorded lectures are available on various topics. Further reading materials are available through tp-info.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 13(03 Mar - 01 Jun)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Project work and teaching staff consultations</strong><br><p>Help and feedback provided by teaching staff during scheduled lab classes.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Project work and teaching staff consultations</strong>",
            "topic_description": "Project work and teaching staff consultations Help and feedback provided by teaching staff during scheduled lab classes.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        }
    ]
}