{
    "course_title": "Thinking about Literature: Criticism and Theory",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/ENGL2405-21601-7520",
    "full_course_code": "ENGL2405-21601-7520",
    "course_code": "ENGL2405",
    "class_code": "21601",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "read critical and theoretical texts closely, building on skills you have learnt from your study of literary texts;"
        },
        {
            "number": "LO2.",
            "description": "understand some of the ways in which literary (and other) texts can be conceptualised;"
        },
        {
            "number": "LO3.",
            "description": "understand some of the complex relations between literary texts and critical or theoretical texts;"
        },
        {
            "number": "LO4.",
            "description": "understand some of the complex relations literary texts have to the cultures in which they're produced, circulated and read;"
        },
        {
            "number": "LO5.",
            "description": "show a knowledge of some of the significant issues in literary criticism and theory;"
        },
        {
            "number": "LO6.",
            "description": "have a first-hand acquaintance with some of the key writings and figures associated with those issues;"
        },
        {
            "number": "LO7.",
            "description": "be able to use these skills and knowledges in your own critical analyses of literary texts;"
        },
        {
            "number": "LO8.",
            "description": "show developed interpretive, analytical, and communication skills; and"
        },
        {
            "number": "LO9.",
            "description": "understand and use conventions for the professional and scholarly presentation of documents."
        },
        {
            "number": "LO10.",
            "description": "better apply yourself to challenging tasks and ideas, and to work consistently at these tasks."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Seminar Preparation, Writing, and Participation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p> 24/02/2025 - 18/04/2025</p></dd>",
            "learning_objectives": "L01, L02, L05, L06",
            "mode": "Oral, Written",
            "category": "Participation/ Student contribution",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>There are 12 weeks of class in the semester, with two seminars per week. From weeks 1 to 13 (excluding the reading week) you will be given 1 mark (equals 1 percentage point) for each week that you:</p>\n<p>1. are prepared for (that is, you have done the readings and brought these to the seminar). These will be checked.</p>\n<p>2. attend and participate for the entirety of both seminars (so turning up on time and staying until the finish), and</p>\n<p>3. submit a writing task of passable standard to your tutor via the link found in the week's \"Resources\" folder on Blackboard <strong>before</strong> the first class of each week. For the writing task you write a response to a question based on that week's readings. <strong>The question will be provided on the course Blackboard site under 'Learning Resources--week X' from 5pm, the Friday before the relevant teaching week.</strong> Responses should be 100 words in length (plus or minus 10%), and are marked on a pass/fail basis.</p>\n<p><strong>Rationale:</strong></p>\n<p>Consistent preparation and participation lead to better learning outcomes and more productive and enjoyable seminars. Moreover, the three components of this assessment item--as detailed below--are basic to being students of literature, and as general skills are required by many workplaces. In addition, the ability to write on a set topic and within a short time frame are valuable academic and vocational skills--the more you write, the easier it becomes. Finally, this assessment item provides tutors (and yourself) with early feedback if you are having difficulties with course readings.</p>\n<p>Writing tasks will be returned with basic feedback e.g \"pass\", \"fail\" Students who fail a week should meet with their tutor.</p>\n<p><br/></p>\n<p> This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit a writing task of passable standard to your tutor via the link found in the week's \"Resources\" folder on Blackboard <strong>before</strong> the first class of each week.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Critical Essay",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>45% 2000 words (incl. quotations) </dd>",
            "due_date": "<dd><p> 24/04/2025</p>\n<p>\n</p><p>Submit via TurnItIn through Blackboard</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L08, L09",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Write a 2000-2200 word (excluding quotations) research-based critical essay on one of the following topics based on Module One. This task encourages you to explore in more detail a topic you find particularly interesting, and requires you to show your understanding of the topic.</p>\n<p>You need to construct an argument based on material covered in the first module of the course and from your research. To expand your ideas and understanding use a minimum of four critical scholarly sources. Two of these sources can be course readings from List A, excluding Carter and Coetzee. The other two sources must not be from the <em>Norton Anthology of Theory and Criticism</em> or List A texts.</p>\n<p>Scholarly sources can be an academic monograph, book chapter, or academic journal article. Some topics may need non-scholarly sources. These are not counted towards the critical sources.</p>\n<p>Depending on the topic, you may use one or two literary works as evidence, though these cannot be counted as critical sources. These literary works must be required reading on either ENGL1800 or ENGL1500 only (any year from 2015 to present). Note that the focus of your essay is the topic's theoretical or critical issue. You are not to write a conventional literary critical essay in which you provide a reading of a literary work, unless the topic specifies this. Even then, the focus will be on exploring a particular theoretical or critical framework to perform a reading.</p>\n<p>The essay must be correctly formatted using MLA 9th edition referencing and presentation style.</p>\n<p><br/></p>\n<p><strong>Rationale:</strong></p>\n<p>This assessment task requires you to:</p>\n<ol>\n<li>perform literary studies research so that you enounter, understand, and integrate scholarship relevant to your topic;</li>\n<li>think critically about the material covered in the first module and synthesise an argument based on this material and your research;</li>\n<li>write an analytical essay that demonstrates your understanding of the topic and the first module; and</li>\n<li>present a written document that adheres to professional standards of presentation (namely, MLA format) and written expression.</li>\n</ol>\n<p><br/></p>\n<p><strong>Submission:</strong></p>\n<p>TurnItIn Receipts:</p>\n<ul>\n<li>Assignments for this course will be submitted electronically via Blackboard and using <em>TurnItIn</em>. Before submitting any assignments for this course you must ensure you have completed UQ's compulsory online <a href=\"https://www.uq.edu.au/integrity/Login.aspx?ReturnUrl=%252fintegrity\"><em>Academic Integrity Tutorial.</em></a></li>\n<li>When you successfully submit your assessment to TurnItIn you will see text confirming your submission is complete, before being redirected to your Assignment inbox. On this page you can:</li>\n<li>View the name of the submitted file</li>\n<li>View date and time of the upload</li>\n<li>Resubmit your paper (if necessary)</li>\n<li>Download your submitted paper</li>\n<li>Download digital receipt.</li>\n<li>If you cannot see your submission in your Assignment inbox you should regard your submission as unsuccessful. Students are responsible for retaining evidence of submission by the due date for all assessment items, in the required form (e.g. screenshot, email, photo, and an unaltered copy of submitted work).</li>\n<li>If the submission was not successful:</li>\n<li>Note the error message (preferably take a screenshot). </li>\n<li>Go to your assignment page and see if it is possible to submit again.</li>\n<li>If you cannot submit again email your course coordinator immediately with the assignment attached.</li>\n<li>Please visit this webpage for further advice on <a href=\"https://web.library.uq.edu.au/library-services/it/learnuq-blackboard-help/learnuq-assessment/turnitin-assignments/submit-your-turnitin-assignment?p=0#0\">how to submit your TurnItIn assignment</a>.</li>\n</ul>\n<p> </p>\n<p>Integrity Pledge</p>\n<p>Assignments for this course will be submitted electronically via Blackboard and using Turnitin. Before submitting any assignments for this course, you must ensure you have completed UQ's compulsory online Academic Integrity Tutorial.</p>\n<p>In uploading an assignment via Turnitin you are certifying that it is your original work, that it has not been copied in whole or part from another person or source except where this is properly acknowledged, and that it has not in whole or part been previously submitted for assessment in any other course at this or any other university.</p>\n<p>Withholding marks prior to finalisation of grades</p>\n<p>Per <a href=\"https://ppl.app.uq.edu.au/content/3.10.02-assessment#Procedures\">the Assessment Judgements section of the Assessment Procedures</a>:ﾠ</p>\n<p>Results for all summative assessment items are to be made available to individual students through the eLearning Management System on completion of marking, with the exception of the final assessment item which is to be released only after the final grade for the course has been released</p>\n<p><br/></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>TurnItIn Receipts:</strong> </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Final Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>7/06/2025 - 21/06/2025</p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L06, L07, L08",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This in-person final examination will cover the second module of the course, though you may find it useful to include material discussed in module one in your essays.</p>\n<p><strong>Rationale:</strong></p>\n<p>This exam examines your understanding of the required readings and theoretical approaches in Module Two, textual analysis abilities, writing skills, and ability to relate the readings to literary texts under exam conditions. It is also an identity-invigilated form of assessment.</p>\n<p><strong>Format:</strong></p>\n<ul>\n<li>120 minutes 10 minutes perusal.</li>\n<li>The examination has four questions requiring you to write a short essay in response. Each essay is worth 10 marks (or 10 per cent of your marks for the course). Answer all questions. Write your answers in the supplied answer booklet.</li>\n<li>Specified materials permitted: Written materials only: you will be able to take into the examination room one A4, single-sided, single-spaced, typed or handwritten page of notes, in minimum 10 point font.</li>\n<li>Essay topics may include textual analysis of a supplied passage.</li>\n<li>Suggested length for each essay: between 600-750 words in length, including quotations.</li>\n<li>You can make reference to any of the relevant required readings from List A in your essays, and ensure you quote from the creative text if part of the essay topic.</li>\n<li>No other secondary source (e.g other critical readings of texts) is required.</li>\n<li>Avoid lengthy quotations. Use sentences, paragraphs, a logical arrangement of ideas, formal essay structure (an introduction, body, and conclusion), and correct spelling. Marks will be deducted for incorrect length and errors in written expression.</li>\n<li>A practice exam will be made available on Blackboard after the mid-semester break.</li>\n</ul>\n<p><br/></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1</strong><br><p>What is Literature? (And what is Literary Value?)</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L05, L06, L08, L10</p></div></td>",
            "topic_title": "<strong>Week 1</strong>",
            "topic_description": "Week 1 What is Literature? (And what is Literary Value?)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L05",
                "L06",
                "L08",
                "L10"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2</strong><br><p>What is Literary Criticism?</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L10</p></div></td>",
            "topic_title": "<strong>Week 2</strong>",
            "topic_description": "Week 2 What is Literary Criticism?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L10"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3</strong><br><p>What is it to be an Author?</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L10</p></div></td>",
            "topic_title": "<strong>Week 3</strong>",
            "topic_description": "Week 3 What is it to be an Author?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L10"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4</strong><br><p>How Do We Read Literary Texts, and Why?</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L10</p></div></td>",
            "topic_title": "<strong>Week 4</strong>",
            "topic_description": "Week 4 How Do We Read Literary Texts, and Why?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L10"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5</strong><br><p>What is Literary Language, and How Does it Work?</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L10</p></div></td>",
            "topic_title": "<strong>Week 5</strong>",
            "topic_description": "Week 5 What is Literary Language, and How Does it Work?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L10"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6</strong><br><p>Where Do Literary Texts Come From? The Heavens? The Imagination? Somewhere Else?</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L10</p></div></td>",
            "topic_title": "<strong>Week 6</strong>",
            "topic_description": "Week 6 Where Do Literary Texts Come From? The Heavens? The Imagination? Somewhere Else?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L10"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7</strong><br><p>What Does it Mean to Say that Literature is an Institution?</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L08, L10</p></div></td>",
            "topic_title": "<strong>Week 7</strong>",
            "topic_description": "Week 7 What Does it Mean to Say that Literature is an Institution?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L08",
                "L10"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8</strong><br><p>Does Literature Have Anything to Do with Politics?</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L10</p></div></td>",
            "topic_title": "<strong>Week 8</strong>",
            "topic_description": "Week 8 Does Literature Have Anything to Do with Politics?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L10"
            ]
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-semester Break - No Class</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-semester Break - No Class</strong>",
            "topic_description": "Mid-semester Break - No Class",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9</strong><br><p>Some Critical Approaches to Literature: Feminism</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L10</p></div></td>",
            "topic_title": "<strong>Week 9</strong>",
            "topic_description": "Week 9 Some Critical Approaches to Literature: Feminism",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L10"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10</strong><br><p>Reading week. No classes. </p></br></p></div></td>",
            "topic_title": "<strong>Week 10</strong>",
            "topic_description": "Week 10 Reading week. No classes.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11</strong><br><p>Some Critical Approaches to Literature: Psychoanalysis</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L10</p></div></td>",
            "topic_title": "<strong>Week 11</strong>",
            "topic_description": "Week 11 Some Critical Approaches to Literature: Psychoanalysis",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L10"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12</strong><br><p>Some Critical Approaches to Literature: Postcolonial Studies</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L10</p></div></td>",
            "topic_title": "<strong>Week 12</strong>",
            "topic_description": "Week 12 Some Critical Approaches to Literature: Postcolonial Studies",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L10"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13</strong><br><p>Some Critical Approaches to Literature: Marxism</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L10</p></div></td>",
            "topic_title": "<strong>Week 13</strong>",
            "topic_description": "Week 13 Some Critical Approaches to Literature: Marxism",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L10"
            ]
        }
    ]
}