{
    "course_title": "Introduction to Environmental Studies",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/ENVM1501-20630-7520",
    "full_course_code": "ENVM1501-20630-7520",
    "course_code": "ENVM1501",
    "class_code": "20630",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "describe major environmental processes that shape the biosphere with consideration for the influence and origins of humans"
        },
        {
            "number": "LO2.",
            "description": "describe some fundamental ecological principles and critically evaluate the relationship between biogeographic theory and terrestrial biodiversity conservation"
        },
        {
            "number": "LO3.",
            "description": "describe and evaluate different explanations for the origins of environmental values and their influence on environmental management"
        },
        {
            "number": "LO4.",
            "description": "discuss and evaluate sustainable development as a modern management paradigm within an historical context"
        },
        {
            "number": "LO5.",
            "description": "discuss and evaluate issues of ownership, and perceptions of ownership, and how they influence environmental management and policy"
        },
        {
            "number": "LO6.",
            "description": "discuss and evaluate the 'Tragedy of the commons' concept"
        },
        {
            "number": "LO7.",
            "description": "describe some approaches and tools used in environmental management"
        },
        {
            "number": "LO8.",
            "description": "discuss the emergence and importance of stakeholders and public participation in environmental management"
        },
        {
            "number": "LO9.",
            "description": "develop an overall capacity to approach and discuss environmental management issues in a holistic and structured fashion."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Environmental Issues in Context",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 4/04/2025 3:00 pm</p></dd>",
            "learning_objectives": "L04, L07, L09",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Assignments 1 and 2 must be based on one of the following three issue areas.</p>\n<ol>\n<li>The social, economic and environmental impacts and implications of <strong>European Union (EU) trade restrictions policies</strong> (such as Regulation (EU) 2023/1115 on deforestation-free products).</li>\n<li><strong>Energy policy</strong> and the social, economic and environmental opportunities and constraints to sustainable transition</li>\n<li>The social, economic and environmental trade-offs and challenges in <strong>aquaculture</strong> as an apparent alternative to wild-caught fisheries (includes vertebrate and non-vertebrate species).</li>\n</ol>\n<p>Note: These are deliberately broad, and you are encouraged to refine and focus them for your assignments. You may adopt a national or international focus with these topics in your assessment.</p>\n<p><strong>Topic:</strong></p>\n<p><strong><em>Environmental issues in context: identifying social (including, cultural, political and institutional), economic, and biophysical (physical, technical and environmental) dimensions of a contemporary issue.</em></strong></p>\n<p><strong>Aims:</strong></p>\n<ul>\n<li>Identify and describe key social (including cultural, political and institutional), economic and biophysical dimensions of an issue and how these interact to influence and shape that issue,</li>\n<li>improve your ability to read widely on a complex social/environmental issue and integrate the available information, and </li>\n<li>provide early feedback on your written communication.</li>\n</ul>\n<p><strong>Background:</strong></p>\n<p>Frequently environmental issues are defined or viewed only as the physical expression of human activities. This is what Dovers (2005 pp41-42) describes as the ‘substantive problem’. Frequently these physical expressions become the focus of attention. However, in environmental management what we rapidly realise is that there are very different views both underlying causes and what the appropriate policy response(s) ought to be to complex problems with multiple causes. This course attempts to give students a far more critical way of defining and thinking about environmental issues and their management context.</p>\n<p>To illustrate, consider the issue of ‘land clearing’. There are a number of ways of defining the issue, and what the cause(s) may be. It could be stated as any of the following depending on a person’s particular position:</p>\n<ul>\n<li>Inadequate laws to stop clearing,</li>\n<li>Too restrictive government intervention that stymies development, economic opportunities and capacity to feed a growing population,</li>\n<li>Poor incentives to change land use,</li>\n<li>A financially and economically driven activity due to decreasing terms of trade for agriculture and declining profitability,</li>\n<li>A largely historical problem that is now exaggerated by environmentalists,</li>\n<li>Failure of a market system that inadequately rewards good land management, or</li>\n<li>A threat to biological diversity.</li>\n</ul>\n<p>These are all views that are expressed by different people or groups with an interest in the issue. These interested parties are referred to as “stakeholders” (more on this in assignment 2). Alternative ways of seeing issues stems from the different background and the values and attitudes of individuals (covered in Module 4 and assignment 2), as well as the particular circumstances that an individual may face. In this course, you should gain the ability to look critically and impartially at an environmental issue in a range of ways. Specifically we are encouraging you to appreciate the social, economic and physical dimensions of environmental issues in order to ultimately develop better ways of managing and solving such issues. This assignment will be the first time that many students have attempted to look critically at an issue in such a way. Although challenging, this will be a very useful skill for your professional career even if not directly related to environmental and sustainability.</p>\n<p><strong>Task:</strong></p>\n<p>Your assignment is to identify and describe key social (this includes cultural, political and institutional aspects), economic, and biophysical (environmental) dimensions of the issue that you have chosen. Each of these dimensions should be addressed by explaining how they influence the issue and are influenced by the issue. Another way of thinking about this is, what are the drivers that are shaping the issue, and how do the components of the issue then effect, or drive, other aspects. Some discussion of the interactions across dimensions should be included (see the marking criteria). The word ‘institutional’ mentioned above can create confusion for those not familiar with it. What it means is the formal and informal rules and behaviours that operate in society that affect an issue (see Dovers and Connor 2004 p 11). Frequently the term is more specifically applied to the formal and informal organisations of people acting in environmental management or other arenas (see for example Lane and Robinson (2009)). These rules and organisations vary from place to place, culture to culture and time to time. So to some extent there will be overlap between culture, institutions, politics etc.</p>\n<p>To do well, and get the most from this assignment, you should aim to provide a written report based on extensive reading and synthesis of that literature. The written report should be treated as though you are providing advice to a senior decision maker (this could be any level of government, an NGO or private sector organisation) in order to clarify the nature of the issue that they may have to deal with. Your report should be between 1000 and 1500 words. Your assignment <strong>must</strong> be based on one of the three topics used for the two written assignments for ENVM1501 this year.</p>\n<p><strong>Expectations:</strong></p>\n<p>The assignment will be marked on the criteria and standards linked in this ECP with the following expectations in mind. Your assignment should:</p>\n<ul>\n<li>contain evidence of wide reading and that you have gained an ability to integrate information rather than simply reproducing information,</li>\n<li>contain a wide range of cited references including, quality academic literature, media articles, and some relevant web sites,</li>\n<li>be written in excellent English, with a style and written expression appropriate to a professional report, and</li>\n<li>be well structured with a clear flow of ideas.</li>\n</ul>\n<p><strong>References from above.</strong></p>\n<p>Dovers, S. (2005) <em>Environment and Sustainability Policy: Creation, Implementation, Evaluation</em>. The Federation Press, Sydney.</p>\n<p>Dover, S and Connor, R. (2004)<em> Institutional Change for Sustainable Development</em>. Edward Elgar Publishing Limited. Cheltenham, UK .</p>\n<p>Available to UQ students via the library at</p>\n<p><a href=\"http://library.uq.edu.au/search~S7?/tinstitutional+change+for+sustainable+development/tinstitutional+change+for+sustainable+development/1%2C1%2C2%2CB/frameset&amp;FF=tinstitutional+change+for+sustainable+development&amp;2%2C%2C2\">http://library.uq.edu.au/search~S7?/tinstitutional+change+for+sustainable+development/tinstitutional+change+for+sustainable+development/1%2C1%2C2%2CB/frameset&amp;FF=tinstitutional+change+for+sustainable+development&amp;2%2C%2C2</a></p>\n<p>Lane, M. and Robinson, C. (2009). Institutional complexity and environmental management: the challenge of integration and the promise of large-scale collaboration. <em>Australasian Journal of Environmental Management</em>, <strong>16</strong>, 16-24.</p>\n<p><strong>Suggested outline for Assignment 1:</strong></p>\n<p>Introduction:</p>\n<ul>\n<li>Make sure that your introduction:</li>\n<li>conveys the aim of the assignment to the reader and convinces them that it is something worth investigating,</li>\n<li>briefly introduces the issue under investigation, and</li>\n<li>provides an outline of how the assignment is to be structured.</li>\n</ul>\n<p>Body of the assignment.</p>\n<ul>\n<li>I suggest using sub-headings based on the key ideas you draw from the literature. Make sure that there is a logical flow and links between the sections and paragraphs.</li>\n</ul>\n<p>Conclusion</p>\n<ul>\n<li>Be sure to match your conclusion to the aim of the assignment (ie. Show how you achieved or demonstrated the aim). DO NOT PROVIDE SOLUTIONS to the environmental issue you have chosen.</li>\n</ul>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Online submission by Turnitin only by the due date. No hard copy or assignment cover sheets required.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Environmental Values",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 9/05/2025 3:00 pm</p></dd>",
            "learning_objectives": "L03, L04, L08, L09",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Assignments 1 and 2 must be based on one of the following three issue areas.</p>\n<ol>\n<li>The social, economic and environmental impacts and implications of <strong>European Union (EU) trade restrictions policies</strong> (such as Regulation (EU) 2023/1115 on deforestation-free products).</li>\n<li><strong>Energy policy</strong> and the social, economic and environmental opportunities and constraints to sustainable transition</li>\n<li>The social, economic and environmental trade-offs and challenges in <strong>aquaculture</strong> as an apparent alternative to wild-caught fisheries (includes vertebrate and non-vertebrate species).</li>\n</ol>\n<p>Note: These are deliberately broad, and you are encouraged to refine and focus them for your assignments. You may adopt a national or international focus with these topics in your assessment.</p>\n<p><strong>Aims:</strong></p>\n<ul>\n<li>Identify and describe human values in relation to environmental issues,</li>\n<li>Demonstrate that you can identify how values shape people’s positions on environmental issues, and</li>\n<li>Improve your ability to critically review and analyse an environmental issue.</li>\n</ul>\n<p><strong>Background:</strong></p>\n<p>Individuals exhibit beliefs, attitudes and behaviours that are driven by their environmental values, environmental philosophy or environmental ethics (for the purpose of this course we can use these terms interchangeably, although there are distinctions). Good summaries of can be found in Stern and Dietz 1994, and Dietz, Fitzgerald and Shwom 2005, and the relationship between environmental philosophy and ethics is outlined online by Brennan and Lo (2011) at the Stanford Encyclopedia of Philosophy. However, most people are unaware of environmental values as their influence is generally subtle, and mediated through attitudes and contextual factors that can significantly affect how people behave or act (Stern et al. 1995). Our values exert a powerful influence on what we consider ‘right’ and ‘wrong’, how we view an issue, whether we perceive a problem, and thus how we consider an issue should be resolved (de Groot and Steg 2007). </p>\n<p>Frequently, at the core of many debates and differences of view around environment and sustainability issues are different sets of values. Unfortunately, these values and their role are rarely acknowledged. Usually, the discourse of an environmental issue is framed in the realms of ‘facts’, ‘logic’, ‘rational thought’ and ‘technological’ science, which precludes any analysis of values (see for example Welcomer <em>et al</em>. 2000). In order to better understand the social construction and views of environmental issues this assignment is designed to give you a brief introduction to environmental values and to assist you to explore how they may expressed in an environmental issue. The capacity to explore environmental issues at this deeper level will be important for you in any career that deals with people and their environments.</p>\n<p><strong>Task:</strong></p>\n<p>Provide a written assignment that shows evidence of how different peoples’ (individuals and groups) views of the issue you have chosen vary, and how this may be linked to their underlying (environmental) values. You are to provide a written assignment based on extensive reading and synthesis of that literature. Your assignment should be between 2,500 to 3,000 words, and <strong>must</strong> be based on one of the three topics for ENVM1501 this year. See the suggested structure for ideas on how to address the assignment.</p>\n<p><strong>Expectations:</strong></p>\n<p>The assignment will be marked on the criteria attached to the ECP with the following expectations in mind. Your assignment should:</p>\n<ul>\n<li>contain evidence of wide reading and that you have gained an ability to integrate rather than simply reproduce information,</li>\n<li>contain a wide range of cited references including, quality academic literature, media articles, and some relevant web sites,</li>\n<li>be written in excellent English, with a style and written expression appropriate to a professional report, and</li>\n<li>be well structured with a clear flow of ideas.</li>\n</ul>\n<p><strong>References</strong></p>\n<p>Brennan, A and Lo, Y, \"Environmental Ethics\",<strong> </strong><em>The Stanford Encyclopedia of Philosophy (Fall 2011 Edition)</em>, EN Zalta (ed.), &lt;<a href=\"http://plato.stanford.edu/archives/fall2011/entries/ethics-environmental/\">http://plato.stanford.edu/archives/fall2011/entries/ethics-environmental/</a>&gt;.</p>\n<p>de Groot, JIM &amp; Steg, L 2007, 'Value orientations to explain beliefs related to environmental significant behavior' <em>Environment and Behavior,</em> vol. 40, no. 3, pp. 330-354.</p>\n<p>Dietz, T, Fitzgerald, A &amp; Shwom, R 2005, 'Environmental values' <em>Annual Review of Environment and Resources,</em> vol. 30, no. pp. 335-372.</p>\n<p>Stern, PC &amp; Dietz, T 1994, 'The value basis of environmental concern' <em>Journal of Social Issues,</em> vol. 50, no. 3, pp. 65-84.</p>\n<p>Stern, PC, Dietz, T, Kalof, L &amp; Guagnano, GA 1995, 'Values, beliefs, and proenvironmental action: Attitude formation toward emergent attitude objects' <em>Journal of Applied Social Psychology,</em> vol. 25, no. 18, pp. 1611-1636.</p>\n<p>Welcomer, S., Gioia, D. and Kilduff, M. (2000) Resisting the Discourse of modernity: Rationality versus emotion in hazardous waste siting. <em>Human relations.</em> <strong>53</strong> (9): 1175-1205.</p>\n<p><strong>Suggested outline for Assignment 2:</strong></p>\n<p>Introduction:</p>\n<ul>\n<li>Make sure that your introduction:</li>\n<li>conveys the aim of the assignment to the reader and convinces them that it is something worth investigating (remember the focus is on the role and influence of values in social environmental issues),</li>\n<li>briefly introduces the issue under investigation, and</li>\n<li>provides an outline of how the assignment is to be structured.</li>\n</ul>\n<p>Body of the assignment (consider a series of subheadings).</p>\n<ul>\n<li>A relatively brief but well researched overview of environmental ethics/values should be incorporated at the early part of the body.</li>\n<li>The remainder of the body should demonstrate how different stakeholders’ and positions in the issue illustrate a range of environmental values, with the purpose of showing how the issue is constructed differently because of the fundamental differences in people (This exercise should help in your professional development to avoid judging other people’s perceptions of an issue as right or wrong).</li>\n</ul>\n<p>Conclusion</p>\n<ul>\n<li>Be sure to match your conclusion to the aim of the assignment. DO NOT PROVIDE SOLUTIONS to the environmental issue you have chosen and do not be tempted to indicate which environmental values are right/wrong or more/less enlightened.</li>\n</ul>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p><a href=\"https://archive.course-profiles.uq.edu.au/student_section_loader/show_file_contents/239828\">Assignment 2 criteria and Standards ENVM1501 2024.pdf</a></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Online submission by Turnitin only by the due date. No hard copy or assignment cover sheets required.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Internet Based Discussion Series",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 30/05/2025 4:00 pm</p>\n<p>\n</p><p>Online postings need to be submitted throughout the semester.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L08, L09",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Reflective essay based on discussion series</strong></p>\n<p><strong>Aim:</strong></p>\n<ol>\n<li>To develop skills in critically reading literature from a diverse range of disciplines.</li>\n<li>Develop capacity to explore multiple perspectives on what can be seemingly straightforward topics.</li>\n<li>Expose students to some of the underlying themes in many environmental issues.</li>\n<li>Develop skills in research and the ability to communicate in a professional style your views on a complex matter based on reading and critical thought.</li>\n<li>Provide an opportunity for students to explore some concepts from the course in more detail</li>\n</ol>\n<p><strong>Format:</strong></p>\n<p>The assessable item is the reflective essay (see below) but this will be based on your engagement in online discussion throughout the semester. You must also submit a detailed list of all postings made throughout the semester that includes the posting number date and time, and the title where relevant. This is important should we wish to quickly check any of your postings.</p>\n<p>Four (4) discussion topics will be posted on the web site (Blackboard) for this course. Each topic will be introduced with a paragraph or two capturing its importance and relevance to issues of environmental management. References to relevant readings are posted with each topic. The topics shall remain open for discussion throughout the semester. Staff will be reading the discussion postings and engaging in the discussion as often as possible to provide advice and feedback as well as probe ideas further.</p>\n<p><strong>Task (what is the assessment?):</strong></p>\n<p>You are to engage in all four discussion topics throughout the semester, as frequently as you wish (minimum of 2 posts per topic). The assessment will be based on a short reflective essay. Each student is to write 3 to 4 written pages (~1200 to 1500 words) of the discussion series indicating what they have learned from the interaction, and from the topics. This reflective essay should particularly focus on <strong>new insights</strong> you gained, <strong>challenges</strong> and <strong>alternative points of view</strong> that were raised and the <strong>relationships between the topics</strong> that you noticed. Keep the following in mind:</p>\n<ul>\n<li>We are looking for quality contributions (in the discussion series) that show evidence of reading and critical thought. Your responses must be clear and properly referenced, including reference to other students’ contributions. This means that your views and opinions must be well argued and preferably based on reading, observations and reflection.</li>\n<li>Each contribution may be as long as you wish; however, keep in mind that long rambling contributions are unlikely to be read by other students. Look for clarity and try to keep your contributions as concise as possible (say less than 500 words, 300 is about ideal).</li>\n<li>Any student who abuses this discussion series will receive zero for this piece of assessment, and depending on the severity of the abuse may face further action (see the rules below). Abuse means making rude comments or comments of a personal nature or using inappropriate language (eg. sexist, racist, derogatory etc).</li>\n<li>To pass this component of the assessment you must have contributed at least twice to all of the discussion topics by the end of the last teaching week, but earlier is better (please check the marking criteria). If less than 8 contributions are posted then it will be deemed that this piece of assessment is incomplete and the maximum grade for the course will be a 4.</li>\n<li>As with all assessment, read the assessment criteria carefully.</li>\n</ul>\n<p><strong>Due dates:</strong></p>\n<p>Your reflective essay is to be submitted (through Turnitin) on the last teaching week of semester. Please note that you should be making notes towards this assessment throughout the semester – it will make the reflective essay more thoughtful and easier to develop.</p>\n<p>The topics:</p>\n<ol>\n<li>The theory of island biogeography and conservation in fragmented landscapes: an elegant theory but does it limit our ability to see beyond the ‘remnant / non-remnant’ dichotomy?</li>\n<li>Environmental values: Have we climbed above Nature and “freed” ourselves, or have we “fallen” from the grace of Nature? </li>\n<li>Tragedy of the commons: reality or paradigm in economics and conservation?</li>\n<li>Levels of empowerment and autonomy: who has the right to determine how resources are used (NB. There are no prescribed readings for this topic. Let’s see what comes out.)</li>\n</ol>\n<p><strong>Standards, expectations and rules:</strong></p>\n<p>The guiding principle for this piece of assessment is simply to maintain courtesy, respect and consideration at all times for all other students.</p>\n<ul>\n<li>The discussion series is designed to improve your skills in high quality professional debate based on information and critical thinking. For this reason, abbreviations and mobile phone ‘SMS text chat’ are not appropriate (for a benchmark consider you were discussing the topic in an electronic format with a professional in your field).</li>\n<li>There are to be no comments of a personal or private nature (this does not exclude personal observations or experiences of an issue that is relevant to the discussion).</li>\n<li>Contributions should be based on reflection, literature and current affairs when appropriate. Personal views and opinions are encouraged, but must be based on your reading and understanding of the literature and reflection on other students’ comments. In the absence of reference material, ideas must be fully explained in order to justify your position or ideas. Speculation and creativity are encouraged, but be sure that other people can follow your logic and that what you are speculating has not been written before in the readings or by other students.</li>\n<li>Plagiarism is not acceptable (see plagiarism warning in the ECP).</li>\n<li>Any deviation from these rules will result in zero for this assessment.</li>\n</ul>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Online submission by Turnitin only by the due date. No hard copy or assignment cover sheets required.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Video Assignment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 13/06/2025 4:00 pm</p></dd>",
            "learning_objectives": "L01, L04, L07, L09",
            "mode": "Oral, Product/ Artefact/ Multimedia",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Aim</strong>:          </p>\n<ul>\n<li>demonstrate an in-depth working knowledge of course concepts of the course not covered by assessment items 1, 2 or 3, and</li>\n<li>develop an overall capacity to approach and discuss environmental management issues in a holistic and structured fashion.</li>\n</ul>\n<p><strong>Task</strong>:       </p>\n<p><strong>You are to prepare and upload to blackboard an audio-visual presentation of no longer than five minutes.</strong> This presentation should demonstrate your understanding of one of the four topics listed below. You are to select <strong>one </strong>of these and undertake your own reading and research into the topic in order to do a short presentation like someone who had to convey the concept to a lay audience. For example, you should consider that you are in a teaching role and need to communicate this complex topic in a relatively simple yet engaging manner.</p>\n<p>Your presentation will need to combine text, diagrams or any other instructional information which is fully referenced and cited. The expectation would be a minimum of five separate quality sources. Given the five-minute limitation for this assessment you may <strong>not </strong>embed short videos that already exists on the Internet. However, you may wish to generate your own form of animation or other creative techniques to help illustrate the concepts in the video.</p>\n<p>Instructions to prepare your video presentation assessment</p>\n<p><a href=\"https://web.library.uq.edu.au/library-services/it/learnuq-blackboard-help/learnuq-assessment/record-video-assignments-zoom\">https://web.library.uq.edu.au/library-services/it/learnuq-blackboard-help/learnuq-assessment/record-video-assignments-zoom</a></p>\n<p><strong>Topics for the oral presentation. Choose only one of the following 4 options. For your topic you must describe and discuss critically:</strong></p>\n<ol>\n<li>The two main scientific perspectives of the debate on the megafauna extinction as it relates mainly to Australasia.</li>\n<li>The key features of the theory of island biogeography and why it has been linked to terrestrial conservation drawing on key and recent literature.</li>\n<li>The meaning of, and distinction between, ‘strong’ and ‘weak’ sustainability using referenced materials and examples.</li>\n<li>The changing role of the Australian Commonwealth Government in environmental matters and its constitutional basis. References to support your insights are essential.</li>\n</ol>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit the video assignment through the Assessment area in Blackboard for ENVM1501.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 1 Introduction and Rationale</strong><br/><p>Introductory module and overview of the course</p></p><p><strong>Learning outcomes:</strong> L09</p></div></td>",
            "topic_title": "<strong>Module 1 Introduction and Rationale</strong>",
            "topic_description": "Module 1 Introduction and Rationale Introductory module and overview of the course",
            "learning_outcomes": [
                "L09"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 2 The Big Picture</strong><br/><p>The big picture of life on earth<br/>Describe the influence of the atmosphere, hydrosphere and lithosphere on the global distribution of major biomes.<br/>With reference to Australasia explain the distribution of major climate features.<br/>Discuss why human activities tend to simplify and modify ecosystems</p></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Module 2 The Big Picture</strong>",
            "topic_description": "Module 2 The Big Picture The big picture of life on earth Describe the influence of the atmosphere, hydrosphere and lithosphere on the global distribution of major biomes. With reference to Australasia explain the distribution of major climate features. Discuss why human activities tend to simplify and modify ecosystems",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 2 The Big Picture</strong><br><p>Module 2<br/>Describe the influence of the atmosphere, hydrosphere and lithosphere on the global distribution of major biomes.<br/>With reference to Australasia explain the distribution of major climate features.<br/>Discuss why human activities tend to simplify and modify ecosystems<br/>Readings/Ref: LG (Module 2);</p></br></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Module 2 The Big Picture</strong>",
            "topic_description": "Module 2 The Big Picture Module 2 Describe the influence of the atmosphere, hydrosphere and lithosphere on the global distribution of major biomes. With reference to Australasia explain the distribution of major climate features. Discuss why human activities tend to simplify and modify ecosystems Readings/Ref: LG (Module 2);",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 3 Biogeography and Ecology</strong><br><p>Describe using biogeographic principles why fragmentation of terrestrial landscapes can negatively affect some species and ecosystem processes while favouring other species, </p>\n<p>critically discuss the relevance of island biogeography as a theoretical framework for terrestrial biodiversity conservation, and</p>\n<p>describe and explain some introductory ecological concepts</p></br></p><p><strong>Learning outcomes:</strong> L02</p></div></td>",
            "topic_title": "<strong>Module 3 Biogeography and Ecology</strong>",
            "topic_description": "Module 3 Biogeography and Ecology Describe using biogeographic principles why fragmentation of terrestrial landscapes can negatively affect some species and ecosystem processes while favouring other species, critically discuss the relevance of island biogeography as a theoretical framework for terrestrial biodiversity conservation, and describe and explain some introductory ecological concepts",
            "learning_outcomes": [
                "L02"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 4 Valuing The Environment and Environmental Values </strong><br><p>Appreciate the cultural basis for environmental values and perceptions,</p>\n<p>describe and debate some explanations for the origins of Western environmental values, </p>\n<p>describe and analyse Sustainable Development in an historical and contemporary context, and </p>\n<p>describe some contemporary issues in the relationship between economics and environmental management</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Module 4 Valuing The Environment and Environmental Values </strong>",
            "topic_description": "Module 4 Valuing The Environment and Environmental Values Appreciate the cultural basis for environmental values and perceptions, describe and debate some explanations for the origins of Western environmental values, describe and analyse Sustainable Development in an historical and contemporary context, and describe some contemporary issues in the relationship between economics and environmental management",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid Semester Break</strong><br><p>Self directed learning. Work on Assessment 2 and online discussion posts</p></br></p><p><strong>Learning outcomes:</strong> L03, L04</p></div></td>",
            "topic_title": "<strong>Mid Semester Break</strong>",
            "topic_description": "Mid Semester Break Self directed learning. Work on Assessment 2 and online discussion posts",
            "learning_outcomes": [
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 4 (Lectures and Additional Contact)</strong><br><p>Continue with Module 4, begin Module 5</p></br></p><p><strong>Learning outcomes:</strong> L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Module 4 (Lectures and Additional Contact)</strong>",
            "topic_description": "Module 4 (Lectures and Additional Contact) Continue with Module 4, begin Module 5",
            "learning_outcomes": [
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 5 Rights and Responsibilities</strong><br><p>Module 5 Rights and responsibilities (Lecture Series): appreciate issues of ownership and property rights (legal and extra legal) in environmental issues,<br/>describe and critically debate the issue of the Tragedy of the Commons as a paradigm in the development of models to distribute and give assess to the environment and resources, and<br/>describe in basic detail the system of land tenure in Australia and some implications for contemporary environmental management issues.</p></br></p><p><strong>Learning outcomes:</strong> L05, L06</p></div></td>",
            "topic_title": "<strong>Module 5 Rights and Responsibilities</strong>",
            "topic_description": "Module 5 Rights and Responsibilities Module 5 Rights and responsibilities (Lecture Series): appreciate issues of ownership and property rights (legal and extra legal) in environmental issues, describe and critically debate the issue of the Tragedy of the Commons as a paradigm in the development of models to distribute and give assess to the environment and resources, and describe in basic detail the system of land tenure in Australia and some implications for contemporary environmental management issues.",
            "learning_outcomes": [
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 6 Approaches to Environmental Solutions at The Societal Level</strong><br/></p><p><strong>Learning outcomes:</strong> L07, L08</p></div></td>",
            "topic_title": "<strong>Module 6 Approaches to Environmental Solutions at The Societal Level</strong>",
            "topic_description": "Module 6 Approaches to Environmental Solutions at The Societal Level",
            "learning_outcomes": [
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 6 Approaches to Environmental Solutions at The Societal Level (Continued)</strong><br><p>Approaches to environmental solutions at the societal level<br/>describe some of the range of policy and other tools used at national, state and local levels to enhance environmental management,<br/>describe the changing nature of Commonwealth, State and Local Governments role in environmental management with emphasis on the constitutional basis for these powers,<br/>describe and critique the emergence of public participation and the importance of stakeholder understanding in environmental management, and <br/>appreciate the role and contribution of different forms of knowledge in environmental management issues.</p></br></p><p><strong>Learning outcomes:</strong> L07, L08</p></div></td>",
            "topic_title": "<strong>Module 6 Approaches to Environmental Solutions at The Societal Level (Continued)</strong>",
            "topic_description": "Module 6 Approaches to Environmental Solutions at The Societal Level (Continued) Approaches to environmental solutions at the societal level describe some of the range of policy and other tools used at national, state and local levels to enhance environmental management, describe the changing nature of Commonwealth, State and Local Governments role in environmental management with emphasis on the constitutional basis for these powers, describe and critique the emergence of public participation and the importance of stakeholder understanding in environmental management, and appreciate the role and contribution of different forms of knowledge in environmental management issues.",
            "learning_outcomes": [
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 7 Case Study</strong><br><p>Case study: Land clearing as an integrative case of environmental management challenges. This module will provide some background to the tree clearing issue and link what has been covered throughout the course. The aim of the module is to illustrate the trans-disciplinary nature of environmental management.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Module 7 Case Study</strong>",
            "topic_description": "Module 7 Case Study Case study: Land clearing as an integrative case of environmental management challenges. This module will provide some background to the tree clearing issue and link what has been covered throughout the course. The aim of the module is to illustrate the trans-disciplinary nature of environmental management.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 7 Case Study (continued)</strong><br><p>Land clearing as a case study in environmental management continued.</p></br></p><p><strong>Learning outcomes:</strong> L09</p></div></td>",
            "topic_title": "<strong>Module 7 Case Study (continued)</strong>",
            "topic_description": "Module 7 Case Study (continued) Land clearing as a case study in environmental management continued.",
            "learning_outcomes": [
                "L09"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 7 Case Study (Finalise)</strong><br/></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Module 7 Case Study (Finalise)</strong>",
            "topic_description": "Module 7 Case Study (Finalise)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        }
    ]
}