{
    "course_title": "Exercise Prescription & Programming for Musculoskeletal Conditions",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EXMD4740-21097-7520",
    "full_course_code": "EXMD4740-21097-7520",
    "course_code": "EXMD4740",
    "class_code": "21097",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand the pathological and pathophysiological bases of musculoskeletal conditions, including risk factors, complications and comorbidities as they relate to exercise prescription"
        },
        {
            "number": "LO2.",
            "description": "Understand the medical and allied health management of common musculoskeletal conditions, including medications, treatment outcomes, impact on exercise and clinical status"
        },
        {
            "number": "LO3.",
            "description": "Safely, confidently and proficiently prescribe exercise interventions based on clinical data sourced during the assessment of exercise capacity (with specific reference to joint range of motion, posture, gait, muscle strength and function capacity)."
        },
        {
            "number": "LO4.",
            "description": "Understand and apply the evidence related to mode of exercise, intensity, duration, frequency, volume and progression for musculoskeletal conditions."
        },
        {
            "number": "LO5.",
            "description": "Be aware of the precautions and contraindications for exercise rehabilitation during the 3 stages of injury repair and how to successfully and safely modify exercises throughout these 3 stages"
        },
        {
            "number": "LO6.",
            "description": "Be confident in demonstrating strong communication, including demonstrating exercises in front of an educated audience using, for example correct anatomical terminology, as well as being able to easily and effectively utilise laymans terms when explaining exercise cues to clients"
        },
        {
            "number": "LO7.",
            "description": "Effectively design and implement clinical exercise interventions for clients with musculoskeletal conditions including strategies for behaviour change."
        },
        {
            "number": "LO8.",
            "description": "Be competent in SOAP note report writing and in using SOAP as a tool for ensuring appropriate exercise prescription"
        },
        {
            "number": "LO9.",
            "description": "Enhance professional practice and professional identity through knowledge of professional roles available to AEP, as well as self-reflection related to communication, interprofessional interactions, scope of practice, attitudes and professional development"
        },
        {
            "number": "LO10.",
            "description": "Develop interprofessional practice skills in conflict management and collaborative leadership and enhance skills in role clarification, team functioning, interprofessional communication, client-centred care."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Examination of practical skills and prescription",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 7/04/2025 - 11/04/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Practical/ Demonstration",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Short overview: The examinee will be given a case study. They must complete the following tasks in 30 minutes:</p>\n<p>1. subjective assessment</p>\n<p>2. Examinee will detail a list of objective assessments they would perform with the case accompanied by clinical reasoning. The examinee will demonstrate at least one of these assessment items using the examiner as the pretend client.</p>\n<p>Practical exams will be scheduled in half hour blocks during Week 7 (normal practical times and additional times as required by class numbers). Examinees will be given 15 minutes of pre reading of the case before their allocated start time. </p>\n<p><strong>Artificial Intelligence (AI) and Machine Translation (MT)</strong> </p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<p><strong>Recording of Assessment:</strong></p>\n<p><a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">Assessment Procedure</a></p>\n<p>When a student is required to complete an oral or practical assessment item worth 20% or more, the performance will be recorded and retained as per Appendix 1 as the official recording of the item for re-mark purposes.</p>\n<p>Recordings will be stored in a secure manner and will only be accessed for the purposes of:</p>\n<p>i. moderation of marking</p>\n<p>ii. provision of feedback to the student(s) recorded; and/or</p>\n<p>iii. re-marking following a successful re-mark application.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>To be completed in-person.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Competency in musculoskeletal assessment and rehab",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 28/04/2025 - 13/06/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Participation/ Student contribution, Practical/ Demonstration",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Assessment breakdown </strong></p>\n<ol>\n<li>Assessment session (5%)</li>\n<li>Draft program (5%)</li>\n<li>Exercise session training (5%)</li>\n<li>SOAP notes (pass/fail)</li>\n<li>Reflections (5%)</li>\n<li>Final report (client + health professional) (20%)</li>\n</ol>\n<p><strong>The process</strong></p>\n<ol>\n<li>In Week 9 of semester 1 you will conduct an initial assessment with the client - this may be done via telehealth or face to face depending on circumstances (but is likely to be face to face pending any emergency situations). You will need to consult with a clinical educator during these sessions.  </li>\n<li>Following the assessment, you will write a draft program for the client which will be delivered in week 10. It will be due early in week 10 (clinical educators will advise times and dates) so that you can receive feedback from your clinical educator during week 10 prior to working with your client in week 10.  </li>\n<li>You will deliver 4 face to face (or telehealth where necessary) exercise sessions to your client. The focus of this should be encouraging learning the exercises, how to incorporate them into their life etc. It can include general exercise prescription, but the focus should be on the area of concern of the client. Each week you will submit a SOAP note and reflection to your clinical educator by an agreed upon time each week.</li>\n<li>You will then write a final report for the client and an allied health report (due on the Friday of week 1 of Examination Period) </li>\n</ol>\n<p>Please read the information brief on blackboard for a thorough breakdown of the clinic requirements. </p>\n<p>***Please note, due to public holidays impacting some clinic groups, the timelines specified may be slightly altered for students who have practicals that clash with public holidays. This information will be relayed to students as soon as practical during lectures. </p>\n<p><strong>Artificial Intelligence (AI) or Machine Translation (MT) </strong></p>\n<p><strong>Draft program, SOAP notes, reflections,  Final report: </strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct. </p>\n<p><strong>Assessment session and Exercise session training: </strong>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit final report via the relevant Turnitin submission portal on the course Blackboard site.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Interprofessional Collaborative Practice",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p>Please refer to the assessment information on Blackboard for the assessment due date for your team.</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This is a team assessment. Teams will be assigned during your first tutorial. There are two (2) parts to this assessment:</p>\n<p><strong>Part One</strong> requires you to complete a poster and will draw on the online and face-to-face content from Modules 4 and 5 and the knowledge and skills you developed from Modules 1 to 3. You will present your poster for peer feedback in Module 6.</p>\n<p><strong>Part Two</strong> involves creating a 3-minute video and will draw on the online and face-to-face content from Modules 4, 5 and 6 and the knowledge and skills you developed from Modules 1 to 3.</p>\n<p>You will have the opportunity to begin work on each part of the assessment with your team during tutorials and will be expected to spend additional time with your team to complete each task.</p>\n<p>Teams will need to submit both parts of your assessment in the Assessment tab on the IPCP Blackboard course site. Additional information regarding submission will be provided on the IPCP Blackboard course site.</p>\n<p>Please refer to the assessment information on Blackboard for further details and requirements for the assessment.</p>\n<p><strong>Artificial Intelligence (AI) or Machine Translation (MT)</strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Online submission via Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Theory end of semester exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>7/06/2025 - 21/06/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This exam will be comprised of a range of different question types including true/false, multiple choice, multiple answer, short answer, video based case study and other application questions. It will cover material from lectures and practicals and will cover material from week 1 to week 13 of the semester. Practice questions will be given throughout the semester and students are encouraged to familiarise themselves with the Inspera platform. </p>\n<p><strong>Artificial Intelligence (AI) or Machine Translation (MT)</strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>1</strong><br><p>Introduction and Subjective assessments<br/>Applies lecture knowledge in practice, including objective and subjective assessment (client history) with relevant communication theories and strategies. Includes practice in reading and writing referrals to allied health professionals and relating of client goals to prescription. Requires students to demonstrate the ability to modify communication strategies for information gathering to improve their effectiveness.</p></br></p></div></td>",
            "topic_title": "<strong>1</strong>",
            "topic_description": "1 Introduction and Subjective assessments Applies lecture knowledge in practice, including objective and subjective assessment (client history) with relevant communication theories and strategies. Includes practice in reading and writing referrals to allied health professionals and relating of client goals to prescription. Requires students to demonstrate the ability to modify communication strategies for information gathering to improve their effectiveness.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>1</strong><br><p>Introduction to EP in MS practice, includes scope of practice of EPﾒs and other relevant health practitioners<br/>Soap note reporting and Posture -Covers material related to reporting for clinical conditions, specific to musculoskeletal, assessing impairment, personal, contextual factors, thorough subjective and objective assessment</p></br></p></div></td>",
            "topic_title": "<strong>1</strong>",
            "topic_description": "1 Introduction to EP in MS practice, includes scope of practice of EPﾒs and other relevant health practitioners Soap note reporting and Posture -Covers material related to reporting for clinical conditions, specific to musculoskeletal, assessing impairment, personal, contextual factors, thorough subjective and objective assessment",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 9(03 Mar - 04 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Interprofessional Collaborative Practice Module</strong><br><p>Interprofessional Collaborative Practice Modules (Thursday/ Friday) (Tutorials):<br/>You will work in small teams in the tutorial groups with your peers from; Dentistry, Exercise Physiology, Midwifery, Nursing, Occupational Therapy, Pharmacy, Physiotherapy, Social Work and Speech Pathology. There are three modules that consist of on-line preparation and face-to-face in class learning activities. You will work in your team to engage in a range of learning activities to develop your knowledge and skills to help prepare you for working in teams when caring for clients.<br/>In Module Four, you will develop knowledge and skills to identify and manage conflict in healthcare teams.<br/>In Modules Five and Six you will expand your skills to communicate assertively in your team and advocate for your client applying your interprofessional practice skills.</p></br></p></div></td>",
            "topic_title": "<strong>Interprofessional Collaborative Practice Module</strong>",
            "topic_description": "Interprofessional Collaborative Practice Module Interprofessional Collaborative Practice Modules (Thursday/ Friday) (Tutorials): You will work in small teams in the tutorial groups with your peers from; Dentistry, Exercise Physiology, Midwifery, Nursing, Occupational Therapy, Pharmacy, Physiotherapy, Social Work and Speech Pathology. There are three modules that consist of on-line preparation and face-to-face in class learning activities. You will work in your team to engage in a range of learning activities to develop your knowledge and skills to help prepare you for working in teams when caring for clients. In Module Four, you will develop knowledge and skills to identify and manage conflict in healthcare teams. In Modules Five and Six you will expand your skills to communicate assertively in your team and advocate for your client applying your interprofessional practice skills.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>2</strong><br><p>Posture, ROM and gait <br/>Applied movement analysis, joint based, functional based and individualised. Examples related to home, work and sport environments. Positional aggravators and relievers. Recording, measurement and analysis of subjective and objective data. Includes indications of red flags and medical emergencies</p></br></p></div></td>",
            "topic_title": "<strong>2</strong>",
            "topic_description": "2 Posture, ROM and gait Applied movement analysis, joint based, functional based and individualised. Examples related to home, work and sport environments. Positional aggravators and relievers. Recording, measurement and analysis of subjective and objective data. Includes indications of red flags and medical emergencies",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>2</strong><br><p>Gait, posture and functional assessment in home, work and sport environments. <br/>Includes movement analysis theory, optimal and suboptimal posture, evidence base related to movement and injury (static and dynamic)</p></br></p></div></td>",
            "topic_title": "<strong>2</strong>",
            "topic_description": "2 Gait, posture and functional assessment in home, work and sport environments. Includes movement analysis theory, optimal and suboptimal posture, evidence base related to movement and injury (static and dynamic)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>3</strong><br><p>Functional ex prescription. Closed vs open chain. Loading progressions for tissue type.<br/>Practically apply the use of data to exercise prescription in MSK context. Evidence based decisions and clinical reasoning case studies and practice. Includes the ability to recognise adverse signs and symptoms during exercise and recovery and how to decide whether to modify, stop or not start exercise.</p></br></p></div></td>",
            "topic_title": "<strong>3</strong>",
            "topic_description": "3 Functional ex prescription. Closed vs open chain. Loading progressions for tissue type. Practically apply the use of data to exercise prescription in MSK context. Evidence based decisions and clinical reasoning case studies and practice. Includes the ability to recognise adverse signs and symptoms during exercise and recovery and how to decide whether to modify, stop or not start exercise.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>3</strong><br><p>Evidence based exercise prescription and clinical decision making<br/>Includes knowledge of mode, intensity, duration, frequency, volume and progression for musculoskeletal pathology, including those that may cause deterioration of clients, and that are contraindicated for clients with AEP target pathologies (acutely and chronic). Understanding of tissue mechanics, loading and adaptation to exercise are explicitly addressed</p></br></p></div></td>",
            "topic_title": "<strong>3</strong>",
            "topic_description": "3 Evidence based exercise prescription and clinical decision making Includes knowledge of mode, intensity, duration, frequency, volume and progression for musculoskeletal pathology, including those that may cause deterioration of clients, and that are contraindicated for clients with AEP target pathologies (acutely and chronic). Understanding of tissue mechanics, loading and adaptation to exercise are explicitly addressed",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>4</strong><br><p>Lx Spine assessment and prescription <br/>Application of lecture material including safe, effective exercise strategies, progression and regression to enable full spectrum of tissue loading. Application of pain strategies and expectations related to gains and regressions.</p></br></p></div></td>",
            "topic_title": "<strong>4</strong>",
            "topic_description": "4 Lx Spine assessment and prescription Application of lecture material including safe, effective exercise strategies, progression and regression to enable full spectrum of tissue loading. Application of pain strategies and expectations related to gains and regressions.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>4</strong><br><p>Lx Spine and ex prescription. Specific to theory related to loading characteristics of tissues related to the trunk and hips. Understanding of pathological, pathophysiological bases, disease stage and risk factors, tissue mechanics, pain and injury, and contraindications and red flags. Diagnostic procedures, surgical and conservative management discussed in an exercise context.</p></br></p></div></td>",
            "topic_title": "<strong>4</strong>",
            "topic_description": "4 Lx Spine and ex prescription. Specific to theory related to loading characteristics of tissues related to the trunk and hips. Understanding of pathological, pathophysiological bases, disease stage and risk factors, tissue mechanics, pain and injury, and contraindications and red flags. Diagnostic procedures, surgical and conservative management discussed in an exercise context.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>5</strong><br><p>Upper body - cx spine, scapular and shoulder<br/>Application of lecture material including safe, effective exercise strategies, progression and regression to enable full spectrum of tissue loading. Application of pain strategies and expectations related to gains and regressions.</p></br></p></div></td>",
            "topic_title": "<strong>5</strong>",
            "topic_description": "5 Upper body - cx spine, scapular and shoulder Application of lecture material including safe, effective exercise strategies, progression and regression to enable full spectrum of tissue loading. Application of pain strategies and expectations related to gains and regressions.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>5</strong><br><p>Upper body assessment and prescription <br/> Lecture includes, shoulder, elbow, wrist, cx spine, scapula. Specific to theory related to loading characteristics of tissues related to the trunk and hips. Understanding of pathological, pathophysiological bases, disease stage and risk factors, tissue mechanics, pain and injury, and contraindications and red flags. Diagnostic procedures, surgical and conservative management discussed in an exercise context.</p></br></p></div></td>",
            "topic_title": "<strong>5</strong>",
            "topic_description": "5 Upper body assessment and prescription Lecture includes, shoulder, elbow, wrist, cx spine, scapula. Specific to theory related to loading characteristics of tissues related to the trunk and hips. Understanding of pathological, pathophysiological bases, disease stage and risk factors, tissue mechanics, pain and injury, and contraindications and red flags. Diagnostic procedures, surgical and conservative management discussed in an exercise context.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>6</strong><br><p>lower body assessment and prescription <br/>Application of lecture material including safe, effective exercise strategies, progression and regression to enable full spectrum of tissue loading. Application of pain strategies and expectations related to gains and regressions.</p></br></p></div></td>",
            "topic_title": "<strong>6</strong>",
            "topic_description": "6 lower body assessment and prescription Application of lecture material including safe, effective exercise strategies, progression and regression to enable full spectrum of tissue loading. Application of pain strategies and expectations related to gains and regressions.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>6</strong><br><p>Lower body ﾖ Relevant to the hip, knee and ankle. Specific to theory related to loading characteristics of tissues related to the trunk and hips. Understanding of pathological, pathophysiological bases, disease stage and risk factors, tissue mechanics, pain and injury, and contraindications and red flags. Diagnostic procedures, surgical and conservative management discussed in an exercise context.</p></br></p></div></td>",
            "topic_title": "<strong>6</strong>",
            "topic_description": "6 Lower body ﾖ Relevant to the hip, knee and ankle. Specific to theory related to loading characteristics of tissues related to the trunk and hips. Understanding of pathological, pathophysiological bases, disease stage and risk factors, tissue mechanics, pain and injury, and contraindications and red flags. Diagnostic procedures, surgical and conservative management discussed in an exercise context.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>7- Practical Exam</strong><br><p>Each student will perform a 30 minute practical exam covering subjective information gathering, assessment item selection and delivery and exercise prescription</p></br></p></div></td>",
            "topic_title": "<strong>7- Practical Exam</strong>",
            "topic_description": "7- Practical Exam Each student will perform a 30 minute practical exam covering subjective information gathering, assessment item selection and delivery and exercise prescription",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>7</strong><br><p>Pain, chronicity and rehabilitation. Explores differences between acute and chronic pain and management including psychosocial aspects of MSK rehabilitation <br/>Pharmacology for MS includes pain relief, anti-inflammatories, steroids</p></br></p></div></td>",
            "topic_title": "<strong>7</strong>",
            "topic_description": "7 Pain, chronicity and rehabilitation. Explores differences between acute and chronic pain and management including psychosocial aspects of MSK rehabilitation Pharmacology for MS includes pain relief, anti-inflammatories, steroids",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>9</strong><br><p>Osteoarthritis, Juvenile Rheumatoid arthritis, Bone osteoporosis</p></br></p></div></td>",
            "topic_title": "<strong>9</strong>",
            "topic_description": "9 Osteoarthritis, Juvenile Rheumatoid arthritis, Bone osteoporosis",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>12</strong><br><p>Older Adults Sarcopenia</p>\n<p>Falls and Frailty</p></br></p></div></td>",
            "topic_title": "<strong>12</strong>",
            "topic_description": "12 Older Adults Sarcopenia Falls and Frailty",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>11</strong><br><p>Occupational Rehabilitation<br/>Theory related to occupational and compensable rehabilitation environments, red and yellow flags, tasks and work demand assessment.<br/>Includes FCEﾒs.</p></br></p></div></td>",
            "topic_title": "<strong>11</strong>",
            "topic_description": "11 Occupational Rehabilitation Theory related to occupational and compensable rehabilitation environments, red and yellow flags, tasks and work demand assessment. Includes FCEﾒs.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>10</strong><br><p>MSK rehabilitation for Athletic Populations </p></br></p></div></td>",
            "topic_title": "<strong>10</strong>",
            "topic_description": "10 MSK rehabilitation for Athletic Populations",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>8</strong><br><p>Pelvic floor, womens health</p></br></p></div></td>",
            "topic_title": "<strong>8</strong>",
            "topic_description": "8 Pelvic floor, womens health",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>13</strong><br><p>Self-management and theory related to long term behaviour change in MSK</p>\n<p>Revision and course overview</p></br></p></div></td>",
            "topic_title": "<strong>13</strong>",
            "topic_description": "13 Self-management and theory related to long term behaviour change in MSK Revision and course overview",
            "learning_outcomes": []
        }
    ]
}