{
    "course_title": "Exercise Prescription & Programming for Ageing, Metabolic Disease & Cancer",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EXMD4741-21098-7520",
    "full_course_code": "EXMD4741-21098-7520",
    "course_code": "EXMD4741",
    "class_code": "21098",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Discuss the role of physical activity and exercise in preserving cognitive function."
        },
        {
            "number": "LO2.",
            "description": "Discriminate the epidemiology, aetiology, risk factors, pathophysiology, diagnostic procedures, surgical, medical, pharmacological and allied health treatments, psychosocial impact and subsequent exercise considerations for patients with cancer, cognitive impairment, dementia and mental disorders"
        },
        {
            "number": "LO3.",
            "description": "Distinguish contraindications, comorbidities, surgical, medical, pharmacological and allied health treatments, and associated acute and chronic risks to exercise testing and delivery for a client with cancer and mental disorders, using their medical and exercise history, and clinical data from their GP, to implement appropriate pre-exercise screening and risk stratification procedures."
        },
        {
            "number": "LO4.",
            "description": "In pairs, perform relevant measurements of health and physical function, and design, deliver, evaluate and adapt exercise programs for a client with cancer and/or mental health condition and/or cognitive impairment/older adult based on their short- and long-term goals, preferences, medical history, subjective and objective measurements/observations and current exercise and functional capacities, and in accordance with workplace/laboratory/gymnasium hygiene, health and safety guidelines."
        },
        {
            "number": "LO5.",
            "description": "Differentiate adverse signs and symptoms related to the disease state or treatment that may arise during exercise or recovery and carry out the appropriate course of action."
        },
        {
            "number": "LO6.",
            "description": "Design and critically appraise safe and effective evidence-based exercise programs for individuals with cancer, cognitive impairment, dementia, mental disorders, and older adults."
        },
        {
            "number": "LO7.",
            "description": "Appraise your ability to effectively and efficiently communicate testing procedures, test results, exercise prescription instructions/cues, and subsequent implications of physical activity and exercise for the health and wellbeing of individuals with complex and chronic medical conditions."
        },
        {
            "number": "LO8.",
            "description": "Enhance professional practice through engagement in self reflection."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Workshop Reports and Subjective Assessment Competency",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>10% (3 x Workshop Reports: 3% each, Subjective Assessment Competency: 1%) </dd>",
            "due_date": "<dd><p>Workshop Report 1 11/03/2025 - 12/03/2025</p>\n<p>Workshop Report 2 25/03/2025 - 26/03/2025</p>\n<p>Workshop Report 3 8/04/2025 - 9/04/2025</p>\n<p>\n</p><p>Due 5:00 pm one week following your timetabled workshop (e.g. if your workshop was at 10:00 am on Tuesday of week 2, your report is due by 5:00 pm of the following Tuesday of week 3).</p>\n<p>Subjective Assessment Competency: Across the five workshops (Workshop 1 to Workshop 5) you will be assessed once on your subjective assessment skills in a role-play scenario.</p></dd>",
            "learning_objectives": null,
            "mode": "Oral, Written",
            "category": "Paper/ Report/ Annotation, Practical/ Demonstration, Role play/ Simulation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>As part of Workshops 1, 3 and 5 you will be required to complete a designated report (e.g., NDIS, TCA, DVA) based on the case and information acquired and discussed in the workshop. You will submit each report by 5pm of the following week through the designated turn-it-in link on the ULTRA site. </p>\n<p>Once per semester (i.e., on one instance across the 5 workshops) you will be assessed on your subjective assessment skills in the workshop, as you pair up and role play. Approximately 5-10 students will be assessed by the workshop facilitator each workshop. </p>\n<p>Further details can be found in the information and criteria sheets on ULTRA.</p>\n<p><strong>Use of generative Artificial Intelligence (AI) or Machine Translation (MT).</strong></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Workshop Reports: </strong>to be submitted via the relevant Turnitin submission portal on ULTRA site.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p><strong>Workshop Reports: </strong>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "In-Semester Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 31/03/2025</p>\n<p>\n</p><p>During timetabled lecture.</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The In-Semester Exam assesses the lecture and workshop content from week 1-4 inclusive.</p>\n<p><strong>Use of generative Artificial Intelligence (AI) or Machine Translation (MT).</strong></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Client Assessment and Training Skills",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>50% (Exercise Assessment and Programming: 15%, Client Interaction, Exercise Session Delivery and Clinical Reflections: 35%) </dd>",
            "due_date": "<dd><p><strong>Exercise programming: </strong>due 5:00 pm one week following your initial and final assessment.</p>\n<p><strong>Client Interaction, Exercise Session Delivery and Clinical Reflections: </strong>30/05/2025 5:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance, Written",
            "category": "Paper/ Report/ Annotation, Performance, Practical/ Demonstration, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment contains two major components. Criteria sheets for each component can be found on the ULTRA site.</p>\n<p><strong>1.   Exercise Assessment and Programming - (15%). Consisting of a written component (7.5%) and a practical component (7.5%).</strong></p>\n<p><strong>Task outline: </strong>You will work in pairs for this task (i.e. both students in the student pair get the same mark). You will be assigned a client who is either living with or has survived cancer, has a mental health condition and/or is older aged. In week 7 you will conduct an initial assessment of the client. 7.5% of this assessment item is based on your practical work during this session; i.e. competency and professionalism. Following the assessment visit, you will write a draft program for the client which will start to be delivered in week 8. You will have 2 days following your assessment visit in week 7 to submit your program draft to your clinical educator who will provide feedback within ~2 days (prior to delivery of the program) allowing you to adjust programming if required. This is not assessed but feedback should assist you with the written component. You will then submit the written component (details below) one week after the initial assessment visit (E.g. in week 7, if your session is Tuesday 9am-10.30, your assessment item will be due by 5pm on Tuesday of week 8).</p>\n<p>-         This written component (7.5%) will have three parts:</p>\n<p>1)     How does the client information (medical history, additional information, goals and assessment data) impact on the interactions you will have with the client?</p>\n<p>2)     How does the client information (medical history, additional information, goals and assessment results) impact on the exercise prescription you have written for your client?</p>\n<p>3)     Exercise program (using the Proforma)- with potential progressions and regressions during your training sessions with the client.</p>\n<p>Reference to appropriate evidence/literature is expected where relevant.</p>\n<p>-         This task includes:</p>\n<p>a)     Reviewing client information: medical history, doctors notes- what might these mean for the interactions/programming</p>\n<p>b)     Developing an exercise program based on the FITT principle and cognisant of any considerations, goals and objectives identified. This includes exercise delivered during the weekly in-person clinic session and home-based prescription/advice to reduce sedentary behaviour. The program should address the client’s goals and describe progressions for improvement (with timelines for progression) across the 4 weeks of supervised sessions.</p>\n<p><strong>2.   Client interaction, Exercise Session Delivery, and Clinical Reflections- practical and professional skills in clinic (35%). Consisting of clinic work (25%), and a final written report including a home program (10%).</strong></p>\n<p><strong>For clinic work, </strong>student pairs work together but are assessed individually. For the final written report including a home program, students work in their pairs for this task (i.e. both students in the student pair get the same mark).</p>\n<p>This Assessment Item includes:</p>\n<p><strong>Clinic Work (25%): </strong></p>\n<p>a. <strong>           </strong>Clinical reasoning (assessed during the pre- and post-exercise training sessions and the training session) underpinned by relevant knowledge (pathophysiology, pharmacology, psychology and behavioural management). May include demonstrating knowledge and application of pre-training preparation requirements and contraindications to exercise prescription and deliver</p>\n<p>b.            Quality of communication during all aspects of clinical practice and client interactions. Communication should be well structured, accurate, engaging, timely, patient appropriate (language, terminology).</p>\n<p>c.             Quality of exercise delivery (e.g. explanation of exercise to be performed: checks/clarifies client understanding)</p>\n<p>d.            Professionalism (e.g. attire, behaviour and attitude)- this is a pass/fail component and a Hurdle for passing the course.</p>\n<p>e.            SOAP Notes that assess the requirement for, and proficiently implement adjustments to the exercise program based on identified needs. SOAP notes will be completed on the template provided and uploaded to Nookal by 5pm the day following your clinic session. You will be provided with a link and instructions for Nookal upload.</p>\n<p>f.            Equipment handling and clean up</p>\n<p>g.            Weekly Clinical reflections to assesses your insight as a reflective practitioner for each session into, at minimum:</p>\n<p>·        What worked and why?</p>\n<p>·        What didn’t work and why?</p>\n<p>·        What will/would you do to improve the program/enhance client outcomes (if you believe no changes are required, then you must clearly explain why this was the case)</p>\n<p>·        Provide your partner two things they did really well and two things they could improve on </p>\n<p>Reflections must be submitted via the appropriate Turnitin link on ULTRA and the name of your document must follow this convention: NAME_Reflection_Submission# (e.g. SMITH_Reflection_1). Font must be double-spaced, Calibri or Times New Roman at size 11 or 12, as preferred. Word count approximately 250-500 words.</p>\n<p><strong>If your client</strong> <strong>misses</strong> <strong>a workshop session:</strong></p>\n<p>In the case that your client is ill/away/unable to attend a scheduled session, you will be required to attend the practical/clinic as per usual. Your reflection should address their absenteeism based on their individual circumstances (i.e. if you were their AEP, what would you do if your client was unable to attend their session?). For example, if your client has missed a session based on hospitalisation for a certain condition, would you send them exercises that they could safely perform in the hospital bed? Why? Why not? What would it include? How will you program for next week’s session considering your patient’s absence this week? You would not be required to upload a SOAP note if your client is absent.</p>\n<p><strong>Final written report including a home program (10%)</strong></p>\n<p>Each student pair submits the same written assignment (via Turnitin). The written piece of work should reflect a report that they will send to their client summarising specific aspects of their clinic experience (e.g. Change in objective measures from week 1 to week 6, attendance, goals attained) and a home program that they can continue with.</p>\n<p><strong>Use of generative Artificial Intelligence (AI) or Machine Translation (MT).</strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": null,
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "End of Semester Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>7/06/2025 - 21/06/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The examination will cover all material delivered throughout the course. </p>\n<p><strong>Use of generative Artificial Intelligence (AI) or Machine Translation (MT).</strong></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Course Introduction </strong><br/></p><p><strong>Learning outcomes:</strong> L08</p></div></td>",
            "topic_title": "<strong>Course Introduction </strong>",
            "topic_description": "Course Introduction",
            "learning_outcomes": [
                "L08"
            ]
        },
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mental Health- 1</strong><br/></p></div></td>",
            "topic_title": "<strong>Mental Health- 1</strong>",
            "topic_description": "Mental Health- 1",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mental Health - Part 2</strong><br/></p></div></td>",
            "topic_title": "<strong>Mental Health - Part 2</strong>",
            "topic_description": "Mental Health - Part 2",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mental Health- Part 3</strong><br/></p></div></td>",
            "topic_title": "<strong>Mental Health- Part 3</strong>",
            "topic_description": "Mental Health- Part 3",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Prescription and Programming- Mental Health 1</strong><br/></p></div></td>",
            "topic_title": "<strong>Prescription and Programming- Mental Health 1</strong>",
            "topic_description": "Prescription and Programming- Mental Health 1",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Cancer- Part 1</strong><br/></p></div></td>",
            "topic_title": "<strong>Cancer- Part 1</strong>",
            "topic_description": "Cancer- Part 1",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Cancer - Part 2</strong><br/></p></div></td>",
            "topic_title": "<strong>Cancer - Part 2</strong>",
            "topic_description": "Cancer - Part 2",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Prescription and Programming- Mental Health 2</strong><br/><p>Mental Health / Practical Exam Prep</p></p></div></td>",
            "topic_title": "<strong>Prescription and Programming- Mental Health 2</strong>",
            "topic_description": "Prescription and Programming- Mental Health 2 Mental Health / Practical Exam Prep",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Cancer- Part 3</strong><br/></p></div></td>",
            "topic_title": "<strong>Cancer- Part 3</strong>",
            "topic_description": "Cancer- Part 3",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Older Adults</strong><br/></p></div></td>",
            "topic_title": "<strong>Older Adults</strong>",
            "topic_description": "Older Adults",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Prescription and Programming- Cancer 1</strong><br/></p></div></td>",
            "topic_title": "<strong>Prescription and Programming- Cancer 1</strong>",
            "topic_description": "Prescription and Programming- Cancer 1",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Stigma and Inclusion in Healthcare</strong><br/></p><p><strong>Learning outcomes:</strong> L02, L03, L05, L08</p></div></td>",
            "topic_title": "<strong>Stigma and Inclusion in Healthcare</strong>",
            "topic_description": "Stigma and Inclusion in Healthcare",
            "learning_outcomes": [
                "L02",
                "L03",
                "L05",
                "L08"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Getting Prac Ready</strong><br/></p><p><strong>Learning outcomes:</strong> L07, L08</p></div></td>",
            "topic_title": "<strong>Getting Prac Ready</strong>",
            "topic_description": "Getting Prac Ready",
            "learning_outcomes": [
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Prescription and Programming- Cancer 2</strong><br/></p></div></td>",
            "topic_title": "<strong>Prescription and Programming- Cancer 2</strong>",
            "topic_description": "Prescription and Programming- Cancer 2",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Prescription and Programming- Older Adults</strong><br/></p></div></td>",
            "topic_title": "<strong>Prescription and Programming- Older Adults</strong>",
            "topic_description": "Prescription and Programming- Older Adults",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Clinical Workshop 1</strong><br/><p>Exercise assessment and delivery with client - Initial Consultation</p></p></div></td>",
            "topic_title": "<strong>Clinical Workshop 1</strong>",
            "topic_description": "Clinical Workshop 1 Exercise assessment and delivery with client - Initial Consultation",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Clinical Workshop 2</strong><br/><p>Exercise delivery </p></p></div></td>",
            "topic_title": "<strong>Clinical Workshop 2</strong>",
            "topic_description": "Clinical Workshop 2 Exercise delivery",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Clinical Workshop 2</strong><br/><p>Exercise delivery</p></p></div></td>",
            "topic_title": "<strong>Clinical Workshop 2</strong>",
            "topic_description": "Clinical Workshop 2 Exercise delivery",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Clinical Workshop 4</strong><br/><p>Exercise delivery</p></p></div></td>",
            "topic_title": "<strong>Clinical Workshop 4</strong>",
            "topic_description": "Clinical Workshop 4 Exercise delivery",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Clinical Workshop 5</strong><br/><p>Exercise delivery</p></p></div></td>",
            "topic_title": "<strong>Clinical Workshop 5</strong>",
            "topic_description": "Clinical Workshop 5 Exercise delivery",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Clinical Workshop 6</strong><br/><p>Final assessments and programming</p></p></div></td>",
            "topic_title": "<strong>Clinical Workshop 6</strong>",
            "topic_description": "Clinical Workshop 6 Final assessments and programming",
            "learning_outcomes": []
        }
    ]
}