{
    "course_title": "Literary and Cultural Debates in French",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/FREN3355-20927-7520",
    "full_course_code": "FREN3355-20927-7520",
    "course_code": "FREN3355",
    "class_code": "20927",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "read and analyse literary texts from different genres and periods in French/lire et analyser des textes littéraires d'époques et de genres différents en français"
        },
        {
            "number": "LO2.",
            "description": "understand and recognize themes and motifs in the texts you are reading/reconnaitre et et identifier les thèmes et motifs des texts que vous lisez"
        },
        {
            "number": "LO3.",
            "description": "make links between the literary texts you are reading, the broader socio-cultural questions they pose and the contexts in which the texts are situated/faire des liens entre les texts littéraires que vous lisez, les questions socioculturelles qu'ils posent et le contexte culturel dans lequel ils se situent"
        },
        {
            "number": "LO4.",
            "description": "talk and write about literary texts in French within the framework of their social, historical, ideological and/or philosophical contexts/communiquer à l'écrit et à l'oral sur des textes littéraires en français dans le cadre de leurs contextes sociales, historiques, idéologiques et/ou philosophiques"
        },
        {
            "number": "LO5.",
            "description": "write in clear and correct French about literary questions, including those relating to various literary genres and movements/écrire clairement et correctement en français sur des questions littéraires, y compris par rapport aux genres et mouvements littéraires"
        },
        {
            "number": "LO6.",
            "description": "better understand the cultural conventions of argumentation in French/mieux comprendre les conventions culturelles liées à l'argumentation en français"
        },
        {
            "number": "LO7.",
            "description": "express your opinion on different controversial current affairs topics in French/vous exprimer sur des sujets d'actualité divers et controversés en français"
        },
        {
            "number": "LO8.",
            "description": "support and defend your ideas, in spoken and written French, using appropriate techniques, expressions and connectors/soutenir et défendre vos idéees en français, à l'écrit et à l'oral, en employant des techniques, des expressions et des connecteurs appropriés"
        },
        {
            "number": "LO9.",
            "description": "work effectively with a partner or in a group/travailler de manière efficace avec les autres"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Blackboard Reading Tasks",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p>Reading Task 1 -  4/03/2025 5:00 pm</p>\n<p>Reading Task 2 - 14/03/2025 12:00 pm</p>\n<p>Reading Task 3 - 18/03/2025 5:00 pm</p>\n<p>Reading Task 4 - 25/03/2025 5:00 pm</p>\n<p>Reading Task 5 - 1/04/2025 5:00 pm</p>\n<p>Reading Task 6 - 8/04/2025 5:00 pm</p>\n<p>Reading Task 7 - 15/04/2025 5:00 pm</p>\n<p>Reading Task 8 - 29/04/2025 5:00 pm</p>\n<p>Reading Task 9 - 6/05/2025 5:00 pm</p>\n<p>Reading Task 10 - 13/05/2025 5:00 pm</p>\n<p>Reading Task 11 - 20/05/2025 5:00 pm</p>\n<p>Reading Task 12 - 27/05/2025 5:00 pm</p></dd>",
            "learning_objectives": "L01, L02",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will be given 12 tasks in the course of semester of which the best 10 marks will be used to calculate the final result for this assessment task. These tasks will be based on the key course texts and may include journalistic or academic articles as well as the main literary texts. The tasks will be due on Tuesdays at 5pm from weeks 2-13. They will be posted on Blackboard, in general, a week before the assessments are due.</p>\n<p><strong>STATEMENT ON AI &amp; MT</strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The tasks are to be completed on Blackboard.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A penalty of 100% of the maximum mark applies if an extension has not been granted.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Presentation : analysis of an academic article",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> Week 5 - Week 13</p>\n<p>\n</p><p>See task description for specific due dates for specific text presentations.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L06, L09",
            "mode": "Oral",
            "category": "Presentation, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Generally, in the final weeks of each module in the course, students--in groups of 2 or 3--will be asked to lead class discussion on the analysis of an academic article in French related to the literary text under discussion in that module (or potentially related to one of the broader cultural debates linked to one of those literary texts). In short, those presenting are to \"teach\" the article to the other students in the class.</p>\n<p>By 5pm on the Monday the week of the presentation, students doing presentations are to post on Blackboard:</p>\n<ul>\n<li>a pdf of the article to be analysed, with annotations pointing to the key argumentation strategies used in the article (connectors or set phrases used for various different purposes etc., plus useful points concerning difficult vocabulary etc. and even aspects of the article that the presenters themselves had difficulty understanding).</li>\n<li>a brief summary of that article (no more than 100 words).</li>\n<li>some questions (4 maximum) to orient students' reading of the article.</li>\n</ul>\n<p>Suggestd academic articles will be posted on Blackboard, though students--with the permission of the lecturer teaching the module in question--may choose another article.</p>\n<p>Duration = 12-15 minutes for a group of two students, 16-20 minutes for a group of three.</p>\n<p>It is important to work as a team but criteria will be individual.</p>\n<p>The following dates are proposed for student presentations (further dates may be added depending on course enrolments) :</p>\n<ul>\n<li>Thursday 20 and Thursday 27 March (academic articles on <em>La Femme cachée</em> and approved texts on related debates)</li>\n<li>Thursday 3 April and Thursday 10 April (academic articles on <em>Persepolis</em> and approved texts on related debates)</li>\n<li>Thursday 1 May and Thursday 9 May (academic articles on <em>Le Cœur à rire et à pleurer </em>and approved texts on related debates)</li>\n<li>Thursday 22 May and Thursday 19 May (academic articles on <em>2084 . La fin du monde </em>and approved texts on related debates)</li>\n</ul>\n<p>If students enrolments are too large to allow for all students to do presentations in class, some students will need to present in other weeks or record their presentations and post on Blackboard. The same due dates will apply.</p>\n<p><strong>Working in teams</strong></p>\n<p>Please note that, although students are marked individually on the criteria, your presentation will work best if you work as a team. For example, you may decide to divide the article into sections for different team members to work on, but your presentation will be stronger if all team members read each other's work and offer feedback and advice. This will make the overall presentation more coherent.</p>\n<p>If one or more group member does not participate with the group (i.e. attending meetings, responding to messages, completing drafts in a timely manner as decided by the group, submitting work as requested), the group member may be removed from the group and required to complete work individually without the benefit of feedback from the other members of the team. It is incumbent upon team members to treat each other professionally and to report to the course coordinator if a member has been non-responsive or non-participatory. If a team member is removed from a group, he or she will be notified in writing by the course coordinator.</p>\n<p>If you have circumstances which prevent you from working in a group, you must formally request permission to complete this assessment item individually by emailing the course coordinator before team assignments are made. Your request should include supporting documentation or refer to an SAPD or application for an extension.</p>\n<p><strong>Use of Generative AI &amp; MT:</strong> This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct. <strong> </strong><em>Students must note that the use of AI outputs without attribution, and contrary to any direction by teaching staff, is a form of plagiarism and constitutes academic misconduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>By 5pm on the Monday the week of the presentation, students doing presentations are to post on Blackboard:</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A penalty of 100% of the maximum mark applies if an extension has not been granted.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Oral debate and reflective essay",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 28/03/2025 - 30/05/2025</p>\n<p>\n</p><p>Due dates (choose ONE of the options below) :</p>\n<ul>\n<li>Debate relating to question on text/s associated with <em>La Femme cachée </em>: Video debate (28 March by 5pm) + Reflective essay (4 April by 5pm)</li>\n<li>Debate relating to question on text/s associated with <em>Persepolis</em>: Video debate (4 April by 5pm) + Reflective essay (11 April by 5pm)</li>\n<li>Debate relating to question on text/s associated with <em>Le Cœur à rire et à pleurer</em> : Video debate (9 May at 5pm ) + Reflective essay (16 May at 5pm)</li>\n<li>Debate relating to question on text/s associated with<em> 2084 : la fin du monde</em> : Video debate (23 May at 5pm ) + Reflective essay (30 May at 5pm)</li>\n</ul></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L08, L09",
            "mode": "Oral, Written",
            "category": "Essay/ Critique, Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Once during the semester, you are to participate in a debate on a subject linked to the set texts for the course and/or the cultural debates associated with their content. There will be four debates in the course of semester. You must sign up to and participate in one of these debates.</p>\n<p>The debate is divided into two parts:</p>\n<p><strong>Part 1: Oral debate (12%)</strong></p>\n<p>A specific question, possibly related to an article or an extract from a text, will be published for each of the four debates during the semester.</p>\n<p>You will choose one of these, register and publish a four to five minute video (maximum) in response to the question posed. The video need not be as structured as a written essay, for example, but you should nonetheless use connectors and expressions learnt in class to reinforce your argument (in order to show opposition, concession etc.). You are expected to acknowledge other points of view in relation to the topic under discussion (for example, in the article or text extract from which the question was drawn, or from other journalistic articles, especially if you're the first to contribute to the debate), and for those who contribute later in the debate, you should react to the comments which have come before your contribution. You may use notes to help you if you like, but if you read a text--or give the impression of reading a text--it will be difficult to have a high grade for your contribution (as per the criteria). Please see Blackboard for further instructions.</p>\n<p><strong>Part 2: reflective essay (18%)</strong></p>\n<p>For the second part of the exercise, you will write an essay in which you reflect in a more formal manner on the question posed in the debate. This time, your text should be more tightly structured and you should weigh up both sides of the argument in question (with reference to what your classmates have said in the oral debate, and to texts relevant to the debate) in order to produce a sophisticated and nuanced argument in favour of your position. The essay is generally due a week after the due date for the oral debate, but see the precise dates below. Please refer to Blackboard for further instructions.</p>\n<p>Length : 800-1,000 words.</p>\n<p>Due dates (choose ONE of the options below) :</p>\n<ul>\n<li>Debate relating to question on text/s associated with <em>La Femme cachée </em>: Video debate (28 March by 5pm) + Reflective essay (4 March by 5pm)</li>\n<li>Debate relating question on text/s associated with <em>Persepolis</em>: Video debate (4 April by 5pm) + Reflective essay (11 April by 5pm)</li>\n<li>Debate relating to question on text/s associated with <em>Le Cœur à rire et à pleurer</em> : Video debate (9 May at 5pm ) + Reflective essay (16 May at 5pm)</li>\n<li>Debate relating to question on text/s associated with<em> 2084 : la fin du monde</em> : Video debate (23 May at 5pm ) + Reflective essay (30 May at 5pm)</li>\n</ul>\n<p><strong>Use of Generative AI &amp; MT: </strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>To be submitted via Blackboard</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Oral discussion",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 9/06/2025 - 13/06/2025</p>\n<p>\n</p><p>Exam Week 1</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L06, L07, L08",
            "mode": "Oral",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>In groups of two, students will be interviewed by their tutors on the texts studied in the course of the semester and on the debates associated with those texts. In the course of the discussion, students will be able to show their knowledge of the set texts for the course as well as display their argumentation skills to argue their point as convincingly as possible, but also to make concessions.</p>\n<p>Broad topics for the oral discussion--and the particular texts that the discussions will pertain to--will be published on Blackboard by Week 13. Students will be able to nominate their topic in advance. Students may rehearse the discussion together, but it is not to be memorised as the discussion will involve questions from the tutors to the students rather than a rehearsed discussion between students.</p>\n<p>The discussion will take place in the first week of the exam period unless otherwise specified by central examinations.</p>\n<p>THE ORAL DISCUSSION IS A HURDLE REQUIREMENT. STUDENTS MUST RECEIVE A MARK OF 40% (12/30) IN ORDER TO PASS THIS COURSE</p>\n<p><strong>Use of Generative AI &amp; MT: </strong><em>This task has been designed to be challenging, authentic and complex. Whilst students may use AI technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI tools. </em><strong>Students must note that the use of AI outputs without attribution, and contrary to any direction by teaching staff, is a form of plagiarism and constitutes academic misconduct. </strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>No submission required. Oral discussions will be conducted in-person.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1 : Tutorials/Semaine 1 : s￩minaires</strong><br/><p>Semaine/Week 1 : Course introduction/<em>La Femme cachée</em> and texts on/for argumentation</p>\n<p><br/></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Week 1 : Tutorials/Semaine 1 : s￩minaires</strong>",
            "topic_description": "Week 1 : Tutorials/Semaine 1 : s￩minaires Semaine/Week 1 : Course introduction/ La Femme cachée and texts on/for argumentation",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2: Tutorials/Semaine 2 : s￩minaires</strong><br><p>Semaine/Week 2 : <em>La Femme cachée</em> and texts on/for argumentation</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Week 2: Tutorials/Semaine 2 : s￩minaires</strong>",
            "topic_description": "Week 2: Tutorials/Semaine 2 : s￩minaires Semaine/Week 2 : La Femme cachée and texts on/for argumentation",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3: Tutorials/Semaine 3 : s￩minaires</strong><br/><p>Semaine/Week 3 : \"La femme cach￩e\" + \"Persepolis\" and texts on/for argumentation<br/><br/>\"La Femme cach￩e\" + \"Persepolis\" et textes argumentatifs.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Week 3: Tutorials/Semaine 3 : s￩minaires</strong>",
            "topic_description": "Week 3: Tutorials/Semaine 3 : s￩minaires Semaine/Week 3 : \"La femme cach￩e\" + \"Persepolis\" and texts on/for argumentation \"La Femme cach￩e\" + \"Persepolis\" et textes argumentatifs.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4: Tutorials/Semaine 4 : s￩minaires</strong><br><p>Semaine 4 :<em> Persepolis</em> and texts on/for argumentation</p>\n<p><br/></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Week 4: Tutorials/Semaine 4 : s￩minaires</strong>",
            "topic_description": "Week 4: Tutorials/Semaine 4 : s￩minaires Semaine 4 : Persepolis and texts on/for argumentation",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5: Tutorials/Semaine 5 : s￩minaires</strong><br><p>Semaine 5 :<em> Persepolis</em> and texts on/for argumentation</p>\n<p><br/></p>\n<p><br/></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Week 5: Tutorials/Semaine 5 : s￩minaires</strong>",
            "topic_description": "Week 5: Tutorials/Semaine 5 : s￩minaires Semaine 5 : Persepolis and texts on/for argumentation",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6: Tutorials/Semaine 6 : s￩minaires</strong><br><p>Semaine/Week 6 : <em>Persepolis</em> and texts on/for argumentation</p>\n<p><br/></p>\n<p>\"Persepolis\" + textes argumentatifs</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Week 6: Tutorials/Semaine 6 : s￩minaires</strong>",
            "topic_description": "Week 6: Tutorials/Semaine 6 : s￩minaires Semaine/Week 6 : Persepolis and texts on/for argumentation \"Persepolis\" + textes argumentatifs",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7: Tutorials/Semaine 7 : s￩minaires</strong><br><p>Semaine/Week 7 : \"Le Cœur à rirer et à pleurer\" and texts on/for argumentation. </p>\n<p>\"Le Cœur à rirer et à pleurer\" de Maryse Condé et textes argumentatifs.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Week 7: Tutorials/Semaine 7 : s￩minaires</strong>",
            "topic_description": "Week 7: Tutorials/Semaine 7 : s￩minaires Semaine/Week 7 : \"Le Cœur à rirer et à pleurer\" and texts on/for argumentation. \"Le Cœur à rirer et à pleurer\" de Maryse Condé et textes argumentatifs.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8: Tutorials/Semaine 8 : s￩minaires</strong><br><p>Semaine/Week 8 : <em>Le Cœur à rire et à pleurer</em> and texts on/for argumentation. NB : No Friday tutorial = Good Friday Public Holiday</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Week 8: Tutorials/Semaine 8 : s￩minaires</strong>",
            "topic_description": "Week 8: Tutorials/Semaine 8 : s￩minaires Semaine/Week 8 : Le Cœur à rire et à pleurer and texts on/for argumentation. NB : No Friday tutorial = Good Friday Public Holiday",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MID-SEMESTER BREAK</strong><br/></p></div></td>",
            "topic_title": "<strong>MID-SEMESTER BREAK</strong>",
            "topic_description": "MID-SEMESTER BREAK",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9: Tutorials/Semaine 9 : s￩minaires</strong><br/><p>Semaine/Week 9 : <em>Le Cœur à rire et à pleurer</em> and texts on/for argumentation </p>\n<p><br/></p>\n<p><br/></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Week 9: Tutorials/Semaine 9 : s￩minaires</strong>",
            "topic_description": "Week 9: Tutorials/Semaine 9 : s￩minaires Semaine/Week 9 : Le Cœur à rire et à pleurer and texts on/for argumentation",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10: Tutorials/Semaine 10 : s￩minaires</strong><br><p>Semaine/Week 10 : </p>\n<p><br/></p>\n<p><em>Le Cœur à rire et à pleurer</em> and texts on/for argumentation</p>\n<p><br/></p>\n<p><br/></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Week 10: Tutorials/Semaine 10 : s￩minaires</strong>",
            "topic_description": "Week 10: Tutorials/Semaine 10 : s￩minaires Semaine/Week 10 : Le Cœur à rire et à pleurer and texts on/for argumentation",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11: Tutorials/Semaine 11 : s￩minaires</strong><br><p>Semaine/Week 11 :<em> 2084 : la fin du monde</em> + argumentative texts</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Week 11: Tutorials/Semaine 11 : s￩minaires</strong>",
            "topic_description": "Week 11: Tutorials/Semaine 11 : s￩minaires Semaine/Week 11 : 2084 : la fin du monde + argumentative texts",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12: Tutorials/Semaine 12 : s￩minaires</strong><br><p>Semaine/Week 12 : <em>2084 : la fin du monde </em>+ texts on/for argumentation</p>\n<p><br/></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Week 12: Tutorials/Semaine 12 : s￩minaires</strong>",
            "topic_description": "Week 12: Tutorials/Semaine 12 : s￩minaires Semaine/Week 12 : 2084 : la fin du monde + texts on/for argumentation",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13: Tutorials/Semaine 13 : s￩minaires</strong><br><p>Semaine/Week 13 : <em>2084 : la fin du monde </em>+ texts on/for argumentation</p>\n<p><br/></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Week 13: Tutorials/Semaine 13 : s￩minaires</strong>",
            "topic_description": "Week 13: Tutorials/Semaine 13 : s￩minaires Semaine/Week 13 : 2084 : la fin du monde + texts on/for argumentation",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        }
    ]
}