{
    "course_title": "Honours Research Thesis",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/KORN6012-22526-7520",
    "full_course_code": "KORN6012-22526-7520",
    "course_code": "KORN6012",
    "class_code": "22526",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Conceptualise, plan and carry out a coherent research project."
        },
        {
            "number": "LO2.",
            "description": "Develop an argument critically and clearly."
        },
        {
            "number": "LO3.",
            "description": "Demonstrate knowledge of current research in the subject area."
        },
        {
            "number": "LO4.",
            "description": "Discern and locate appropriate research materials and data, in line with research ethics guidelines."
        },
        {
            "number": "LO5.",
            "description": "Justify and apply appropriate methods, techniques, analysis and conventions."
        },
        {
            "number": "LO6.",
            "description": "Communicate research processes, findings and implications, both in writing and verbally, in accordance with the conventions of the language and discipline of the thesis."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Honours Thesis",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>100%</dd>",
            "due_date": "<dd><p> 31/10/2025 4:00 pm</p>\n<p>\n</p><p><strong>Friday of Week 13 (Semester 2)</strong></p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Thesis",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Honours thesis is a <strong>10,000-17,000 words research project</strong> <strong>in English or Korean (with permission) </strong>that demonstrates a student's ability to conduct independent scholarly inquiry. It should engage critically with existing research, apply appropriate theoretical and methodological frameworks, and present findings in a manner consistent with academic conventions. The thesis serves as a capstone project, reflecting the student’s research skills, analytical abilities, and understanding of the discipline.</p>\n<p>A word count that is within ±10% of the set length (word limit) is acceptable. Word count does not include footnotes; however, discursive footnotes are included in the word count. A word count that is outside these 10% will receive a proportionate penalty and will be graded against the grading criteria.</p>\n<p><strong>Purpose of the Thesis</strong></p>\n<p>The Honours thesis is designed to:</p>\n<ul>\n<li>Develop students’ ability to conduct independent, original research.</li>\n<li>Deepen their engagement with relevant theories, methodologies, and scholarly debates.</li>\n<li>Enhance their academic writing and argumentation skills.</li>\n<li>Prepare them for further research at the postgraduate level or careers requiring analytical and critical thinking skills.</li>\n</ul>\n<p><strong>Assessment Criteria</strong></p>\n<p>The thesis will be evaluated based on:</p>\n<ul>\n<li><strong>Originality &amp; Research Depth</strong> – Demonstrates independent thought and engagement with existing scholarship.</li>\n<li><strong>Theoretical &amp; Methodological Rigor</strong> – Uses appropriate frameworks and research methods.</li>\n<li><strong>Clarity &amp; Coherence</strong> – Presents a clear argument with logical progression.</li>\n<li><strong>Academic Writing &amp; Presentation</strong> – Adheres to scholarly conventions, including citation style and formatting.</li>\n</ul>\n<p>Detailed marking criteria can be found here: <a href=\"https://languages-cultures.uq.edu.au/study/honours/information-current-honours-students\">https://languages-cultures.uq.edu.au/study/honours/information-current-honours-students</a> - Under section: “Documents for Current Honours Students”.</p>\n<p><strong>Statement on Gen AI &amp; MT</strong></p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) provides emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p><em>Please consult UQ Guidelines on how to acknowledge and reference Gen AI </em><a href=\"https://guides.library.uq.edu.au/referencing/ai-tools-assignments\"><em>https://guides.library.uq.edu.au/referencing/ai-tools-assignments</em></a><em> , and MT </em><a href=\"https://guides.library.uq.edu.au/referencing/machine-translation\"><em>https://guides.library.uq.edu.au/referencing/machine-translation</em></a><em> </em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The final thesis must be submitted <strong>by 4pm on </strong><strong>Friday of Week 13 (Semester 2),</strong> via the following methods:</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 26(24 Feb - 02 Nov)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Supervisory Meetings</strong><br><p>Regular supervisory meetings provide structured academic support, critical feedback, and mentoring throughout the Honours project. Early on upon enrolment in Honours, students should meet with their supervisor to establish an agreed schedule for meetings and set milestones for research progress and writing tasks. These meetings are a space for collaborative reflection, discussion of academic challenges, and development of research and writing strategies. Maintaining consistent engagement with supervision is essential for successful completion of the Honours thesis.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Supervisory Meetings</strong>",
            "topic_description": "Supervisory Meetings Regular supervisory meetings provide structured academic support, critical feedback, and mentoring throughout the Honours project. Early on upon enrolment in Honours, students should meet with their supervisor to establish an agreed schedule for meetings and set milestones for research progress and writing tasks. These meetings are a space for collaborative reflection, discussion of academic challenges, and development of research and writing strategies. Maintaining consistent engagement with supervision is essential for successful completion of the Honours thesis.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 26(24 Feb - 02 Nov)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Dissertation Writing and Revision</strong><br/><p>Students are expected to engage in sustained independent research and to develop their academic writing through an iterative process of drafting and redrafting sections of their Honours thesis. In consultation with their supervisor, students will agree on a schedule for the submission of drafts, which will form the basis for structured feedback and revision. This activity supports the development of a coherent research argument, critical engagement with relevant scholarship, and clear, scholarly communication. Feedback from the Honours supervisor plays a central role in shaping and refining the written work over time.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Dissertation Writing and Revision</strong>",
            "topic_description": "Dissertation Writing and Revision Students are expected to engage in sustained independent research and to develop their academic writing through an iterative process of drafting and redrafting sections of their Honours thesis. In consultation with their supervisor, students will agree on a schedule for the submission of drafts, which will form the basis for structured feedback and revision. This activity supports the development of a coherent research argument, critical engagement with relevant scholarship, and clear, scholarly communication. Feedback from the Honours supervisor plays a central role in shaping and refining the written work over time.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        }
    ]
}