{
    "course_title": "Soil Plant Relationships",
    "study_period": "Sem 1 2025",
    "location": "External",
    "attendance": "Online",
    "url": "https://course-profiles.uq.edu.au/course-profiles/LAND3005-21791-7520",
    "full_course_code": "LAND3005-21791-7520",
    "course_code": "LAND3005",
    "class_code": "21791",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Illustrate the processes by which the solid-phase regulates the availability of nutrients/toxins in the soil solution."
        },
        {
            "number": "LO2.",
            "description": "Illustrate the importance of biological organisms in cycling nutrients in soil."
        },
        {
            "number": "LO3.",
            "description": "Illustrate the importance of the physical properties of the soil (such as texture, structure and water holding capacity) for the growth of plants."
        },
        {
            "number": "LO4.",
            "description": "Evaluate the major problems facing Soil Scientists in Australia and throughout the world (such as salinity and acidity) by applying the underlying theory gained through the course."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate core practical skills in Soil Science using laboratory and glasshouse techniques."
        },
        {
            "number": "LO6.",
            "description": "Solve a range of soil science problems, both individually and as part of a team."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Practical Assessment Tasks (Task 1: Soil fertility experimental preparation/design + Task 2: Practical Calculations in Soil Science + Task 3: 'Assessment of Fertility of Soil' report]",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>35% - Task 1 (Experimental preparation, 10%), Task 2 (Practical Calculations, 10%), Task 3 (Report, 15%) </dd>",
            "due_date": "<dd><p>Task 1 14/03/2025 2:00 pm</p>\n<p>Task 2 21/03/2025 2:00 pm</p>\n<p>Task 3 30/05/2025 2:00 pm</p>\n<p>\n</p><p>Due date is AEST (Brisbane) time.</p></dd>",
            "learning_objectives": "L03, L05, L06",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>TASK 1: Soil fertility experimental preparation/design</strong></p>\n<p>Read “How to unravel and solve soil fertility problems” by C Asher, N Grundon, and NW Menzies (available on BlackBoard) then complete the tasks outlined below.</p>\n<p>All of the information you require to complete this task (including relevant equations) can be found in the LAND3005 Prac Manual and the book (How to unravel and solve soil fertility problems), both of which are on BlackBoard.</p>\n<p><strong>Situation</strong>: Your client has three distinctly different soils (this could be three soils on a farm, or three soils on a mine site for revegetation). No information is available regarding the soil chemical fertility of the soils. There are multiple ways that soil fertility could be tested, including by chemical tests (chemical extractions), plant analysis, and/or by biological testing. It is decided that a pot trial will be used to examine how well plants grow in each soil type, and to identify what nutrients are limiting to plant growth. </p>\n<p><strong>Task Summary</strong>: You must write a description of how a pot trial could be conducted on the three soils to test what nutrients are limiting.</p>\n<p><strong>Task Full Description</strong>: In order to find out more about these soils, you will design a bioassay (pot trial) experiment to assess the chemical fertility of the three soils. For this assignment, please provide a detailed but concise description of the bioassay experiment you will conduct (i.e. quantity of sample, design, interpretation) to determine the chemical fertility of the unknown soils. For this assignment please provide:</p>\n<p>1.   Brief procedures of the pot trial, including calculations of amount of materials required. Consider how much soil is needed, the chemicals required to test the various nutrients, and any other materials required. Briefly show your calculations.</p>\n<p>2.   A justification of the treatments selected for the pot trial. For example, you will probably want to include a control (with no nutrient addition), but what other treatments should be tested. Why are these treatments recommended?</p>\n<p>3.   Discussion of the limitations of the technique described to provide soil fertility recommendations. In other words, what are some of the disadvantages of pot trials compared to other approaches for examining the nutrient status of soils?</p>\n<p><strong>Word limit</strong>: 1500 words +/- 10% (excluding any tables, figures, and references) [Please state the word count on the first page].</p>\n<p><strong>Writing style:</strong> Your writing style should be similar to that found in soil science/agronomy journal articles. Many styles are available but for this assignment it is recommended that you use the style manual provided by the American Society of Agronomy (<a href=\"https://dl.sciencesocieties.org/publications/style\">https://dl.sciencesocieties.org/publications/style</a>) as it is one of the most well-organized style manuals within the discipline. Please have a look at the manual for the details concerning style and formatting.</p>\n<p><strong>Layout for the report:</strong></p>\n<ol>\n<li>Title page. Include the report name, your name, student number and word count</li>\n<li>Introduction. Optional. This section does not count towards the word limit for the assignment. If you provide an Introduction, please write a short one, perhaps one to two paragraphs at the most.</li>\n<li>Procedures. In this section, write about the procedure for conducting the pot trial, including the amount of materials required. Briefly show your calculations.</li>\n<li>Treatments and justification. Here, list the treatments to be investigated, and state why these treatments are being selected.</li>\n<li>Limitations. Discuss the limitations of pot trials for assessing soil nutrient fertility.</li>\n<li>References. You can use up to three internet sources in your references; however, you cannot use Wikipedia as a reference. It does not matter what referencing style you use, but please be consistent and accurate.</li>\n</ol>\n<p>Make sure you cite references, and list them at the end of report. Failure to acknowledge the work of other people constitutes plagiarism. If you are in doubt as to what constitutes plagiarism, please consult with the Course Coordinator.</p>\n<p>This is an individual task.</p>\n<p><strong>TASK 2: Practical Calculations in Soil Science</strong></p>\n<p>The aim of this quiz is to test your ability to perform calculations are relevant for practical activities in soil science. For example, some of the calculations relate to establishing a nutrient trial to test the fertility of soils. These calculations are very similar to those undertaken by the Internal students in the prac classes.</p>\n<ul>\n<li>A total of 10 questions (1 mark each) will be provided on the course Blackboard site.</li>\n<li>You have 180 min to complete the 10 questions. Hence, the aim is not to apply a time-pressure for the quiz, but for you to engage with learning resources and understand the calculations. </li>\n<li>After 180 min, the quiz will auto-submit if you have not already submitted it.</li>\n<li>You are permitted to make <strong>ONE</strong> attempt.</li>\n<li>To prepare for the online quiz, study the LAND3005 prac manual (available on Blackboard in the Learning Resources folder). All calculations for the quiz are based upon material in the LAND3005 prac manual</li>\n<li>You must complete the online quiz by the due date or late penalties apply</li>\n<li>It is an Open Book quiz - you can examine other materials (such as the LAND3005 prac manual) during the quiz</li>\n<li>For each answer, the computer allows an uncertainty of approximately 10%. For example, if the answer to a calculation is '5.6' and you answer '5.5', then this is within the allowable limits, and you would receive the full marks for that question.</li>\n</ul>\n<p>This is an example of a type of question you may be asked:</p>\n<p><em>You collect a soil from the field that is at field capacity (i.e. 24 h drainage after being saturated). After collecting the soil, you weigh it and find that you have collected 620g of soil at field capacity. You then dry the soil in an oven at 105 degrees Celsius, and find that the soil now weighs 480g. What is the water content of the soil at field capacity? Give your answer as a percentage (%). For example, if your calculated answer is \"50%\", type \"50\".</em></p>\n<p><strong>TASK 3: 'Assessment of Fertility of Soil' report</strong></p>\n<p>Understanding how to identify soil fertility problems and generate valid recommendations is one of the primary outcomes of this course. Data from several practical exercises undertaken by the Internal students (phosphorus adsorption, nutrient omission, and rate experiments) will be provided in Blackboard. In this assignment, your task is generating a written report addressing the following points:</p>\n<ul>\n<li>Identify (and rank) the nutrient deficiencies for the given soil (<strong>Red Ferrosol</strong>) based upon plant performance.</li>\n<li>Relate these deficiencies to the soil chemical analyses provided (and use <em>Soil analysis: An interpretation Manual</em> to interpret these data).</li>\n<li>Give special consideration to the behaviour of P, which is deficient in this soil, by examining (i) the P adsorption isotherm data, which compares the Ferrosol to a range of other soils (the data for the other soils are simply provided to give you a comparison), and (ii) the data from the P rate trial, in which the Ferrosol is compared to a sand for reference.</li>\n<li>Discuss the behaviour of P in this soil relative to soil properties</li>\n<li>What is the optimum rate of fertiliser for the Red Ferrosol?</li>\n<li>Why do the fertilisers differ in their behaviour?</li>\n</ul>\n<p>When you open the files, you will see that there is data from multiple soil types. For this task, you should only focus on the Red <strong>Ferrosol</strong> – the other soils are provided for reference / interest only.</p>\n<p>Your report should follow the basic outline:</p>\n<ul>\n<li>Title page (report name, your name, student number, and word count excluding references)</li>\n<li>Introduction (optional, and is not included in word count)</li>\n<li>Results and discussion. Analyse and interpret your data, giving consideration to the points listed above.</li>\n<li>Conclusions</li>\n<li>References. Do not cite your Course notes (for example, LAND2003 or LAND3005). Rather, only cite articles and books from the scientific literature.</li>\n</ul>\n<p>Word limit:<strong> 2000 words </strong>(±10%). Note: The word limit applies to the Results and discussion, and Conclusion only.</p>\n<ul>\n<li><strong>The introduction, figures, tables, and references are excluded from the word count.</strong></li>\n</ul>\n<p>These sequential assessment tasks evaluate students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your Assessment task, in Blackboard, via the Turnitin link by the submission deadline. You should also retain an electronic copy of every piece of assessment you submit.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Review of selected topic",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p> 9/05/2025 2:00 pm</p>\n<p>\n</p><p>Due date is AEST (Brisbane) time.</p></dd>",
            "learning_objectives": "L04, L06",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You are required to review the literature and critically summarise information on one of the two topics listed below. Once you have made your selection, you are then required to prepare an analysis of that topic.</p>\n<p>Choose <strong>ONE </strong>of the following two topics:</p>\n<ol>\n<li>Nitrogen cycling and fertilisation in soil systems. Give consideration to:</li>\n<li>The adverse impacts of agricultural production on soil N concentrations? AND</li>\n<li>The benefits of N fertilisation (consider not only the direct benefits in terms of increased agricultural production, but more broadly, consider the importance of N fertilisers in feeding the global human population). AND</li>\n<li>The adverse outcomes of N fertilisation on the environment, and how these adverse impacts could be minimised.</li>\n</ol>\n<p><strong>OR</strong></p>\n<ol>\n<li>Biofuel production from soil. There is increasing pressure on soils, not only because we need to produce more food for a growing human population, but also because of competing uses of soils, such as for the production of biofuels.</li>\n<li>How the magnitude (volume) of biofuel production has changed over time and how this has provided competition with the use ofsoils to produce food, AND</li>\n<li>How ‘environmentally friendly’ biofuels are (i.e. their relative climate warming) when taking into account a full ‘lifecycle analysis’ of biofuel production. Give a special focus to soil-related factors, such as production and use of N fertilisers and subsequent emissions of greenhouse gases from soils. Discuss how these factors offset the desired ‘cooling’ by saving fossil fuel usage.</li>\n</ol>\n<p>Begin by reading all relevant material thoroughly. As you read, make notes of the important ideas and concepts. When writing the analysis, consider the following suggested structure:</p>\n<ol>\n<li>Introduction. Describe the overall topic, and summarise your main points that you will then expand in later sections.</li>\n<li>Main text (this could be split into different sections). Describe in detail your main information by assessing, reviewing, and summarising the relevant information. Support your evaluation with detailed evidence from the literature. Do not forget to include appropriate references.</li>\n<li>Summary. Finish with a summary and an evaluation of your main conclusions.</li>\n<li>References. Do not cite your Course notes (for example, LAND2003 or LAND3005). Rather, you must only cite articles and books from the scientific literature.</li>\n</ol>\n<p>Length: 2000 words +/- 10% (excluding references and any appendices)</p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>All reports must be submitted through turnitin via BlackBoard. Files must be uploaded as PDF or DOC - other files cannot be opened and will not be marked.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Final Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>7/06/2025 - 21/06/2025</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The final examination will be marked solely on the basis that the answers demonstrate an understanding of the subject matter. The examination delivers a single mark that is used in the calculation of your final grade.</p>\n<p>The exam will be an on-campus exam. Have your UQ student ID card available for all your exams.</p>\n<p>Students enrolled in External delivery must attend the exam in-person at an approved off-campus venue.</p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 2",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 1: Introduction and Soil Constituents</strong><br/><p>Introduction: soil as a valued resource<br/>Mineralogy<br/>Development of surface charge</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L06</p></div></td>",
            "topic_title": "<strong>Module 1: Introduction and Soil Constituents</strong>",
            "topic_description": "Module 1: Introduction and Soil Constituents Introduction: soil as a valued resource Mineralogy Development of surface charge",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 4",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 2: Soil Processes Controlling Nutrients</strong><br><p>Surface charge<br/>Organic matter in soils<br/>Solubility: theory overview<br/>Adsorption<br/>Soil pH: master variable</p></br></p><p><strong>Learning outcomes:</strong> L01, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Module 2: Soil Processes Controlling Nutrients</strong>",
            "topic_description": "Module 2: Soil Processes Controlling Nutrients Surface charge Organic matter in soils Solubility: theory overview Adsorption Soil pH: master variable",
            "learning_outcomes": [
                "L01",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 5 To Week 7",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 3: Plant Nutrients</strong><br><p>Nitrogen dynamics in soil and environmental importance<br/>Phosphorus supply and adsorption problem<br/>Sulfur<br/>Potassium, calcium, magnesium<br/>Micronutrients<br/>Fertility evaluation</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L06</p></div></td>",
            "topic_title": "<strong>Module 3: Plant Nutrients</strong>",
            "topic_description": "Module 3: Plant Nutrients Nitrogen dynamics in soil and environmental importance Phosphorus supply and adsorption problem Sulfur Potassium, calcium, magnesium Micronutrients Fertility evaluation",
            "learning_outcomes": [
                "L01",
                "L02",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 8 To Week 9",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 5: Environmental Soil Science</strong><br><p>Soil Acidity<br/>Soil Salinity/Sodicity - extent, cause, management options<br/>Soil Salinity/Sodicity - impact on plants<br/>Organic agriculture</p></br></p><p><strong>Learning outcomes:</strong> L01, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Module 5: Environmental Soil Science</strong>",
            "topic_description": "Module 5: Environmental Soil Science Soil Acidity Soil Salinity/Sodicity - extent, cause, management options Soil Salinity/Sodicity - impact on plants Organic agriculture",
            "learning_outcomes": [
                "L01",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 11 To Week 12",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 4: Soil Physics and plant growth</strong><br><p>Soil texture<br/>Soil structure<br/>Soil water content and soil water potential<br/>Soil water dynamics and plant water demand<br/>Soil and the hydrologic cycle<br/>Soil management</p></br></p><p><strong>Learning outcomes:</strong> L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Module 4: Soil Physics and plant growth</strong>",
            "topic_description": "Module 4: Soil Physics and plant growth Soil texture Soil structure Soil water content and soil water potential Soil water dynamics and plant water demand Soil and the hydrologic cycle Soil management",
            "learning_outcomes": [
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        }
    ]
}