{
    "course_title": "Law of the World Trade Organization",
    "study_period": "Sem 1 2025",
    "location": "External",
    "attendance": "Online",
    "url": "https://course-profiles.uq.edu.au/course-profiles/LAWS7853-20147-7520",
    "full_course_code": "LAWS7853-20147-7520",
    "course_code": "LAWS7853",
    "class_code": "20147",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Thoroughly understand, explain, and critically discuss the structure and key principles of the major WTO Agreements."
        },
        {
            "number": "LO2.",
            "description": "Independently and efficiently conduct research into the law of the World Trade Organization,including finding primary documents through the WTO Documents Online database."
        },
        {
            "number": "LO3.",
            "description": "Thoroughly understand and critically discuss and debate the issues that affect different groups within the WTO, including developing countries and the student's own country."
        },
        {
            "number": "LO4.",
            "description": "Critically analyse relevant jurisprudence and demonstrate a critical appreciation of contemporary theoretical debates relating to the WTO Agreements."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Analytical exercise and Short Essay",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 7/05/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>For this task, students will receive one or more written scenarios which describe a particular government legislative measure and its alleged effects on the trade interests of another Member or Members. Students are required to answer one or more questions set forth at the end of each scenario. In general terms, these questions will require the student to analyse the consistency or otherwise of the measure with the Member’s obligations under the WTO Agreements (approx. 2500 words)</p>\n<p><br/></p>\n<p>Answers should be typed in double spacing on A4 paper. In cases where the Course Coordinator considers that a student may derive an unfair advantage over other students by exceeding the word limit the Course Coordinator will not assess material in excess of the prescribed limit.</p>\n<p><br/></p>\n<p>The purpose of the exercise is to test the ability of students to analyse complex factual situations, identify and explain how various WTO obligations may be implicated and provide an assessment of the relative merits of the possible arguments that could be made in support of the position of one or more of the parties in the problem.</p>\n<p><br/></p>\n<p>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments must be submitted electronically via the submission link on the course Blackboard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "End-of-semester Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>7/06/2025 - 21/06/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The second task will involve an exam, delivered online, comprising multiple choice-style questions that test knowledge of issues relating to WTO law and jurisprudence that have been addressed in the course, with a particular focus on the content covered in Days 3 and 4. Further details on this task will be made available to students during the course.</p>\n<p>This assessment task is to be completed online. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of Generative AI or MT may constitute student misconduct under the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=145\">Student Code of Conduct Policy</a>.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 7",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Day 1</strong><br><p>Introduction to the course. <br/>Introduction to international trade law, the history and institutions of the multilateral trading system and current issues at the WTO. Overview of the structure of the WTO and the WTO Agreements.<br/><br/>Dispute Settlement<br/>Examination of the Understanding on Rules and Procedures Governing the Settlement of Disputes (DSU) and the processes by which trade disputes are managed and resolved in the WTO.<br/><br/>Border Measures<br/>Tariffs and quantitative restrictions: Introduction to tariffs, tariff negotiations and tariff bindings. Examination of the background to the general ban on quantitative restrictions.<br/><br/>\n</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Day 1</strong>",
            "topic_description": "Day 1 Introduction to the course. Introduction to international trade law, the history and institutions of the multilateral trading system and current issues at the WTO. Overview of the structure of the WTO and the WTO Agreements. Dispute Settlement Examination of the Understanding on Rules and Procedures Governing the Settlement of Disputes (DSU) and the processes by which trade disputes are managed and resolved in the WTO. Border Measures Tariffs and quantitative restrictions: Introduction to tariffs, tariff negotiations and tariff bindings. Examination of the background to the general ban on quantitative restrictions.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Day 2</strong><br><p>Non-Discrimination ﾖ MFN<br/>Introduction to the MFN obligation and relevant case law pertaining to Article I of the GATT.<br/><br/>Non-Discrimination ﾖ National Treatment<br/>Examination of the concept of discrimination in the WTO context, de jure versus de facto discrimination, purpose versus effects, introduction to the national treatment obligation and the relevant case law pertaining to Article III of the GATT.<br/><br/>GATT Exceptions<br/>General exceptions under Art. XX: Examination of the circumstances in which Members are permitted to act inconsistently with GATT obligations in order to pursue other policy objectives; e.g. protection of health or the environment. <br/>Introduction to key legal research tools in WTO law<br/>\n</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Day 2</strong>",
            "topic_description": "Day 2 Non-Discrimination ﾖ MFN Introduction to the MFN obligation and relevant case law pertaining to Article I of the GATT. Non-Discrimination ﾖ National Treatment Examination of the concept of discrimination in the WTO context, de jure versus de facto discrimination, purpose versus effects, introduction to the national treatment obligation and the relevant case law pertaining to Article III of the GATT. GATT Exceptions General exceptions under Art. XX: Examination of the circumstances in which Members are permitted to act inconsistently with GATT obligations in order to pursue other policy objectives; e.g. protection of health or the environment. Introduction to key legal research tools in WTO law",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Day 3</strong><br><p>Other Exceptions<br/>The National Security provision in Art. XXI: Examination of key cases on national security matters and the role of geopolitical tensions in the WTO.<br/><br/>Preferential Trade Agreements<br/>The scope of Article XXIV which permits preferential trade agreements in deviation (mainly) from the MFN principle. Bilateral, regional and preferential trade agreements have proliferated in the WTO era. Are these consistent with the principles and objectives of the GATT and the WTO? Article XXIV provides the underpinning disciplines for these agreements.<br/><br/>Trade Remedies (subsidies, countervailing duties, anti-dumping duties and safeguards): Discussion of disciplines that regulate the ability of Members to take unilateral action to counteract subsidization of industry (pursuant to the SCM Agreement), injury to domestic industry caused by dumping of imports (pursuant to the Anti-Dumping Agreement), or unexpected surges in imports (pursuant to the Agreement on Safeguards)<br/><br/>TBT Agreement.<br/>Examination of the Agreement on Technical Barriers to Trade (TBT Agreement), relevant cases.<br/><br/>SPS Agreement. Examination of the key provisions of the Agreement on the Application of Sanitary and Phytosanitary Measures (SPS Agreement), their elaboration through the relevant case law, and how these agreements fit within the overall objectives of the WTO system.<br/><br/>Trade in Services.<br/>Discussion of the concept of a service, the scope of the General Agreement on Trade in Services (GATS), general obligations in the GATS and key rules regarding commitments made in GATS schedules.<br/><br/>TRIPS Agreement. General overview of the TRIPS Agreement.<br/>\n</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Day 3</strong>",
            "topic_description": "Day 3 Other Exceptions The National Security provision in Art. XXI: Examination of key cases on national security matters and the role of geopolitical tensions in the WTO. Preferential Trade Agreements The scope of Article XXIV which permits preferential trade agreements in deviation (mainly) from the MFN principle. Bilateral, regional and preferential trade agreements have proliferated in the WTO era. Are these consistent with the principles and objectives of the GATT and the WTO? Article XXIV provides the underpinning disciplines for these agreements. Trade Remedies (subsidies, countervailing duties, anti-dumping duties and safeguards): Discussion of disciplines that regulate the ability of Members to take unilateral action to counteract subsidization of industry (pursuant to the SCM Agreement), injury to domestic industry caused by dumping of imports (pursuant to the Anti-Dumping Agreement), or unexpected surges in imports (pursuant to the Agreement on Safeguards) TBT Agreement. Examination of the Agreement on Technical Barriers to Trade (TBT Agreement), relevant cases. SPS Agreement. Examination of the key provisions of the Agreement on the Application of Sanitary and Phytosanitary Measures (SPS Agreement), their elaboration through the relevant case law, and how these agreements fit within the overall objectives of the WTO system. Trade in Services. Discussion of the concept of a service, the scope of the General Agreement on Trade in Services (GATS), general obligations in the GATS and key rules regarding commitments made in GATS schedules. TRIPS Agreement. General overview of the TRIPS Agreement.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Day 4</strong><br><p>Continuation from Day 3 (SPS, TBT, TRIPS, and Services)<br/><br/>Other topics in WTO law with contemporary significance: e.g. climate change; digital trade and data-flows; supply-chain resilience.</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Day 4</strong>",
            "topic_description": "Day 4 Continuation from Day 3 (SPS, TBT, TRIPS, and Services) Other topics in WTO law with contemporary significance: e.g. climate change; digital trade and data-flows; supply-chain resilience.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        }
    ]
}