{
    "course_title": "Law of Armed Conflict",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/LAWS7711-20136-7520",
    "full_course_code": "LAWS7711-20136-7520",
    "course_code": "LAWS7711",
    "class_code": "20136",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Articulate and critique the rationale and general characteristics of the law of armed conflict as a legal regime, and compare and contrast this legal regime to other international law regimes (such as international human rights law)."
        },
        {
            "number": "LO2.",
            "description": "Critically evaluate past and present developments in the law of armed conflict, and identify and analyse the social, moral, political and cultural factors that facilitate or hinder such developments."
        },
        {
            "number": "LO3.",
            "description": "Identify, interpret and apply the appropriate rules and principles of the law of armed conflict to different conflict scenarios."
        },
        {
            "number": "LO4.",
            "description": "Identify the actors involved in the development, interpretation and implementation of the law of armed conflict, and describe and evaluate the processes through which they do so."
        },
        {
            "number": "LO5.",
            "description": "Assess the effectiveness of the law of armed conflict in achieving its aims, and identify and analyse the social, strategic, technological and other factors that facilitate or hinder compliance with the law of armed conflict."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Case Note",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 28/04/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You will be required to write a case note, which summarises and analyses a decision of a court relating to the law of armed conflict. The course coordinator will provide a list of cases to choose from via the course Blackboard site. You can also write the case note on a case that is not on the list, but you need to discuss that with the course coordinator in advance.</p>\n<p>The <strong>maximum length of the case note is 2,000 words. </strong>Footnotes are not included in the word count provided that they only contain references. The word count must appear on the first page of the paper. Words in excess of the word limit will not be read, and will not be counted towards the answer.</p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=145\">Student Code of Conduct Policy</a>.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments must be submitted electronically via the submission link on the course Blackboard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Take Home Assessment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>60%</dd>",
            "due_date": "<dd><p> 10/06/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>For this assessment, you will be given three or more questions via the course Blackboard site on the specified date. The questions may be problem scenarios or essay-style prompts. The questions may be drawn from any part of the course.</p>\n<p>You can freely choose <strong>two questions</strong> to answer and you will have <strong>1 week </strong>to complete the assessment. The responses to the two questions will be weighted equally.</p>\n<p>The <strong>maximum length of the assessment (responses to the two questions combined) is 4,000 words</strong>. Footnotes are not included in the word count provided that they only contain references. The word count must appear on the first page of the paper. Words in excess of the word limit will not be read, and will not be counted towards the answer.</p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=145\">Student Code of Conduct Policy</a>.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments must be submitted electronically via the submission link on the course Blackboard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 3 To Week 10(10 Mar - 11 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Seminars</strong><br><p>The seminars will be held on 11 March, 25 March, 15 April and 6 May.</p>\n<p>Seminar topics are:</p>\n<p><strong>1. Introduction, Sources and Subjects</strong></p>\n<p>Does it make sense to regulate warfare? Where does one find rules and principles of the law of armed conflict? How have States consciously developed the law? What has been the impact of other entities on the evolution of the law? Are customary law and general principles of law still relevant?</p>\n<p><strong>2. Scope of Application</strong></p>\n<p>When, where and to whom does the law of armed conflict apply? How and why does the law distinguish between different types of conflict? Was there really a 'global war on terror'?</p>\n<p><strong>3. Targeting</strong></p>\n<p>What categories of persons does the law recognise? What are the consequences of belonging to a particular category? Is there such a thing as an 'unlawful combatant'? Are ISIS fighters terrorists? Are private military contractors mercenaries? Who and what may be the object of an attack? What is collateral damage? How much collateral damage is permissible? Who decides? What precautionary measures must be taken when launching an attack?</p>\n<p><strong>4. Means and Methods of Warfare</strong></p>\n<p>Can belligerents choose whatever weapons, means and methods they like? What restrictions does the law place on the use of specific weapons? Is cyber warfare really warfare? Are drones and autonomous weapons unlawful?</p>\n<p><strong>5. Wounded and Sick, and Civilians</strong></p>\n<p>How must the wounded, sick and shipwrecked be treated? How must medical personnel and facilities be treated? When do the wounded and sick and medical personnel lose their protection? Other than being protected against direct attack, how does the law look after civilians? What is occupation? How must an occupant treat the inhabitants of an occupied territory?</p>\n<p><strong>6. Detention</strong></p>\n<p>Who can be detained in an armed conflict? What is the process for detention? How can the decision to detain be challenged? How must detainees be treated? When and how must detainees be released?</p>\n<p><strong>7. Implementation and Compliance</strong></p>\n<p>What happens on the international level to ensure compliance with the law of armed conflict? Have these measures been effective? What more could be done?</p>\n<p><strong>8. Individual and Superior Responsibility</strong></p>\n<p>When can individuals be held accountable for breaches of the law of armed conflict? Is every breach of the law a war crime? Are superiors responsibly for every act of their subordinates? In what courts can war criminals be tried?</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Seminars</strong>",
            "topic_description": "Seminars The seminars will be held on 11 March, 25 March, 15 April and 6 May. Seminar topics are: 1. Introduction, Sources and Subjects Does it make sense to regulate warfare? Where does one find rules and principles of the law of armed conflict? How have States consciously developed the law? What has been the impact of other entities on the evolution of the law? Are customary law and general principles of law still relevant? 2. Scope of Application When, where and to whom does the law of armed conflict apply? How and why does the law distinguish between different types of conflict? Was there really a 'global war on terror'? 3. Targeting What categories of persons does the law recognise? What are the consequences of belonging to a particular category? Is there such a thing as an 'unlawful combatant'? Are ISIS fighters terrorists? Are private military contractors mercenaries? Who and what may be the object of an attack? What is collateral damage? How much collateral damage is permissible? Who decides? What precautionary measures must be taken when launching an attack? 4. Means and Methods of Warfare Can belligerents choose whatever weapons, means and methods they like? What restrictions does the law place on the use of specific weapons? Is cyber warfare really warfare? Are drones and autonomous weapons unlawful? 5. Wounded and Sick, and Civilians How must the wounded, sick and shipwrecked be treated? How must medical personnel and facilities be treated? When do the wounded and sick and medical personnel lose their protection? Other than being protected against direct attack, how does the law look after civilians? What is occupation? How must an occupant treat the inhabitants of an occupied territory? 6. Detention Who can be detained in an armed conflict? What is the process for detention? How can the decision to detain be challenged? How must detainees be treated? When and how must detainees be released? 7. Implementation and Compliance What happens on the international level to ensure compliance with the law of armed conflict? Have these measures been effective? What more could be done? 8. Individual and Superior Responsibility When can individuals be held accountable for breaches of the law of armed conflict? Is every breach of the law a war crime? Are superiors responsibly for every act of their subordinates? In what courts can war criminals be tried?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}