{
    "course_title": "Jessup International Law Moot",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/LAWS5165-20123-7520",
    "full_course_code": "LAWS5165-20123-7520",
    "course_code": "LAWS5165",
    "class_code": "20123",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Formulate and present coherent and correct legal arguments suitable for a mooting or similar environment;"
        },
        {
            "number": "LO2.",
            "description": "Present oral presentations of legal arguments coherently and persuasively in a mooting or similar context; and"
        },
        {
            "number": "LO3.",
            "description": "Draft, explain and defend extensive written memorials in support of arguments advanced through oral advocacy."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Oral Advocacy Participation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 24/02/2025 - 30/05/2025</p>\n<p>\n</p><p>See task description.</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Oral",
            "category": "Participation/ Student contribution",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will be assessed on their participation and performance in the mooting competition associated with the course. The oral advocacy components of the competition include two main elements: 1. Participation in <strong>practice moots</strong> in preparation for the formal competition (potentially prior to both the national and international rounds of the competition); 2 Participation in <strong>formal competition moots</strong> (potentially in both the national and international rounds of the competition).</p>\n<p>All members of the team will be required to undertake multiple <strong>practice moots</strong>. Ordinarily team members will appear in 25 practice moots prior to the national rounds. With a 5 person team, this will mean that not all 5 members will be able to make oral submissions in all 25 practice moots. Each student member in a 5 person team will normally appear in at least 15 of these practice moots. In each of the practice moots, students will be required to answer questions asked by the practice moot judges (normally sitting in panels of 3 judges). Practice moot judges are drawn from an experienced group of lawyers, including retired and current members of the judiciary, practising barristers and solicitors, and academics. The 5th student not appearing in a particular moot is required to attend that moot to transcribe questions asked by judges and to work on improving answers given to any questions asked by judges in the moot. Judges will provide individualised feedback to each student appearing in the practice moot and will rank the students in the moot on the practice moot ranking sheet (see below). Each practice moot will normally be recorded (the video recording will normally be placed on the Blackboard site for the course) and the team coach/es will also provide individualised feedback to students appearing in each moot (including by use of the video recording of the moot).</p>\n<p>If the team qualifies for the international rounds of the competition, the team will normally hold an additional 15 practice moots before similarly qualified judges and involving the same forms of questions and feedback, in preparation for the international rounds of the competition.</p>\n<p>Participation in <strong>formal competition moots</strong> will involve, at minimum, 4 moots at the national rounds of the competition, and at maximum, depending on the success of the team, 7 moots in the national rounds, and an additional number of moots in the international rounds (ranging from 4 moots to 9 moots). Students appearing in the formal competition moots will be selected by the coach/es based on the rankings and scores of the practice moot judges. Formal competition moots will be judged by panels of 3 judges (drawn from lawyers from around the world with expertise in international law) and scored on score sheets provided by the organisers of the competition (see below). Judges in formal competition moots will ask questions during moots and will also provide oral and written feedback after moots on the advocacy of students appearing before them.</p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use Artificial Intelligence (AI) and/or Machine Translation (MT) technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=145\">Student Code of Conduct Policy</a>.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": null,
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Written Memorials",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 24/02/2025 - 30/05/2025</p>\n<p>\n</p><p>See task description.</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will be assessed on the overall quality and effectiveness of the written memorials drafted in accordance with the rules of the competition, taking into account their individual contributions to the drafting process. The formal pleading sections of the applicant and respondent memorials are each 9,500 words in length. Students will rotate weekly through each of the 4 issues raised by the moot topic and will normally be required to produce a weekly draft applicant and respondent memorial over the period from release of the topic in September of the year before, up to the commencement of the final memorial drafting process around mid-December. The formal memorial drafting process requires the attendance of all students as it is a form of group drafting. Moots will also be organised before the coach/es to test the logic and strength of the legal arguments proposed for the written memorials. Draft memorials will be constantly assessed by the coach/es who will provide general feedback on the strength of legal arguments, grasp of relevant facts, the quality of primary and secondary sources that students propose to rely upon, and the logic and coherence of the proposed written submissions. Good written submissions can normally be defended both by reference to <strong>judicial precedents</strong> and on a <strong>principled basis</strong>. Principled justifications for submissions are especially important as moot judges sit as the International Court of Justice which (like the High Court of Australia) is not bound by its prior decisions (although these are considered highly persuasive). A team's applicant and respondent memorials will be scored by 6 Australian judges (drawn from lawyers from around Australia) and then by another 6 judges (at minimum) internationally, if the team progresses to the international rounds of the competition. Memorial judges will score memorials and provide feedback on memorial score sheets (see below). Oral round moot judges in the formal competition can also take memorials into account in assessing oral rounds and the results of formal moots are also determined by reference to formal memorial scores. </p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use Artificial Intelligence (AI) and/or Machine Translation (MT) technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=145\">Student Code of Conduct Policy</a>.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": null,
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Moot</strong><br><p>Students undertake independent research in preparation for the moot competition under the supervision of the team coach and faculty advisor.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Moot</strong>",
            "topic_description": "Moot Students undertake independent research in preparation for the moot competition under the supervision of the team coach and faculty advisor.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        }
    ]
}