{
    "course_title": "Current Issues in Public Law",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/LAWS7722-20140-7520",
    "full_course_code": "LAWS7722-20140-7520",
    "course_code": "LAWS7722",
    "class_code": "20140",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand the common features of human rights legislation in Australia, particularly the sources of the protected rights in the International Bill of Rights, the dialogue model and the culture of justification."
        },
        {
            "number": "LO2.",
            "description": "Identify when a human right is limited, by reference to domestic and internal materials on the scope and underlying values of the right."
        },
        {
            "number": "LO3.",
            "description": "Apply a structured proportionality test for justifying limits on human rights in accordance with s 13 of the Human Rights Act 2019 (Qld) and the equivalent general limitations clauses in the Australian Capital Territory and Victoria."
        },
        {
            "number": "LO4.",
            "description": "Understand the mechanisms for front-end scrutiny of proposed legislation and subordinate legislation, including statements of compatibility and override declarations."
        },
        {
            "number": "LO5.",
            "description": "Apply the interpretative clause to interpret legislation, so far as possible, in a way that is compatible with human rights, and if a human rights-compatible interpretation is not possible, understand when it would be appropriate for the Supreme Court to make a declaration of incompatibility."
        },
        {
            "number": "LO6.",
            "description": "Understand the substantive and procedural limbs of the human rights obligations imposed on public entities or public authorities, and understand how to challenge a breach of those obligations in court or tribunal proceedings using the “piggy back” clause."
        },
        {
            "number": "LO7.",
            "description": "Appreciate the scope of the rights to equality and privacy in detail, including the internal limitations of special measures and arbitrariness."
        },
        {
            "number": "LO8.",
            "description": "Identify the human rights that are most relevant to vulnerable cohorts such as prisoners, people navigating the mental health system, social housing tenants, criminal defendants, and First Nations peoples."
        },
        {
            "number": "LO9.",
            "description": "Understand the unique aspects of socio-economic rights such as the rights to health and education, including the duty of progressive realisation."
        },
        {
            "number": "LO10.",
            "description": "Be aware of emerging human rights issues related to advancements in technology and the impacts of climate change."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Essay/ Critique, Tutorial/ Problem Set",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 7/04/2025 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The assessment task is to prepare written submissions for court or tribunal proceedings, raising a human rights argument, in the scenario provided to students in the first seminar. The submissions will not need to address any non-human rights ground.</p>\n<p>Word limit: 3,000 words excluding footnotes and court header.</p>\n<p><br/></p>\n<p>This assessment task is to be completed in-person. The use of Artificial Intelligence (AI) tools will not be permitted. Any attempted use of AI may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments must be submitted electronically via the submission link on the course Blackboard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Research Essay",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>60%</dd>",
            "due_date": "<dd><p> 9/06/2025 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Your task is to write a 5,000 word academic research essay on a current issue in human rights. You may choose one of the four topics suggested below or you can choose your own topic. If you choose your own topic, you have to send a 200 word essay plan to the course co-ordinator and get approval before you can start on your topic.</p>\n<p>The paper must be based on current and relevant literature, include a clear hypothesis or research problem and present a balanced argument. This means you are required to read and reference literature which supports and literature which criticises your hypothesis. You are also required to reference any thought which is not your own or is considered general knowledge. Research essays should be structured with an introduction, body and conclusion.</p>\n<p>Research essay topics:</p>\n<ol>\n<li>Consistent decision-making promotes the right to equality before the law. But automated decision-making also has the potential to create harsh outcomes. Can automated decision-making using artificial intelligence be substantively compatible with human rights, and if so, in what circumstances? Would implementing such an approach comply with the procedural limb?</li>\n<li>Victims of crime have human rights, by virtue of being human, including the rights to life, property and security of the person. Is there a case for including more specific victims’ rights in Australia’s human rights legislation? Would including such rights fit the philosophy and structure of the legislation? What would be the benefits and downsides?</li>\n<li>In significant human rights cases on the impacts of climate change, courts have used the concept of a carbon budget to determine whether a measure or failure to adopt a measure has such a large impact on the remaining carbon budget that it amounts to a breach of human rights. Can human rights still offer a useful frame of reference if the carbon budget is exhausted? How should impacts on human rights be assessed in a post-carbon budget world?</li>\n<li>Have the Human Rights Acts been effective in creating a culture of engaging with human rights questions, or does Australian exceptionalism persist? What are the reasons why the Human Rights Acts have or have not been effective in creating a human rights culture in governments, parliaments and the legal profession in Australia compared to most other Westminster systems?</li>\n<li>Choose your own topic (you have to get approval from the course co-ordinator).</li>\n</ol>\n<p><br/></p>\n<p>This assessment task is to be completed in-person. The use of Artificial Intelligence (AI) tools will not be permitted. Any attempted use of AI may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments must be submitted electronically via the submission link on the course Blackboard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 13(03 Mar - 01 Jun)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Seminars</strong><br><p>The seminar topics are:</p>\n<p>1.   Introduction: what are human rights, the dialogue model and the culture of justification</p>\n<p>2.   Proportionality</p>\n<p>3.   The role of the legislature</p>\n<p>4.   The role of courts</p>\n<p>5.   The role of the executive (or more broadly, public entities)</p>\n<p>6.   The many dimensions of the rights to equality and privacy</p>\n<p>7.   Prisoners’ rights</p>\n<p>8.   Mental health and social housing</p>\n<p>9.   Political rights</p>\n<p>10. Rights of criminal defendants</p>\n<p>11. Socio-economic rights</p>\n<p>12. First Nations rights and rights related to climate change</p></br></p></div></td>",
            "topic_title": "<strong>Seminars</strong>",
            "topic_description": "Seminars The seminar topics are: 1.   Introduction: what are human rights, the dialogue model and the culture of justification 2.   Proportionality 3.   The role of the legislature 4.   The role of courts 5.   The role of the executive (or more broadly, public entities) 6.   The many dimensions of the rights to equality and privacy 7.   Prisoners’ rights 8.   Mental health and social housing 9.   Political rights 10. Rights of criminal defendants 11. Socio-economic rights 12. First Nations rights and rights related to climate change",
            "learning_outcomes": []
        }
    ]
}