{
    "course_title": "Constitutional Law",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/LAWS3700-20236-7520",
    "full_course_code": "LAWS3700-20236-7520",
    "course_code": "LAWS3700",
    "class_code": "20236",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate an understanding of the ways in which federalism is embodied in the Australian federal Constitution."
        },
        {
            "number": "LO2.",
            "description": "Understand the basic principles of constitutional interpretation through discussion of specific legislative powers."
        },
        {
            "number": "LO3.",
            "description": "Understand, accurately state, and effectively apply the law in relation to Commonwealth-state relations."
        },
        {
            "number": "LO4.",
            "description": "Understand the scope and application of the rights and liberties expressly or impliedly secured by the Constitution."
        },
        {
            "number": "LO5.",
            "description": "Understand the ways in which constitutional change is effected under the federal and state constitutions."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "In-Semester On-line Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 15/04/2025 6:00 pm</p>\n<p>\n</p><p>The exam must be submitted by 7:50pm.</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Date and Time of Exam</strong>: Tuesday 15 April 2024, 6.00pm to 7.50pm. This will allow 10 mins planning time, 85 mins writing time and 15 mins for students to upload their answers. </p>\n<p><strong>Access</strong>: The exam will be made available on the Learn.UQ site for the course on Tuesday 15 April 2024 at 6.00pm.</p>\n<p><strong>Weight</strong>: 40% of the total grade for the course.</p>\n<p><strong>Task Description</strong>: The exam will consist of one or more problem-style questions. Any written or printed material is permitted in the exam; it may also be annotated.</p>\n<p><strong>Assessment Objective</strong>: The objective of the exam is to assess the ability of students to (a) identify the relevant legal issue or issues raised by the question, (b) identify the cases, principles and rules relevant to addressing that issue or issues, and (c) provide an answer to the question by applying those cases, principles and rules to the issue or issues. </p>\n<p><strong>Maximum Length</strong>: 2000 words including references and notes. This word limit is imposed because the purpose of the exam is <strong>not </strong>for students to write an abstract summary of the law on the general topic of the examination question, but rather to identify the legal issue or issues and specifically to address that issue or issues. </p>\n<p>State at the beginning of your answer the<strong> particular question </strong>you have chosen to answer and the <strong>total word length</strong> of your answer. Also clearly state your <strong>name </strong>and your <strong>student number</strong>. </p>\n<p><strong>Penalty for excess length</strong>: loss of 2 marks (out of 40) for every 100 words (inclusive) over the word length. Eg, a total word length of 2090 words will result in 2 marks (out of 40) being deducted; a total word length of 2190 words will result in 4 marks (out of 40) being deducted. </p>\n<p><strong>Format</strong>: Abbreviated references to cases is permitted and sufficient (eg, 'Spence v Qld', or 'Tasmanian Dam Case, per Gibbs CJ'). Answers must be submitted as Microsoft Word documents, double-spaced, with 2 cm margins and justified on both right and left margins. Use an appropriate font style and size (ie, 12-point Times New Roman or 11-point Arial).</p>\n<p><strong>You must not discuss any of the questions or any of your answers with anyone else during the duration of the assessment</strong>. Any student found to have done so will be referred to the Academic Integrity Officer.</p>\n<p>Because the exam will be held during the ordinary lecture time, all students will be expected to undertake the exam at that time.</p>\n<p>This exam will evaluate student abilities, skills and knowledge without the aid of Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that <strong>the use of AI or MT technologies to develop or write responses is strictly prohibited</strong> and may constitute student misconduct under the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=145\">Student Code of Conduct Policy</a> .</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The online exam will be available via Learn.UQ. You will have 15 minutes to upload the exam after the exam finish time.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>Exams submitted after the end of the submission time will incur a <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/requesting-late-penalty-exemption-online-exam\">late penalty</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "End-of-semester Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>60%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>7/06/2025 - 21/06/2025</p></dd>",
            "learning_objectives": "L03, L04, L05",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This will be an examination based on the topics not covered by the in-semester exam. Any written or printed material is permitted in the exam; it may also be annotated. It will consist of five questions, of which students will be required to answer any three. Each question will be equally weighted.</p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of Generative AI or MT may constitute student misconduct under the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=145\">Student Code of Conduct Policy</a>.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lectures</strong><br><p><strong>Lecture 1. Constitutionalism: </strong></p>\n<p>This lecture will introduce the course, followed by a review of the key features of the Australian Constitution, including its underlying principles.</p>\n<p><strong>Lecture 2. Constitutional Interpretation:</strong></p>\n<p>This lecture will introduce the High Court's approach to interpretation of the Constitution and characterisation of Commonwealth laws. This will include consideration of the general methods the High Court uses to interpret the Constitution and the specific techniques it uses when interpreting Commonwealth legislative powers. The lecture will lay a foundation for our examination of the Commonwealth's legislative powers,</p>\n<p><strong>Lecture 3. Legislative Power: Corporations: </strong></p>\n<p>This lecture will begin our examination of the Commonwealth’s legislative powers, focusing on the corporations power (s 51(xx) of the Constitution).</p>\n<p><strong>Lecture 4. Legislative Power: External Affairs: </strong></p>\n<p>This lecture will continue our examination of the Commonwealth's legislative powers, focusing on the external affairs power (s 51(xxix).</p>\n<p><strong>Lecture 5. Acquisition and Just Terms: </strong></p>\n<p>This lecture will continue our examination of the Commonwealth's legislative powers, focusing on the Commonwealth's power to make laws with respect to the acquisition of property on just terms (s 51(xxxi)). </p>\n<p><strong>Lecture 6. Inconsistency between Commonwealth and State laws: </strong></p>\n<p>Section 109 of the Constitution provides for the resolution of inconsistencies between valid federal and state laws. This lecture will survey the High Court’s jurisprudence on s 109.</p>\n<p><strong>Lecture 7. Executive Power of the Commonwealth: </strong></p>\n<p>This lecture will consider the powers of the Commonwealth Executive, including the prerogatives and capacities of the Crown, the spending and appropriation powers, and the so-called 'implied nationhood power'.</p>\n<p><strong>Lecture 8. Intergovernmental Immunities: </strong></p>\n<p>This lecture will consider the High Court's jurisprudence on Commonwealth-state relations, examining the limits on legislative and executive interference between the two orders or levels of government.</p>\n<p><strong>Lecture 9. Freedom of Interstate Trade (s 92): </strong></p>\n<p>Section 92 of the Constitution requires that trade, commerce, and intercourse among the states shall be absolutely free. This lecture will survey the High Court’s jurisprudence on s 92.</p>\n<p><strong>Lecture 10. Freedom of Political Communication: </strong></p>\n<p>In addition to the rights and freedoms expressly guaranteed, the High Court has found a guarantee of freedom of political communication to be implied by the Constitution. This lecture will survey the High Court’s jurisprudence on the implied freedom.</p>\n<p><strong>Lecture 11. Freedom of Religion (s 116)</strong></p>\n<p>Section 116 of the Constitution prohibits the Commonwealth from making any law for establishing any religion, imposing any religious observance, or prohibiting the free exercise of any religion. It also provides that no religious test shall be required as a qualification for any office or public trust under the Commonwealth. This lecture will survey the High Court’s jurisprudence on s 116.</p>\n<p><strong>Lecture 12. Constitutional Amendment: </strong></p>\n<p>The Constitution establishes several methods of constitutional amendment that apply to different aspects or provisions of the Constitution: (a) Commonwealth enactment (s 51(xxxvi)); (b) State referral of powers (s 51(xxxvii)); (c) Commonwealth and State enactment (s 51(xxxviii)); (d) dual referendum (s 128); unanimous referendum (s 128, para 5). The State Constitutions can be amended by ordinary statute, except where special ‘manner and form’ requirements apply (Australia Acts 1986, s 6). This lecture will offer an account of these methods of constitutional amendment.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Lectures</strong>",
            "topic_description": "Lectures Lecture 1. Constitutionalism: This lecture will introduce the course, followed by a review of the key features of the Australian Constitution, including its underlying principles. Lecture 2. Constitutional Interpretation: This lecture will introduce the High Court's approach to interpretation of the Constitution and characterisation of Commonwealth laws. This will include consideration of the general methods the High Court uses to interpret the Constitution and the specific techniques it uses when interpreting Commonwealth legislative powers. The lecture will lay a foundation for our examination of the Commonwealth's legislative powers, Lecture 3. Legislative Power: Corporations: This lecture will begin our examination of the Commonwealth’s legislative powers, focusing on the corporations power (s 51(xx) of the Constitution). Lecture 4. Legislative Power: External Affairs: This lecture will continue our examination of the Commonwealth's legislative powers, focusing on the external affairs power (s 51(xxix). Lecture 5. Acquisition and Just Terms: This lecture will continue our examination of the Commonwealth's legislative powers, focusing on the Commonwealth's power to make laws with respect to the acquisition of property on just terms (s 51(xxxi)). Lecture 6. Inconsistency between Commonwealth and State laws: Section 109 of the Constitution provides for the resolution of inconsistencies between valid federal and state laws. This lecture will survey the High Court’s jurisprudence on s 109. Lecture 7. Executive Power of the Commonwealth: This lecture will consider the powers of the Commonwealth Executive, including the prerogatives and capacities of the Crown, the spending and appropriation powers, and the so-called 'implied nationhood power'. Lecture 8. Intergovernmental Immunities: This lecture will consider the High Court's jurisprudence on Commonwealth-state relations, examining the limits on legislative and executive interference between the two orders or levels of government. Lecture 9. Freedom of Interstate Trade (s 92): Section 92 of the Constitution requires that trade, commerce, and intercourse among the states shall be absolutely free. This lecture will survey the High Court’s jurisprudence on s 92. Lecture 10. Freedom of Political Communication: In addition to the rights and freedoms expressly guaranteed, the High Court has found a guarantee of freedom of political communication to be implied by the Constitution. This lecture will survey the High Court’s jurisprudence on the implied freedom. Lecture 11. Freedom of Religion (s 116) Section 116 of the Constitution prohibits the Commonwealth from making any law for establishing any religion, imposing any religious observance, or prohibiting the free exercise of any religion. It also provides that no religious test shall be required as a qualification for any office or public trust under the Commonwealth. This lecture will survey the High Court’s jurisprudence on s 116. Lecture 12. Constitutional Amendment: The Constitution establishes several methods of constitutional amendment that apply to different aspects or provisions of the Constitution: (a) Commonwealth enactment (s 51(xxxvi)); (b) State referral of powers (s 51(xxxvii)); (c) Commonwealth and State enactment (s 51(xxxviii)); (d) dual referendum (s 128); unanimous referendum (s 128, para 5). The State Constitutions can be amended by ordinary statute, except where special ‘manner and form’ requirements apply (Australia Acts 1986, s 6). This lecture will offer an account of these methods of constitutional amendment.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 13(03 Mar - 01 Jun)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorials</strong><br><p>Week 2 - Tutorial 1: Constitutionalism</p>\n<p>Week 3 - Tutorial 2: Constitutional Interpretation</p>\n<p>Week 4 - Tutorial 3: Corporations Power</p>\n<p>Week 5 - Tutorial 4: External Affairs Power</p>\n<p>Week 6 - Tutorial 5: Acquisition Power</p>\n<p>Week 7 - Tutorial 6: Inconsistency between laws </p>\n<p>Week 8 - No Tutorial</p>\n<p>Break - No Tutorial</p>\n<p>Week 9 - No Tutorial</p>\n<p>Week 10 - Tutorial 7: Executive Power</p>\n<p>Week 11 - Tutorial 8: Intergovernmental Immunities</p>\n<p>Week 12 - Tutorial 9: Freedom of Interstate Trade</p>\n<p>Week 13 - Tutorial 10: Freedom of Political Communication</p>\n<p>Supplementary Tutorial Question: Freedom of Religion</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Tutorials</strong>",
            "topic_description": "Tutorials Week 2 - Tutorial 1: Constitutionalism Week 3 - Tutorial 2: Constitutional Interpretation Week 4 - Tutorial 3: Corporations Power Week 5 - Tutorial 4: External Affairs Power Week 6 - Tutorial 5: Acquisition Power Week 7 - Tutorial 6: Inconsistency between laws Week 8 - No Tutorial Break - No Tutorial Week 9 - No Tutorial Week 10 - Tutorial 7: Executive Power Week 11 - Tutorial 8: Intergovernmental Immunities Week 12 - Tutorial 9: Freedom of Interstate Trade Week 13 - Tutorial 10: Freedom of Political Communication Supplementary Tutorial Question: Freedom of Religion",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}