{
    "course_title": "Thermodynamics & Heat Transfer",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MECH3400-21323-7520",
    "full_course_code": "MECH3400-21323-7520",
    "course_code": "MECH3400",
    "class_code": "21323",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Identify and correctly use the fundamental principles of thermodynamics and heat transfer - Analyse simple canonical engineering problems and link them to these fundamental principles"
        },
        {
            "number": "LO2.",
            "description": "Identify and correctly use the fundamental principles of thermodynamics and heat transfer - Understand different modes of heat transfer (conduction, convection and radiation)"
        },
        {
            "number": "LO3.",
            "description": "Identify and correctly use the fundamental principles of thermodynamics and heat transfer - Apply basic thermodynamic principles to analyse well-known power/refrigeration cycles"
        },
        {
            "number": "LO4.",
            "description": "Identify and correctly use the fundamental principles of thermodynamics and heat transfer - Calculate the temperature distribution in a heat exchanger and for different processes"
        },
        {
            "number": "LO5.",
            "description": "Identify and correctly use the fundamental principles of thermodynamics and heat transfer - Demonstrate an understanding of the fundamental thermodynamic principles of combustion and chemical equilibrium"
        },
        {
            "number": "LO6.",
            "description": "Identify and correctly use the fundamental principles of thermodynamics and heat transfer - Read psychrometric charts and identify the relevant air properties (saturation temperature, humidity, enthalpy etc)"
        },
        {
            "number": "LO7.",
            "description": "Identify and correctly use the fundamental principles of thermodynamics and heat transfer - Understand the difference between transient and steady problems and select the proper tool to investigate the problem"
        },
        {
            "number": "LO8.",
            "description": "Apply thermodynamics and heat transfer problem-solving strategies to analyse the performance of complex engineering systems - Select and apply appropriate techniques and tools introduced in the course to quantify the thermodynamic performance of innovative power/refrigeration cycles"
        },
        {
            "number": "LO9.",
            "description": "Apply thermodynamics and heat transfer problem-solving strategies to analyse the performance of complex engineering systems - Apply simplified mathematical models to complex thermodynamic processes in heating ventilation and air conditioning problems"
        },
        {
            "number": "LO10.",
            "description": "Apply thermodynamics and heat transfer problem-solving strategies to analyse the performance of complex engineering systems - Create strategies for accommodating real effects building on the simplified frameworks developed in thermodynamics"
        },
        {
            "number": "LO11.",
            "description": "Apply thermodynamics and heat transfer problem-solving strategies to analyse the performance of complex engineering systems - Select the approach best suited to investigate a given heat transfer problem"
        },
        {
            "number": "LO12.",
            "description": "Apply thermodynamics and heat transfer problem-solving strategies to analyse the performance of complex engineering systems - Interpret temperature and heat transfer measurements"
        },
        {
            "number": "LO13.",
            "description": "Effectively communicate engineering solutions in thermodynamics and heat transfer to teaching staff and peers - Work collaboratively with team members to develop analysis of thermodynamics and heat transfer data from laboratory experiments"
        },
        {
            "number": "LO14.",
            "description": "Effectively communicate engineering solutions in thermodynamics and heat transfer to teaching staff and peers -  Demonstrate the ability to articulate methodologies to estimate heat transfer and energy conversion efficiency"
        },
        {
            "number": "LO15.",
            "description": "Effectively communicate engineering solutions in thermodynamics and heat transfer to teaching staff and peers - Document and report engineering thermohydraulics measurements and analysis of physical data"
        },
        {
            "number": "LO16.",
            "description": "Use analysis methods of physical systems to contrast performance against potential environmental impacts and human comfort - Systematically utilise the basic thermodynamic analysis of advanced engineering systems to quantify environmental benefits of existing options"
        },
        {
            "number": "LO17.",
            "description": "Use analysis methods of physical systems to contrast performance against potential environmental impacts and human comfort - Compare and contrast different HVAC system options to identify environmental suitability based on their climate of application"
        },
        {
            "number": "LO18.",
            "description": "Use analysis methods of physical systems to contrast performance against potential environmental impacts and human comfort - Demonstrate an understanding of engineering tailored heat transfer solutions to achieve least environmental impact"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Thermodynamics and Heat Transfer prac sessions",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p> 24/03/2025 - 20/05/2025</p>\n<p>\n</p><p>13:00 (1:00pm) One week from the attendance of your practical session</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Paper/ Report/ Annotation, Practical/ Demonstration",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students are expected to attend the practical on the date that they have signed up for. We strongly encourage the students to note this down in their calendar with adequate reminders, as this occurs only once in the semester for every student. The practical spaces are limited and hence it is very difficult to accommodate students who accidentally miss their session. We would suggest contacting Dr. Ramprakash Ananthapadmanaban (Practical Coordinator) by email, in the event of missing your session, owing only to extenuating circumstances, to be relocated to a new session. Please note that the Report deadlines noted below then shift to your new practical session and with the group of students you undertake this with.</p>\n<p>Pre-work (self-study at home and responding to questions posted on Blackboard) carries 5%, running the tests and Practical Report on thermodynamics (refrigeration) and heat transfer (conduction) carries the remaining 10%.</p>\n<p>Practical reports are due one week (5 working days) from the date that you attended your practical session. If that date falls on a holiday/mid-semester break, it will be due the next working day of the semester.</p>\n<p>The submission time for the report is<strong> 13:00 (1 PM</strong>), even if your practical hours were different from this.</p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<p>Please refer to Blackboard for a detailed marking criteria.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via TurnItIn on Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "In-Semester Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p>In-semester Saturday</p>\n<p>29/03/2025 - 12/04/2025</p>\n<p>\n</p><p>Please refer to your personal exam timetable on my.UQ.</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The In-Semester examination will assess a portion of the thermodynamics/heat transfer content covered up to this point in the semester. Specific topics will be communicated via Blackboard announcements.</p>\n<p>Format: Multiple-choice, Short answer, Problem solving</p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Final Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>60%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>7/06/2025 - 21/06/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Final Exam will assess all of the content covered in the course.</p>\n<p>Format: Multiple-choice, Problem solving</p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial</strong><br><p>Apply, practice, and extend the concepts taught during the lectures to sample problems and discuss worked solutions; receive feedback and assistance in the learning process; develop communication skills through in-class discussions.</p></br></p></div></td>",
            "topic_title": "<strong>Tutorial</strong>",
            "topic_description": "Tutorial Apply, practice, and extend the concepts taught during the lectures to sample problems and discuss worked solutions; receive feedback and assistance in the learning process; develop communication skills through in-class discussions.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lectures on thermodynamics and heat transfer</strong><br><p>Learn new concepts and how to apply them to solve thermodynamics and heat transfer problems. Participate in in-class discussions regarding technical aspects of thermodynamics and heat transfer.</p></br></p></div></td>",
            "topic_title": "<strong>Lectures on thermodynamics and heat transfer</strong>",
            "topic_description": "Lectures on thermodynamics and heat transfer Learn new concepts and how to apply them to solve thermodynamics and heat transfer problems. Participate in in-class discussions regarding technical aspects of thermodynamics and heat transfer.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Independent Study</strong><br><p>Both the thermodynamics and heat transfer components of the course require students to undertake individual study. This is necessary to reinforce understanding of lecture material and practice application of the course concepts to tutorial and additional problems.<br/>Note that in any typical week for the course there are only 5 hours of contact (lectures and tutorials). At least the same proportion of time should be spent on independent reading and problem solving.</p></br></p></div></td>",
            "topic_title": "<strong>Independent Study</strong>",
            "topic_description": "Independent Study Both the thermodynamics and heat transfer components of the course require students to undertake individual study. This is necessary to reinforce understanding of lecture material and practice application of the course concepts to tutorial and additional problems. Note that in any typical week for the course there are only 5 hours of contact (lectures and tutorials). At least the same proportion of time should be spent on independent reading and problem solving.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 5 To Week 11(24 Mar - 18 May)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Thermodynamics &amp; Heat Transfer Pracs</strong><br><p>Heat transfer practicals provide an opportunity to apply knowledge of course content to real problems, and thereby gain a more direct understanding of course concepts.</p></br></p></div></td>",
            "topic_title": "<strong>Thermodynamics &amp; Heat Transfer Pracs</strong>",
            "topic_description": "Thermodynamics & Heat Transfer Pracs Heat transfer practicals provide an opportunity to apply knowledge of course content to real problems, and thereby gain a more direct understanding of course concepts.",
            "learning_outcomes": []
        }
    ]
}