{
    "course_title": "Medical Specialties",
    "study_period": "Sem 1 2025",
    "location": "Herston",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MEDI7414-20466-7520",
    "full_course_code": "MEDI7414-20466-7520",
    "course_code": "MEDI7414",
    "class_code": "20466",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (06/01/2025 - 07/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate high standards of ethical conduct, rapport and empathy in all interactions with peers, patients and their families"
        },
        {
            "number": "LO2.",
            "description": "Develop necessary critical thinking and clinical reasoning skills for the clinical environment."
        },
        {
            "number": "LO3.",
            "description": "Explain the epidemiology, pathophysiology and clinicopathological correlates of conditions that are important and/or common in the context of hospital-based medicine"
        },
        {
            "number": "LO4.",
            "description": "Appropriately manage conditions seen commonly in hospital-based medical practice (as outlined in the syllabus), including selection of pharmacological and other treatments, and awareness of their side-effects and contraindications."
        },
        {
            "number": "LO5.",
            "description": "Effectively assess a patient and their medical condition, including appropriate history and examination, as well as rational selection and interpretation of investigations"
        },
        {
            "number": "LO6.",
            "description": "Demonstrate a practical approach to common ward-based clinical tasks and situations which are typically managed by junior medical officers in a hospital setting"
        },
        {
            "number": "LO7.",
            "description": "Recognise the varying roles of medical, nursing and allied health staff within an acute care ward, and demonstrate skills and attributes which allow for effective interactions with those staff as part of a health care team."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Multiple Choice Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": null,
            "due_date": "<dd><p> 2/06/2025 - 7/06/2025</p>\n<p>\n</p><p>Details regarding the exam will be provided by the Medical School.</p></dd>",
            "learning_objectives": "L03, L04, L05, L06",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This examination will consist of multiple choice questions blueprinted to the Medical Specialties Curriculum (available on Blackboard). This examination assesses a broad range of clinical knowledge. You are not expected to have in-depth knowledge of all facets of each medical specialty. In contrast to Year 3 Medicine, there is a greater emphasis on: acute and on-call scenarios, safe prescribing, as well as recongition, assessment and management principles of common and/or life-threatening medical conditions.</p>\n<p>To assist in preparation, the Year 4 Curriculum Snapshot is designed to draw your attention to areas of medicine most likely to be examined on the MCQ paper. The Safe Prescribing and On-Call tutorial programs and other recommended resources will assist in your preparation. </p>\n<p>You will sit the MCQ exam during the end of semester examination week.</p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p>Marks will be given for correct answers.</p>\n<p>The 55% passing score may be modified in accordance with standard setting methods.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>If you fail to meet the submission deadline for the Marked Admission without an approved extension, it will be considered as a lapse in professional conduct. The penalty will be a deduction of 10% relative percentage per day. Late submission longer than 7 calendar days will be considered as not meeting the passing standard for this assessment, in addition to being considered a lapse in professional conduct.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Marked Admission",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": null,
            "due_date": "<dd><p> Week 6, Fri 5:00 pm</p>\n<p>\n</p><p>Can be completed in Week 5 or 6 of Clinical Placement Block.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07",
            "mode": "Oral",
            "category": "Practical/ Demonstration, Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You will be required to prepare a <em>viva voce</em> presentation of a clinical case seen during your six-week clinical placement. The primary medical issue/s should predominantly concern the medical specialty to which you are attached.</p>\n<p>There are two primary aims of this task: </p>\n<ol>\n<li>Demonstration of acquired knowledge and a deeper understanding of a common medical problem or problems relating to the medical specialty to which you are attached.</li>\n<li>Demonstration of a range of skills necessary to complete a medical admission (or outpatient encounter), including: prescribing medications on a medication chart, requesting relevant pathology or imaging, and completion of a discharge summary (or outpatient clinic letter).</li>\n</ol>\n<p><br/></p>\n<p><strong>Components:</strong></p>\n<p>Part A: Case-based discussion</p>\n<ol>\n<li>Focused and accurate clinical history. </li>\n<li>Focused and accurate clinical examination.</li>\n<li>Synthesis &amp; prioritisation of clinical issues - demonstrating satisfactory clinical reasoning; understanding of the pathophysiology and clinicopathological correlates of the condition; and recognising the social impact of the disease upon the patient.</li>\n<li>Management - development and discussion of an appropriate and tailored management plan. </li>\n</ol>\n<p>Part B: Admission documentation</p>\n<ol>\n<li>Appropriate selection and ordering of investigations (i.e. use of radiology and pathology forms);</li>\n<li>Appropriate use of medication charts;</li>\n<li>Appropriate and well-constructed discharge summary OR outpatient clinic letter </li>\n</ol>\n<p>The marked admission must be undertaken in week 5 or 6 of the clinical placement.</p>\n<p>The marked admission is to be presented for examination to your primary supervisor. Where the primary supervisor is unable to act as an examiner, they may assign a delegate. The examiner must be a clinician within the assigned clinical placement who has specialist status or is on a specialist training pathway, (i.e. Consultant, “Attending”, Fellow or Advanced Trainee Registrar) for formal marking. Marked admissions completed with a resident medical officer, Basic Physician Trainee or Principal House Officer will not be accepted. The examiner's name, position must be accurately recorded, and signed and dated. </p>\n<p>For a detailed task description on how to approach the marked admission, please refer to the 'Marked Admission Student Guide' found below and in the Assessment section of the Blackboard site for this course.</p>\n<p>Note: Students may collaborate in their literature readings and are encouraged to share resources and undertake group learning activities, but each case must have been seen on an individual basis.</p>\n<p><br/></p>\n<p><strong>Criteria &amp; Marking: </strong></p>\n<p>This is a graded assessment item. To satisfy this assessment item, you must achieve a total score of at least 60%. </p>\n<p>Late submission without an approved extension will impact the overall course grade.</p>\n<p>The Associate Dean (Academic), Faculty of Medicine has waived the requirement for this assessment item to be recorded. To ensure the integrity of assessment and to enhance feedback on assessment, clear records will be kept of performance against the criteria and standards. The Marked Admission Mark Sheet (available on the course Blackboard site) is used to document student performance and provide feedback comments.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Original hard copy mark sheet must be provided to your Student Coordinator by 1700 Friday Week 6.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>If you fail to meet the submission deadline for the Marked Admission without an approved extension, it will be considered as a lapse in professional conduct. The penalty will be a deduction of 10% relative percentage per day. Late submission longer than 7 calendar days will be considered as not meeting the passing standard for this assessment, in addition to being considered a lapse in professional conduct.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Standardised Clinical Scenario",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": null,
            "due_date": "<dd><p> Week 6 Mon - Week 6 Fri</p></dd>",
            "learning_objectives": "L02, L03, L04, L05, L06, L07",
            "mode": "Oral",
            "category": "Examination, Practical/ Demonstration, Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Standardised Clinical Scenario (SCS) is a form of standardised clinical examination. You will be familiar with the format of an SCS exam as conducted during their placements in Year 3 Medicine. The format for the Year 4 Medical Specialties SCS is generally similar with a greater focus on acute and on-call medical scenarios. You will be presented with a common acute medical scenario that might be faced during a ward-call shift as a junior doctor, in which you make determinations regarding targeted clinical assessment, diagnosis and clinical reasoning, rational use of investigations and formulation of a management plan.</p>\n<p>Scenarios are derived from a finite list of potential topics / presenting complaints. The list of potential topics is available on Blackboard.  The On-Call education program provides a framework for you to develop and practise the requisite skills to complete this assessment item.</p>\n<p>Examiners may be local clinicians and/or UQ academic staff. Examinations will ordinarily take place face-to-face at the student's usual clinical site, however, examinations may be conducted via Zoom where necessary. </p>\n<p>Timing: Week 6 of clinical placements.</p>\n<p>Duration: 15 minutes duration, plus 5 minutes reading time.</p>\n<p>Components:</p>\n<ol>\n<li>Approach to differential diagnosis</li>\n<li>Assessment and clinical prioritisation</li>\n<li>Examination interpretation</li>\n<li>Investigation interpretation</li>\n<li>Management</li>\n</ol>\n<p>The Associate Dean (Academic), Faculty of Medicine has waived the requirement for this assessment item to be recorded. To ensure the integrity of assessment and to enhance feedback on assessment, two examiners are used, and clear records will be kept of performance against the criteria and standards. The Standardised Clinical Scenario Mark Sheet (available on the course Blackboard site) is used to document student performance and provide feedback comments.</p>\n<p>Criteria &amp; Marking:</p>\n<p>To pass this assessment item, you need to achieve a total grade of at least 55%. The passing score may be modified in accordance with standard setting methods.</p>\n<p>Further information regarding marking of this assessment, including the marking rubric can be found on the Blackboard course page. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>If you fail to meet the submission deadline for any Clinical Participation Assessment without an approved extension, it will not be accepted and may result in course failure regardless of whether the supervisor has rated your participation at a satisfactory or proficient level in the related course components. </p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Clinical Participation Assessment - Med Spec",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": null,
            "due_date": "<dd><p> Week 6, Fri 5:00 pm</p>\n<p>\n</p><p>Students with a split placement will be required to submit a CPA at the end of each section of your placement. Please consult your Student Coordinator for details. </p></dd>",
            "learning_objectives": "L01, L05, L06, L07",
            "mode": "Activity/ Performance",
            "category": "Participation/ Student contribution, Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Medical School considers that participation and engagement at clinical placements fundamental are fundamental aspects of the MD program, consistent with the framework of self-directed and life-long learning and indicative of the need for clinical competence and professional conduct in addition to theoretical knowledge. </p>\n<p>In all courses during Years 3 and 4 of the MD program, you are assessed on your professional conduct and clinical skills and the extent to which you have contributed and engaged in your clinical placement and clinical learning activities. The nature of these activities will vary according to the placement, but may include admitting/clerking patients, assessing patients at outpatient clinics, presenting at ward rounds and demonstrating initiative in attending other activities such as grand rounds. </p>\n<p><br/></p>\n<p>Scoring in the Clinical Participation Assessment (CPA) is based on conduct and contribution during ward rounds and case discussions, initiative in seeking learning opportunities, behaviour towards peers and medical (and all other) colleagues, patient assessment, ability to succinctly present a patient case including differential diagnosis, and awareness of social and ethical issues including risk assessment. </p>\n<p>The CPA components are: </p>\n<ul>\n<li>Clinical Communication </li>\n<li>History Taking </li>\n<li>Examination Skills </li>\n<li>Clinical Reasoning </li>\n<li>Engagement in Practice </li>\n<li>Professional Practice </li>\n<li>Reflective Practice </li>\n<li>Social/Cultural Competence and Safety </li>\n</ul>\n<p>There is also a Student Flag component which allows a supervisor to report a student with concerning unprofessional or unsafe behaviour. The Student Flag component also provides a mechanism for notifying exemplary performance to the School. </p>\n<p>To maximise your learning, you are encouraged to actively seek feedback from your clinical teacher/s during your clinical placement. This will assist in identifying any areas requiring further improvement before your final Clinical Participation Assessment is completed. Active engagement in the clinical setting is a requirement to pass this assessment task. </p>\n<p><br/></p>\n<p>The CPA rubric can be found in the Blackboard Course Site for guidance so that you are familiar with marking criteria for each component. </p>\n<p><strong>Criteria &amp; Marking:</strong> </p>\n<p>The CPA is a global assessment of professional and clinical practice and contribute to your overall performance in the following ways: </p>\n<p><br/></p>\n<ol>\n<li>If you are enrolled concurrently in the WLP course, four components contribute to this MEDI7414 course (Clinical Communication, History Taking, Examination Skills, Clinical Reasoning) and the remaining components (Engagement in Practice, Professional Practice, Reflective Practice, Social/Cultural Competence and Safety and Student Flag) contribute to the WLP course. </li>\n<li>If you are not enrolled concurrently in the WLP course all components contribute to this MEDI7414 course. </li>\n</ol>\n<p>Additional information may be received by staff from clinical placement site/s where you completed this course. This will be reviewed by the Course Coordinator and ratings completed by your supervisor in the CPA may be revised. For example, if your supervisor rated you as satisfactory related to professional conduct but the Medical School has other information available, the supervisor’s ratings may be moderated based on this additional information. </p>\n<p><br/></p>\n<p>Your performance will also be reviewed at the End of Semester Examiner’s meeting and following discussion you may receive a non-graded fail for the course, if: </p>\n<ul>\n<li>There are any unsatisfactory results recorded in any of the CPA components contributing to this course (including moderations made by the Course Coordinator) </li>\n<li>There are four or more borderline results recorded in any of the CPA components contributing to this course (including moderations made by the Course Coordinator) </li>\n<li>The required number of CPAs have not been submitted to your supervisor for completion by the due date. </li>\n</ul>\n<p>Factors that will be taken into account during the review undertaken at the End of Semester Examiner’s meeting include: </p>\n<ul>\n<li>Evidence of temporal improvement in performance across the course (if applicable) </li>\n<li>Completion and content of the WLP Task Review in response to unsatisfactory or borderline ratings </li>\n<li>Relative opportunity available across the semester </li>\n<li>Other factors relevant to your performance </li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>A function of the CPA discussion and form completion is to consider information from the whole placement. Therefore, you are expected to complete your CPA discussion and submit your CPA form during the final week of placement. Given clinician availability, there may be times when this is not always possible. If you complete your CPA discussion and submit your CPA form before the final week of placement for placements of 3 weeks or less, or before the penultimate week of placement for placements longer than 3 weeks, additional information obtained by your supervisor or Course Coordinator maybe considered to add to that discussed and submitted. Therefore, you are discouraged from completing the CPA discussion and form submission early.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>If you fail to meet the submission deadline for any Clinical Participation Assessment without an approved extension, it will not be accepted and may result in course failure regardless of whether the supervisor has rated your participation at a satisfactory or proficient level in the related course components. </p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Not scheduled",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introductory week activities</strong><br><p>Introductory week activities for the Advanced Hospital Practice Semester. You will undertake a combination of centralised activities and unique site-specific learning activities throughout the week.</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L06, L07</p></div></td>",
            "topic_title": "<strong>Introductory week activities</strong>",
            "topic_description": "Introductory week activities Introductory week activities for the Advanced Hospital Practice Semester. You will undertake a combination of centralised activities and unique site-specific learning activities throughout the week.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 6",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>On-Call</strong><br><p>The On-Call tutorial program focuses on common and serious acute medical scenarios that may be encountered as an on-call junior doctor with a focus on targeted &amp; rapid clinical assessment, rational use of resources, formulation of a working diagnosis and sensible differential list and formulation of an initial management plan. On-call sessions are designed to be interactive with a focus on clinical reasoning. Some topics are presented in a live format while other topics are available as interactive online modules. You are expected to attend all available live sessions and view other online modules by the completion of the course. Liaise with your local student coordinators for timetables.</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>On-Call</strong>",
            "topic_description": "On-Call The On-Call tutorial program focuses on common and serious acute medical scenarios that may be encountered as an on-call junior doctor with a focus on targeted & rapid clinical assessment, rational use of resources, formulation of a working diagnosis and sensible differential list and formulation of an initial management plan. On-call sessions are designed to be interactive with a focus on clinical reasoning. Some topics are presented in a live format while other topics are available as interactive online modules. You are expected to attend all available live sessions and view other online modules by the completion of the course. Liaise with your local student coordinators for timetables.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 6",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Safe Prescribing</strong><br><p>The safe prescribing tutorial program offers a vital opportunity for you to undertake facilitated written practice safely prescribing common and high-risk medications, before they soon become interns prescribing medications for real patients. An introductory session is held centrally in the AHP introductory week followed by a program of five clinician-led tutorials. Pre-reading is available on Blackboard and you are expected to come prepared for each live session. Students will receive practical experience in a variety of prescribing scenarios, (for example, anticoagulation insulin prescribing; opioid prescribing; discharge &amp; PBS prescribing). The end-of-semester MCQ Exam will include questions that examine knowledge in safe prescribing. Liaise with your local student coordinators for timetables.</p></br></p><p><strong>Learning outcomes:</strong> L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Safe Prescribing</strong>",
            "topic_description": "Safe Prescribing The safe prescribing tutorial program offers a vital opportunity for you to undertake facilitated written practice safely prescribing common and high-risk medications, before they soon become interns prescribing medications for real patients. An introductory session is held centrally in the AHP introductory week followed by a program of five clinician-led tutorials. Pre-reading is available on Blackboard and you are expected to come prepared for each live session. Students will receive practical experience in a variety of prescribing scenarios, (for example, anticoagulation insulin prescribing; opioid prescribing; discharge & PBS prescribing). The end-of-semester MCQ Exam will include questions that examine knowledge in safe prescribing. Liaise with your local student coordinators for timetables.",
            "learning_outcomes": [
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 6",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Clinical placement activities</strong><br><p>Daily attendance and engagement in clinical activities associated with your clinical placement including but not limited to: ward rounds, outpatient clinics, procedural lists (where relevant) as well as departmental educational meetings. Consult with your supervisor at the commencement of your clinical term to ensure you understand the expectations of the placement. Some hospitals also provide additional educational sessions (e.g. Student Grand Rounds). Consult with your local student coordinator for your timetable.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Clinical placement activities</strong>",
            "topic_description": "Clinical placement activities Daily attendance and engagement in clinical activities associated with your clinical placement including but not limited to: ward rounds, outpatient clinics, procedural lists (where relevant) as well as departmental educational meetings. Consult with your supervisor at the commencement of your clinical term to ensure you understand the expectations of the placement. Some hospitals also provide additional educational sessions (e.g. Student Grand Rounds). Consult with your local student coordinator for your timetable.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 6",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>On-Call Shift Participation</strong><br><p>The purpose of participating in On-Call shifts is to give you valuable experience in the range of medical conditions encountered after hours in hospital settings. In many hospitals this is referred to as ward call, which may be undertaken by doctors with varying levels of experience, from intern to registrar level.</p>\n<p><br/></p>\n<p>You are to complete a minimum of 24 hours which is typically divided as four (4) x 6-8 hour on call shifts under the supervision of a junior medical officer (intern / resident / registrar) during the 6-week block. Each session must be signed off by a supervising doctor.</p>\n<p><br/></p>\n<p>Ordinary day hours during which you would typically be placed with their usual supervising team are not to be claimed as \"On-Call\". You should ascertain how ward call is organised at the clinical unit to which you are attached and work within the parameters of that system. Most institutions typically roster ward call staff during weekday evenings and weekend afternoons/evenings. You are not expected to undertake over-night shifts. It is your responsibility to liaise with your local student coordinator (and/or junior medical workforce) to ensure that on-call shifts are scheduled and completed within the placement period.</p>\n<p><br/></p>\n<p>You must communicate with your supervising placement team to ensure they are aware of you rostered On-Call shifts. To minimise fatigue, students completing weekday evening On-Call shifts are encouraged to negotiate a revised starting and/or finishing time with their supervising team so that a total of no more than 12 hours are completed in a single day (e.g. 6 hours with placement team, 6 hours participating in \"On-Call\"). You must ensure a minimum of 10 hours break between the end of shift and the commencement of the next day shift.</p>\n<p><br/></p>\n<p>You must submit evidence of completion by submission of the appropriate online forms.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>On-Call Shift Participation</strong>",
            "topic_description": "On-Call Shift Participation The purpose of participating in On-Call shifts is to give you valuable experience in the range of medical conditions encountered after hours in hospital settings. In many hospitals this is referred to as ward call, which may be undertaken by doctors with varying levels of experience, from intern to registrar level. You are to complete a minimum of 24 hours which is typically divided as four (4) x 6-8 hour on call shifts under the supervision of a junior medical officer (intern / resident / registrar) during the 6-week block. Each session must be signed off by a supervising doctor. Ordinary day hours during which you would typically be placed with their usual supervising team are not to be claimed as \"On-Call\". You should ascertain how ward call is organised at the clinical unit to which you are attached and work within the parameters of that system. Most institutions typically roster ward call staff during weekday evenings and weekend afternoons/evenings. You are not expected to undertake over-night shifts. It is your responsibility to liaise with your local student coordinator (and/or junior medical workforce) to ensure that on-call shifts are scheduled and completed within the placement period. You must communicate with your supervising placement team to ensure they are aware of you rostered On-Call shifts. To minimise fatigue, students completing weekday evening On-Call shifts are encouraged to negotiate a revised starting and/or finishing time with their supervising team so that a total of no more than 12 hours are completed in a single day (e.g. 6 hours with placement team, 6 hours participating in \"On-Call\"). You must ensure a minimum of 10 hours break between the end of shift and the commencement of the next day shift. You must submit evidence of completion by submission of the appropriate online forms.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        }
    ]
}