{
    "course_title": "Leadership: Theory & Practice",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MGTS7619-20083-7520",
    "full_course_code": "MGTS7619-20083-7520",
    "course_code": "MGTS7619",
    "class_code": "20083",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Critically analyse the challenges of leading and managing people in the workplace."
        },
        {
            "number": "LO2.",
            "description": "Critically analyse the application of various theoretical frameworks of leadership."
        },
        {
            "number": "LO3.",
            "description": "Develop and activate a plan to build upon your strengths and weaknesses in leading and managing people."
        },
        {
            "number": "LO4.",
            "description": "Clearly articulate the fundamental skills of leadership."
        },
        {
            "number": "LO5.",
            "description": "Practise effective leadership & business management skills in a variety of situations."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Identifying Values",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p>Task 1 14/03/2025 5:00 pm</p>\n<p>Task 2 21/03/2025 5:00 pm</p>\n<p>Task 3 28/03/2025 5:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This is an Individual assessment designed to help you identify your core values. The assessment consists of three individual but interrelated tasks (Tasks 1, 2, &amp; 3; up to 5 marks each) that need to be completed in Weeks 3, 4, and 5; one task each week. This will be a very enjoyable and character-building process that will deliver lots of learning.</p>\n<p><strong>Task &amp; Submission</strong></p>\n<ul>\n<li>Complete Tasks 1, 2, and 3. The tasks begin during the seminar, but you will have time to complete and submit your tasks by 5 pm Friday the same week. </li>\n<li>You will submit your work via Blackboard (weekly submission during weeks 3, 4, and 5).</li>\n</ul>\n<p><strong>Why this assessment?</strong></p>\n<p>From a learning point of view, a key focus of this course is to challenge students to identify strategies to develop their own brand of leadership. This requires a critical and honest evaluation of the values that you think are most important to you. It is not enough to contribute every now and again throughout the semester. Businesses don’t run that way. You need to be working towards creating an impact through weekly activities that you undertake. So, you also need to provide evidence of how you maintained a strong weekly work ethic to make your learning journey value to you. This is an issue of productivity – a measure of how much time you spent on the development of your knowledge (self-exploration) and its possible application to your professional development (self-actualisation) that will inevitably lead to meaningful results in terms of actual leadership impact.</p>\n<p><strong>AI Statement:</strong></p>\n<p><em>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You will submit your work via Blackboard (weekly submission during weeks 3, 4, and 5).</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "In-class Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 17/04/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This is an individual assessment.</p>\n<p>The test will consist of (a) 50 Multi-choice questions, and (b) 3 short answer questions.</p>\n<p>The test reflects the topics covered in the course from week 1 to week 7. Questions will be based on the topics covered in the textbook, UQx BUSLEAD modules, and seminars; so it will be vital for students to attend the seminars and complete their readings each week.</p>\n<p><strong>AI Statement:</strong></p>\n<p><strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>This is a paper-based assessment where students are required to handwrite their responses. It is essential that students <strong>ensure their handwriting is clear and legible</strong>. If handwriting is not legible, it may result in the responses being marked incorrectly or not being marked at all, which could negatively impact the student's overall grade. The allowed one A4 sheet of handwritten notes (single sided) must be submitted with the exam. You will need to use a <strong>2B pencil</strong> for the multiple choice section, and bring an <strong>eraser/rubber</strong> so you can easily change an answer if needed.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Embodying Values Presentation",
            "special_indicators": [],
            "weighting": "<dd>60%</dd>",
            "due_date": "<dd><p>Presentation Week 12 - Week 13</p>\n<p>Peer Review - 5pm - 30/05/2025</p>\n<p>\n</p><p>Presentation is during class, submission of your presentation materials by the beginning of your assigned session.</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance, Oral",
            "category": "Presentation, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Embodying Values Presentation assessment is an account of an attempt to enact a life priority. The activity is an embodiment exercise. During weeks 3-5, you will decide on a shortlist of implicit criteria that underlay the creation of a better world. Then, you will choose two and try to act in accordance with it (the Embodying Values activities). At the end of the semester, you will deliver a presentation reflecting on your experience in doing the Embodying Values activities, and how the activities contribute to your Transformational and Authentic leadership capacity. You are also required to peer-review two other presentations.</p>\n<p>See below for more details.</p>\n<p><strong>Tasks &amp; Submission</strong></p>\n<p>This is an individual assessment item and consists of three distinct elements:</p>\n<p><strong><em>Part 1, Embodying Values activity (weeks 6-11)</em>:</strong></p>\n<p>Push yourself to perform two acts over two weeks (between weeks 6 and 11) to embody two values that you identify during Weeks 3, 4, and 5. The acts should take you beyond your usual repertoire of daily behaviours and work to the significant benefit of another or of others. For example, you might check out one of the sites for helping people (e.g., kids with cancer, refugees, Rosies, St Vinnies, volunteer at your local school, visit a senior centre, fix and serve meals, volunteer at a hospital).</p>\n<ul>\n<li>The activities that you undertake to embody the identified values must not be retrospective. That is, the activities should be thoughtfully considered and selected after you identify your values during Weeks 3 to 5.</li>\n<li>Please note that activities such as 'making donations' do not constitute an embodying practice in themselves (for the purpose of this course). Therefore, they should be complemented with an additional activity.</li>\n</ul>\n<p><strong><em>Part 2, Presentation (weeks 12-13)</em>:</strong></p>\n<p>You will deliver a presentation in class based on your Embodying Values activity. The presentation is a report on your experience of the 'Embodying Values activity' and how the activities contribute to your transformational and/or authentic leadership.</p>\n<p>In your presentation, you should cover criteria 1, 2, and 3 as outlined in the marking rubric.</p>\n<p>Please note that the quality of both the content and delivery is important. An effective leader should be able to professionally communicate ideas based on reliable and clear content. For this reason, I have allocated marks to both the content and presentation (see the marking rubric).</p>\n<ul>\n<li>Submit a PowerPoint (PPT) file of your presentation via Blackboard.</li>\n<li>Deliver a presentation during the seminar (either in Week 12 or 13). Students will be assigned randomly to either week. Please make sure that your presentation meets the following requirements:</li>\n<li>7 minutes max duration. (This may vary depending on the number of enrolments. You will be advised in advance if any changes are applied.)</li>\n<li>Limit the number of slides you use (I recommend no more than 10)</li>\n<li>Minimum of five academic journal articles. Draw on quality reference materials and cite them on your slides. Please note that this is not a presentation on a research study. However, your reflection should show the benefit of having read intelligently in order to give you useful concepts and vocabulary. Use APA (7th ed.) style for referencing.</li>\n<li>Focus on professional communication (eye contact, pace, projection, etc.). Your presentation should be engaging and inspiring too.</li>\n</ul>\n<p><strong><em>Part 3, Peer review (by the end of week 13)</em>:</strong></p>\n<p>You will assess two other presentations. Groups of three will be randomly created in Blackboard. You will assess each of your Group members’ Presentations.</p>\n<p>Why peer-review? The skill to provide honest and constructive feedback on others' performance is a key skill for leaders. Engaging in the peer-review task helps you cultivate critical analytical skills and the ability to articulate constructive feedback, which is indispensable for effective leadership. Through this process, you not only enhance your evaluative capabilities but also refine your communication skills, laying the groundwork for becoming adept leaders capable of fostering growth and improvement in collaborative environments.</p>\n<ul>\n<li>Use the PROFORMA document that is available on Blackboard (in the Assessment 3 folder) to complete your peer review.</li>\n<li>Submit your peer review document via Blackboard.</li>\n<li>Failure to attend the presentation on the due date will incur a penalty.</li>\n</ul>\n<p><em>Note: </em>If you are unable to conduct a peer review for either of the two presenters due to the peers’ failure to submit their presentation materials, please note in your peer review document: “The presentation materials were not submitted within the designated timeframe.\" </p>\n<p><strong>Please Note:</strong> The presentation will be recorded for marking purposes per UQ Policy.</p>\n<p><strong>AI Statement:</strong></p>\n<p><strong><em>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</em></strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Welcome &amp; Introduction</strong><br/><p>This seminar provides an overview the course content, expectations and assessment items. Additionally, we explore the difference between management and leadership, and discuss what it takes to be a good leader.</p></p></div></td>",
            "topic_title": "<strong>Welcome &amp; Introduction</strong>",
            "topic_description": "Welcome & Introduction This seminar provides an overview the course content, expectations and assessment items. Additionally, we explore the difference between management and leadership, and discuss what it takes to be a good leader.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Theories evolution + The Trait Approach</strong><br/><p>This seminar explores the evolution of leadership theories throughout the 20th century. Additionally, we will examine the classic Trait approach to leadership.</p></p></div></td>",
            "topic_title": "<strong>Theories evolution + The Trait Approach</strong>",
            "topic_description": "Theories evolution + The Trait Approach This seminar explores the evolution of leadership theories throughout the 20th century. Additionally, we will examine the classic Trait approach to leadership.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The Skills Approach to Leadership</strong><br/><p>This seminar explores another leader-centered approach: the Skills Approach. This approach highlights that what sets a leader apart from their peers are the leader's competencies and skills. Building on this perspective, researchers have developed models to explain the capabilities (knowledge and skills) that enable effective leadership.</p></p></div></td>",
            "topic_title": "<strong>The Skills Approach to Leadership</strong>",
            "topic_description": "The Skills Approach to Leadership This seminar explores another leader-centered approach: the Skills Approach. This approach highlights that what sets a leader apart from their peers are the leader's competencies and skills. Building on this perspective, researchers have developed models to explain the capabilities (knowledge and skills) that enable effective leadership.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The Behavioural Approach to Leadership</strong><br/><p>This seminar covers the Behavioural Approach to Leadership. This approach looks at leadership as an observable activity or process. Following this perspective, researchers in the 1940s began to identify the behaviours that were associated with effective leadership.</p></p></div></td>",
            "topic_title": "<strong>The Behavioural Approach to Leadership</strong>",
            "topic_description": "The Behavioural Approach to Leadership This seminar covers the Behavioural Approach to Leadership. This approach looks at leadership as an observable activity or process. Following this perspective, researchers in the 1940s began to identify the behaviours that were associated with effective leadership.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The Situational Approach to Leadership</strong><br/><p>This seminar explores an approach that, unlike previous ones, is not leader-centric: the Situational Approach. This approach focuses on leadership in various situations, suggesting that different circumstances require different types of leadership. According to this approach, an effective leader is one who can adapt their leadership style to suit different situations. This approach is among the first to consider the role of followers in determining a leader's effectiveness.</p></p></div></td>",
            "topic_title": "<strong>The Situational Approach to Leadership</strong>",
            "topic_description": "The Situational Approach to Leadership This seminar explores an approach that, unlike previous ones, is not leader-centric: the Situational Approach. This approach focuses on leadership in various situations, suggesting that different circumstances require different types of leadership. According to this approach, an effective leader is one who can adapt their leadership style to suit different situations. This approach is among the first to consider the role of followers in determining a leader's effectiveness.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Leader-Member Exchange (LMX) Theory</strong><br/><p>This seminar explores Leader-Member Exchange Theory (LMX). LMX is based on the assumption that the relationship between the leader and followers is variable; that is some of the followers may receive more attention from the leader than other followers. These followers are referred to as the 'in-group'. Other followers, the 'out-group', receive less of the leader's attention and time. In this seminar, we will learn about the advantages of being an in-group member, and how one can become an in-group member. </p></p></div></td>",
            "topic_title": "<strong>Leader-Member Exchange (LMX) Theory</strong>",
            "topic_description": "Leader-Member Exchange (LMX) Theory This seminar explores Leader-Member Exchange Theory (LMX). LMX is based on the assumption that the relationship between the leader and followers is variable; that is some of the followers may receive more attention from the leader than other followers. These followers are referred to as the 'in-group'. Other followers, the 'out-group', receive less of the leader's attention and time. In this seminar, we will learn about the advantages of being an in-group member, and how one can become an in-group member.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Team Leadership</strong><br/><p>This seminar explores team leadership and what a group member (not the team leader) can do to provide leadership when necessary and without having the position power. </p>\n<p><strong>Centrally run In-Semester Examination</strong></p></p></div></td>",
            "topic_title": "<strong>Team Leadership</strong>",
            "topic_description": "Team Leadership This seminar explores team leadership and what a group member (not the team leader) can do to provide leadership when necessary and without having the position power. Centrally run In-Semester Examination",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Revision and Exam</strong><br/><p>See Assessment 2 information for details of the exam</p></p></div></td>",
            "topic_title": "<strong>Revision and Exam</strong>",
            "topic_description": "Revision and Exam See Assessment 2 information for details of the exam",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid-sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In-Semester Break</strong><br/></p></div></td>",
            "topic_title": "<strong>In-Semester Break</strong>",
            "topic_description": "In-Semester Break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Transformational Leadership</strong><br/><p>This seminar explores Transformational Leadership, one of the most current and popular approaches. You will learn about five qualities of transformational leaders and examine examples to better understand Transformational Leadership.</p></p></div></td>",
            "topic_title": "<strong>Transformational Leadership</strong>",
            "topic_description": "Transformational Leadership This seminar explores Transformational Leadership, one of the most current and popular approaches. You will learn about five qualities of transformational leaders and examine examples to better understand Transformational Leadership.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Authentic Leadership</strong><br/><p>This seminar explores the topic of Authentic Leadership. Authentic leadership is concerned with a simple yet very important question: 'what is good leadership?' Authentic Leadership is very similar to Transformational Leadership, with more explicit emphasis on the role of ethics in leadership. </p></p></div></td>",
            "topic_title": "<strong>Authentic Leadership</strong>",
            "topic_description": "Authentic Leadership This seminar explores the topic of Authentic Leadership. Authentic leadership is concerned with a simple yet very important question: 'what is good leadership?' Authentic Leadership is very similar to Transformational Leadership, with more explicit emphasis on the role of ethics in leadership.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Leadership and Organisational Culture</strong><br/><p>This seminar explores organizational culture and its connection to leadership. We will see how leaders shape and are shaped by the culture of their organization, and how a strong culture can improve leadership.</p></p></div></td>",
            "topic_title": "<strong>Leadership and Organisational Culture</strong>",
            "topic_description": "Leadership and Organisational Culture This seminar explores organizational culture and its connection to leadership. We will see how leaders shape and are shaped by the culture of their organization, and how a strong culture can improve leadership.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Student Presentation</strong><br/></p></div></td>",
            "topic_title": "<strong>Student Presentation</strong>",
            "topic_description": "Student Presentation",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Student Presentation</strong><br/></p></div></td>",
            "topic_title": "<strong>Student Presentation</strong>",
            "topic_description": "Student Presentation",
            "learning_outcomes": []
        }
    ]
}