{
    "course_title": "Employee and Organisational Development",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MGTS7611-20081-7520",
    "full_course_code": "MGTS7611-20081-7520",
    "course_code": "MGTS7611",
    "class_code": "20081",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Identify and explain a range of concepts, models and approaches that relate to employee and organisational development theory and apply them to practical situations."
        },
        {
            "number": "LO2.",
            "description": "Critically reflect and write on the theory and nature of employee and organisational development and its implications for an ethical and inclusive workplace that fosters wellbeing."
        },
        {
            "number": "LO3.",
            "description": "Apply theory to analyse case studies in order to develop professional and engaging presentations."
        },
        {
            "number": "LO4.",
            "description": "Work effectively and respectfully in diverse teams."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Learning Experiences & Styles Reflective Essay",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p> 30/04/2025 2:00 pm</p></dd>",
            "learning_objectives": "L02",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Essay/ Critique, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>In this reflective essay, you will be required to think about yourself as a person, exploring your experiences throughout your personal learning journey, including:</p>\n<ul>\n<li><strong>Learning Style:</strong> Identification and analysis of your preferred learning styles (e.g., visual, auditory, kinesthetic, read/write).</li>\n<li><strong>Learning Experiences:</strong> Reflection on past learning experiences, both formal (e.g., university courses, workshops) and informal (e.g., on-the-job training, self-study).</li>\n<li><strong>Impact of Training Approaches:</strong> Analysis of how different training methods (e.g., lectures, simulations, case studies, mentoring) have impacted your learning effectiveness.</li>\n<li><strong>Self-Assessment:</strong> Evaluation of your current strengths and weaknesses as a learner and identification of areas for improvement.</li>\n</ul>\n<p><strong>Key Goal:</strong></p>\n<p>To foster self-awareness and metacognition in students regarding their learning process.</p>\n<p><strong>Objectives:</strong></p>\n<ol>\n<li><strong>Identify and analyse individual learning styles.</strong></li>\n<li><strong>Critically evaluate past learning experiences.</strong></li>\n<li><strong>Demonstrate understanding of different training approaches and their impact.</strong></li>\n<li><strong>Develop self-awareness of learning strengths and weaknesses.</strong></li>\n</ol>\n<p><br/></p>\n<p><strong>Deliverable:</strong></p>\n<p>A reflective essay of approximately 1500 words, adhering to academic writing standards. Evidence from the academic literature will be required. Please see the marking criteria at Blackboard for more information.</p>\n<p><strong>AI Statement</strong></p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The assignment is to be submitted electronically in the Blackboard Assessment link.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Employee Development Strategy Report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>45%</dd>",
            "due_date": "<dd><p> 13/05/2025 2:00 pm</p>\n<p>\n</p><p>Portfolio Activities will be due:</p>\n<p>Tutorials 3 - 7 (one week delayed due to weather)</p>\n<p><br/></p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Paper/ Report/ Annotation, Product/ Design, Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Goal</strong>: </p>\n<p>This assessment challenges students to undertake the development of a comprehensive Employee Development Program tailored to the needs of a chosen organisation. The aim is to equip you with the skills necessary to seamlessly integrate theoretical insights into actionable strategies, aligning with the organisational objectives. Your task involves conducting a needs analysis, synthesizing pertinent literature, and crafting a robust development program that not only addresses organisational challenges but also leverages opportunities for growth. This assessment demands the application of critical thinking, astute research capabilities, and the finesse to communicate effectively in a professional business context.</p>\n<p><strong>Description</strong>: You are to develop a 90 minute training program for a pre-selected organisation. You will need to ensure you have gathered appropriate information about the organization and the trainees to analyse their training and/or career development needs prior to designing the program and developing the materials and evaluation strategy (you WILL NOT be implementing the program but will conduct all the steps necessary for implementation).</p>\n<p><strong>Organisation &amp; Topic</strong>: All groups will be working with the same assigned organisation and the same topic. </p>\n<p><strong>Deliverable</strong>: A 3,000-word (10% over the word limit tolerance) report containing an overview of the organisation and the purpose of the employee development strategy, an evaluation of the current strategy, a needs analysis, a literature, and a proposed new/modified development strategy. A minimum of 15 good quality peer-reviewed articles should form the core of your work with the literature, but this should also be supplemented with high quality practitioner literature, other academic literature and contemporary sources as needed to support your arguments.</p>\n<p><strong>Portfolio Activities</strong>: <strong>Collaborative Portfolio:</strong></p>\n<p>In tutorials, in your collaborative groups your will complete and submit a series of 5 activities - one per week. Portfolio activities will account for 10 of the 45 marks. Portfolio activities will take place, and be submitted during, in tutorials from teaching weeks 4 Week 3 to Week8 (tutorials 3 - 7) that will help you prepare your training and development strategy. Your strategy will focus on building the necessary people capabilities to make that possible. To be effective, T&amp;D must take a hard look at employee capabilities and determine which are the most essential to support the execution of the company’s business. Portfolio activities will assist you in making these decisions and inform you T&amp;D strategy.</p>\n<p><strong>Objectives</strong>:</p>\n<ul>\n<li>Assess students' understanding of instructional design and program evaluation principles and techniques.</li>\n<li>Evaluate students' ability to apply instructional design principles to create effective online training modules.</li>\n<li>To encourage students' creativity and innovation in developing engaging and informative training content.</li>\n<li>Synthesize and critically evaluate existing literature on employee development strategies.</li>\n<li>Communicate findings and recommendations effectively in a professional report format.</li>\n</ul>\n<p>Students are to draw upon the text, the readings on Blackboard and an extensive array of relevant literature from peer-reviewed academic journals relating to employee and organisational development. Please check Blackboard for more information.</p>\n<p><strong>AI Statement:</strong></p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The assignment is to be submitted electronically through  the Blackboard Assessment link.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Final Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>7/06/2025 - 21/06/2025</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Goal:</strong> This assessment will evaluate your understanding and application of the concepts, frameworks, and theories covered in the Human Capital Development course.</p>\n<p><strong>Format:</strong></p>\n<ul>\n<li><strong>Multiple Choice Questions:</strong> The exam will consist of 40 multiple-choice questions covering the following areas:</li>\n<li><strong>Key concepts and theories:</strong> Learning theories, training needs analysis, program design, instructional design, evaluation methodologies, etc.</li>\n<li><strong>Human Capital Development practices:</strong> Strategic human capital management, legal considerations, career development, etc.</li>\n<li><strong>Contemporary issues:</strong> Technological advancements, globalization, diversity and inclusion, sustainability, etc.</li>\n</ul>\n<p><strong>Objectives:</strong></p>\n<ul>\n<li><strong>Demonstrate comprehension:</strong> Accurately recall and apply key concepts, theories, and principles related to Human Capital Development.</li>\n<li><strong>Analyze and interpret information:</strong> Critically evaluate scenarios, case studies, and data related to human capital practices.</li>\n<li><strong>Apply knowledge:</strong> Solve problems and make informed decisions based on course content and real-world scenarios.</li>\n</ul>\n<p><strong><em>AI Statement:</em></strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction to the Course</strong><br><p>Welcome and Introduction to MGTS7611.</p>\n<p>Teaching staff will be introduced, goals and aims of the course addressed, and assessment items and class learning activities will be explained.</p></br></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Introduction to the Course</strong>",
            "topic_description": "Introduction to the Course Welcome and Introduction to MGTS7611. Teaching staff will be introduced, goals and aims of the course addressed, and assessment items and class learning activities will be explained.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong> Introduction &amp; Preliminary Team Formation</strong><br><p>Your tutor will introduce the tutorial program and conduct a workshop for team development. This workshop focuses on enhancing team cohesion and building effective working relationships. Participants will engage in interactive activities designed to foster trust, communication, and collaboration while establishing preliminary team roles and responsibilities.</p></br></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong> Introduction &amp; Preliminary Team Formation</strong>",
            "topic_description": "Introduction & Preliminary Team Formation Your tutor will introduce the tutorial program and conduct a workshop for team development. This workshop focuses on enhancing team cohesion and building effective working relationships. Participants will engage in interactive activities designed to foster trust, communication, and collaboration while establishing preliminary team roles and responsibilities.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction to Organisational &amp; Employee Develpment</strong><br><p>This lecture introduces the key principles of Human Capital Development, emphasizing its strategic importance for organizational success. Participants will engage in activities to further solidify team dynamics, finalize team roles and responsibilities, and develop a shared understanding of the team's goals and objectives.</p></br></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Introduction to Organisational &amp; Employee Develpment</strong>",
            "topic_description": "Introduction to Organisational & Employee Develpment This lecture introduces the key principles of Human Capital Development, emphasizing its strategic importance for organizational success. Participants will engage in activities to further solidify team dynamics, finalize team roles and responsibilities, and develop a shared understanding of the team's goals and objectives.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction to Employee and Organisational Development and Team Finaisation</strong><br/><p>You will participate in a tutor-facilitated workshop and complete activities in your workshop team.</p>\n<p>This tutorial is also the final opportunity to join a team for assessment for the collaborative group assessment.</p></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Introduction to Employee and Organisational Development and Team Finaisation</strong>",
            "topic_description": "Introduction to Employee and Organisational Development and Team Finaisation You will participate in a tutor-facilitated workshop and complete activities in your workshop team. This tutorial is also the final opportunity to join a team for assessment for the collaborative group assessment.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Aligning Employee Development &amp; Strategy</strong><br/><p>This lecture provides a comprehensive overview of Strategic Human Capital Development, exploring its critical role in driving organizational performance. Participants will gain insights into key concepts, best practices, and emerging trends in talent management, with a focus on aligning human capital strategies with overall business objectives.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Aligning Employee Development &amp; Strategy</strong>",
            "topic_description": "Aligning Employee Development & Strategy This lecture provides a comprehensive overview of Strategic Human Capital Development, exploring its critical role in driving organizational performance. Participants will gain insights into key concepts, best practices, and emerging trends in talent management, with a focus on aligning human capital strategies with overall business objectives.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Aligning Employee Development &amp; Strategy</strong><br/><p>You will participate in a tutor-facilitated workshop and complete Portfolio Activity 1 in your collaborative teams. Completed activities must be submitted by the end of tutorial to earn marks.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Aligning Employee Development &amp; Strategy</strong>",
            "topic_description": "Aligning Employee Development & Strategy You will participate in a tutor-facilitated workshop and complete Portfolio Activity 1 in your collaborative teams. Completed activities must be submitted by the end of tutorial to earn marks.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Training Needs Assessment</strong><br/><p>This lecture focuses on the critical process of conducting effective Training Needs Assessments. Participants will learn proven methodologies for identifying skill gaps, analyzing training requirements, and developing targeted training solutions to enhance employee performance and organizational effectiveness.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Training Needs Assessment</strong>",
            "topic_description": "Training Needs Assessment This lecture focuses on the critical process of conducting effective Training Needs Assessments. Participants will learn proven methodologies for identifying skill gaps, analyzing training requirements, and developing targeted training solutions to enhance employee performance and organizational effectiveness.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Training Needs Assessment</strong><br/><p>You will participate in a tutor-facilitated workshop and complete Portfolio Activity 2 in your collaborative teams. Completed activities must be submitted by the end of tutorial to earn marks.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Training Needs Assessment</strong>",
            "topic_description": "Training Needs Assessment You will participate in a tutor-facilitated workshop and complete Portfolio Activity 2 in your collaborative teams. Completed activities must be submitted by the end of tutorial to earn marks.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Learning Theories &amp; Transfer of Training</strong><br/><p>This lecture explores key learning theories and their application in designing and delivering effective training programs. Participants will gain a deeper understanding of how individuals learn, the factors that influence learning transfer, and practical strategies to maximize the application of training content to the workplace.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Learning Theories &amp; Transfer of Training</strong>",
            "topic_description": "Learning Theories & Transfer of Training This lecture explores key learning theories and their application in designing and delivering effective training programs. Participants will gain a deeper understanding of how individuals learn, the factors that influence learning transfer, and practical strategies to maximize the application of training content to the workplace.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Learning Theories &amp; Transfer of Training</strong><br/><p>You will participate in a tutor-facilitated workshop and complete Portfolio Activity 3 in your collaborative teams. Completed activities must be submitted by the end of tutorial to earn marks.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Learning Theories &amp; Transfer of Training</strong>",
            "topic_description": "Learning Theories & Transfer of Training You will participate in a tutor-facilitated workshop and complete Portfolio Activity 3 in your collaborative teams. Completed activities must be submitted by the end of tutorial to earn marks.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Program Design - Traditional &amp; Technological Training Methods</strong><br/><p>This lecture focuses on the principles and practices of effective training program design. Participants will learn a systematic approach to developing and implementing high-quality training programs, including instructional design methodologies, learning objectives development, and the selection and utilization of appropriate training methods and materials.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Program Design - Traditional &amp; Technological Training Methods</strong>",
            "topic_description": "Program Design - Traditional & Technological Training Methods This lecture focuses on the principles and practices of effective training program design. Participants will learn a systematic approach to developing and implementing high-quality training programs, including instructional design methodologies, learning objectives development, and the selection and utilization of appropriate training methods and materials.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Program Design - Traditional &amp; Technological Training Methods</strong><br/><p>You will participate in a tutor-facilitated workshop and complete Portfolio Activity 4 in your collaborative teams. Completed activities must be submitted by the end of tutorial to earn marks.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Program Design - Traditional &amp; Technological Training Methods</strong>",
            "topic_description": "Program Design - Traditional & Technological Training Methods You will participate in a tutor-facilitated workshop and complete Portfolio Activity 4 in your collaborative teams. Completed activities must be submitted by the end of tutorial to earn marks.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Program Evaluation</strong><br/><p>This lecture explores key learning theories and their application in designing and delivering effective training programs. Participants will gain a deeper understanding of how individuals learn, the factors that influence learning transfer, and practical strategies to maximize the application of training content to the workplace.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Program Evaluation</strong>",
            "topic_description": "Program Evaluation This lecture explores key learning theories and their application in designing and delivering effective training programs. Participants will gain a deeper understanding of how individuals learn, the factors that influence learning transfer, and practical strategies to maximize the application of training content to the workplace.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Program Evaluation</strong><br/><p>You will participate in a tutor-facilitated workshop and complete Portfolio Activity 5 in your collaborative teams. Completed activities must be submitted by the end of tutorial to earn marks.</p>\n<p><strong>Good Friday Public Holiday - Friday 18 April 2025 - Check Blackboard for announcements about affected classes.</strong></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Program Evaluation</strong>",
            "topic_description": "Program Evaluation You will participate in a tutor-facilitated workshop and complete Portfolio Activity 5 in your collaborative teams. Completed activities must be submitted by the end of tutorial to earn marks. Good Friday Public Holiday - Friday 18 April 2025 - Check Blackboard for announcements about affected classes.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Organisational Development Frameworks and Models</strong><br/><p>This seminar explores a range of contemporary Organisational Development (OD) frameworks and models, examining their underlying principles and applications. Participants will gain an understanding of how these frameworks can be utilised to diagnose organizational issues, design and implement change initiatives, and foster continuous improvement in organizational performance and effectiveness.</p>\n<p><strong>Good Friday Public Holiday - Friday 18 April 2025 - Check Blackboard for announcements about affected classes.</strong></p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Organisational Development Frameworks and Models</strong>",
            "topic_description": "Organisational Development Frameworks and Models This seminar explores a range of contemporary Organisational Development (OD) frameworks and models, examining their underlying principles and applications. Participants will gain an understanding of how these frameworks can be utilised to diagnose organizational issues, design and implement change initiatives, and foster continuous improvement in organizational performance and effectiveness. Good Friday Public Holiday - Friday 18 April 2025 - Check Blackboard for announcements about affected classes.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Mid-sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In-Semester Break</strong><br/><p>No classes this week.</p></p></div></td>",
            "topic_title": "<strong>In-Semester Break</strong>",
            "topic_description": "In-Semester Break No classes this week.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Organisational Development Frameworks &amp; Models</strong><br/><p>Your tutor will facilitate guided activities for completing case analysis applying Organisational Development frameworks and models.</p>\n<p>You will complete an online module for conducting a case analysis in tutorial. In preparation, ensure you have read and familiarised yourself with the case and the case content.</p></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Organisational Development Frameworks &amp; Models</strong>",
            "topic_description": "Organisational Development Frameworks & Models Your tutor will facilitate guided activities for completing case analysis applying Organisational Development frameworks and models. You will complete an online module for conducting a case analysis in tutorial. In preparation, ensure you have read and familiarised yourself with the case and the case content.",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Organisation Development: Creating Readiness for Change</strong><br/><p>This week's lecture will delve into the critical \"unfreeze\" stage of Lewin's Change Model, emphasizing the necessity of disrupting the existing equilibrium within an organization. We will explore strategies for overcoming resistance to change, such as creating a sense of urgency, building a coalition for change, and effectively communicating a compelling vision for the future that motivates and inspires employees to embrace the impending transformation.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Organisation Development: Creating Readiness for Change</strong>",
            "topic_description": "Organisation Development: Creating Readiness for Change This week's lecture will delve into the critical \"unfreeze\" stage of Lewin's Change Model, emphasizing the necessity of disrupting the existing equilibrium within an organization. We will explore strategies for overcoming resistance to change, such as creating a sense of urgency, building a coalition for change, and effectively communicating a compelling vision for the future that motivates and inspires employees to embrace the impending transformation.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Organisational Development: Creating Readiness for Change</strong><br/><p>Your tutor will facilitate guided activities for completing case analysis applying Organisational Development frameworks and models relevant to Lewin's 'unfreeze' step to initiating a change initiative. You will use the same case as the previous week. Ensure you have familiarised yourself with the case, content, and questions to be addressed. </p>\n<p><br/></p></p><p><strong>Learning outcomes:</strong> L03, L04</p></div></td>",
            "topic_title": "<strong>Organisational Development: Creating Readiness for Change</strong>",
            "topic_description": "Organisational Development: Creating Readiness for Change Your tutor will facilitate guided activities for completing case analysis applying Organisational Development frameworks and models relevant to Lewin's 'unfreeze' step to initiating a change initiative. You will use the same case as the previous week. Ensure you have familiarised yourself with the case, content, and questions to be addressed.",
            "learning_outcomes": [
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Organisational Development: Strategies for Successful Transition</strong><br><p>The focus of this week's lecture will be on the \"change\" stage, where new behaviors, processes, and structures are introduced and implemented within the organization. We will discuss various change management techniques, including employee training programs, coaching initiatives, and the provision of robust support systems to facilitate the transition and ensure the successful adoption of the new approach by all members of the organization.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Organisational Development: Strategies for Successful Transition</strong>",
            "topic_description": "Organisational Development: Strategies for Successful Transition The focus of this week's lecture will be on the \"change\" stage, where new behaviors, processes, and structures are introduced and implemented within the organization. We will discuss various change management techniques, including employee training programs, coaching initiatives, and the provision of robust support systems to facilitate the transition and ensure the successful adoption of the new approach by all members of the organization.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Organisational Development: Strategies for Successful Transition</strong><br/><p>Your tutor will facilitate guided activities for completing case analysis applying Organisational Development frameworks and models relevant to Lewin's 'change' step to initiating a change initiative. You will use the same case as the previous week. Ensure you have familiarised yourself with the case, content, and questions to be addressed. </p></p><p><strong>Learning outcomes:</strong> L03, L04</p></div></td>",
            "topic_title": "<strong>Organisational Development: Strategies for Successful Transition</strong>",
            "topic_description": "Organisational Development: Strategies for Successful Transition Your tutor will facilitate guided activities for completing case analysis applying Organisational Development frameworks and models relevant to Lewin's 'change' step to initiating a change initiative. You will use the same case as the previous week. Ensure you have familiarised yourself with the case, content, and questions to be addressed.",
            "learning_outcomes": [
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Organisational Development: Achieving Long-Term Sustainability</strong><br/><p>This week's lecture will conclude the series by examining the \"refreeze\" stage, where the new state of equilibrium is established and reinforced within the organization. We will explore strategies for solidifying the changes, such as celebrating successes, integrating the changes into the organizational culture, and establishing ongoing monitoring and evaluation mechanisms to ensure the long-term sustainability of the transformation and address any emerging challenges.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Organisational Development: Achieving Long-Term Sustainability</strong>",
            "topic_description": "Organisational Development: Achieving Long-Term Sustainability This week's lecture will conclude the series by examining the \"refreeze\" stage, where the new state of equilibrium is established and reinforced within the organization. We will explore strategies for solidifying the changes, such as celebrating successes, integrating the changes into the organizational culture, and establishing ongoing monitoring and evaluation mechanisms to ensure the long-term sustainability of the transformation and address any emerging challenges.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Organisational Development: Achieving Long-Term Sustainability</strong><br/><p>Your tutor will facilitate guided activities for completing case analysis applying Organisational Development frameworks and models relevant to Lewin's 'refreeze' step to initiating a change initiative. You will use the same case as the previous week. Ensure you have familiarised yourself with the case, content, and questions to be addressed. </p></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Organisational Development: Achieving Long-Term Sustainability</strong>",
            "topic_description": "Organisational Development: Achieving Long-Term Sustainability Your tutor will facilitate guided activities for completing case analysis applying Organisational Development frameworks and models relevant to Lewin's 'refreeze' step to initiating a change initiative. You will use the same case as the previous week. Ensure you have familiarised yourself with the case, content, and questions to be addressed.",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The Future of Employee &amp; Organisational Development</strong><br/><p>This lecture will explore the evolving landscape of employee and organizational development, examining emerging trends such as artificial intelligence, automation, and the gig economy. We will discuss how these forces are shaping the future of work and how organizations can adapt their development strategies to cultivate a high-performing and agile workforce in a rapidly changing environment.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>The Future of Employee &amp; Organisational Development</strong>",
            "topic_description": "The Future of Employee & Organisational Development This lecture will explore the evolving landscape of employee and organizational development, examining emerging trends such as artificial intelligence, automation, and the gig economy. We will discuss how these forces are shaping the future of work and how organizations can adapt their development strategies to cultivate a high-performing and agile workforce in a rapidly changing environment.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Exam Preparation</strong><br/><p>Your tutor will provide important tips for exam preparation, provide sample questions and discuss rationale for answers, and answer student questions.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Exam Preparation</strong>",
            "topic_description": "Exam Preparation Your tutor will provide important tips for exam preparation, provide sample questions and discuss rationale for answers, and answer student questions.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Course Wap Up</strong><br/><p>This lecture will provide a concise overview of the key concepts and theories covered throughout the course. We will also offer valuable advice and strategies for effectively preparing for the upcoming exam, including exam format, key areas of focus, and tips for maximizing your performance.</p></p><p><strong>Learning outcomes:</strong> L02</p></div></td>",
            "topic_title": "<strong>Course Wap Up</strong>",
            "topic_description": "Course Wap Up This lecture will provide a concise overview of the key concepts and theories covered throughout the course. We will also offer valuable advice and strategies for effectively preparing for the upcoming exam, including exam format, key areas of focus, and tips for maximizing your performance.",
            "learning_outcomes": [
                "L02"
            ]
        }
    ]
}