{
    "course_title": "Ethical Issues in Management",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MGTS7607-20079-7520",
    "full_course_code": "MGTS7607-20079-7520",
    "course_code": "MGTS7607",
    "class_code": "20079",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Analyse common ethical dilemmas facing employees and managers in the contemporary business environment, both individually and as part of a team."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate a comprehensive awareness and understanding of major business ethics theories, paradigms and approaches."
        },
        {
            "number": "LO3.",
            "description": "Analyse the factors that influence employee and managerial ethical decision-making."
        },
        {
            "number": "LO4.",
            "description": "Demonstrate knowledge of the practical challenges of managing ethical dilemmas and deviance in the workplace."
        },
        {
            "number": "LO5.",
            "description": "Critically reflect on your own values and behaviours and your role as an agent of positive ethical change."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Case Study Response",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p>The assessments will occur in class during the following weeks: Week 5, Week 7, Week 9, Week 10, Week 11, and Week 12.</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Written",
            "category": "Tutorial/ Problem Set",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Each seminar topic will have a case (and additional material, as required) assigned as a required reading. Students will need to complete the required readings prior to class and attend the seminar to learn additional content (e.g., concepts, theories, models).</p>\n<p><strong>Students are only permitted to use the approved materials (provided at Blackboard and/or in class) to answer the questions. </strong></p>\n<p>This assessment will involve an<strong> individual component </strong>and<strong> a team component </strong>in class:</p>\n<p>First, students will complete a series of questions individually then submit their answers.</p>\n<p>Following this, student teams will receive additional questions and will need to discuss and formulate their answers. Each team must submit their responses within the allocated time.</p>\n<p><strong>Marking</strong></p>\n<p>Each case study response (comprised of individual and team components) will be marked out of 8. <strong>The best five of six marks will count towards students' final grade.</strong></p>\n<p><strong>Team Formation</strong></p>\n<p>Preliminary teams will be formed in class in Weeks 1 and 2 and finalised in Week 4. Students will only be allowed to change teams in exceptional circumstances and with written permission of the course coordinator.</p>\n<p>Each student will complete a peer assessment of their team members' contributions, and these will be used to adjust marks as needed.</p>\n<p><strong>Note: Students must attend class during the first four weeks of the semester to join a team. Week 4 is the final opportunity to join a team. Students who do not attend class and do not provide an adequate reason for their absence accompanied by documentation (e.g., medical certificate) will not be allocated to a team and will receive 0 for the team component of this assessment task.</strong></p>\n<p><strong>AI Statement:</strong></p>\n<p><em>Artificial Intelligence (AI) and Machine Translation (MT) must not be used when preparing for or completing the case responses.</em></p>\n<p><em>Any generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The answers must be submitted in class via the Blackboard Assessment link.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Case Analysis",
            "special_indicators": [],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 9/05/2025 2:00 pm</p></dd>",
            "learning_objectives": "L02, L03, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>In this report, students are required to analyse the factors that can influence unethical behaviour in a work setting and consider how managers can prevent or reduce such behaviours. Specifically, students must choose an example of an organisation in which an episode (or multiple episodes) of unethical behaviour occurred. Students are free to draw on their own experience but they are also welcome to discuss an organisation featured in the media. Students must provide a brief description of the context, key individuals, etc. and the unethical behaviour(s) that occurred. </p>\n<p>Following this, students must identify the key factors that contributed to the unethical behaviour, drawing on the content discussed in the course. It is essential that students draw on evidence from the theoretical and empirical literature to build a convincing argument for the role of their chosen factors. Finally, students must evaluate how the organisation responded and consider how the organisation could have responded more effectively; recommendations (based on scholarly literature) should be included here. <strong>Students must include a minimum of 12 peer-reviewed journal articles as evidence that they are able to draw on appropriate scholarly literature. </strong> The report should be 2500 words in length (+/- 10%). </p>\n<p><strong>AI Statement:</strong></p>\n<p><em>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance.</em></p>\n<p><em>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The report must be submitted through Turnitin located in the Blackboard Assessment link.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Managing Ethical Issues in Future",
            "special_indicators": [],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 10/06/2025 2:00 pm</p></dd>",
            "learning_objectives": "L03, L05",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The purpose of this task is for students to consider how contemporary ethical issues may affect them in their current OR future role in the workplace. In this essay, students should discuss their current or future work position and identify one major ethical issue that they have faced, or will likely face, in their role. Students are free to choose an issue related to those discussed in the course (e.g., discrimination, sexual harassment, advertising ethics, cross-cultural ethical decision-making, corporate social responsibility, whistle-blowing, etc.) or choose one from the scholarly literature. In the essay, students should provide:</p>\n<ol>\n<li>A summary of the ethical issue, with a focus on recent research and examples </li>\n<li>A justification for why the issue is relevant to their work position  </li>\n<li>The challenges or difficulties associated with managing the issue</li>\n<li>An action plan for the future, based on learnings from the course and academic research</li>\n</ol>\n<p>Evidence from the academic literature will be required. The essay should be approximately 1300 words in length (+/- 10%). </p>\n<p><strong>AI Statement:</strong></p>\n<p><em>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance.</em></p>\n<p><em>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The essay must be submitted through Turnitin located in the Blackboard Assessment link.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction to Business Ethics </strong><br/><p>In this seminar we will discuss the structure and content of the course and the learning objectives. We will also consider the nature of ethics; approaches to ethical decision-making; and define business ethics. We will also further consider the importance of identifying one's personal values and how to create an individual ethical code.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Introduction to Business Ethics </strong>",
            "topic_description": "Introduction to Business Ethics In this seminar we will discuss the structure and content of the course and the learning objectives. We will also consider the nature of ethics; approaches to ethical decision-making; and define business ethics. We will also further consider the importance of identifying one's personal values and how to create an individual ethical code.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Contemporary Business Ethics </strong><br/><p>In this seminar we will discuss the contemporary landscape of business ethics and students will have the opportunity to form teams for the case-based assessments.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L05</p></div></td>",
            "topic_title": "<strong>Contemporary Business Ethics </strong>",
            "topic_description": "Contemporary Business Ethics In this seminar we will discuss the contemporary landscape of business ethics and students will have the opportunity to form teams for the case-based assessments.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Unethical Behaviour at Work</strong><br/><p>Managers and subordinates frequently encounter unethical behaviour in work settings, which in turn can have negative implications for stakeholders. In this seminar, we will consider the types of unethical behaviour that can occur in organisations; why employees sometimes choose to engage in these behaviours; and how to manage and prevent unethical behaviour. We will also work through the case study.</p>\n<p><strong>This week is the final opportunity to join a team for the case study response assessment task. </strong></p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Unethical Behaviour at Work</strong>",
            "topic_description": "Unethical Behaviour at Work Managers and subordinates frequently encounter unethical behaviour in work settings, which in turn can have negative implications for stakeholders. In this seminar, we will consider the types of unethical behaviour that can occur in organisations; why employees sometimes choose to engage in these behaviours; and how to manage and prevent unethical behaviour. We will also work through the case study. This week is the final opportunity to join a team for the case study response assessment task.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Responses to Unethical Behaviour at Work</strong><br/><p>When employees encounter unethical behaviour in their organisation, they can respond in a variety of ways. In this seminar, we will discuss the nature, determinants and consequences of these responses, including silence, disclosure to others, confrontation, informal and formal whistle-blowing, and exiting the organisation. We will also work through the case study.</p>\n<p><strong>As this is an assessment week, students must submit their case study responses in class.</strong></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Responses to Unethical Behaviour at Work</strong>",
            "topic_description": "Responses to Unethical Behaviour at Work When employees encounter unethical behaviour in their organisation, they can respond in a variety of ways. In this seminar, we will discuss the nature, determinants and consequences of these responses, including silence, disclosure to others, confrontation, informal and formal whistle-blowing, and exiting the organisation. We will also work through the case study. As this is an assessment week, students must submit their case study responses in class.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Giving Voice to Values</strong><br/><p>Giving Voice to Values (GVV) is a post-decision-making approach to ethical dilemmas and asks the question: \"Once I know how I want to respond, what is the best way to act on my values and try to achieve an effective outcome?\" In this seminar we will discuss core tenets of the GVV approach and students will apply major concepts by working through reflection questions and scenarios in teams.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Giving Voice to Values</strong>",
            "topic_description": "Giving Voice to Values Giving Voice to Values (GVV) is a post-decision-making approach to ethical dilemmas and asks the question: \"Once I know how I want to respond, what is the best way to act on my values and try to achieve an effective outcome?\" In this seminar we will discuss core tenets of the GVV approach and students will apply major concepts by working through reflection questions and scenarios in teams.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Equal Opportunity and Discrimination</strong><br/><p>In this seminar we will discuss the importance of equal opportunity and discrimination in organisations. We will also work through the case study.</p>\n<p><strong>As this is an assessment week, students must submit their case study responses in class.</strong></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Equal Opportunity and Discrimination</strong>",
            "topic_description": "Equal Opportunity and Discrimination In this seminar we will discuss the importance of equal opportunity and discrimination in organisations. We will also work through the case study. As this is an assessment week, students must submit their case study responses in class.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong> Stakeholders and Professional Ethics</strong><br/><p>In this seminar we will discuss the importance of stakeholders and professional ethics. We will also work through the case study.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong> Stakeholders and Professional Ethics</strong>",
            "topic_description": "Stakeholders and Professional Ethics In this seminar we will discuss the importance of stakeholders and professional ethics. We will also work through the case study.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Mid-sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In-Semester Break</strong><br/></p></div></td>",
            "topic_title": "<strong>In-Semester Break</strong>",
            "topic_description": "In-Semester Break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>CSR and The Environment</strong><br/><p>In this seminar we will discuss the importance of Corporate Social Responsibility (CSR) and especially protection of the natural environment as part of business practices in the 21st century. We will also work through the case study.</p>\n<p><strong>As this is an assessment week, students must submit their case study responses in class.</strong></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>CSR and The Environment</strong>",
            "topic_description": "CSR and The Environment In this seminar we will discuss the importance of Corporate Social Responsibility (CSR) and especially protection of the natural environment as part of business practices in the 21st century. We will also work through the case study. As this is an assessment week, students must submit their case study responses in class.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Advertising Ethics</strong><br/><p>In this seminar we will discuss the role of ethics and ethical decision-making in advertising, especially protection of consumer rights. We will also work through the case study.</p>\n<p><strong>As this is an assessment week, students must submit their case study responses in class.</strong></p>\n<p><strong>This class will be rescheduled due to the Labour Day public holiday. Please see Blackboard for details.</strong></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Advertising Ethics</strong>",
            "topic_description": "Advertising Ethics In this seminar we will discuss the role of ethics and ethical decision-making in advertising, especially protection of consumer rights. We will also work through the case study. As this is an assessment week, students must submit their case study responses in class. This class will be rescheduled due to the Labour Day public holiday. Please see Blackboard for details.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Leadership and Corporate Culture</strong><br/><p>In this seminar we will discuss the importance of ethical leadership and creating an ethical organisational culture. We will also work through the case study. </p>\n<p><strong>As this is an assessment week, students must submit their case study responses in class.</strong></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Leadership and Corporate Culture</strong>",
            "topic_description": "Leadership and Corporate Culture In this seminar we will discuss the importance of ethical leadership and creating an ethical organisational culture. We will also work through the case study. As this is an assessment week, students must submit their case study responses in class.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>International Business Ethics</strong><br/><p>In this seminar we will discuss what it means to operate as an ethical professional in the global business environment. We will also work through the case study.</p>\n<p><strong>As this is an assessment week, students must submit their case study responses in class.</strong></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>International Business Ethics</strong>",
            "topic_description": "International Business Ethics In this seminar we will discuss what it means to operate as an ethical professional in the global business environment. We will also work through the case study. As this is an assessment week, students must submit their case study responses in class.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Course Review and Future Challenges</strong><br/><p>The final seminar will include a discussion of major learnings from the course and some of the major ethical issues facing managers in future. We will also work through the case study. </p>\n<p><strong>This seminar is the final opportunity for deferred case study response submission.</strong></p></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L05</p></div></td>",
            "topic_title": "<strong>Course Review and Future Challenges</strong>",
            "topic_description": "Course Review and Future Challenges The final seminar will include a discussion of major learnings from the course and some of the major ethical issues facing managers in future. We will also work through the case study. This seminar is the final opportunity for deferred case study response submission.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L05"
            ]
        }
    ]
}