{
    "course_title": "Music Industry Engagement",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MUSC3910-21470-7520",
    "full_course_code": "MUSC3910-21470-7520",
    "course_code": "MUSC3910",
    "class_code": "21470",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate understanding of and ability to apply relevant practices and protocols in inter-cultural music making."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate capacity to create music in inter-cultural contexts, through collaborative, compositional and/or improvisational skills."
        },
        {
            "number": "LO3.",
            "description": "Demonstrate skills in communication, creativity and networking in the context of curated music events and opportunities."
        },
        {
            "number": "LO4.",
            "description": "Understand and critically reflect on concepts and issues relevant to inter-cultural music making."
        },
        {
            "number": "LO5.",
            "description": "Understand the role and value of diverse voices and backgrounds within the music industry."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Record Label Fundamentals Quiz",
            "special_indicators": [],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p> 10/03/2025 - 14/03/2025</p>\n<p>\n</p><p><em>Not a submissible item. </em>The Quiz will be completed online within a 90-minute timeframe. </p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This Quiz will assess a foundational knowledge of label practices and processes. Questions and answers will be mainly drawn from readings and other learning content from Weeks 1-3. The Quiz will be completed online within a specified date range, and time-limited to 90 minutes.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The Quiz will be completed online within a 90-minute timeframe. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Release Plan",
            "special_indicators": [],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 2/05/2025 5:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Create a release plan for a hypothetical EP or Album release - it may be your own project or a fictional project. In consideration of its style, format, and target audience, complete a comprehensive release plan.</p>\n<p>The plan should consist of two documents based on templates provided via Blackboard:</p>\n<p> </p>\n<p><strong>1) A Release Plan Document</strong></p>\n<p> This is a working document which sets out all relevant details of the release plan, with room for descriptive or strategic information.</p>\n<p> </p>\n<p><strong>2) A Release Schedule Document</strong></p>\n<p> This document is a Gantt-chart-based schedule, setting out important dates and tasks. It should be consistent with any dates in the Release Plan document and give a comprehensive birds-eye-view of the release process.</p>\n<p> </p>\n<p>Templates and example cases will be provided on Blackboard. You may edit the template documents as much as you wish, including altering the structure where you feel it is sensible to do so. Consider the two documents as inter-dependent; you may find you need to go back and forth between them in order to settle into a solid release schedule.</p>\n<p> </p>\n<p><strong>Task Constraints</strong></p>\n<p>While a completely fictional release plan is permitted, it must be situated in current reality and bound by realistic constraints. For example:</p>\n<p> - Your budget cannot be unlimited - if total costs exceed $2000, you must include some explanation of where the money is to come from for each stage.</p>\n<p> - You may consider boosting your budget with government grants, crowd-funding, or other fund-raising strategies, provided that these are accounted for in the release plan with regard to timing and the work required to undertake such strategies.</p>\n<p> - Your schedule must not exceed a total period of two years.</p>\n<p> - Any major showcase opportunities (e.g. BIGSOUND, AusMusic Month, Festivals, etc) or media relationships (e.g. 4ZZZ, TripleJ Unearthed, Local Blogs and Press) must be real events and organisations - fictional showcases, media outlets, or organisations are not permitted.</p>\n<p> - If using a fictional artist, they should be considered to be at the early stages of their career - i.e. they have not attained international fame, have no major label ties, and have modest resources at their disposal.</p>\n<p>- The plan must not depend on anything unlikely to occur in reality, e.g. \"winning a competition to have your album produced by Rick Rubin\", or \"randomly meeting Vera Blue on a plane flight and convincing her to contribute vocals\" cannot be a part of your release plan.</p>\n<p> - Your release plan should be achievable by the artist(s) themselves; any work contributed by additional personnel must be accounted for. E.g. if someone is to design an album cover or edit videos, they must either be paid a reasonable fee, or have other clear incentives to contribute their time and effort.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via Blackboard</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Work Journal and Portfolio",
            "special_indicators": [],
            "weighting": "<dd>60%</dd>",
            "due_date": "<dd><p> 9/06/2025 5:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Notebook/ Logbook, Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Present a work journal and portfolio compiling your reflections and work outcomes from your time with the label.</p>\n<p><strong>Your Submission Must Include:</strong></p>\n<ul>\n<li>At least six (6) journal entries documenting the experience of working with the record label, including a final reflection on your experience as a whole.</li>\n<li>A portfolio of work completed for the label during the semester including between one (1) and five (5) items presented across no more than ten (10) A4 pages.</li>\n</ul>\n<p><strong>Journal Entries</strong></p>\n<p>Journal entries should be dated at intervals throughout the semester, and may include your observations on day-to-day operations, hypotheses on outcomes, and things you have learned. Entries should be reflective in nature and tailored to an insider audience - i.e. there is no need to explain in detail how the label operates or what the releases are; you may assume this context is known. The writing style needn't be scholarly, but should be clear and specific, and free from offensive language or comments. Students should aim to demonstrate openness to new ideas and processes, a willingness to view situations from a range of perspectives, and a positive attitude.</p>\n<p>Your submission must include a final entry which presents a reflective evaluation of the experience of the course as a whole.</p>\n<p>The journal portion of your submission must include at least six (6) entries and total between 2000 and 2500 words.</p>\n<p>If the journal entries kept throughout the semester exceed the word limit, students may present edited versions or a curated selection of entries for the purpose of this assessment.</p>\n<p><strong>Portfolio Items</strong></p>\n<p>The portfolio portion of your submission showcases the tangible outcomes of your time with Corella Recordings. Your submission may include between one (1) and five (5) items. These may include:</p>\n<ul>\n<li>Written promotional copy (e.g. an artist bio or press release)</li>\n<li>Website news article/blog post</li>\n<li>Social media copy</li>\n<li>Images or graphics created for the label</li>\n<li>Spreadsheets, databases, or other documents (e.g. media contact database for a particular release)</li>\n<li>Audio files created for the label</li>\n<li>Video files created for the label</li>\n<li>Website pages</li>\n</ul>\n<p>The collated portfolio items may not exceed ten (10) A4 pages of the submitted document*. If a student has more than five (5) eligible portfolio items or items totalling more than 10 pages, they may present edited versions or a curated selection for the purpose of this assessment.</p>\n<p>*For audio files or video files, an attached file or link to the file on cloud storage may be provided. For the sake of the page limit, we will consider each audio or video item as one (1) page counting toward the total.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via Blackboard</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Weekly Readings and Online Resources</strong><br><p>Students will be provided with weekly online learning materials to complement their work, and equip them with core knowledge required for effective participation.</p></br></p></div></td>",
            "topic_title": "<strong>Weekly Readings and Online Resources</strong>",
            "topic_description": "Weekly Readings and Online Resources Students will be provided with weekly online learning materials to complement their work, and equip them with core knowledge required for effective participation.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Independent and collaborative work</strong><br><p>Students will commit non-contact time to assigned label duties, communication and collaboration via online teamwork platforms, and written assessments.</p></br></p></div></td>",
            "topic_title": "<strong>Independent and collaborative work</strong>",
            "topic_description": "Independent and collaborative work Students will commit non-contact time to assigned label duties, communication and collaboration via online teamwork platforms, and written assessments.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Team Meeting</strong><br/><p>Each week, our team will gather for a 2-hour team meeting. During these sessions students will learn and discuss important concepts related to music releases, participate in label planning, and benefit from guest lecturers and presenters.</p>\n<p><br/></p>\n<p>Meetings are not scheduled during the School of Music Project Week.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Team Meeting</strong>",
            "topic_description": "Team Meeting Each week, our team will gather for a 2-hour team meeting. During these sessions students will learn and discuss important concepts related to music releases, participate in label planning, and benefit from guest lecturers and presenters. Meetings are not scheduled during the School of Music Project Week.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Co-working Sessions</strong><br><p>Students will meet in the computer lab once a week to discuss content, receive briefings and delegations, and work collaboratively on label-related activities.</p>\n<p><br/></p>\n<p>Co-working sessions are not scheduled during the School of Music Project Week.</p></br></p></div></td>",
            "topic_title": "<strong>Co-working Sessions</strong>",
            "topic_description": "Co-working Sessions Students will meet in the computer lab once a week to discuss content, receive briefings and delegations, and work collaboratively on label-related activities. Co-working sessions are not scheduled during the School of Music Project Week.",
            "learning_outcomes": []
        }
    ]
}