{
    "course_title": "Multi-Instrumental Pedagogy 1",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MUSC3840-21467-7520",
    "full_course_code": "MUSC3840-21467-7520",
    "course_code": "MUSC3840",
    "class_code": "21467",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate the development of musicianship and performance skills as required in specific educational settings"
        },
        {
            "number": "LO2.",
            "description": "Demonstrate an understanding of issues surrounding repertoire selection for educational purposes"
        },
        {
            "number": "LO3.",
            "description": "Demonstrate basic accompanying skills on keyboard (while singing where appropriate)"
        },
        {
            "number": "LO4.",
            "description": "Select musical material suitable for the specific classroom combinations/ensembles/year levels discussed. This may include music composed or arranged by the student"
        },
        {
            "number": "LO5.",
            "description": "Participate in a string ensemble or small concert band"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Written Folio and resources",
            "special_indicators": [],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 11/04/2025 5:00 pm</p></dd>",
            "learning_objectives": "L02, L04",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Portfolio and Resources </strong></p>\n<p>Task Description:</p>\n<p>Create a Portfolio of written document/s and resources in the instrument tutorial which is not your original specialisation.  </p>\n<p>You will write a report and compile resources for<strong> one instrumental area </strong>that does not include your main instrument.</p>\n<p> eg.  String players will choose Wind/Brass </p>\n<p>       Keyboard players may choose Wind/Brass OR Strings</p>\n<p>       Wind/Brass player will choose Strings</p>\n<p>Length: 1,000 words</p>\n<p>Learning Objectives Assessed: 2, 4</p>\n<p>Due Date: Week 7</p>\n<p>Weight: Total 20%</p>\n<p>  </p>\n<p><strong>Wind / Brass Instruments</strong></p>\n<p><strong>The portfolio and resources</strong> is a compilation of <strong>scholarly </strong>sources (books, chapters, journal articles, dictionary entries), teaching tools, useful website links that are specific for the instruments being learned. You will respond to each resource with a discussion of its use in the teaching of your instrument. Provide a summary explaining possible application in classroom teaching. This will form the basis of practical resources for teaching in the field, in the context of teaching the instrument or teaching about the instrument in the classroom. Appropriate acknowledgement of authors and composers must be in APA style.  </p>\n<p>A most important skill for a music student is how to practise effectively. Keep a record of your practice and write a short summary at the end of the week with conclusions drawn from your practice records. The goal is to have a clear idea of what to expect in the future from your student’s practice, and effective methods for them to use. It should include an overall reflection on practice technique and materials used. In this reflection the effectiveness or ineffectiveness of certain practice models and methods should be evident. Evidence of research into practice techniques is important in this submission.</p>\n<p>This will form the basis of practical resources for teaching in the field, in the context of teaching the instrument or teaching about the instrument in the classroom. Appropriate acknowledgement of authors and composers must be in APA style. </p>\n<p>All items of assessment should be accompanied by a School of Music coversheet (these are available in hard copy from the School Office or as a download from the School of Music Website); coversheets must include the signed declaration on the originality of work contained in the assessment.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via Turnitin.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Performance - Strings, Wind/Brass, Keyboard",
            "special_indicators": [],
            "weighting": "<dd>40% (20% per instrument) </dd>",
            "due_date": "<dd><p> 23/05/2025 5:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L05",
            "mode": "Activity/ Performance",
            "category": "Practical/ Demonstration",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Instruments students will learn will be decided by the tutor and course coordinator</strong>.</p>\n<p> </p>\n<p><strong>Due Date: Week 12 - </strong>The performance task will be video submission and uploaded via Blackboard for each instrument. </p>\n<p> PLEASE NOTE it is <strong>YOUR</strong> responsibility to be sure that the uploaded material is in a format accessible by your lecturer.</p>\n<p> </p>\n<p><strong>Performance Task</strong></p>\n<p>  </p>\n<p><strong>Wind / Brass </strong></p>\n<p>Students are required to demonstrate the development of their instrumental skills as part of the course. Development is reflected in the student’s ability to hone their instrumental technique and ensemble skills, with relevance to an educational context. Practical performance involving learning a new instrument <strong>(The instruments students learn is decided by the tutor and course coordinator</strong>).</p>\n<p>Students should also be able to demonstrate appropriate repertoire selection for a school student at the end of their first year of playing. Your tutors may recommend the appropriate level of pieces you should perform, given your background and instrumental experience.</p>\n<p> </p>\n<p>Task sheet will be available week 2 of the course.</p>\n<p> </p>\n<p><strong>Strings</strong></p>\n<p>Students are required to demonstrate the development of their instrumental skills as part of the course. Development is reflected in the student’s ability to hone their instrumental technique with relevance to an educational context. They should also be able to demonstrate appropriate repertoire selection for a school student at the end of their first year of playing. Your tutors may recommend the appropriate level of pieces you should perform, given your background and instrumental experience. </p>\n<p>Task sheet will be available week 2 of the course.</p>\n<p>Instrumental Skills include (but are not limited to):</p>\n<ul>\n<li>Bowing technique, articulation, slide technique, sticking technique, fingering positions, written ranges, posture, tuning/intonation, maintenance of the instrument and effective sounding ranges including those of the young/developing player.</li>\n<li>Practical performance involving learning a new instrument <strong>(instruments students will learn will be decided by the tutor and course coordinator</strong>).</li>\n</ul>\n<p><br/></p>\n<p><strong>Keyboard </strong></p>\n<p>Students are required to demonstrate the development of their instrumental skills as part of the course. Development is reflected in the student’s ability to hone their instrumental technique and ensemble skills, with relevance to an educational context. They should also be able to demonstrate appropriate repertoire selection for a school student at the end of their first year of playing. Your tutors may recommend the appropriate level of pieces you should perform, given your background and instrumental experience. </p>\n<p>Task sheet will be available week 2 of the course.</p>\n<p>Keyboard skills include (but not limited too)</p>\n<p><em>Technical</em></p>\n<ul>\n<li>Choral warm up</li>\n<li>A simple, harmonised melodic pattern ascending chromatically each repetition until one octave is covered</li>\n<li>Chord progressions</li>\n<li>Three chord progressions chosen from given selection</li>\n<li>Each performed twice in opposite modes (i.e. major/minor) and in different keys</li>\n<li>Each of the three progressions must begin on a different inversion in the right hand.</li>\n</ul>\n<p><em>Repertoire</em></p>\n<ul>\n<li>One solo piece at AMEB Grade 1 standard</li>\n<li>Piece to be selected from AMEB syllabus (any series)</li>\n<li>Not required to be from memory</li>\n<li>One song accompaniment (from a lead sheet) plus portion in a different key</li>\n<li>A semi-improvised (i.e. non-noted) accompaniment constructed from the chord's symbols on a lead sheet</li>\n<li>Additionally, one section (i.e. verse or chorus) to be played in a different key</li>\n<li>The performance should represent the student's ability and should display a high artistic standard regardless of level of difficulty.</li>\n</ul>\n<p><br/></p>\n<p>This assessment task is to be completed in-person. The use of Artificial Intelligence (AI) tools will not be permitted. Any attempted use of AI may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The performance task will be a video submission and uploaded via Blackboard for each instrument.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Instrumental Music Teaching Research Assignment",
            "special_indicators": [],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 30/05/2025 5:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Research Assignment</strong></p>\n<p>Choose one of the following topics and write a 1200 word assignment addressing the main issues surrounding that topic. Being a <strong>research assignment</strong> all ideas presented (even ones with which you agree and which may have emerged from your own thinking) must be supported academically, acknowledged and appropriately referenced. As soon-to-be-educators who are expected to model best practice, the quality of your expression is an important aspect in this submission.</p>\n<p><br/></p>\n<p><strong>Topic One</strong></p>\n<p>Preamble: Many instrumental teachers accept responsibility for teaching tone and technique, and possibly attendant skills such as rhythm and notation. Yet they see the teaching of theory as the responsibility of other teachers. Consequently many players have a very limited understanding of the theory of music that underpins the music they play.</p>\n<p>Topic: Write an account which develops a rationale for the inclusion of theoretical knowledge for the instrumental student. Provide a list of engaging and effective resources and appropriate strategies for teaching theory during the instrumental lessons. Provide a brief overview of what theoretical knowledge is appropriate for each stage of instrumental instruction.</p>\n<p><br/></p>\n<p><strong>Topic Two</strong></p>\n<p>Preamble: While improvisation is generally considered the province of the jazz musician, and not expected of the mainstream player, there are others who consider improvisation to be a significant tool in the development of the young musician. Similarly, many see composing as the province of the experienced musician, while others see it as a process that is beneficial to even the youngest of players.</p>\n<p>Topic: Write an account which provides a rationale for the inclusion of improvisation/composition in the learning experiences of young musicians. What are strategies and techniques that an instrumental teacher (who themselves may not feel competent in these areas) can utilise in the instrumental studio?</p>\n<p><br/></p>\n<p><strong>Topic Three</strong></p>\n<p>Preamble: Many teachers lament the removal of specific aural requirements from the school music curriculum. They feel that aural skills are foundational skills for the musician, and of specific benefit to the performer.</p>\n<p>Topic: Write an account which develops a rationale for the inclusion of aural skill development for the instrumental student, and explore ways in which such training can occur within the context of instrumental teaching, where time and opportunity can be limited.</p>\n<p><br/></p>\n<p><strong>Topic Four</strong></p>\n<p>Preamble: Students learn instruments for a variety of reasons, and various vested interests desire different outcomes. In a school the headmaster may want people to learn so the school can have good ensembles which showcase their program; parents may want the student to have fun; class music teachers may want good exam results; the ensemble director may want lovely tone.</p>\n<p>Topic: From the perspective of music education itself, write an account which provides a rationale for the inclusion of non-instrument centered activities and evaluates the various outcomes in what might be considered \"good music teaching\". Consider such outcomes as good technique; developing musicality; underpinning theoretical knowledge; developing aural skills; music reading skills; contextual knowledge; developing creativity. Discuss what is it the instrumental teacher’s responsibility to develop the<em> instrumentalist</em> or to develop the <em>musician</em>, and how might an appropriate balance be achieved.</p>\n<p><br/></p>\n<p><strong>Topic Five</strong></p>\n<p>Preamble: <em>For the musician self-expression is wonderful but self-discipline is AMAZING. </em>Many students do not succeed, or even persist, in instrumental instruction because they lack the discipline to practice and consequently lose interest. Parents often fail to support their children to engage in instrumental learning and allow them to discontinue lessons.</p>\n<p>Topic: Write an account that addresses issues of student motivation and engagement especially in the early years. How can a teacher assist the student to remain highly engaged while also accepting the routine and discipline of practice?</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via TurnItIn.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorials</strong><br><p>You will attend two tutorials a week, in two different instrument groups. Learning activities will be practical in nature, focusing on the learning of an unfamiliar orchestral instrument, and/or keyboard in preparation for accompanying in a classroom/school environment. This will include tutorials on such topics as: Setting up and caring for the instruments Embouchure or tone production Correct posture, finger/hand positions, bow holds etc Repertoire selection.</p>\n<p><br/></p>\n<p>Please note tutorials are not scheduled during the School of Music Project Week. </p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Tutorials</strong>",
            "topic_description": "Tutorials You will attend two tutorials a week, in two different instrument groups. Learning activities will be practical in nature, focusing on the learning of an unfamiliar orchestral instrument, and/or keyboard in preparation for accompanying in a classroom/school environment. This will include tutorials on such topics as: Setting up and caring for the instruments Embouchure or tone production Correct posture, finger/hand positions, bow holds etc Repertoire selection. Please note tutorials are not scheduled during the School of Music Project Week.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}