{
    "course_title": "Museums: Theory and Practice",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MUSM7000-21657-7520",
    "full_course_code": "MUSM7000-21657-7520",
    "course_code": "MUSM7000",
    "class_code": "21657",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Be conversant with the interdisciplinary nature of museology"
        },
        {
            "number": "LO2.",
            "description": "Discuss and reflect on the historical context of museums and galleries"
        },
        {
            "number": "LO3.",
            "description": "Evaluate and debate the contemporary role of museums and galleries"
        },
        {
            "number": "LO4.",
            "description": "Articulate key theoretical approaches to the functions of museums and galleries"
        },
        {
            "number": "LO5.",
            "description": "Analyse case studies to compare different approaches to museums and galleries"
        },
        {
            "number": "LO6.",
            "description": "Collaborate with others to investigate and present a proposal engaging with contemporary issues in museums"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Assessment 1: Participation on discussion board",
            "special_indicators": [],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 29/05/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Participation/ Student contribution",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students must post on a minimum of <strong>12 separate readings</strong> to pass this assessment. Each reading response counts as one response.</p>\n<p>If you post once but include two responses to two different texts this counts as 2 postings.</p>\n<p>Using the Discussion Board on the course Blackboard site students post a few sentences (50-75 words) about each of the required readings for each weekly topic from week 1 to week 12. Students must post ideally on the required readings BEFORE the seminar for which they are set.</p>\n<p>In your post you should say what you think the key arguments of the reading are. You can add your own opinion about the reading, its style and content.</p>\n<p>The purpose of this assessment is to become fluent in critical reading and to learn key theories in museum studies. These readings can also be used to build your essay assessment.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>Use of AI: </strong>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Using the Discussion Board on the course Blackboard site students post a few sentences (50-75 words) about each of the required readings for each weekly topic from week 1 to week 12. Students must post ideally on the required readings BEFORE the seminar for which they are set.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Assessment 2: Object Biography",
            "special_indicators": [],
            "weighting": "<dd>35%</dd>",
            "due_date": "<dd><p> 27/03/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Write a 1200-word biography of a museum object of your choice. You can choose from any museum online or from the campus museums <strong>excluding </strong>the following objects which you should<strong> not </strong>use for your essay; <strong>the Elgin marbles, Benin bronzes, Rosetta stone, anything from the Summer Palace Beijing,  jewels of Helen; Macquarie chest, any item in the Encounters exhibition.</strong></p>\n<p>When writing the essay think about the object’s materials and form and what it tells us, its history, including its contemporary relevance, and its life before and after it entered the museum. It might be that there are large parts of your objects biography that are undocumented so you can say this and focus on those moments that are known.</p>\n<p>You should draw on relevant contextual literature drawn from the course reading lists and your own object specific research, and include at least one figure. The essay should be structured with a clear introduction and conclusion, and a bibliography (the bibliography is separate from the word count). References should follow one consistent style.</p>\n<p>State your essay word count excluding the bibliography on the title page of your submitted essay.</p>\n<p>References should be included in the essay, text NOT as foot or end notes, as author and date of publication e.g. (Smith;1920). If you are quoting from the author then include the page number where the quote occurs. E.g. (Smith 1920;21).</p>\n<p>The total mark will be translated into a percentage and therefore marked out of 100. Your mark will appear in the Blackboard grade centre as out of 35% and out of 7 as your grade.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>Use of AI: </strong>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Assessment 3: Research Essay",
            "special_indicators": [],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 29/05/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Write a 2,700 word research essay, based on one of the essay topics, focusing on critical issues in museum history, theory and/or practice. Your essay should be structured with an introduction contextualising your argument and approach, literature review, examples to illustrate your argument, analysis, and a conclusion. You should draw on museum studies literature, include case studies (ideally based on first-hand experience), and place these within a critical context. You may choose to integrate your own material, including images, into the essay. Full bibliography is required and consistent referencing throughout (Bibliography is not included in word count). </p>\n<p>The criteria outlined in the rubric will be graded out of a total 100 marks. The mark will then be translated into a percentage.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>Use of AI: </strong>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1:  Introduction: Museum Theory and practice</strong><br/><p>This introductory session will be online only. It will provide an overview of the course. It will set out the expectations of the course, the weekly format, and the course requirements for the semester.</p>\n<p>The introductory lecture considers the many facets of the contemporary museum.</p>\n<p>Readings/Ref: Blackboard</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Week 1:  Introduction: Museum Theory and practice</strong>",
            "topic_description": "Week 1:  Introduction: Museum Theory and practice This introductory session will be online only. It will provide an overview of the course. It will set out the expectations of the course, the weekly format, and the course requirements for the semester. The introductory lecture considers the many facets of the contemporary museum. Readings/Ref: Blackboard",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2:  The Formation of the Museum</strong><br/><p>What is a museum? What is the role of a museum? This class is an in person class as is the rest of semester.<br/>Over the past two centuries the concept of the museum has changed dramatically. In this session we examine its development in relation to the changing roles of the state and the public and to the rise of consumption and the department store. The session explores different museum models which may challenge, and transcend conventional definitions of museums today and the origins of collecting.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Week 2:  The Formation of the Museum</strong>",
            "topic_description": "Week 2:  The Formation of the Museum What is a museum? What is the role of a museum? This class is an in person class as is the rest of semester. Over the past two centuries the concept of the museum has changed dramatically. In this session we examine its development in relation to the changing roles of the state and the public and to the rise of consumption and the department store. The session explores different museum models which may challenge, and transcend conventional definitions of museums today and the origins of collecting.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong> Week 3 content: The Social Lives of objects</strong><br><p>What is an object? Do museums need objects and do objects need museums? In this session we will begin thinking critically and creatively about objects in the museum. Objects have been said to have social lives, just as people do but what does that mean? A complete biography is critical to a museum's objects value. We will explore ideas about objects, biographies and histories in museums, and introduce some material culture theory that helps us critically analyse the relationships between people and objects.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong> Week 3 content: The Social Lives of objects</strong>",
            "topic_description": "Week 3 content: The Social Lives of objects What is an object? Do museums need objects and do objects need museums? In this session we will begin thinking critically and creatively about objects in the museum. Objects have been said to have social lives, just as people do but what does that mean? A complete biography is critical to a museum's objects value. We will explore ideas about objects, biographies and histories in museums, and introduce some material culture theory that helps us critically analyse the relationships between people and objects.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4 content:  The Transformational Museum</strong><br/><p>This session explores the way that objects are interpreted and can be transformed in meaning by the museum through their exhibition and curation. We do this by investigating theories about the way the museum can change the meaning of objects, especially through exhibitions.</p>\n<p>The history of the museum is also an architectural history. The architectural space of the museum entails a spatial ordering of knowledge, bodily movements, experiences and perceptions. In contrast to the supposed neutrality of the 'white cube' gallery, a new generation of architects see the museum building as integral to the museum's 'programme' and as a dynamic aspect of the visitor experience.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Week 4 content:  The Transformational Museum</strong>",
            "topic_description": "Week 4 content:  The Transformational Museum This session explores the way that objects are interpreted and can be transformed in meaning by the museum through their exhibition and curation. We do this by investigating theories about the way the museum can change the meaning of objects, especially through exhibitions. The history of the museum is also an architectural history. The architectural space of the museum entails a spatial ordering of knowledge, bodily movements, experiences and perceptions. In contrast to the supposed neutrality of the 'white cube' gallery, a new generation of architects see the museum building as integral to the museum's 'programme' and as a dynamic aspect of the visitor experience.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5: Museums as colonialism</strong><br/><p>A multitude of older museums are both artefacts of colonialism and colonising in their remit and operations. Until recently this was a hidden dimension of art museums though anthropology especially were deemed culpable institutions with historically inequitable and exploitive collecting practices. In this session we explore the colonial roots of museums and systems of collecting and the implications that these have for museums in the 21st century.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Week 5: Museums as colonialism</strong>",
            "topic_description": "Week 5: Museums as colonialism A multitude of older museums are both artefacts of colonialism and colonising in their remit and operations. Until recently this was a hidden dimension of art museums though anthropology especially were deemed culpable institutions with historically inequitable and exploitive collecting practices. In this session we explore the colonial roots of museums and systems of collecting and the implications that these have for museums in the 21st century.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6: The Redemptive Museum</strong><br/><p>Responding to the colonial museum many Indigenous artists and scholars have sought to reinterpret history.</p>\n<p>In this session we draw on the influential textual work of Aileen Moreton Robinson, the visual work of artists including Julie Gough, and scholars, to explore what decolonisation in museums might be as a process. </p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Week 6: The Redemptive Museum</strong>",
            "topic_description": "Week 6: The Redemptive Museum Responding to the colonial museum many Indigenous artists and scholars have sought to reinterpret history. In this session we draw on the influential textual work of Aileen Moreton Robinson, the visual work of artists including Julie Gough, and scholars, to explore what decolonisation in museums might be as a process.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7:  Intellectual Property</strong><br/><p>Whose property is cared for in museums? In this seminar we explore the concept of intellectual property and copyright through case studies of Australian First People's cultural products. Case study the copyright of Arrernte artist Albert Namatjira's watercolours and the Australian Indigenous flag.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Week 7:  Intellectual Property</strong>",
            "topic_description": "Week 7:  Intellectual Property Whose property is cared for in museums? In this seminar we explore the concept of intellectual property and copyright through case studies of Australian First People's cultural products. Case study the copyright of Arrernte artist Albert Namatjira's watercolours and the Australian Indigenous flag.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8 : The digital Museum; Museums as digital media</strong><br/><p>By now many museums are digitally mediated museums. This seminar examines the role of digital technologies in constituting the contemporary museum. Digital media constitutes both the structure and the visitor experience of the museum. The process of digitizing museum and the use of social media by museums has been accelerated by the COVID-19 pandemic. We will explore the potentials and ethics of the online world for museums. As theorists propose that the digital museum is the future we will ask: what will be the future for the real museum? Or is this the wrong question? Guest lecture: Dr Caroline Wilson Barnoa</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Week 8 : The digital Museum; Museums as digital media</strong>",
            "topic_description": "Week 8 : The digital Museum; Museums as digital media By now many museums are digitally mediated museums. This seminar examines the role of digital technologies in constituting the contemporary museum. Digital media constitutes both the structure and the visitor experience of the museum. The process of digitizing museum and the use of social media by museums has been accelerated by the COVID-19 pandemic. We will explore the potentials and ethics of the online world for museums. As theorists propose that the digital museum is the future we will ask: what will be the future for the real museum? Or is this the wrong question? Guest lecture: Dr Caroline Wilson Barnoa",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9: Museum Ethics and Activism</strong><br/><p>This session focuses on the social role of museums and the ethics of industry sponsorship of museums. How can cash strapped museums find ethical sponsors and what is ethical anyway?</p>\n<p>In this session we also ask the linked question of whether museums can and should be activists? We will explore this topic through the work of several museum activists and case studies. Visit to Fryer Library</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Week 9: Museum Ethics and Activism</strong>",
            "topic_description": "Week 9: Museum Ethics and Activism This session focuses on the social role of museums and the ethics of industry sponsorship of museums. How can cash strapped museums find ethical sponsors and what is ethical anyway? In this session we also ask the linked question of whether museums can and should be activists? We will explore this topic through the work of several museum activists and case studies. Visit to Fryer Library",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10: No Class Public Holiday</strong><br/></p></div></td>",
            "topic_title": "<strong>Week 10: No Class Public Holiday</strong>",
            "topic_description": "Week 10: No Class Public Holiday",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11: The Inclusive Museum; education in museums</strong><br/><p>This session will explore the relations between museums, education and communities.</p>\n<p>In recent years the museum has become the site of life long learning delivered through exhibitions and public programs in digital and physical spaces. The new museum education is not just for schools but aimed at including all audiences.</p>\n<p>Guest Speaker tbc: Terry Deen Head of education at QAGOMA</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Week 11: The Inclusive Museum; education in museums</strong>",
            "topic_description": "Week 11: The Inclusive Museum; education in museums This session will explore the relations between museums, education and communities. In recent years the museum has become the site of life long learning delivered through exhibitions and public programs in digital and physical spaces. The new museum education is not just for schools but aimed at including all audiences. Guest Speaker tbc: Terry Deen Head of education at QAGOMA",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12: Museums, Identity &amp; Representation</strong><br/><p>Public museums have played an important role in nation-building and identity formation. Focusing on the relationship between museums, the state, and society, this session explores the identity work of public museums. Museums have been vehicles for national representation and international diplomacy, and they have helped shape, define and forge a sense of national identity and citizenship. Drawing on museum and exhibition case-studies from Australia and internationally, in this session we will examine the roles public museums have played in the construction of national identity and cultural difference, and in the (re-) writing of national histories. Visit to UQ Art Museum current exhibition curator talk</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Week 12: Museums, Identity &amp; Representation</strong>",
            "topic_description": "Week 12: Museums, Identity & Representation Public museums have played an important role in nation-building and identity formation. Focusing on the relationship between museums, the state, and society, this session explores the identity work of public museums. Museums have been vehicles for national representation and international diplomacy, and they have helped shape, define and forge a sense of national identity and citizenship. Drawing on museum and exhibition case-studies from Australia and internationally, in this session we will examine the roles public museums have played in the construction of national identity and cultural difference, and in the (re-) writing of national histories. Visit to UQ Art Museum current exhibition curator talk",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Peer Assisted Study Session",
            "topic": "<td data-title=\"Topic\"><div><p><strong>No class- Independant study</strong><br/></p></div></td>",
            "topic_title": "<strong>No class- Independant study</strong>",
            "topic_description": "No class- Independant study",
            "learning_outcomes": []
        }
    ]
}