{
    "course_title": "Clinical Nursing Practice 3",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/NURS7129-20439-7520",
    "full_course_code": "NURS7129-20439-7520",
    "course_code": "NURS7129",
    "class_code": "20439",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Utilise evidence-based information to develop clinical skills in simulated and clinical environments, at novice level."
        },
        {
            "number": "LO2.",
            "description": "Practice legal, ethical, cultural and professional principles within the scope of a student nurse when undertaking patient care and/or performing clinical responsibilities."
        },
        {
            "number": "LO3.",
            "description": "Demonstrate critical thinking and reasoning, commensurate with program level, when delivering, evaluating and reflecting on evidence-based care in accordance with the Nursing and Midwifery Board of Australia competency domains at a novice level."
        },
        {
            "number": "LO4.",
            "description": "Apply learned interpersonal, clinical assessment and clinical intervention skills in the planning and management of nursing care in accordance with the Nursing and Midwifery Board of Australia competency domains at a novice level."
        },
        {
            "number": "LO5.",
            "description": "Engage in effective verbal, non-verbal and written professional communication with patients and interdisciplinary team members."
        },
        {
            "number": "LO6.",
            "description": "Establish therapeutic relationships with patients that are goal directed, patient centred and care focused within expected professional boundaries."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Medication Calculation Assessment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 25/02/2025 3:00 pm</p>\n<p>\n</p><p>Please refer to your NURS7129 course timetable for the assessment date and time - this assessment is a mandatory attendance requirement.</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment consists of three online medication quizzes which will examine and extend your preparedness for clinical placement.</p>\n<p><strong>Medication Safety exams</strong> - This part will examine your knowledge regarding medication safety which includes medication calculations and the “rights” of medication administration. The link to the medication safety exams will be available in the companion course site:</p>\n<ul>\n<li>Medication 'Rights' Customised Assessment #2</li>\n<li>Medication Calculations Customised Assessments #4 and #6</li>\n<li>Download the certificates of completed at the end of each quiz upload and present present these certificates to test invigilators to mark off as completed.</li>\n</ul>\n<p>Students are required to achieve 100% accuracy for the nominated medication safety exams. Whilst there is the opportunity for ongoing repeat attempts at the exams, <strong>100% accuracy must be achieved.</strong></p>\n<p><strong>This assessment is invigilated and students must attend the allocated session and have with them their laptop or electronic device to access the assessment task. </strong></p>\n<p>Any students unable to achieve 100% accuracy by the end of the scheduled assessment will not proceed to clinical placement. Students unsuccessful in the assessment attempt will be informed via their UQ email of the requirements and due date of the second attempt. Students are to refer to the course Blackboard site Assessment tab for additional details. </p>\n<p><strong>Students must undertake and be successful in their medication safety exam. This must be completed prior to undertaking medication administration.</strong></p>\n<p>Medication administration under direct RN supervision is an expected scope of practice for all undergraduate students.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students are to upload the completed medication safety certificates via the Blackboard assessment link post results being verfied by assessors.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Hand Hygiene Certification",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> Pass/fail </dd>",
            "due_date": "<dd><p> 6/03/2025 1:00 pm</p></dd>",
            "learning_objectives": "L01, L02",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Hand hygiene is a fundamental nursing skill and essential to safe patient care. When performed correctly, effective hand hygiene contributes to the prevention of healthcare-associated infection and improved patient safety. The aim of this assessment is to evaluate students' knowledge and understanding of effective, evidence-based hand hygiene practices that health care workers must implement when working in healthcare facilities and providing clinical care. Successful completion of this assessment is defined as achieving 100% in the quiz at the end of the module. Please refer to the tasksheet located on the NURS7129 Blackboard site for additional information.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Certificate of completion dated between 17/2/25 to 6/3/25 1pm to be uploaded to the NURS7129 Blackboard site. </p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "IPCP: Role Play and Reflection",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p>Please refer to the HABS1240 Blackboard site</p>\n<p>The two assessment due dates relate to the tutorials running over two weeks. Each student will attend one of the three tutorials: </p>\n<ul>\n<li>Friday 21st Feb 9am,</li>\n<li>Friday 21st Feb 1pm, or</li>\n<li>Friday 28th Feb 9am </li>\n</ul>\n<p><br/></p></dd>",
            "learning_objectives": "L03, L04, L05",
            "mode": "Written",
            "category": "Participation/ Student contribution, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This is a team assessment and all team members are expected to contribute equally to the team’s assessment items during the tutorial. Teams will be assigned prior to the tutorial. There are two (2) parts to this assessment both based upon a client case conference role play that your team will complete during the tutorial class.</p>\n<ul>\n<li><strong>Part one</strong> requires you to complete a worksheet and will draw on your case conference role play, focusing on role-clarification, team functioning and client-centred care.</li>\n<li>Length: There is no word limit for the worksheet.</li>\n<li><strong>Part two</strong> requires you to complete a team reflection on the processes adopted during your case conference role play specifically focusing on interprofessional communication, team functioning, conflict management and collaborative leadership.</li>\n<li>Length: The team reflection will be limited to 500 words.</li>\n</ul>\n<p>Teams will need to submit both assessment pieces via the Assessment tab on the IPCP Learn.UQ course site prior to the end of the tutorial class. Additional information regarding submission will be provided on the IPCP Learn.UQ course site. Please refer to the assessment information on Learn.UQ for further details and requirements for the assessment.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Online submission via Blackboard.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Interprofessional Simulation OSCA",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> Pass/fail  </dd>",
            "due_date": "<dd><p>Due dates are dependent on student allocation at time of enrollment. </p></dd>",
            "learning_objectives": "L02, L03, L04, L05",
            "mode": "Activity/ Performance, Oral",
            "category": "Participation/ Student contribution, Role play/ Simulation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Interprofessional learning within the field of nursing stands as a cornerstone for professional development, fostering a collaborative and dynamic environment that significantly contributes to the growth and efficacy of healthcare practitioners. Recognising the interconnectedness of the multidisciplinary team, interprofessional learning emphasises the importance of nurses working collaboratively to share knowledge, skills, and experiences. This collaborative approach not only enhances the quality of patient care but also cultivates a culture of continuous improvement within the healthcare profession. This OSCA assesses your ability to work and communicate within interprofessional teams as a component of developing your professional capabilities. </p>\n<p>You are required to self allocate as per the timetabling requirements for enrollment into NURS7129. Students must review the assessment tasksheet for additional assessment details located within the NURS7129 Blackboard site. Students who do not allocate themselves to simulation session on enrollment into the course will receive a fail grade for the assessment.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-4",
            "assessment_title": "Placement Preparation and Performance Assessment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p>Due dates are dependent on allocated placement.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Activity/ Performance, Written",
            "category": "Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>An expectation of this course is satisfactorily meeting the Nursing and Midwifery Board of Australia (NMBA) Registered Nurse Standards for Practice while practicing under the scope of a second year, first semester Master of Nursing Studies student. The course requires successful completion of 280 hours of clinical placement. The following elements needed to be completed in order to evidence Clinical Placement Preparation and Performance:</p>\n<p><strong>1. Placement Readiness Plan</strong></p>\n<p>Within the first two days of clinical placement students will develop a Placement Plan (completed via ePAD). The overall aim of the placement plan is to support you to develop agency in your learning and consider how to integrate learning and feedback between different contexts. Through completing placement plans iteratively, you demonstrate your ability to take initiative to prepare for placement and review previous assessments to identify gaps or challenges which need further work as you progress towards working as a registered nurse. Information on how to complete your Placement Plan will be provided to you prior to starting placement.</p>\n<p><strong>2. Clinical Skills Assessment</strong></p>\n<p>Within the first half of your clinical placement (prior to your Formative ANSAT) you will select three clinical skills to demonstrate to your Buddy RN or Clinical Facilitator. You will choose one from the communication list, one from the medication administration list, and one from the patient assessment list. You will demonstrate your ability to safely undertake these activities, and request feedback on your performance via ePAD. Information on how to complete your Clinical Skills Assessments will be provided to you prior to starting placement.</p>\n<p><strong>3. Self-evaluation of Nursing Standards of Practice</strong></p>\n<p>Immediately prior to undertaking your Formative ANSAT you will self-evaluate your performance against the NMBA Registered Nurse Standards for Practice (completed via ePAD). The aim of this task is to support your ability to evaluate your own performance through making comparisons of your work to that of your peers, supervisors and to the descriptions in the rubric. Through iterative engagement with the standards of practice, you will demonstrate your ability to actively seek and action feedback information and to persist despite the emotional challenges associated with engaging in constructive feedback. Information on how to complete your self-evaluation will be provided to you prior to starting placement.</p>\n<p><strong>4. Feedback and Action Plan</strong></p>\n<p>Immediately following your Formative ANSAT you will reflect on the feedback you have received and identify areas for improvement (completed via ePAD). The purpose of this task is to assess your capacity for self-reflection and ability to process feedback from various sources, to deeply engage with your level of knowledge and professional skills. Through reviewing your completed Formative ANSAT in ePAD, you will demonstrate your ability for accurate self-evaluation and showcase your proficiency in monitoring professional and clinical development over time, reflect on achievements, and identify areas for further growth. Information on how to complete this activity will be provided to you prior to starting placement.</p>\n<p>Students are to refer to the \"Assessment\" tab located within the NURS7129 Blackboard site for further details and specifications of the assessment item.</p>\n<p>Please note: falsification of any information pertaining to placement attendance or performance will be considered a breach of the UQ Student Code of Conduct Policy 3.60.01 (<a href=\"https://ppl.app.uq.edu.au/content/3.60.01-student-code-conduct\">https://ppl.app.uq.edu.au/content/3.60.01-student-code-conduct</a>).</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>This assessment item is required to be entered into ePAD and signed off by your Clinical Facilitator or Buddy RN.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-5",
            "assessment_title": "Clinical Placement Completion",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p>Due dates are dependent on the allocated placement.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Activity/ Performance",
            "category": "Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This final assessment requires students to demonstrate successful completion of clinical placement and attainment of Scope of Practice for NURS7129. Demonstrated capability in clinical practice commensurate with the NURS7129 Course Learning Objectives evidenced by successful completion and submission of the Formative and Summative Australian Nursing Standards Assessment Tool (ANSAT). </p>\n<p>There are three (3) parts to this assessment:</p>\n<p><strong>Part 1 - Formative ANSAT</strong></p>\n<ul>\n<li>Must be completed and submitted via ePAD mid placement after approx. 140 hours of placement.</li>\n<li>Must be signed by Buddy RN/Preceptor or PPE/Clinical Supervisor.</li>\n<li>All sections must be completed (scores and comments).</li>\n<li><em>Students must receive a score of 3 or above on every criteria to pass.</em></li>\n</ul>\n<p>Please note: Submitting the formative ANSAT mid-placement will ensure students who have not met the passing requirements (scores of 3 and above) can be supported with a Practice Learning Plan through to the end of placement. </p>\n<p><strong>Part 2 - Summative ANSAT</strong></p>\n<ul>\n<li>Must be completed on your last or second-to-last shift and submitted via ePAD by the end of placement.</li>\n<li>Must be signed by Buddy RN/Preceptor or PPE/Clinical Supervisor.</li>\n<li>All sections must be completed (scores and comments).</li>\n<li><em>Students must receive a score of 3 or above on every criteria to pass. </em>(Any scores of 2 or below at this final assessment means that a student has not achieved passing requirements for this course.)</li>\n</ul>\n<p><strong>Part 3 - Timesheet</strong></p>\n<p>Successful completion of 280 hours of clinical placement within the rostered timeframe advised by the Clinical Placements Unit. </p>\n<p>The completed timesheet must demonstrate all required hours of clinical placement (280 hours), undertaken within the rostered timeframe as advised by the Clinical Placement Unit.</p>\n<p>The Clinical Practicum Timesheet must be signed off by the student's Registered Nurse Preceptor / UQ Practice Educator, every shift via a declaration in MyProgress ePAD. </p>\n<p><em>Additional information</em></p>\n<ul>\n<li>All attendances and absences to be recorded within ePAD.</li>\n<li>All ANSAT documents to be officially completed within ePAD for submission.</li>\n<li>Falsification of documentation (e.g. ePAD, medical records) will be deemed a serious breach of scope of practice and codes of conduct resulting in immediate withdrawal from placement and a fail grade awarded.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students are to submit clinical hours, formative and summative ANSATs via ePAD.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "O-week(17 Feb - 23 Feb)",
            "activity_type": "Problem-based learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>GEM - Interprofessional Collaborative Practice</strong><br><p>You will work in small teams in a single 3-hour tutorial with students from Audiology, Dentistry, Dietetics, Nursing, Occupational Therapy, Physiotherapy, Psychology, Social Work and Speech Pathology. This is one module consisting of online preparation and a face-to-face tutorial class. You will be allocated to a small team of students from different discipline backgrounds to engage in a range of learning activities, including a case conference role play, to develop your knowledge and skills to help prepare you for working in interprofessional collaborative teams when caring for clients.</p></br></p><p><strong>Learning outcomes:</strong> L01, L05, L06</p></div></td>",
            "topic_title": "<strong>GEM - Interprofessional Collaborative Practice</strong>",
            "topic_description": "GEM - Interprofessional Collaborative Practice You will work in small teams in a single 3-hour tutorial with students from Audiology, Dentistry, Dietetics, Nursing, Occupational Therapy, Physiotherapy, Psychology, Social Work and Speech Pathology. This is one module consisting of online preparation and a face-to-face tutorial class. You will be allocated to a small team of students from different discipline backgrounds to engage in a range of learning activities, including a case conference role play, to develop your knowledge and skills to help prepare you for working in interprofessional collaborative teams when caring for clients.",
            "learning_outcomes": [
                "L01",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 6",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Course orientation</strong><br><p>This lecture will provide an overview of the course and clinical placement expectations and requirements. Additional lectures are provided to support your clinical knowledge on contemporary topics. </p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Course orientation</strong>",
            "topic_description": "Course orientation This lecture will provide an overview of the course and clinical placement expectations and requirements. Additional lectures are provided to support your clinical knowledge on contemporary topics.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Clinical placement</strong><br><p>Clinical placement at teaching hospitals and health institutions. Clinical placement details and requirements will vary based on each student's allocated clinical placement site. Placement details will be distributed by the NMSW Clinical Placement Team and general placement information will be posted on the NURS7129 Blackboard site. Please note some placements may be allocated outside of semester dates and this placement allocation depends largely on what is provided to UQ. Clinical placement attendance is a mandatory requirement and students must achieve a passing result and complete a minimum of 280 hours of clinical placement.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Clinical placement</strong>",
            "topic_description": "Clinical placement Clinical placement at teaching hospitals and health institutions. Clinical placement details and requirements will vary based on each student's allocated clinical placement site. Placement details will be distributed by the NMSW Clinical Placement Team and general placement information will be posted on the NURS7129 Blackboard site. Please note some placements may be allocated outside of semester dates and this placement allocation depends largely on what is provided to UQ. Clinical placement attendance is a mandatory requirement and students must achieve a passing result and complete a minimum of 280 hours of clinical placement.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Case-based learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Online modules</strong><br><p>Online learning modules are required to be completed over the course of the semester. These modules aim to support the development of knowledge, critical thinking and clinical reasoning skills, and readiness for professional practice.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L06</p></div></td>",
            "topic_title": "<strong>Online modules</strong>",
            "topic_description": "Online modules Online learning modules are required to be completed over the course of the semester. These modules aim to support the development of knowledge, critical thinking and clinical reasoning skills, and readiness for professional practice.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L06"
            ]
        },
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Medication Assessment Exam</strong><br/><p>Medication Assessment Exam scheduled for Tuesday 25/2/25 commencing at 3pm.</p></p><p><strong>Learning outcomes:</strong> L03, L05</p></div></td>",
            "topic_title": "<strong>Medication Assessment Exam</strong>",
            "topic_description": "Medication Assessment Exam Medication Assessment Exam scheduled for Tuesday 25/2/25 commencing at 3pm.",
            "learning_outcomes": [
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 3 To Week 12(10 Mar - 25 May)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Interprofessional (IP) Simulation</strong><br><p>Students are required to participate in one Interprofessional (IP) Simulation Tutorial on campus. Other participating students will be from a range of allied health disciplines. On the day of the Simulation, students will be provided a case scenario and will work together to overcome clinical challenges. Details of date, time and venue of IP simulation will be provided via Blackboard. Students will nominate to participate on a certain date.</p></br></p><p><strong>Learning outcomes:</strong> L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Interprofessional (IP) Simulation</strong>",
            "topic_description": "Interprofessional (IP) Simulation Students are required to participate in one Interprofessional (IP) Simulation Tutorial on campus. Other participating students will be from a range of allied health disciplines. On the day of the Simulation, students will be provided a case scenario and will work together to overcome clinical challenges. Details of date, time and venue of IP simulation will be provided via Blackboard. Students will nominate to participate on a certain date.",
            "learning_outcomes": [
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 5 To Week 10(24 Mar - 11 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Employability Workshops</strong><br><p>Two workshops, one in week 5 and one in week 10, will help students develop important skills for their graduate program applications and interviews. These skills will be useful for all nursing employment opportunities, present or future. Information such as date, time and venue for these workshops can be found in your timetable next to the code WKS1.</p></br></p><p><strong>Learning outcomes:</strong> L05</p></div></td>",
            "topic_title": "<strong>Employability Workshops</strong>",
            "topic_description": "Employability Workshops Two workshops, one in week 5 and one in week 10, will help students develop important skills for their graduate program applications and interviews. These skills will be useful for all nursing employment opportunities, present or future. Information such as date, time and venue for these workshops can be found in your timetable next to the code WKS1.",
            "learning_outcomes": [
                "L05"
            ]
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Graduate Information Session</strong><br/><p>This seminar will provide students with information related to graduate positions and applications from Mater Services, Darling Downs, West Moreton, Metro North and South health divisions, Aged and Community Services and Institute for Urban Indigenous Health. Students need to enrol in either the on campus session or the live Zoom session.</p></p><p><strong>Learning outcomes:</strong> L05</p></div></td>",
            "topic_title": "<strong>Graduate Information Session</strong>",
            "topic_description": "Graduate Information Session This seminar will provide students with information related to graduate positions and applications from Mater Services, Darling Downs, West Moreton, Metro North and South health divisions, Aged and Community Services and Institute for Urban Indigenous Health. Students need to enrol in either the on campus session or the live Zoom session.",
            "learning_outcomes": [
                "L05"
            ]
        }
    ]
}