{
    "course_title": "Clinical Nursing Practice 3",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/NURS2103-21207-7520",
    "full_course_code": "NURS2103-21207-7520",
    "course_code": "NURS2103",
    "class_code": "21207",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate attributes of the registered nurse including professional knowledge, skills, self-awareness, and ethical values to provide nursing care that meets the patients healthcare needs and recognises the individuals preferences."
        },
        {
            "number": "LO2.",
            "description": "Undertake assessment of the individual experiencing an acute event using accurate data collection and interpretation, documentation of findings and appropriate problem solving and interventions."
        },
        {
            "number": "LO3.",
            "description": "Demonstrate effective application of the clinical reasoning process to achieve safe and comprehensive care of the individual."
        },
        {
            "number": "LO4.",
            "description": "Apply knowledge of safe administration of medications and pharmacotherapeutics to inform individual centred care including intravenous fluid and drug management, diabetes management and medication provision."
        },
        {
            "number": "LO5.",
            "description": "Utilise effective and culturally respectful written, verbal, non-verbal, and digital communication, with individuals, families and the interprofessional team, to ensure optimum health outcomes for the individual."
        },
        {
            "number": "LO6.",
            "description": "Demonstrate how the principles of person centred and safe care including clinical risk management are applied in an acute care simulated learning environment and in a clinical practice environment"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Medication Calculation Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 24/02/2025 12:00 pm</p></dd>",
            "learning_objectives": "L03, L04",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment consists of an online medication calculation exam conducted through the Med+Safe eLearning program under invigilated exam conditions on campus. The exam will assess your ability to safely and accurately perform medication calculations to support the safe administration of medications in clinical settings.</p>\n<p>Students are required to bring their own laptop or electronic device with Med+safe eLearning program access to complete the online exam.</p>\n<p>Students are expected to undertake preparatory practice of the Med+Safe assessment prior to the exam. Each assessment draws on a large pool of questions. Each time you attempt the assessment you will receive different questions of a similar style and content.</p>\n<p>Students are required to achieve 100% accuracy with unlimited attempts within the exam timeframe. The Med+Safe completion certificate must be witnessed by invigilators during the exam timeframe and submitted to blackboard within 24 hours of the examination.</p>\n<p>Students are to refer to the course Blackboard site Assessment tab for additional details. </p>\n<p>Students unable to achieve the Med+Safe completion certificate within the exam timeframe are not permitted to proceed to clinical placement and will be unsuccessful in the course.</p>\n<p><strong>Medication administration on clinical placement must occur under direct Registered Nurse supervision. This is an expected scope of practice for all undergraduate students.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students are allocated a 90-minutes timeframe to allow for multiple attempts of the assessment if required. Once students successfully complete the assessment, they will be able to download the Med+Safe completion certificate. Student's are required to present their student ID/Drivers license with the Med+Safe completion certificate to the allocated invigilator for verification. Students are required to submit the verified Med+Safe completion certificate to blackboard within 24 hours post the examination.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Hand Hygiene Certificate",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 3/03/2025 1:00 pm</p></dd>",
            "learning_objectives": "L01",
            "mode": "Activity/ Performance",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Hand hygiene is a fundamental nursing skill and is essential to ensuring safe patient care. This assessment item requires students to complete the Hand Hygiene for Clinical Healthcare Workers online module. Students have unlimited attempts to achieve a pass grade prior to the submission due date. Details related to this assessment and accessing the online learning module is outlined in the assessment task sheet located on the course Blackboard site.</p>\n<p> <strong>Students unable to achieve the Hand Hygiene certificate by the due date are not permitted to proceed/continue with clinical placement and will be unsuccessful in the course.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Certificate of completion dated between 1/1/25 to 3/3/25 1pm to be uploaded to the NURS2103 Blackboard site.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Clinical skills evaluation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 13/03/2025 - 14/03/2025</p></dd>",
            "learning_objectives": "L01, L04, L06",
            "mode": "Activity/ Performance",
            "category": "Practical/ Demonstration, Role play/ Simulation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment is designed to allow students to participate in a clinical learning activity to demonstrate theoretical and clinical knowledge and skills in a safe simulated environment.</p>\n<p>Students will complete the clinical skills evaluation during the week 3 Clinical Based Learning (CBL) session.</p>\n<p>The student will be required to demonstrate theoretical and clinical knowledge on the below clinical skills during the OSCA:</p>\n<ul>\n<li>Hand hygiene</li>\n<li>Management of intravenous lines and fluid administration</li>\n<li>Documentation</li>\n</ul>\n<p>Students are to refer to the course Blackboard site Assessment tab for additional details. </p>\n<p><strong>Students who do not attempt the assessment by the due date are not permitted to proceed/continue with clinical placement and will be unsuccessful in the course.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assessment to be completed in the allocated week 3 Clinical Based Learning session. </p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Clinical Placement Completion",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p>Students are to submit their signed Formative ANSAT, Summative ANSAT and timesheet via ePad.</p>\n<p><br/></p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Activity/ Performance",
            "category": "Performance, Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>An expectation of this course is satisfactorily meeting the Nursing and Midwifery Board of Australia (NMBA) Registered Nurse Standards for Practice while practicing under the scope of second year, first semester Bachelor of Nursing student. All students are required to successfully compete 120 hours of clinical placement.</p>\n<p> The aim of this assessment is to leverage the clinical placement experience as a platform for integrating theoretical knowledge into practical applications. Students will be tasked with demonstrating the progression of their clinical knowledge, skills, and proficiency in alignment with their current year of study. Throughout the clinical placement, the emphasis will be on students demonstrating adherence to professional standards and conduct expected of a registered nurse, while staying within the confines of their specified scope of practice.</p>\n<p><strong>There are three (3) parts to this assessment:</strong></p>\n<p><strong> Part 1 - Formative ANSAT</strong></p>\n<p>Must be completed and submitted via ePAD mid placement after approx 80 hours of placement.</p>\n<ul>\n<li>Must be signed by Buddy RN/Preceptor or PPE/Clinical Supervisor.</li>\n<li>All sections must be completed (scores and comments).</li>\n<li>Students must receive a score of 3 or above on every criteria to pass.</li>\n</ul>\n<p><strong>Please note: </strong>Submitting the formative ANSAT mid placement will ensure students who have not met the passing requirements of a score of 3 and above, can be supported with a Practice Learning Plan through to the end of placement.<strong> </strong></p>\n<p><strong> Part 2 - Summative ANSAT</strong></p>\n<p>At the conclusion of clinical placement, students are to engage in a formal feedback process to evaluate overall performance in the assigned clinical placement and to identify areas for future development.</p>\n<ul>\n<li> Must be completed on the final rostered shift and submitted via ePAD by the end of placement.</li>\n<li> Must be signed by Buddy RN/Preceptor or PPE/Clinical Supervisor.</li>\n<li>All sections must be completed (scores and comments).</li>\n</ul>\n<p>Students must receive a score of 3 or above on every criteria to pass. (Any scores of 2 and below at this final assessment means that a student has not achieved passing requirements for this course. This will result in an unsuccessful grade in this course).</p>\n<p><strong> Part 3 - Timesheet</strong></p>\n<p>The completed timesheet must demonstrate all required hours of clinical placement (e.g. 15 x 8 hours shifts =120 hours), undertaken within the rostered timeframe.</p>\n<ul>\n<li>The Clinical Practicum Timesheet must be signed off by the student's Registered Nurse Preceptor / UQ Practice Educator, at the completion of every shift via a declaration in MyProgress ePAD. </li>\n<li>Students are required to adhere to the Attendance and Absences policy and procedures in the event that they are absent from clinical placement. </li>\n</ul>\n<p><strong>Please note</strong>: Clinical placement may be scheduled outside of the semester.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students are to submit clinical hours, formative and summative ANSATs via ePAD.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "O-week(17 Feb - 23 Feb)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture </strong><br><p>Students are encouraged to attend the O week lecture to understand the expectations and requirements linked to the successful completion of the course. Lectures within this course are recorded for students who are not able to attend in real time.</p></br></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Lecture </strong>",
            "topic_description": "Lecture Students are encouraged to attend the O week lecture to understand the expectations and requirements linked to the successful completion of the course. Lectures within this course are recorded for students who are not able to attend in real time.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Online learning modules</strong><br><p>Online learning modules provides students with important information regarding clinical practice and processes linked to the undertaking of this course.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Online learning modules</strong>",
            "topic_description": "Online learning modules Online learning modules provides students with important information regarding clinical practice and processes linked to the undertaking of this course.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Clinical Based Learning (CBL) sessions</strong><br><p>Clinical based learning (CBL) are conducted throughout the semester to develop students clinical skills and application of theoretical knowledge. Attendance to CBLs are a mandatory component to this course and 100% attendance is required. Students are permitted to miss 20% of CBLs, however all missed CBLs must be made up at a time determined by the course convenor. </p>\n<p>Student are required to adhere to UQ NMSW nursing uniform requirement when attending CBLs. Students do not meet the uniform policy requirements will not be permitted to attend a class and will marked as absent. </p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Clinical Based Learning (CBL) sessions</strong>",
            "topic_description": "Clinical Based Learning (CBL) sessions Clinical based learning (CBL) are conducted throughout the semester to develop students clinical skills and application of theoretical knowledge. Attendance to CBLs are a mandatory component to this course and 100% attendance is required. Students are permitted to miss 20% of CBLs, however all missed CBLs must be made up at a time determined by the course convenor. Student are required to adhere to UQ NMSW nursing uniform requirement when attending CBLs. Students do not meet the uniform policy requirements will not be permitted to attend a class and will marked as absent.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Exam week 2(24 Feb - 22 Jun)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Clinical placement </strong><br><p>Students will be allocated to a clinical placement site to undertake the assigned clinical hours required in the course. The clinical hours are the minimum hours to attendance required for students to demonstrate the skill, knowledge and attributes linked to the course learning outcomes. Students are required to meet the clinical preparation requirements to attend placement and adhere to the NMSW policies and guidelines in relation to their participation and conduct during clinical placement.</p>\n<p><strong>Note clinical placements may be schedules outside of the semester dates.</strong></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Clinical placement </strong>",
            "topic_description": "Clinical placement Students will be allocated to a clinical placement site to undertake the assigned clinical hours required in the course. The clinical hours are the minimum hours to attendance required for students to demonstrate the skill, knowledge and attributes linked to the course learning outcomes. Students are required to meet the clinical preparation requirements to attend placement and adhere to the NMSW policies and guidelines in relation to their participation and conduct during clinical placement. Note clinical placements may be schedules outside of the semester dates.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Medication exam </strong><br/><p>Medication safety is paramount to safe clinical practice. In this schedule activity (refer to the course timetable) students will complete the mandatory medication calculation examination. Please refer to the course assessment details in relation to the requirements for this activity. Students are required to bring with them their driver license, smart device or laptop to undertake the assessment. </p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Medication exam </strong>",
            "topic_description": "Medication exam Medication safety is paramount to safe clinical practice. In this schedule activity (refer to the course timetable) students will complete the mandatory medication calculation examination. Please refer to the course assessment details in relation to the requirements for this activity. Students are required to bring with them their driver license, smart device or laptop to undertake the assessment.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}