{
    "course_title": "Clinical Nursing Practice 5",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/NURS3202-20021-7520",
    "full_course_code": "NURS3202-20021-7520",
    "course_code": "NURS3202",
    "class_code": "20021",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (17/02/2025 - 14/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate safe and professional nursing practice commensurate with year level of study aligned to the Nursing and Midwifery Board of Australia's Professional Standards."
        },
        {
            "number": "LO2.",
            "description": "Assess, plan, implement and evaluate evidence-based nursing care that respects and acknowledges the values of patient and family centred care."
        },
        {
            "number": "LO3.",
            "description": "Implement effective professional and interprofessional written, verbal, non-verbal, and digital communication skills to inform, educate and empower individuals, their family and colleagues towards safe and expected healthcare outcomes."
        },
        {
            "number": "LO4.",
            "description": "Demonstrate the pharmacological principles including safe use of medicines and monitoring of individual response under the direct supervision of the registered nurse."
        },
        {
            "number": "LO5.",
            "description": "Develop interprofessional practice skills in conflict management and collaborative leadership and enhance skills in role clarification, team functioning, interprofessional communication and client-centred care."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Simulation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 17/02/2025 - 3/03/2025</p>\n<p>\n</p><p>Attendance at the simulation CBL is a mandatory requirement for this course and student must attend the simulation based on their formal enrolment as per the timetable. </p></dd>",
            "learning_objectives": "L01, L04",
            "mode": "Activity/ Performance",
            "category": "Role play/ Simulation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students undertaking NURS3202 are required to enrol and attend one (1) simulation CBL in either Orientation Week or Week 1.</p>\n<p>This simulation assessment provides students with the opportunity to demonstrate critical thinking and clinical reasoning in delivering high-quality, person-centered nursing care. Students will be required to effectively plan, implement, and evaluate responsive nursing interventions while managing their time efficiently.</p>\n<p>The scenario will challenge students to exercise professional judgment in addressing patient needs, utilising interprofessional communication skills to collaborate effectively with team members. Following the simulation, students will engage in reflective practice to identify areas for professional growth, set development goals, and integrate feedback into their strategies for maintaining competence in clinical practice.</p>\n<p>Student must adhere to UQNMSW uniform policy when attending the simulation CBL. Where students do not meet the uniform policy requirements they will not be permitted to undertake the simulation CBL.</p>\n<p>Attendance at the simulation CBL is a mandatory requirement for this course and student must attend the simulation based on their formal enrolment as per the timetable.</p>\n<p>Students are advised to review the assessment task sheet located on the NURS3202/NUMW3214 Blackboard site for additional information.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assessment result will be entered by the simulation faciliator into Blackboard.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Medication Calculation Assessment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> Pass/Fail  </dd>",
            "due_date": "<dd><p> 24/02/2025 1:00 pm</p></dd>",
            "learning_objectives": "L01, L04",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment consists of an online medication quiz which will examine and extend your preparedness for clinical placement. The <strong>Medication Safety exams</strong> will examine your knowledge regarding medication safety which includes medication calculations and the “rights” of medication administration. The link to the medication safety exams will be available in the companion course site: Assessment item: <em>Medication Assessment Custom No. 6</em></p>\n<p>While there is the opportunity for ongoing repeat attempts at the exams, <strong>100% accuracy must be achieved. </strong>Any students unable to achieve 100% accuracy by the due date will not proceed to clinical placement. Students unsuccessful in the assessment attempt will be informed via their UQ email of the requirements and due date of the second attempt. Students are to refer to the course Blackboard site Assessment tab for additional details. </p>\n<p><em> Students must undertake and be successful in their medication safety exam. This must be completed prior to undertaking medication administration. Medication administration under direct RN supervision is an expected scope of practice for all undergraduate students.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students to upload the completed Medication safety certificate via the Blackboard assessment link.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Hand Hygiene Certificate",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 6/03/2025 1:00 pm</p></dd>",
            "learning_objectives": "L01",
            "mode": "Activity/ Performance",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Hand hygiene is a fundamental nursing skill and is essential to ensuring safe patient care. This assessment item requires students to complete the Hand Hygiene for Clinical Healthcare Workers online module. </p>\n<p>Students have unlimited attempts to achieve a pass grade (100%) prior to the submission due date. </p>\n<p>Details related to this assessment and accessing the online learning module are outlined in the assessment task sheet located on the course Blackboard site.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Certificate of completion dated between 1/1/25 to 6/3/25 1pm to be uploaded to the NURS3202/NUMW3214 Blackboard site.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "IPCP",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd> Pass/Fail  </dd>",
            "due_date": "<dd><p>\n</p><p>Students are to refer to Blackboard site HABS1240 for specific information and assessment deadlines for this assessment item. </p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance, Oral",
            "category": "Participation/ Student contribution, Presentation, Poster",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>There are two (2) parts to this assessment:</p>\n<p>Part One<strong> </strong>requires you to complete a poster and will draw on the online and face-to-face content from Modules 4 and 5 and the knowledge and skills you developed from Modules 1 to 3. You will present your poster for peer feedback in Module 6.</p>\n<p>Part Two involves creating a 3-minute video and will draw on the online and face-to-face content from Modules 4, 5 and 6 and the knowledge and skills you developed from Modules 1 to 3.</p>\n<p>Students will have the opportunity to begin work on each part of the assessment within their  team during tutorials and will be expected to spend additional time in the team to complete each task.</p>\n<p>This is a team assignment. Teams will be assigned during the first tutorial. Teams will need to submit both parts of the assessment in the Assessment tab on the IPCP Learn.UQ site. Please refer to the assessment information on Learn.UQ for the assessment due date for each team.  </p>\n<p>. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students are to refer to Blackboard site HABS1240.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-4",
            "assessment_title": "Clinical placement completion (formative, summative ANSAT and placement hours)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p>Due dates are dependent on allocated clinical placement dates.</p>\n<p><br/></p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Performance, Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The aim of this assessment is to leverage the clinical placement experience as a platform for integrating theoretical knowledge into practical applications. Students will be tasked with demonstrating the progression of their clinical knowledge, skills, and proficiency in alignment with their current year of study. Throughout the clinical placement, the emphasis will be on students demonstrating adherence to professional standards and conduct expected of a registered nurse, while staying within the confines of their specified scope of practice.</p>\n<ul>\n<li>Midpoint (Formative) ANSAT: To be completed at the midpoint (50% of clinical placement completed) and documented in Myprogress (ePad).</li>\n<li>Final (Summative) ANSAT: To be completed on the final two clinical shifts of the clinical placement and documented in Myprogress (ePad).</li>\n<li>Timesheets to be completed in Myprogress; ePad at the conclusion of each shift.</li>\n</ul>\n<p><em>Formative ANSAT:</em></p>\n<ul>\n<li>Midpoint (Formative) ANSAT: To be completed at the midpoint (50% of clinical placement completed) and documented in Myprogress (ePad).</li>\n<li>You must receive a score of 3 or above on every criteria (failure to do so will result in a learning plan being implemented).</li>\n<li>You must show evidence/reflection of achieving your learning goals OR evidence of amended learning goals.</li>\n<li>New learning goals need to be formulated during this meeting.</li>\n</ul>\n<p><em>Summative ANSAT:</em></p>\n<ul>\n<li>Completion due within the final two rostered shifts of clinical placement.</li>\n<li>To be completed by a UQ Clinical Supervisor, Preceptor, Nurse Educator or Buddy RN via ePAD.</li>\n<li>You must receive a score of 3 or above on every criterion (failure to do so will result in a fail grade for the course).</li>\n<li>You must show evidence/reflection of achieving your learning goals OR evidence of amended learning goals.</li>\n</ul>\n<p><em>Timesheet:</em></p>\n<ul>\n<li>Students enrolled in this course are required to complete 240 hours clinical placement.</li>\n<li>The Clinical Practicum Timesheet must be signed off by the student's Registered Nurse Preceptor / UQ Practice Educator every shift via a declaration in MyProgress ePAD. From your MyProgress home page, you can click ‘Timesheet’. The timesheet appears for you to complete; placement, location, activity type, date, duration and enter a name into ‘approved by’. Students must ensure they choose the correct location and type of shifts from the dropdown boxes. Once you have completed the form, hand your device to your Registered Nurse Preceptor / UQ Practice Educator. They will officially verify your entry by choosing the ‘Approved by’ section and entering their name and work email address. Once completed, click \"submit\". Information on ePAD will be provided to students prior to placement.</li>\n</ul>\n<p>Students are to review the assessment task sheet located on the course Blackboard site.</p>\n<p><em>Please note: Clinical placement may be scheduled outside of the semester</em>.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students are to submit clinical hours, formative and summative ANSATs via ePAD.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom O-week To Week 1(17 Feb - 02 Mar)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>CBL-Simulation</strong><br><p>This simulation provides students with the opportunity to demonstrate critical thinking and clinical reasoning in delivering high-quality, person-centred nursing care. Students will be required to effectively plan, implement, and evaluate responsive nursing interventions while managing their time efficiently.</p>\n<p>The scenario will challenge students to exercise professional judgment in addressing patient needs, utilizing interprofessional communication skills to collaborate effectively with team members. Following the simulation, students will engage in reflective practice to identify areas for professional growth, set development goals, and integrate healthcare evidence and feedback into their strategies for maintaining competence in clinical practice.</p>\n<p>Attendance is a mandatory requirement and is formally recorded for this activity. </p>\n<p><br/></p></br></p></div></td>",
            "topic_title": "<strong>CBL-Simulation</strong>",
            "topic_description": "CBL-Simulation This simulation provides students with the opportunity to demonstrate critical thinking and clinical reasoning in delivering high-quality, person-centred nursing care. Students will be required to effectively plan, implement, and evaluate responsive nursing interventions while managing their time efficiently. The scenario will challenge students to exercise professional judgment in addressing patient needs, utilizing interprofessional communication skills to collaborate effectively with team members. Following the simulation, students will engage in reflective practice to identify areas for professional growth, set development goals, and integrate healthcare evidence and feedback into their strategies for maintaining competence in clinical practice. Attendance is a mandatory requirement and is formally recorded for this activity.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture</strong><br><p>Orientation to the course inclusive of assessment and expectations. Students are advised to review the orientation lecture, this session will provide you valuable information to understand your course requriements and committments.</p></br></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Lecture</strong>",
            "topic_description": "Lecture Orientation to the course inclusive of assessment and expectations. Students are advised to review the orientation lecture, this session will provide you valuable information to understand your course requriements and committments.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 13(03 Mar - 01 Jun)",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Clinical Placement</strong><br><p>Students undertaking NURS3202 are required to complete 240 hours of clinical placement. Clinical placement allocations are accessible via Inplace.</p>\n<p>Clinical placement may occur outside of the semester dates. </p></br></p></div></td>",
            "topic_title": "<strong>Clinical Placement</strong>",
            "topic_description": "Clinical Placement Students undertaking NURS3202 are required to complete 240 hours of clinical placement. Clinical placement allocations are accessible via Inplace. Clinical placement may occur outside of the semester dates.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 3 To Week 10(10 Mar - 11 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>IPCP</strong><br><p>Interprofessional education modules are integrated into the learning for this unit. Students are to access information reagrding IPCP learning via the HABS1240 course blackboard site.</p></br></p></div></td>",
            "topic_title": "<strong>IPCP</strong>",
            "topic_description": "IPCP Interprofessional education modules are integrated into the learning for this unit. Students are to access information reagrding IPCP learning via the HABS1240 course blackboard site.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 4 To Week 10(17 Mar - 11 May)",
            "activity_type": "Clinical coaching",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Feedback sessions</strong><br><p>Feedback Sessions on Teams have been scheduled to provide students with an opportunity to communicate directly with the course coordinator. These sessions aims to address any questions, concerns, or suggestions in a supportive and open environment. Students are encouraged to attend and participate actively.</p></br></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Feedback sessions</strong>",
            "topic_description": "Feedback sessions Feedback Sessions on Teams have been scheduled to provide students with an opportunity to communicate directly with the course coordinator. These sessions aims to address any questions, concerns, or suggestions in a supportive and open environment. Students are encouraged to attend and participate actively.",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Preparation for Graduation Seminar</strong><br><p>This seminar will provide students with information related to graduate positions and applications from Mater Services, Darling Downs, West Moreton, Metro North and South health divisions, Aged and Community Services and Institute for Urban Indigenous Health. Students need to enrol in either the on campus session or the live ZOOM session.</p></br></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Preparation for Graduation Seminar</strong>",
            "topic_description": "Preparation for Graduation Seminar This seminar will provide students with information related to graduate positions and applications from Mater Services, Darling Downs, West Moreton, Metro North and South health divisions, Aged and Community Services and Institute for Urban Indigenous Health. Students need to enrol in either the on campus session or the live ZOOM session.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        }
    ]
}