{
    "course_title": "Occupational Therapy Practice in Community Contexts",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/OCTY3104-21093-7520",
    "full_course_code": "OCTY3104-21093-7520",
    "course_code": "OCTY3104",
    "class_code": "21093",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Determine the impact of legislative and pragmatic factors as they apply to occupational therapy in different community-based practice contexts."
        },
        {
            "number": "LO2.",
            "description": "Evaluate the impact of the environment on occupations and participation for diverse clinical populations."
        },
        {
            "number": "LO3.",
            "description": "Execute a systematic and reasoned occupational therapy process to assess, create, and evaluate environment-based interventions focused on the use and appropriate application of home modifications and assistive technology."
        },
        {
            "number": "LO4.",
            "description": "Use ethical and professional practice, employing occupational therapy skills, techniques, and practice processes to plan and provide services to both individuals and organisations."
        },
        {
            "number": "LO5.",
            "description": "Integrate the best available evidence, knowledge of client factors, understanding of practice context and application of clinical expertise to make clinical decisions and demonstrate clinical reasoning when making communicating and recommending for alternative strategies, home modifications and assistive technology."
        },
        {
            "number": "LO6.",
            "description": "Apply effective communication strategies to present clinical recommendations and justifications to clients and relevant stakeholders and facilitate associated group discussions."
        },
        {
            "number": "LO7.",
            "description": "Reflect on and provide critical appraisal of own and others' performance and implement appropriate changes in response to this appraisal."
        },
        {
            "number": "LO8.",
            "description": "Create an inclusive learning community that supports own and peer/colleague knowledge acquisition and skill development as relevant to practice in community-based contexts."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "In-Semester Theory Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30% MUST PASS </dd>",
            "due_date": "<dd><p> 7/04/2025 8:00 am</p>\n<p>\n</p><p>This In-Semester Exam is a School-Based Exam that will be held in Week 7 of Semester. It will be completed via Inspera with Safe Exam Browser, and students must bring their own device to complete the exam. Students should see the relevant Inspera guides at - https://elearning.uq.edu.au/student-guides-original/inspera-assessment-original - to ensure their device is adequately prepared for the exam.</p></dd>",
            "learning_objectives": "L01, L02, L04, L05, L06",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>A written short answer exam covering content from all professional preparation activities and practical applied workshops and course-related events from Weeks 1- 5 (inclusive).</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>This exam will be conducted face-to-face, on-campus (St Lucia) and will be completed electronically using Inspera with Safe Exam Browser. Students will be expected to prepare and bring their own device on which to complete the exam. If Queensland Health restrictions preclude on-campus assessment, this exam will be conducted as an online non-invigilated exam for all students on the same date and time as previously scheduled.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>Late submissions will not be permitted for this assessment as the times are set within the Inspera platform.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Case-Based Series Assessment - Submission 1: Presentation & Facilitated Discussion",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> PASS/FAIL </dd>",
            "due_date": "<dd><p>The Case-Based Series Assessment is a \"Series Assessment\" and the Presentation and Facilitated Discussion is the First Submission in the series. 28/04/2025 - 2/05/2025</p>\n<p>\n</p><p>The Case-Based Series Assessment is a \"Series Assessment\" and the Presentation and Facilitated Discussion is the First Submission in the series.</p>\n<p>All students, regardless of the date for their Presentation and Facilitated Discussion session, will have to submit their PowerPoint presentation on <strong>Monday, 28th of April at 9:00am</strong> and also finalise their Buddycheck by <strong>Friday 2nd May 2025 at 4:00pm</strong>.</p>\n<p>Please note that while this submission is a Pass/Fail item and the first submission in the Case-Based Series Assessment, it is not a MUST PASS submission and students can still PASS the Case-Based Series Assessment even if they receive a FAIL for the Presentation and Facilitated Discussion submission. As a MUST PASS assessment item, students must receive a PASS on the Case-Based Series Assessment to PASS OCTY3104.</p></dd>",
            "learning_objectives": "L02, L03, L04, L05, L06, L07, L08",
            "mode": "Activity/ Performance",
            "category": "Participation/ Student contribution, Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will work in <strong>groups</strong> (size to be determined based on tutorial numbers, however, groups of 4/5 students likely) to identify a home environment to review for their presentation and case-based assignment. Presentations will be held in Week 9, across the four block times (i.e. Monday 11:00am - 1:00pm, Monday 1:00pm - 3:00pm, Friday 9:00am - 11:00am and Friday 11:00am - 1:00pm). Students will only be required to attend <strong>one (1) presentation session</strong>. </p>\n<p><br/></p>\n<p>In this <strong>20 minute presentation</strong> students will:</p>\n<p>1) Briefly present two (2) designated areas of the environment with pictures, including features and specifications.</p>\n<p>2) Summarise preliminary recommendations for possible home modifications, assistive technology and related strategies to support goals/performance/participation/needs of the service consumer and succinctly present their clinical justification/reasoning for these recommendations.</p>\n<p>3) Facilitate a discussion amongst their peers with regard to the recommendations/justification, aiming to expand/improve/refine/evaluate their preliminary thoughts in preparation for the completion of the case-based assignment report.</p>\n<p><br/></p>\n<p><strong>Pass/Fail Requirements (Hurdles)</strong></p>\n<p>To successfully be able to complete this submission in the case-based series assessment all students must:</p>\n<p><br/></p>\n<p>1) <strong>Individual Hurdle: </strong>Attend a compulsory service consumer session during class time on <strong>Monday 24th March 2025</strong> from 11:00am - 1:00pm OR 1:00pm - 3:00pm. If students are not able to attend this session and can provide a legitimate reason (i.e. medical or extenuating circumstances) then they must submit an absentee form with associated evidence to the School of Health and Rehabilitation Sciences Student and Academic Support Unit (enquiries.shrs@uq.edu.au) within three calendar days. If approval is received, students will then need to complete a make-up activity to ensure that they have received and engaged with the necessary case-based series assessment-related information that was gathered within the session. This make-up activity will need to be submitted by <strong>Monday, 7th of April 2025 @ 4:00pm</strong>. </p>\n<p><br/></p>\n<p>2) <strong>Group Hurdle:</strong> Submit an electronic copy (1 per group) of the PowerPoint presentation (including all pictures) for the presentation and facilitated discussion online by <strong>Monday, 28th of April 2025 at 9:00am</strong>.</p>\n<p><br/></p>\n<p>3) <strong>Individual Hurdle:</strong> Attend (compulsory), in full, all presentations and facilitated discussions for their  Week 9 session on <strong>Monday 28th April 2025 OR Friday 2nd May 2025</strong> and actively participate in professional colleague evaluations (within own group) for all groups that present, submitting the group evaluation online. If students are not able to attend their session in full and can provide a legitimate reason (i.e. medical or extenuating circumstances) then they must submit an absentee form with associated evidence to the School of Health and Rehabilitation Sciences Student and Academic Support Unit (enquiries.shrs@uq.edu.au) within three calendar days. If approval is received, students will then need to complete a make-up activity to ensure that they have reviewed the missed presentations/facilitated discussions and have reflected upon and evaluated the recommendations/clinical justifications within each of the missed presentations. <strong>This make-up activity will need to be submitted by Monday, 12th of May 2025 @ 4:00pm</strong>.</p>\n<p><br/></p>\n<p>4)<strong> Individual Hurdle: </strong>Complete a formative Buddycheck for each member of their group, including themselves, to record the contributions of each of the group member to the presentation and facilitated discussion submission. These are due by <strong>Friday 2nd May 2025 at 4:00pm</strong> at the latest for all students.</p>\n<p><br/></p>\n<p>A fail on any of the above items (i.e., not participating and not completing a make-up activity) may bring about a fail for the corresponding submission:</p>\n<p>a)  If fail attending session with service consumer then may fail the subsequent case-based series assessment presentation and facilitated discussion, report, and clinical supervision viva. </p>\n<p>b) If fail to submit the PowerPoint presentation or attend all group presentations for the relevant session then may fail the case-based series assessment presentation and facilitated discussion. </p>\n<p>The exception to this is the Buddycheck which is a formative peer assessment item that is used with the intention of practicing providing/receiving feedback to/from group members about their performance and contributions within the group.</p>\n<p><br/></p>\n<p><strong>Professional Behaviour Code</strong></p>\n<p>1) Students are expected to be respectful at all times when in contact with the service consumer details and to treat all case material with the privacy and confidentiality that would be expected by OT clinical practice (i.e. all notes, recordings, assessment forms etc. pertaining to this case should be stored securely and not shared with anyone outside the OCTY3104 course).</p>\n<p>2) Students are expected to work collaboratively in a group and contribute equitably throughout the whole process for this submission in the case-based series assessment.</p>\n<p>3) A consent form must be acquired for any photos/video taken of specific individuals if necessary.</p>\n<p>4) Please refer to the Australian Health Practitioners Regulation Agency (AHPRA) - Code of Conduct for Occupational Therapists (Particularly - Section 3.4: Confidentiality and Privacy) at https://www.occupationaltherapyboard.gov.au/Codes-Guidelines/Code-of-conduct.aspx for expectations regarding professional behaviour.</p>\n<p><br/></p>\n<p>The case material, including the task description, marking criteria, and supporting resources, will be available to students via Learn.UQ (Blackboard).</p>\n<p><br/></p>\n<p><strong>Generative AI (e.g., ChatGPT/Gamma)</strong> - This assessment task is to be completed in person. The use of Artificial Intelligence (AI) tools will not be permitted for the presentation or the creation of any affiliated resources. Any attempted use of AI may constitute student misconduct under the Student Code of Conduct.</p>\n<p><br/></p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p>UQ Students: Please access the profile from <a href=\"https://learn.uq.edu.au/\">Learn.UQ</a> or <a href=\"https://www.sinet.uq.edu.au/\">mySI-net</a> to access marking criteria held in this profile.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submissions</strong>:</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>As a PASS/FAIL submission there is no penalty for Late Submission. If students, however, do not complete the submission any of the relevant hurdles then they are at risk of receiving a FAIL for the Presentation and Facilitated Discussion submission.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Case-Based Series Assessment - Submission 2: Report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>40% MUST PASS </dd>",
            "due_date": "<dd><p> 26/05/2025 9:00 am</p>\n<p>\n</p><p>The Case-Based Series Assessment is a \"Series Assessment\" and the Report is the Second Submission in the series.</p>\n<p>Please note that while this submission is weighted (40%), it is also a MUST PASS submission and students will need to PASS the Case-Based Series Assessment Report in order to PASS the Case-Based Series Assessment overall. As a MUST PASS assessment item, students must receive a PASS on the Case-Based Series Assessment to PASS OCTY3104.</p></dd>",
            "learning_objectives": "L02, L03, L04, L05, L06, L07, L08",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will work in <strong>pairs</strong> (or groups of three where necessary) on a Case-Based Series Assessment Report which requires them to utilise knowledge and practical skills acquired through this and previous courses to make recommendations and provide clinical justification/reasoning to support the goals/performance/participation/needs of a service consumer in their home environment and community.</p>\n<p><br/></p>\n<p>To achieve this students will have to:</p>\n<p>1) Critically review the case materials, attend a compulsory service consumer session, and participate in the group presentation and facilitated discussion submission and associated activities (including assessment of a home environment, presentation of preliminary recommendations/justification, and completion of a facilitated peer discussion).</p>\n<p>2) Apply their knowledge, practical skills, reasoning, and points gathered from the presentation and facilitated discussion (including provided feedback) to determine final feasible recommendations for home modifications, assistive technology, and related strategies to meet the service consumer requirements within the relevant home environment.</p>\n<p>3) Produce a consumer-friendly and funder-appropriate home modifications/assistive technology report with <strong>four (4) to six (6) computer drawings</strong> (completed in an approved program) of the <strong>two (2) designated areas</strong> pre and post-modification (there must be at least one (1) pre and one (1) post drawing for each area) and <strong>a maximum of two (2) standard A4 pages</strong> of assistive technology recommendation pictures (pictures and labels ONLY). This report must consider and demonstrate reference to the relevant literature, evidence, case information, and practice context.</p>\n<p><br/></p>\n<p>The final report submission is due on <strong>Monday 26th May 2025 at 9:00am (9:00) </strong>and should be 1.15 spaced and a maximum of 4 standard A4 pages, (not including drawings or pictures). In-text citations and the reference list should be consistent with APA 7th and the in-text citation will be included as part of the 4 standard A4 pages page limit, however, the reference list, like the drawings and pictures, will be considered as additional to the 4 pages of the report. PLEASE NOTE: All drawings and pictures need to be referred to in the main body of the report.</p>\n<p><br/></p>\n<p><strong>Pass/Fail Requirements (Hurdles)</strong></p>\n<p>To successfully be able to complete this submission in the case-based series assessment all students must:</p>\n<p><br/></p>\n<p>1) <strong>Individual Hurdle: </strong>Attend a compulsory service consumer session during class time on <strong>Monday 24th March 2025</strong> from 11:00am - 1:00pm OR 1:00pm - 3:00pm. If students are not able to attend this session and can provide a legitimate reason (i.e. medical or extenuating circumstances) then they must submit an absentee form with associated evidence to the School of Health and Rehabilitation Sciences Student and Academic Support Unit (enquiries.shrs@uq.edu.au) within three calendar days. If approval is received, students will then need to complete a make-up activity to ensure that they have received and engaged with the necessary case-based series assessment-related information that was gathered within the session. This make-up activity will need to be submitted by <strong>Monday, 7th of April 2025 @ 4:00pm</strong>. </p>\n<p><br/></p>\n<p>A fail on the above item (i.e., not participating and not completing a make-up activity) may bring about a fail for the corresponding submission:</p>\n<p>a) If fail attending session with service consumer then may fail the subsequent case-based series assessment presentation and facilitated discussion, report, and clinical supervision viva.</p>\n<p><br/></p>\n<p><strong><em>Students should also note that as a series assessment, they must complete all submissions in the series, therefore to be eligible to pass the Report submission, students will need to have completed the Presentation and Facilitated Discussion Submission.</em></strong></p>\n<p><br/></p>\n<p><strong>Generative AI (e.g., ChatGPT)</strong> </p>\n<p>Generative Artificial Intelligence (AI) and Large Language Models (e.g., ChatGPT, Microsoft CoPilot, &amp; Claude) are increasingly used in society.</p>\n<p>For writing clinical reports in this course, students may not use AI unless explicitly permitted by the course coordinator. If AI use is allowed, the specific guidelines must be clearly defined before implementation to ensure its acceptability and address any potential risks.</p>\n<p><br/></p>\n<p>AI is not a replacement of, or substitute for, professional reasoning or clinical skills. Human oversight is essential in its use, and to employ generative AI effectively and responsibly, students must understand how AI works, including its functions, data storage methods, and its impact on adherence to professional codes of conduct. </p>\n<p> </p>\n<p>If used during report writing, students are responsible for any outputs generated by AI and will be held accountable for the actions of any AI that is used in practice/report preparation. This responsibility includes ensuring adherence to the relevant profession's code of conduct and ethical standards. Transparency about generative AI use is essential and students must identify, document, and submit how the AI was used in the writing of this report (submitted as an additional report section - in addition to outlined page limit) and must follow the relevant policies and procedures of The University of Queensland and the OCTY3104 course. Students are reminded that they need to demonstrate their ability to meet the inherent requirements of the occupational therapy profession, operate within its scope of practice, and ensure that client/consumer/patient privacy and confidentiality are maintained at all times. Under no circumstances should identifiable clinical or client/consumer/patient information be uploaded to open or external AI platforms, as it is unethical and irresponsible.</p>\n<p><br/></p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p>UQ Students: Please access the profile from <a href=\"https://learn.uq.edu.au/\">Learn.UQ</a> or <a href=\"https://www.sinet.uq.edu.au/\">mySI-net</a> to access marking criteria held in this profile.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission</strong>:</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Case-based Series Assessment - Submission 3: Clinical Supervision Viva",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30% MUST PASS </dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>7/06/2025 - 21/06/2025</p>\n<p>\n</p><p>This Case-based Series Assessment Clinical Supervision Viva will take place during the End of Semester Exam period and specified days and times will be scheduled and advised once the Central Examination Timetable has been publicly released.</p>\n<p>The Case-Based Series Assessment is a \"Series Assessment\" and the Clinical Supervision Viva is the Third Submission in the series. </p>\n<p>Please note that while this submission is weighted (30%), it is also a MUST PASS submission and students will need to PASS the Case-Based Series Assessment Clinical Supervision Viva in order to PASS the Case-Based Series Assessment overall. As a MUST PASS assessment item, students must receive a PASS on the Case-Based Series Assessment to PASS OCTY3104.</p></dd>",
            "learning_objectives": "L02, L03, L04, L05, L06, L07, L08",
            "mode": "Activity/ Performance, Oral",
            "category": "Examination, Practical/ Demonstration, Role play/ Simulation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will participate in an in-person 20-minute <strong>individual</strong> clinical supervision viva examination to discuss their Case-Based Series Report and associated clinical activities. The viva will assess students' abilities to discuss and justify responses to feedback, articulate clinical and professional reasoning, evaluate intervention outcomes, and demonstrate understanding of interprofessional communication and working with construction professionals, assistive technology providers, and related clinical services in community practice (like assistance dogs). Students should be prepared to critically reflect on their clinical decision-making, presentation/report feedback, and articulate their future actions as an occupational therapist in training and to justify their therapeutic and clinical approaches across their case series.</p>\n<p><br/></p>\n<p><strong>Pass/Fail Requirements (Hurdles)</strong></p>\n<p>To successfully be able to complete this submission in the case-based series assessment all students must:</p>\n<p><br/></p>\n<p>1) <strong>Individual Hurdle: </strong>Attend a compulsory service consumer session during class time on <strong>Monday 24th March 2025</strong> from 11:00am - 1:00pm OR 1:00pm - 3:00pm. If students are not able to attend this session and can provide a legitimate reason (i.e. medical or extenuating circumstances) then they must submit an absentee form with associated evidence to the School of Health and Rehabilitation Sciences Student and Academic Support Unit (enquiries.shrs@uq.edu.au) within three calendar days. If approval is received, students will then need to complete a make-up activity to ensure that they have received and engaged with the necessary case-based series assessment-related information that was gathered within the session. This make-up activity will need to be submitted by <strong>Monday, 7th of April 2025 @ 4:00pm</strong>. </p>\n<p><br/></p>\n<p>A fail on the above item (i.e., not participating and not completing a make-up activity) may bring about a fail for the corresponding submission:</p>\n<p>a) If fail attending session with service consumer then may fail the subsequent case-based series assessment presentation and facilitated discussion, report, and clinical supervision viva.</p>\n<p><br/></p>\n<p><strong><em>Students should also note that as a series assessment, they must complete all submissions in the series, therefore to be eligible to pass the Clinical Supervision Viva submission, students will need to have completed the Presentation and Facilitated Discussion AND Report Submissions.</em></strong></p>\n<p><br/></p>\n<p><strong>Alternative Exam Arrangements </strong>can be made (and applied to in-semester exams) in specific circumstances. Please see information on circumstances and how to apply at <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/alternative-exam-arrangements\">Alternative Exam Arrangements</a> (https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/alternative-exam-arrangements). Exam adjustments are separate to a Student Access Plan (Disability). Your SAP does NOT apply to exams. This only covers in-class participation, activities, and assessment. If you have approved Alternative Exam Arrangements and you have a course with school-based examinations (e.g. mid-semester exams, in-class quizzes, online quizzes, tutorial exercises, vivas etc.) then please advise the course coordinator and examinations of the adjustments and assessments respectively as soon as possible to increase the potential for arrangements to be accommodated. </p>\n<p><br/></p>\n<p><strong>Generative AI (ChatGPT) - </strong>This assessment task is to be completed in person. The use of Artificial Intelligence (AI) tools will not be permitted. Any attempted use of AI may constitute student misconduct under the Student Code of Conduct.</p>\n<p><br/></p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p>UQ Students: Please access the profile from <a href=\"https://learn.uq.edu.au/\">Learn.UQ</a> or <a href=\"https://www.sinet.uq.edu.au/\">mySI-net</a> to access marking criteria held in this profile.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission</strong>:</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>Late submissions will not be permitted for this assessment as it is submitted in-person at a specific date, time, and location. Students are reminded that this is a MUST PASS item (including hurdles) within the Case-Based Series Assessment, and therefore, if students FAIL this Clinical Supervision Viva, they will fail the Case-Based Series Assessment overall. </p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-4",
            "assessment_title": "Measuring People, Equipment, and Environments Simulations",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> Pass/Fail (MUST PASS) </dd>",
            "due_date": "<dd><p> 28/03/2025 - 30/05/2025</p>\n<p>\n</p><p>Students will be assessed during the simulation practical sessions in the relevant assigned weeks.</p>\n<p>Please note that while this assessment is a PASS/FAIL assessment, it is also a MUST PASS submission and students will need to PASS to PASS the OCTY3104 Course. </p></dd>",
            "learning_objectives": "L03, L04, L06, L07, L08",
            "mode": "Activity/ Performance",
            "category": "Examination, Practical/ Demonstration, Role play/ Simulation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Task Description: Measuring People, Equipment, and Environments Simulations</strong></p>\n<p>These practical sessions are 3-hour hands-on simulations designed to develop and assess students' competency in measuring people, equipment, and environments. Post learning about these skills in a specially designed workshop in Week 5, each simulation practical will include a demonstration of relevant clinical skills, followed by group practice in teams of 3 or 4. Students will have the opportunity to apply their learning in realistic scenarios before being assessed on their ability to perform the skills safely and competently.</p>\n<p>The simulations will be held across two simulation practical blocks in either:</p>\n<ul>\n<li>Weeks 5 &amp; 6</li>\n<li>Weeks 7 &amp; 9</li>\n<li>Weeks 10 &amp; 11</li>\n<li>Weeks 12 &amp; 13</li>\n</ul>\n<p>Assessment will take place within the simulation practicals, ensuring students demonstrate proficiency and competency in the required skills. </p>\n<p><br/></p>\n<p><strong>Alternative Examination Arrangements (AEAs) </strong>- As this is a simulation practical assessment, Alternative Examination Arrangements will not apply in these circumstances. If students have a Student Access Plan (Disability) that includes relevant accommodations, these accommodations will be considered and applied where possible within the simulation practical assessment. Students, however, will have to demonstrate the necessary skills to ensure they meet the inherent requirements of the course and the occupational therapy profession. Students with accommodations are encouraged to contact the course coordinator directly if they would like to discuss if their SAP (Disability) accommodations can/will be applied.</p>\n<p><br/></p>\n<p><strong>Generative AI (ChatGPT) - </strong>This assessment task is to be completed in person. The use of Artificial Intelligence (AI) tools will not be permitted. Any attempted use of AI may constitute student misconduct under the Student Code of Conduct.</p>\n<p><br/></p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p>UQ Students: Please access the profile from <a href=\"https://learn.uq.edu.au/\">Learn.UQ</a> or <a href=\"https://www.sinet.uq.edu.au/\">mySI-net</a> to access marking criteria held in this profile.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission</strong>:</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>Late submissions will not be permitted for this assessment as it is submitted in-person at a specific date, time (i.e., during simulations/practicals) and location. Students are reminded that this is a MUST PASS item for the OCTY3104 course overall.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Practical Applied Workshops</strong><br><p>Students will actively participate in practical applied workshops, which foster a community of learning in which to practice and enhance knowledge and skill development. Students will attend two x 2 hour workshops each week (either Monday 11:00 -1:00pm and Friday 9:00 - 11:00am OR Monday 1:00 - 3:00pm and Friday 11:00 - 1:00pm). All workshops will be delivered face to face (unless identified otherwise by course staff). These workshops will have a practical/case-based focus and will apply knowledge acquired in the professional preparation activities and previous courses.</p>\n<p>As students are working within learning communities and will be participating in assessment with another member or other members from the same workshop group it is vital that students attend their relevant workshops.</p>\n<p>Sign-On will be available for these workshops.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Practical Applied Workshops</strong>",
            "topic_description": "Practical Applied Workshops Students will actively participate in practical applied workshops, which foster a community of learning in which to practice and enhance knowledge and skill development. Students will attend two x 2 hour workshops each week (either Monday 11:00 -1:00pm and Friday 9:00 - 11:00am OR Monday 1:00 - 3:00pm and Friday 11:00 - 1:00pm). All workshops will be delivered face to face (unless identified otherwise by course staff). These workshops will have a practical/case-based focus and will apply knowledge acquired in the professional preparation activities and previous courses. As students are working within learning communities and will be participating in assessment with another member or other members from the same workshop group it is vital that students attend their relevant workshops. Sign-On will be available for these workshops.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 13(03 Mar - 01 Jun)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Professional Preparation Activities</strong><br><p>Students will be expected to engage in structured/guided activities (including the below outlined online modules) that serve as an introduction to each weeks topic and provide a base of knowledge on which to build in the applied workshops.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Professional Preparation Activities</strong>",
            "topic_description": "Professional Preparation Activities Students will be expected to engage in structured/guided activities (including the below outlined online modules) that serve as an introduction to each weeks topic and provide a base of knowledge on which to build in the applied workshops.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 3 To Week 4(10 Mar - 23 Mar)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>SHRS Online Modules - NDIS &amp; Private Practice</strong><br><p>Students will complete two online modules which introduce students to the NDIS and Private Practice. The modules are 1) NDIS Module 1 - Understanding the participant's journey through the NDIS (including revision of \"Introduction to the NDIS\") and 2) Private Practice Module 1 - Introduction to Private Practice. These modules have content, videos, and activities that will support students to expand their knowledge for these two practice contexts.</p></br></p><p><strong>Learning outcomes:</strong> L01, L05</p></div></td>",
            "topic_title": "<strong>SHRS Online Modules - NDIS &amp; Private Practice</strong>",
            "topic_description": "SHRS Online Modules - NDIS & Private Practice Students will complete two online modules which introduce students to the NDIS and Private Practice. The modules are 1) NDIS Module 1 - Understanding the participant's journey through the NDIS (including revision of \"Introduction to the NDIS\") and 2) Private Practice Module 1 - Introduction to Private Practice. These modules have content, videos, and activities that will support students to expand their knowledge for these two practice contexts.",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 5 To Week 13(24 Mar - 01 Jun)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Measuring People, Equipment and Environments Session &amp; Simulations/Practicals</strong><br><p>In Week 5, students will be provided with a single opportunity to attend a practical session focused on developing the clinical skills necessary for measuring people, equipment, and environments. Within the session, course staff will support students to gain information and develop skills required to complete these tasks in clinical practice. For this session, attendance is compulsory. Additionally, students will be expected to attend two assigned simulations/practicals (after they have completed their OCTY3103 People Handling) to practice these skills under simulated conditions and demonstrate their competency as per the assessment that is outlined in the assessment section of this course profile. For these sessions, attendance is compulsory.</p>\n<p><br/></p>\n<p>If students are not able to attend these sessions in full and can provide a legitimate reason (i.e. medical or extenuating circumstances) then they must submit an absentee form with associated evidence to the School of Health and Rehabilitation Sciences Student and Academic Support Unit (enquiries.shrs@uq.edu.au) within three calendar days. If approval is received, students will then need to complete a make-up activity to ensure that they have reviewed the missed content and can apply it clinically (if miss the Week 5 workshop) OR have developed proficiency/competency in applying the skills in practice (if miss the simulation practicals). If students miss the workshop the make-up activity will need to be submitted by Friday, 4th of April @ 1:00pm. If students miss the simulation/practicals the make-up activity will need to be scheduled and advised by the course coordinator, but where possible will take place in either Week 12 or Week 13 of semester.</p></br></p><p><strong>Learning outcomes:</strong> L03, L04, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Measuring People, Equipment and Environments Session &amp; Simulations/Practicals</strong>",
            "topic_description": "Measuring People, Equipment and Environments Session & Simulations/Practicals In Week 5, students will be provided with a single opportunity to attend a practical session focused on developing the clinical skills necessary for measuring people, equipment, and environments. Within the session, course staff will support students to gain information and develop skills required to complete these tasks in clinical practice. For this session, attendance is compulsory. Additionally, students will be expected to attend two assigned simulations/practicals (after they have completed their OCTY3103 People Handling) to practice these skills under simulated conditions and demonstrate their competency as per the assessment that is outlined in the assessment section of this course profile. For these sessions, attendance is compulsory. If students are not able to attend these sessions in full and can provide a legitimate reason (i.e. medical or extenuating circumstances) then they must submit an absentee form with associated evidence to the School of Health and Rehabilitation Sciences Student and Academic Support Unit (enquiries.shrs@uq.edu.au) within three calendar days. If approval is received, students will then need to complete a make-up activity to ensure that they have reviewed the missed content and can apply it clinically (if miss the Week 5 workshop) OR have developed proficiency/competency in applying the skills in practice (if miss the simulation practicals). If students miss the workshop the make-up activity will need to be submitted by Friday, 4th of April @ 1:00pm. If students miss the simulation/practicals the make-up activity will need to be scheduled and advised by the course coordinator, but where possible will take place in either Week 12 or Week 13 of semester.",
            "learning_outcomes": [
                "L03",
                "L04",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Case-based learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Compulsory Session with Service Consumer</strong><br><p>In Week 5, students will be provided with a single opportunity to attend a service consumer (client/participant) session. This session will be used as an opportunity to provide details of and insights into the service consumer the Case-Based Series Assessment is centred around. Within the session, course staff will support students to gain information about the consumer and the consumer/equipment specifications necessary for the completion of the Case-Based Series Assessment submissions (i.e., Presentation and Facilitated Discussion, Report, and Clinical Supervision Viva) for this course. For this session, attendance is compulsory and will be recorded.</p>\n<p><br/></p>\n<p>If students are not able to attend this session and can provide a legitimate reason (i.e. medical or extenuating circumstances) then they must submit an absentee form with associated evidence to the School of Health and Rehabilitation Sciences Student and Academic Support Unit (enquiries.shrs@uq.edu.au) within three calendar days. If approval is received, students will then need to complete a make-up activity to ensure that they have received and engaged with the necessary case-based series assessment-related information that was gathered within the session. This make-up activity will need to be submitted by Monday, 7th of April 2025 @ 4:00pm (16:00). </p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Compulsory Session with Service Consumer</strong>",
            "topic_description": "Compulsory Session with Service Consumer In Week 5, students will be provided with a single opportunity to attend a service consumer (client/participant) session. This session will be used as an opportunity to provide details of and insights into the service consumer the Case-Based Series Assessment is centred around. Within the session, course staff will support students to gain information about the consumer and the consumer/equipment specifications necessary for the completion of the Case-Based Series Assessment submissions (i.e., Presentation and Facilitated Discussion, Report, and Clinical Supervision Viva) for this course. For this session, attendance is compulsory and will be recorded. If students are not able to attend this session and can provide a legitimate reason (i.e. medical or extenuating circumstances) then they must submit an absentee form with associated evidence to the School of Health and Rehabilitation Sciences Student and Academic Support Unit (enquiries.shrs@uq.edu.au) within three calendar days. If approval is received, students will then need to complete a make-up activity to ensure that they have received and engaged with the necessary case-based series assessment-related information that was gathered within the session. This make-up activity will need to be submitted by Monday, 7th of April 2025 @ 4:00pm (16:00).",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Team Based Learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Presentation Attendance &amp; Professional Evaluations</strong><br><p>In Week 9, students must attend (compulsory), in full, all presentations for their Presentation and Facilitated Discussion session on Monday 28th April 2025 OR Friday 2nd May 2025. Sign-on for these sessions will occur in Week 5. During these presentations students will actively participate in professional colleague evaluations (within own group) for all groups that present, submitting the group evaluation online.</p>\n<p><br/></p>\n<p>If students are not able to attend their session in full and can provide a legitimate reason (i.e. medical or extenuating circumstances) then they must submit an absentee form with associated evidence to the School of Health and Rehabilitation Sciences Student and Academic Support Unit (enquiries.shrs@uq.edu.au) within three calendar days. If approval is received, students will then need to complete a make-up activity to ensure that they have reviewed the missed presentations/facilitated discussions and have reflected upon and evaluated the recommendations/clinical justifications within each of the missed presentations. This make-up activity will need to be submitted by Monday, 12th of May 2025 @ 4:00pm.</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Presentation Attendance &amp; Professional Evaluations</strong>",
            "topic_description": "Presentation Attendance & Professional Evaluations In Week 9, students must attend (compulsory), in full, all presentations for their Presentation and Facilitated Discussion session on Monday 28th April 2025 OR Friday 2nd May 2025. Sign-on for these sessions will occur in Week 5. During these presentations students will actively participate in professional colleague evaluations (within own group) for all groups that present, submitting the group evaluation online. If students are not able to attend their session in full and can provide a legitimate reason (i.e. medical or extenuating circumstances) then they must submit an absentee form with associated evidence to the School of Health and Rehabilitation Sciences Student and Academic Support Unit (enquiries.shrs@uq.edu.au) within three calendar days. If approval is received, students will then need to complete a make-up activity to ensure that they have reviewed the missed presentations/facilitated discussions and have reflected upon and evaluated the recommendations/clinical justifications within each of the missed presentations. This make-up activity will need to be submitted by Monday, 12th of May 2025 @ 4:00pm.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Wheelchair and Seating Professional Development</strong><br><p>This professional development event is a single-day-long opportunity, held on a Saturday, for students to gain knowledge from and interact with clients/consumers, occupational therapists, suppliers, and equipment and technology related to experiences of using a mobility aid, wheelchair/motorised mobility aid and seating recommendations, completing relevant documentation/scripts and writing associated assistive technology reports. It will include presentations, demonstrations, and opportunities to view and interact with relevant technologies. Information presented at this event is assessable and will not be made available post-completion of the event, therefore, student attendance is strongly encouraged.</p></br></p><p><strong>Learning outcomes:</strong> L02, L04, L05</p></div></td>",
            "topic_title": "<strong>Wheelchair and Seating Professional Development</strong>",
            "topic_description": "Wheelchair and Seating Professional Development This professional development event is a single-day-long opportunity, held on a Saturday, for students to gain knowledge from and interact with clients/consumers, occupational therapists, suppliers, and equipment and technology related to experiences of using a mobility aid, wheelchair/motorised mobility aid and seating recommendations, completing relevant documentation/scripts and writing associated assistive technology reports. It will include presentations, demonstrations, and opportunities to view and interact with relevant technologies. Information presented at this event is assessable and will not be made available post-completion of the event, therefore, student attendance is strongly encouraged.",
            "learning_outcomes": [
                "L02",
                "L04",
                "L05"
            ]
        }
    ]
}