{
    "course_title": "Quality Use of Medicines B1",
    "study_period": "Sem 1 2025",
    "location": "Dutton Park",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/PHRM3011-21162-7520",
    "full_course_code": "PHRM3011-21162-7520",
    "course_code": "PHRM3011",
    "class_code": "21162",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Apply knowledge of the physiological processes and risk factors associated with cardiovascular  disease, haematological disorders, and renal disease."
        },
        {
            "number": "LO2.",
            "description": "Apply knowledge of therapeutics for drugs affecting cardiovascular and renal systems by considering optimal treatment, prevention and care plans, and modify these when necessary."
        },
        {
            "number": "LO3.",
            "description": "Discuss Over-The-Counter (OTC), alternative and complementary medicines, and lifestyle issues relevant to drug treatment strategies."
        },
        {
            "number": "LO4.",
            "description": "Demonstrate skills in dispensing proprietary products."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate effective patient centred care on prescription and OTC medicines, and non-drug alternatives."
        },
        {
            "number": "LO6.",
            "description": "Apply information retrieval skills by using appropriate resources in a given clinical situation."
        },
        {
            "number": "LO7.",
            "description": "Appreciate cultural issues associated with pharmacy practice."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Dispensing Portfolio",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 5/03/2025 - 14/05/2025</p></dd>",
            "learning_objectives": "L04, L05, L06",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Dispensing Portfolio (Professional Practice Portfolio - PPP): </strong>Dispensing is a key skill required to practise as a pharmacist. It is therefore essential that pharmacy students can demonstrate a satisfactory understanding of the dispensing process prior to their graduation. There are 10 (ten) prescriptions to be dispensed, worth 2% each. This assessment is done during the five (5) dispensing tutorials so you need to attend the dispensing tutorials to be eligible to complete it. Each dispensing tutorial has between one and three pre-allocated prescriptions to dispense.</p>\n<ul>\n<li><strong>Scenario background: </strong>In this assessment students are taking the assumed role of a pharmacist. Imagine that your dispensing tutorials are in a pharmacy dispensary. Depending on the learning activity, the dispensing may involve checking prescriptions for clinical appropriateness, sorting out any administration and funding issues, product selection, and labelling medications including CALs.</li>\n<li>Pre-allocated prescriptions from the dispensing student manuals will be dispensed and uploaded to Blackboard under a submission folder. You have until the end of day (5pm) after each dispensing tutorial to upload your evidence of dispensing (photo of the original Rx, product photo and your labels).</li>\n<li><strong>Students are encouraged to have your dispensing peer-checked prior to submission for accuracy and any errors (see below). </strong>Checking of dispensing is an essential step and is considered best practice.</li>\n<li>The submission will be a single attempt and NO re-submission allowed. Each submission will be marked as either correct or incorrect.</li>\n<li>The 10 pre-allocated prescriptions that make-up the portfolio (2% for each dispensing) will be uploaded to Blackboard by the student at the end of each dispensing tutorial as a JPEG (smart mobile photo) or Blackboard compatible format.</li>\n</ul>\n<p><strong>Learning resources</strong> will be made available under Assessment/Dispensing Accuracy on the PHRM3011 Blackboard site and will be discussed during tutorials. The recommended CAL labels document will also be made available in this location.</p>\n<p><strong>This task prohibits use of AI.</strong> This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<p><strong>Criteria &amp; Marking: </strong>A marking guide will be provided in tutorials.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit through links on the PHRM3011 Blackboard site under 'dispensing portfolio'. Dispensing evidence will be uploaded to the ePortfolio folder and must include: 1) the original prescription with third-party PBS label attached, 2) the labelled product(s) and 3) the required CALs (according to the APF) appropriately attached to the product. There is no re-submission for this assessment. Dispensing to a patient is not a process that allows for multiple attempts.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Placement Reflection and ILP",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 16/05/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L06, L07",
            "mode": "Activity/ Performance, Written",
            "category": "Paper/ Report/ Annotation, Placement, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The year 3 community pharmacy placement is over <strong>6 consecutive weeks</strong> (Weeks 5-10 of semester 1) with <strong>3-4 h of placement per week</strong>.</p>\n<ul>\n<li>Attendance and participation in the Community Pharmacy Placement is a required component of PHRM3011. The focus (where possible) of this placement is on the supply of prescribed cardiovascular medicines. </li>\n<li>The placement MUST be unpaid, in accordance with university policy.</li>\n<li>Placements can <strong>NOT</strong> be conducted until an agreement is in place between the placement pharmacy and the university. It is the student’s responsibility to check if their placement has been approved in InPlace before they attend their placement.</li>\n<li>Absences due to illness are to be covered by a medical certificate that will be emailed to placements@pharmacy.uq.edu.au. On the day(s) when the student is unable to attend their placement, they should notify the preceptor (as soon as it is safe to do so) that they will not be attending the placement. Irrespective of medical certificates, any absences must be discussed at a convenient time to the preceptor as to the possibility of making up the hours and any updates to be made with notice to the Course Coordinator and by email to placements@pharmacy.uq.edu.au.</li>\n<li>Where students identify circumstances that may affect their ability to undertake placement tasks, or complete their placement on time, this information must be communicated to the Course Coordinator and School of Pharmacy Administration as soon as possible to ensure that processes can be put in place to address the situation affecting the completion of the placement requirements.</li>\n<li>Students are reminded that altering or falsifying any documentation that the University requires of the student (e.g. medical certificates or other academic documentation, such as placement attendance statements or other placement task documents) is university misconduct and the student will be held liable for their actions according to the University of Queensland Student Integrity and Misconduct Policy.</li>\n</ul>\n<p><strong><em>Reflection:</em></strong> Write up to a maximum of 300 words in which you reflect on your learning and the feedback you received from your preceptor. The reflection will provide the basis on which to prepare your ILP.</p>\n<p><strong><em>ILP:</em></strong> Draft an ILP and bring to your placement de-brief tutorial to discuss with your peers. Your ILP includes:</p>\n<ul>\n<li>learning goals for your next placement,</li>\n<li>skills development,</li>\n<li>activities required to meet your goals and evaluation that you achieved your learning goals.</li>\n</ul>\n<p>See the Learn.UQ (Blackboard) site for details and marking criteria.</p>\n<p><em>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit assessment components to the ePortfolio Reflective diary (One Case Only includes an individual learning plan/ILP); Evidence of developing skills (related to the case reflection); Dispensing tasks (ten items); and Placement attendance, Feedback and Student evaluation) through the links from the PHRM3011 Blackboard site (under 'Assessment', 'Community Pharmacy Placements') or to InPlace (Placement site details) as indicated.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Online Closed-Book Inspera Exam (invigilated)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>35%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>7/06/2025 - 21/06/2025</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<ul>\n<li>The End of Semester (EOS) final written exam (2 h + 10 min perusal) will consist of multiple choice questions (MCQs) and short answer questions (SAQs). The examination will assess knowledge (content) including application of knowledge to cases (see below).</li>\n<li>Calculators may be necessary to check doses or make simple calculations e.g. BMI. See university restrictions.</li>\n<li>The exam will be undertaken via the Inspera eAssessment platform (as will any deferred or supplementary written exams). Go to the <a href=\"https://elearning.uq.edu.au/student-guides-original/inspera-assessment-original\">Inspera Assessment Information page link</a> to navigate to the Library Services web page which provides further information on: how to access Inspera, on-campus invigilated exams in Inspera, device requirements, familiarisation opportunities, submitting assessment and access to the Student Laptop Scheme and short-term laptop-loans.</li>\n<li>Further details and marking information will be provided in the Blackboard site during semester. </li>\n</ul>\n<p>Case-based scenarios will be based on the following:</p>\n<ol>\n<li>heart failure</li>\n<li>hypertension</li>\n<li>acute coronary syndrome/heart disease</li>\n<li>an arrhythmia</li>\n</ol>\n<p>In your response, you will be required to:</p>\n<ul>\n<li>demonstrate an understanding of the pathophysiology of the condition being treated and the mechanisms by which key classes of drugs work,</li>\n<li>apply the evidence and best-practice guidance regarding management of the condition to the individual,</li>\n<li>identify and evaluate the risk of adverse events associated with treatment,</li>\n<li>justify the management plan,</li>\n<li>consider the ways in which individual patient factors and social situation affect treatment and outcomes,</li>\n<li>evaluate and adjust the treatment plan as disease progresses.</li>\n</ul>\n<p><strong>This task prohibits use of AI. </strong><em>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Oral Structured Clinical Exam (OSCE)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>7/06/2025 - 21/06/2025</p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L06, L07",
            "mode": "Oral",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<ul>\n<li>The oral clinical examination or OSCE is a school-based exam (In-Person) that is scheduled during the examination period (the exact date will be provided before end of semester). Student names and exam sessions will be posted on Blackboard prior to the exam revision period on the university calendar.</li>\n<li>The oral exam will consist of two stations:</li>\n</ul>\n<p><strong>Station One [Discussion with a) Doctor and b) Patient; 10 min perusal; 10 min exam; 20% overall]:</strong> At this station you are required to </p>\n<ul>\n<li><strong>a) identify, explain, and discuss with a doctor (10% overall)</strong>, any potential issues that are identified after listening to an audio recording between a patient and a pharmacist. You will need to consider the patient's medicines, new, and existing. Clinical issues could include clarification of dose, appropriateness of dose, drug interactions, monitoring, appropriateness of therapy, optimising therapy, contra-indications or precautions, allergies, and previous adverse drug reactions. In addition, patient-centre care will be an important aspect of each case and identifying all patient specific factors, for example, difficultly remembering to take medicines or not understanding how a medicine helps or why is a reduced salt diet necessary.</li>\n<li>After resolution of the clinical issue, you will then <strong>b) provide patient counselling (10% overall)</strong> to the 'patient' for the solution that was agreed to with the 'doctor'. During this interaction the student will need to explain to the patient how to use the medication including: dose; frequency; duration; adverse effects and their management, monitoring, and specific lifestyle issues in patient centred language.</li>\n<li>Timings for the station are: <strong>1)</strong> 10 minutes perusal to listen to the pharmacist-patient audio file, take notes, and peruse resources; and <strong>2)</strong> 10 minutes to: <strong>a) discuss and resolve any identified issues with the doctor </strong>and <strong>b) provide patient counselling</strong>. Students need to manage the second 10 minute block to ensure that both of the required tasks are completed in the allocated time (allow ~ 5 min for each discussion). The focus is on communicating and explaining, and you should demonstrate understanding of the medication, medical condition and the context, including the patient’s situation - hence patient centred care (PCC). Resources are allowed for Station One (see below).</li>\n</ul>\n<p><strong>Station Two (Drug Knowledge; 5 min; no perusal; 5% overall): </strong>You will be provided with a cardiovascular drug to treat a specified condition. You will be required to answer questions from the examiner. The drug for station 2 will be a category 1 drug from the personal medicines formulary (PMF) (Year 3, Semester 1 only). Resources will not be allowed at this station and there will be no perusal. The examiner can guide the discussion based on the marking rubric - if desirable. This station examines your drug knowledge. These could include questions similar to:</p>\n<ul>\n<li>i) drug dosing (e.g. starting, maintenance and maximum dose; situations where you might need to modify dose),</li>\n<li>ii) class of medication, </li>\n<li>iii) indications/place in therapy and alternative options, </li>\n<li>iv) mechanism of action, </li>\n<li>v) common/important adverse effects, and </li>\n<li>vi) monitoring/lab tests (target test results).</li>\n</ul>\n<p><strong>Resources:</strong> Students are permitted to have ONLY a pen + blank paper (both provided by the school) and an approved calculator into the exam (see Section 6.1 of this ECP for information on the use of calculators in the examination; you may need a calculator to check doses). Students are NOT permitted to have any other resources into the exam; this includes but is not limited to, notes, phones, textbooks or watches. Access to key pharmacy texts are provided by the school for station one (latest versions of the AMH and APF). Students should ensure they are familiar with these resources prior to the exam. No resources are allowed for station two.</p>\n<p><strong>Resubmission: </strong>Students who attend but fail the oral structured clinical exam will be offered an opportunity to re-sit the exam. The maximum result for a re-sit exam is a pass (i.e. 50% of available marks). The re-sit assessment will be at a date and time determined by the course coordinator and cannot be deferred.</p>\n<p><strong>Assessment Recording: </strong>UQ policy requires that oral assessments worth 20% or more should have a students performance recorded and retained as the official recording of the item for re-mark purposes (and only for this purpose). This will be managed via a recorder for the face-to-face OSCEs.</p>\n<p>This task prohibits use of AI. This assessment task is to be completed in-person. The use of Artificial Intelligence (AI) tools will not be permitted. Any attempted use of AI may constitute student misconduct under the Student Code of Conduct.</p>\n<p><strong>Criteria &amp; Marking: </strong>The rubric will be provided during tutorials.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission: </strong>The oral consultation examination is a school-based exam that is scheduled during the examination period.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Cardiovascular conditions and therapeutics</strong><br><p><strong>Delivered via pre-recorded lectures</strong>: Cardiovascular risk, smoking cessation, therapeutics associated with cardiovascular disease, arrhythmias, clotting disorders, hypertension, coronary (ischaemic) heart disease, blood lipid disorders, heart failure, renal conditions.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L06, L07</p></div></td>",
            "topic_title": "<strong>Cardiovascular conditions and therapeutics</strong>",
            "topic_description": "Cardiovascular conditions and therapeutics Delivered via pre-recorded lectures : Cardiovascular risk, smoking cessation, therapeutics associated with cardiovascular disease, arrhythmias, clotting disorders, hypertension, coronary (ischaemic) heart disease, blood lipid disorders, heart failure, renal conditions.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Dispensing and patient consulting</strong><br><p>2h/week for 12 weeks; Arrhythmias (mainly AF), smoking cessation, hypertension (HTN), coronary (ischaemic) heart disease (CHD or IHD), and heart failure (HF).</p></br></p><p><strong>Learning outcomes:</strong> L04</p></div></td>",
            "topic_title": "<strong>Dispensing and patient consulting</strong>",
            "topic_description": "Dispensing and patient consulting 2h/week for 12 weeks; Arrhythmias (mainly AF), smoking cessation, hypertension (HTN), coronary (ischaemic) heart disease (CHD or IHD), and heart failure (HF).",
            "learning_outcomes": [
                "L04"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 5 To Week 10(24 Mar - 11 May)",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Community Pharmacy Experiential Placement</strong><br><p>3-4 hours per week for 6 weeks during semester (teaching weeks 5-10).</p></br></p><p><strong>Learning outcomes:</strong> L03, L04, L05, L07</p></div></td>",
            "topic_title": "<strong>Community Pharmacy Experiential Placement</strong>",
            "topic_description": "Community Pharmacy Experiential Placement 3-4 hours per week for 6 weeks during semester (teaching weeks 5-10).",
            "learning_outcomes": [
                "L03",
                "L04",
                "L05",
                "L07"
            ]
        }
    ]
}