{
    "course_title": "Pharmacokinetics and Medicines Management",
    "study_period": "Sem 1 2025",
    "location": "Dutton Park",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/PHRM2500-20207-7520",
    "full_course_code": "PHRM2500-20207-7520",
    "course_code": "PHRM2500",
    "class_code": "20207",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Apply knowledge of the concept of clearance and use this knowledge to design appropriate steady-state dosing regimens."
        },
        {
            "number": "LO2.",
            "description": "Identify components of clearance (hepatic and renal) and their relationships to perfusion, extraction ratio and organ function; and apply this information to predict how changes in these factors might influence a patients drug dosing requirements and treatment outcomes."
        },
        {
            "number": "LO3.",
            "description": "Apply knowledge of the concepts related to apparent volume of distribution of a drug and use this knowledge in the selection of an appropriate starting dose."
        },
        {
            "number": "LO4.",
            "description": "Apply the principles of non-compartmental analysis (NCA) and compartmental analysis and be able to appraise these methodologies."
        },
        {
            "number": "LO5.",
            "description": "Apply knowledge of the concept of drug absorption and bioavailability and use this knowledge to assess how this might impact on a patients drug dosing requirements and treatment outcomes."
        },
        {
            "number": "LO6.",
            "description": "Apply knowledge of the concept of non-linear pharmacokinetics and use this knowledge to assess how this might impact on a patients drug dosing requirements and treatment outcomes."
        },
        {
            "number": "LO7.",
            "description": "Apply knowledge of the major mechanisms through which drugs are eliminated from the body and appreciate how variation in these processes may affected a patients drug dosing requirement and treatment outcomes."
        },
        {
            "number": "LO8.",
            "description": "Explain the concept of therapeutic drug monitoring and target concentration intervention and how this might be applied to make dosing recommendations."
        },
        {
            "number": "LO9.",
            "description": "Apply the concept of variability in pharmacokinetic parameters within a population due to physiological variables, pathological changes and genetic differences and critique their potential impact on drug dosing requirements and treatment outcomes."
        },
        {
            "number": "LO10.",
            "description": "Explain and predict variation in patient dosage requirements and drug concentrations in terms of patient physiology, pathological changes, and genetic differences."
        },
        {
            "number": "LO11.",
            "description": "Apply knowledge of the relationship between drug concentration and effect (pharmacodynamics) and make predictions based on this relationship."
        },
        {
            "number": "LO12.",
            "description": "Apply knowledge of how to optimise a dosing regimen and design one, as well as evaluate alternative designs."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Quiz 1, Quiz 2, Quiz 3, Quiz 4 (A series of 4 separate online quizzes)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40% (10% per quiz ) </dd>",
            "due_date": "<dd><p>Quiz 1 - 24/03/2025 5:00 pm</p>\n<p>Quiz 2 - 7/04/2025 5:00 pm</p>\n<p>Quiz 3 - 6/05/2025 5:00 pm</p>\n<p>Quiz 4 -  26/05/2025 5:00 pm</p>\n<p>\n</p><p>Each quiz has a separate due date. Complete and submit the quiz in the time (usually 7 days) prior to this deadline.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L12",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<ul>\n<li>This assessment comprises of four separate quizzes delivered through Learn.UQ.</li>\n<li>Each quiz contains a random selection of 10 to 15 questions from pools of questions.</li>\n<li>Once opened students have 60 minutes to complete the quiz.</li>\n<li>Quizes may assess all material covered by the time of quiz opening (including UQ extend content, workshops, tutorials and assignment), however questions will tend to focus on material covered in recent weeks.</li>\n<li>Each quiz may consist of (but is not limited to) multiple choice, problem solving and numeric calculation questions that test understanding and knowledge gained and the application of that knowledge. Quiz questions may involve assessment of scientific literature or case studies. </li>\n<li>Work independently to complete each quiz.</li>\n<li>Only ONE attempt at each quiz is allowed.</li>\n<li>Each quiz has a separate due date.</li>\n<li>This quiz is automatically marked. If your answer is correct, you will receive full points for that question. If your answer is incorrect, you will receive no points for that question.</li>\n<li>Further details on this piece of assessment, will be provided in the assessment area of Learn.UQ during the semester.</li>\n<li>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Quiz distribution and submission will be administered through Learn.UQ.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Designing a drug dosage regimen",
            "special_indicators": [],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 16/04/2025 5:00 pm</p>\n<p>\n</p><p>Complete and submit the assignment prior to this deadline.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L12",
            "mode": "Written",
            "category": "Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<ul>\n<li>The assignment involves graphing and analysis of intravenous and oral pharmacokinetic data to estimate pharmacokinetic parameter values and provide appropriate dosing recommendations for a patient.</li>\n<li>Students may receive different datasets to analyse.</li>\n<li>Students can elect to work individually or in groups of 2 or 3 people on this assignment.</li>\n<li>Further details about this assignment, the assignment questions, and marks allocated to each question will be provided in the assessment area of Blackboard during the semester.</li>\n<li>This task has been designed to be challenging, authentic and complex. Whilst students may use Artificial Intelligence (AI) and Machine Translation (MT) technologies, successful completion of the assessment will require students to critically engage in specific contexts and tasks for which AI will provide only limited support and guidance. A failure to reference AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignment distribution and submission will be administered through Learn.UQ.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Digital, on-campus, invigilated exam in Inspera",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>7/06/2025 - 21/06/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<ul>\n<li>This invigilated, digital exam will be run centrally in the University examination period.</li>\n<li>This exam will assess content covered in the course within UQ extend, workshops, tutorials and the course assignment. </li>\n<li>This exam may consist of (but is not limited to) multiple choice, multiple response, matching/pairing, numeric calculation, hotspot, drag and drop, graphic matching, and short answer questions that test understanding and knowledge gained and the application of that knowledge. Exam questions may involve assessment of scientific literature or case studies. </li>\n<li>This exam will involve use of the Inspera platform.</li>\n<li>Students need to complete this exam using a device of their own.</li>\n<li>This assessment task is to be completed in-person. </li>\n<li>Further details about this exam will be provided in the assessment area of Learn.UQ during the semester.</li>\n<li>Further details about Inspera Assessment including an introduction to Inspera functionality and where to go for support are available here: <a href=\"https://web.library.uq.edu.au/library-services/it/assessments-inspera\">Assessments in Inspera</a>.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1</strong><br/><p>Introduction to course and drug clearance. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 1</strong>",
            "topic_description": "Week 1 Introduction to course and drug clearance. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2</strong><br/><p>Drug volume of distribution and non-compartmental analysis. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions. </p></p><p><strong>Learning outcomes:</strong> L03, L04</p></div></td>",
            "topic_title": "<strong>Week 2</strong>",
            "topic_description": "Week 2 Drug volume of distribution and non-compartmental analysis. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions.",
            "learning_outcomes": [
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3 </strong><br/><p>Drug absorption and bioavailability. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions. Attend the tutorial at the School of Pharmacy and Pharmaceutical Sciences which provides an opportunity to develop and practice your skills.</p></p><p><strong>Learning outcomes:</strong> L05</p></div></td>",
            "topic_title": "<strong>Week 3 </strong>",
            "topic_description": "Week 3 Drug absorption and bioavailability. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions. Attend the tutorial at the School of Pharmacy and Pharmaceutical Sciences which provides an opportunity to develop and practice your skills.",
            "learning_outcomes": [
                "L05"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4 </strong><br/><p>Bioequivalence and half-life. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions. Attend the tutorial at the School of Pharmacy and Pharmaceutical Sciences which provides an opportunity to develop and practice your skills.</p></p><p><strong>Learning outcomes:</strong> L01, L05</p></div></td>",
            "topic_title": "<strong>Week 4 </strong>",
            "topic_description": "Week 4 Bioequivalence and half-life. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions. Attend the tutorial at the School of Pharmacy and Pharmaceutical Sciences which provides an opportunity to develop and practice your skills.",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5 </strong><br/><p>Compartmental analysis and non-linear pharmacokinetics. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions. Attend the tutorial at the School of Pharmacy and Pharmaceutical Sciences which provides an opportunity to develop and practice your skills.</p></p><p><strong>Learning outcomes:</strong> L04, L06</p></div></td>",
            "topic_title": "<strong>Week 5 </strong>",
            "topic_description": "Week 5 Compartmental analysis and non-linear pharmacokinetics. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions. Attend the tutorial at the School of Pharmacy and Pharmaceutical Sciences which provides an opportunity to develop and practice your skills.",
            "learning_outcomes": [
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6</strong><br/><p>Drug metabolism and biliary elimination. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions. Attend the tutorial at the School of Pharmacy and Pharmaceutical Sciences which provides an opportunity to develop and practice your skills.</p></p></div></td>",
            "topic_title": "<strong>Week 6</strong>",
            "topic_description": "Week 6 Drug metabolism and biliary elimination. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions. Attend the tutorial at the School of Pharmacy and Pharmaceutical Sciences which provides an opportunity to develop and practice your skills.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7 </strong><br/><p>Drug plasma protein binding and renal elimination. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions.</p></p></div></td>",
            "topic_title": "<strong>Week 7 </strong>",
            "topic_description": "Week 7 Drug plasma protein binding and renal elimination. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8</strong><br/><p>Pharmacokinetic variability and genetics. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions. </p></p><p><strong>Learning outcomes:</strong> L09</p></div></td>",
            "topic_title": "<strong>Week 8</strong>",
            "topic_description": "Week 8 Pharmacokinetic variability and genetics. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions.",
            "learning_outcomes": [
                "L09"
            ]
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9</strong><br/><p>Pharmacokinetic variability continued. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions. Attend the tutorial at the School of Pharmacy and Pharmaceutical Sciences which provides an opportunity to develop and practice your skills.</p></p><p><strong>Learning outcomes:</strong> L09, L10</p></div></td>",
            "topic_title": "<strong>Week 9</strong>",
            "topic_description": "Week 9 Pharmacokinetic variability continued. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions. Attend the tutorial at the School of Pharmacy and Pharmaceutical Sciences which provides an opportunity to develop and practice your skills.",
            "learning_outcomes": [
                "L09",
                "L10"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10</strong><br/><p>Pharmacodynamics. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions. </p></p><p><strong>Learning outcomes:</strong> L11</p></div></td>",
            "topic_title": "<strong>Week 10</strong>",
            "topic_description": "Week 10 Pharmacodynamics. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions.",
            "learning_outcomes": [
                "L11"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11</strong><br/><p>Pharmacokinetic dosage individualisation. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions. Attend the tutorial at the School of Pharmacy and Pharmaceutical Sciences which provides an opportunity to develop and practice your skills.</p></p><p><strong>Learning outcomes:</strong> L08, L12</p></div></td>",
            "topic_title": "<strong>Week 11</strong>",
            "topic_description": "Week 11 Pharmacokinetic dosage individualisation. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions. Attend the tutorial at the School of Pharmacy and Pharmaceutical Sciences which provides an opportunity to develop and practice your skills.",
            "learning_outcomes": [
                "L08",
                "L12"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12</strong><br/><p>Designing dosage regimens and pharmacokinetics of monoclonal antibodies. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions. Attend the tutorial at the School of Pharmacy and Pharmaceutical Sciences which provides an opportunity to develop and practice your skills. </p></p><p><strong>Learning outcomes:</strong> L12</p></div></td>",
            "topic_title": "<strong>Week 12</strong>",
            "topic_description": "Week 12 Designing dosage regimens and pharmacokinetics of monoclonal antibodies. Complete the active online learning via UQ Extend before attending the weekly online workshop to discuss content and ask questions. Attend the tutorial at the School of Pharmacy and Pharmaceutical Sciences which provides an opportunity to develop and practice your skills.",
            "learning_outcomes": [
                "L12"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13</strong><br/><p>Attend the tutorial at the School of Pharmacy and Pharmaceutical Sciences which provides an opportunity to develop and practice your skills.</p></p><p><strong>Learning outcomes:</strong> L12</p></div></td>",
            "topic_title": "<strong>Week 13</strong>",
            "topic_description": "Week 13 Attend the tutorial at the School of Pharmacy and Pharmaceutical Sciences which provides an opportunity to develop and practice your skills.",
            "learning_outcomes": [
                "L12"
            ]
        }
    ]
}