{
    "course_title": "QUM Pharmacy Practice Placement",
    "study_period": "Sem 1 2025",
    "location": "Dutton Park",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/PHRM4072-21766-7520",
    "full_course_code": "PHRM4072-21766-7520",
    "course_code": "PHRM4072",
    "class_code": "21766",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate reflective practice, professional competence, interpersonal skills and expertise in the Australian community pharmacy setting; including the development of learning plans for experiential placements"
        },
        {
            "number": "LO2.",
            "description": "Relate your knowledge, skills, and professional attributes acquired throughout the Pharmacy degree in the context of your placement experience"
        },
        {
            "number": "LO3.",
            "description": "Reflect on your placement experience and relate it to your personal and professional development, including in the context of the National Competency Standards Framework for Pharmacists in Australia 2016, life-long learning, and future employability"
        },
        {
            "number": "LO4.",
            "description": "Demonstrate responsiveness to physically, socially, and culturally diverse patient populations in community pharmacy contexts"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Weekly SEAL Reflections",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p>SEAL Submission 1: 2 x NCS Schema 7/03/2025 5:00 pm</p>\n<p>SEAL Submission 2: 2 x NCS Schema 21/03/2025 5:00 pm</p>\n<p>SEAL Submission 3: 1 x LLL Schema + 1 x Employability Schema 17/04/2025 5:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will need to submit a total of SIX reflections according to the schemas and submission dates as outlined below.</p>\n<ul>\n<li>SEAL Submission 1: 2 x NCS Schema</li>\n<li>SEAL Submission 2: 2 x NCS Schema</li>\n<li>SEAL Submission 3: 1 x LLL Schema + 1 x Employability Schema</li>\n</ul>\n<p>These reflections are a significant part of this course, and students are expected to provide a high standard of reflection for each submission. The key component of reflection is ensuring the creation of a specific plan to aid learning within the scope of the situation, and describing how this action is being undertaken.</p>\n<p><strong>Each reflection should not exceed 500 words. More information and marking rubrics for the SEAL reflections can be found on Learn.UQ on the Assessment page.</strong> </p>\n<p>Students should consider their individual experiences during their Placement in order to reflect effectively within each of the different schemas described below: </p>\n<p><strong>1. National Competency Standards (NCS) schema:</strong> Please read the relevant <strong><em>National Competency Standards (NCS) Framework for Pharmacists in Australia 2016</em></strong> (as available through the course Blackboard site) and familiarise yourself with the Standards before attending your placement. Students are to reflect on ONE chosen Enabling Competency from the NCS in each reflection. Each selected Enabling Competency should be different from the others. Students should reflect on the level of skills, knowledge or professional attributes they acquired/demonstrated during their placement experience and relate this clearly to the chosen Enabling Competency. Students are also encouraged to reflect on their own unique personal experiences (e.g. feelings, personal attributes, individual strengths/weaknesses at this stage of development, etc). </p>\n<p><strong>2.</strong> <strong>Lifelong Learning (LLL) schema</strong>: Students should reflect on their own future learning needs and how they have used feedback to inform their ongoing development, which will enable them to professionally manage their internship and joining the pharmacy profession. They should focus on how their placement uncovered specific elements of their own practice and learning that they consider to be particularly relevant to their future practice, and for becoming a lifelong learner who will remain committed to their continuing professional development. </p>\n<p><strong>3.</strong> <strong>Employability schema</strong>: Employability can be defined as a “<em>set of capabilities and personal attributes that empower graduates to perform effectively in the workplace, generate opportunities, and create positive social and economic impact”</em>. This Employability Reflection is an opportunity for students to reflect on their own personal experiences in relation to any aspects of their individual employability at this late stage of their student career path. It is strongly recommended that students familiarise themselves with, before the placement, the UQ’s Employability Framework for necessary background information on the meaning, definitions, structure, and relevant considerations in preparation for addressing this assessment item: https://employability.uq.edu.au/about/employability-framework. </p>\n<p><em>This task has been designed to be challenging, authentic and complex. Successful completion of the assessment will require students to critically engage in specific contexts and tasks for which AI will provide only limited support and guidance. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI tools.</em> </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission: </strong>This task is uploaded into the ePortfolio.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Placement Participation, Entrustable Professional Activities (EPAs) Individual Learning Plan",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 28/03/2025 5:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance, Written",
            "category": "Placement, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>PLACEMENT PARTICIPATION</strong> </p>\n<ul>\n<li>Each student must attend and complete their placement for<strong> 6 consecutive weeks, 4 days per week and at least 180 hours, in their placement pharmacy, commencing two weeks prior to Week 1 of Semester and concluding at the end of Week 4 of Semester</strong>. </li>\n<li>Any alterations to the set timeframe must be discussed with and approved by the Course Coordinator prior to the placement. </li>\n<li>All students are expected to be available to commence classes in other Year 4 courses in Week 5. </li>\n<li>The start and finish time each day will depend on the agreement between the student and their preceptor. If the placement includes a public holiday relevant to that placement site, the students are expected to attend/not attend the placement site in accordance with usual practice at that site e.g. if the facility is not open during the public holiday, then the students do not attend and that time is included within the 180 hours. </li>\n<li>In the case of illness, students are NOT expected to attend their placement and should inform their preceptor. Absences should be recorded in InPlace within 24 hours of your absence (<a href=\"https://uq.pressbooks.pub/bachelor-pharmacy-placement-handbook/chapter/record-an-absence-in-inplace/\">instructions here</a>). Students away from their placement site for greater than TWO days due to illness (i.e. on the third day) should obtain a medical certificate and provide this to the School Office and their preceptor. </li>\n<li>Students are advised to contact the Course Coordinator to notify of any prolonged absence (greater than THREE days) from the placement site due to illness. Additionally, irrespective of medical certificates, any cumulative absence over the 6-week period longer than 3 days must be immediately brought to the attention of the Course Coordinator. </li>\n</ul>\n<p><strong>ENTRUSTABLE PROFESSIONAL ACTIVITIES (EPAs)</strong>  </p>\n<ul>\n<li>Evidence of entrustment discussions with your preceptor during placement and final entrustment decision at the end of your placement should be completed via the ePortfolio. Students will choose a minimum of <strong>THREE (3)</strong> EPAs from a suite of EPAs provided that are relevant to the placement site and the students’ learning goals. Students are required to submit a statement of justification for their choice of EPAs with their EPA self-assessment. See the Learn.UQ site for more information regarding the EPAs.</li>\n</ul>\n<p><strong>INDIVIDUAL LEARNING PLAN (ILP)</strong>  </p>\n<ul>\n<li>Students should draft an ILP and discuss it with their placement preceptor after they have undertaken their EPAs during their placement. Following this discussion, students should create a final ILP incorporating the preceptor feedback. In the ILP, the student should identify where they can improve and how they intend to address the identified deficiencies. The final ILP will be completed in the ePortfolio.  </li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission: </strong>The EPA self-reflection and ILP are completed via the ePortfolio. The completed EPA self-reflections will be submitted to the student's preceptor on ePortfolio. This will trigger an email link to be sent to the Preceptor to complete the student's final EPA entrustment levels and confirm the student's attendance at the placement site via the ePortfolio.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Optimising Socially Accountable and Holistic Patient Care",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 23/05/2025 5:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Patient centred care is the fundamental foundation that underpins all aspects of pharmacy practice. Recognising the cultural, social and physical diversity of patients is essential to the delivery of a holistic healthcare solution. Socially accountable care focuses on a health care approach where practices are oriented towards community and social impact, promoting equity and prioritising the social determinants of health such as education, employment and environment, while holistic care considers treating the person as a whole, not just as a disease or symptom, and integrates mental, emotional, spiritual, physical and social needs into the care provided. </p>\n<p>As part of building an increased awareness of the diversity of patients encountered across the Community Pharmacy setting, students are required to submit a 2000 word report with the following guidelines: </p>\n<p>Identify a particular group of patients serviced by your pharmacy. Some examples may include, but are not limited to, people in the following categories: </p>\n<ul>\n<li>Physical or Cognitive Disability </li>\n<li>Aged care/Elderly </li>\n<li>Aboriginal and Torres Strait Islander People </li>\n<li>Mental Illness </li>\n<li>Culturally/Linguistically Diverse People </li>\n<li>Patients on opioid replacement therapy </li>\n<li>Low socioeconomic demographic</li>\n<li>Paediatric population</li>\n</ul>\n<p>Consider how your pharmacy caters for the socially accountable and holistic care of your selected patient demographic. <strong>Please consider a broader scope beyond just the usual clinical duties of a pharmacist </strong>(i.e. duties such as webster packs, MedsCheck, medication counselling would be considered usual clinical duties so students should explore other aspects of socially accountable and holistic care beyond these services).</p>\n<p>Some questions to consider may include: </p>\n<ul>\n<li>What protocols/procedures/trainings (if any) are in place to assist in the care of these patients (E.g. specially trained staff)? </li>\n<li>What physical assistance (if any) does your pharmacy provide (E.g. wheelchair ramp access, wide aisles, etc)? </li>\n<li>How does the physical layout of the pharmacy consider patients in your specific patient demographic? </li>\n<li>Discuss with your preceptor or other pharmacy staff and consider interviewing some patients/carers for feedback and to gather anecdotal evidence of their personal experiences. Students are encouraged to think creatively about how to gather information relevant here. </li>\n</ul>\n<p>Perform a literature review of the current evidence for best practice in the care of patients in your chosen demographic. Consider recommendations from relevant governing or professional bodies, Royal Commission recommendations, and relevant publications from contemporary research. </p>\n<ul>\n<li>Identify any gaps between current and best practice and create a plan <strong>specific to your placement pharmacy</strong>, to address gaps/implement any new recommendations to optimise socially accountable and holistic patient care in your chosen patient population. </li>\n</ul>\n<p>Your report should have a <strong>maximum of 2000 words</strong> and follow the structure outlined in the Learn.UQ course site.  </p>\n<p><em>This task has been designed to be challenging, authentic and complex. Successful completion of the assessment will require students to critically engage in specific contexts and tasks for which AI will provide only limited support and guidance. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students may be required to demonstrate detailed comprehension of their written submission independent of AI tools.</em> </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission: This assessment will be submitted via Turnitin in Learn.UQ on the Assessment page.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of FAIL if this assessment is submitted late without an approved extension.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(03 Feb - 09 Feb)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Online Introductory Lecture</strong><br><p>Online Introductory Lecture: Course Coordinator will provide a course introduction, an overview of the placement, work integrated learning, and give guidance on how to perform productively and successfully in this course. The online lecture will be available the week before placements commence (3 weeks before Week 1 of Semester). </p>\n<p>This Lecture will be held on <strong>Tuesday 4th February at 1pm </strong>- See Learn.UQ Announcements for Zoom link. </p></br></p></div></td>",
            "topic_title": "<strong>Online Introductory Lecture</strong>",
            "topic_description": "Online Introductory Lecture Online Introductory Lecture: Course Coordinator will provide a course introduction, an overview of the placement, work integrated learning, and give guidance on how to perform productively and successfully in this course. The online lecture will be available the week before placements commence (3 weeks before Week 1 of Semester). This Lecture will be held on Tuesday 4th February at 1pm - See Learn.UQ Announcements for Zoom link.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 7(10 Feb - 23 Mar)",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Community Pharmacy Practice QUM Placement</strong><br><p>A supervised experiential placement undertaken in an Australian community pharmacy over 6 consecutive weeks, 4 days/week, commencing 2 weeks prior to the first week of semester in Year 4 of the Pharmacy Program (180 experiential placement hours in total). </p>\n<p>During the pharmacy practice placement, students choose to participate in a minimum of three EPA’s from a suite of EPAs provided, based on their placement site.  </p>\n<p>These may be done as a one-off or there may be multiple opportunities to conduct these activities under observation from the preceptor. </p></br></p></div></td>",
            "topic_title": "<strong>Community Pharmacy Practice QUM Placement</strong>",
            "topic_description": "Community Pharmacy Practice QUM Placement A supervised experiential placement undertaken in an Australian community pharmacy over 6 consecutive weeks, 4 days/week, commencing 2 weeks prior to the first week of semester in Year 4 of the Pharmacy Program (180 experiential placement hours in total). During the pharmacy practice placement, students choose to participate in a minimum of three EPA’s from a suite of EPAs provided, based on their placement site. These may be done as a one-off or there may be multiple opportunities to conduct these activities under observation from the preceptor.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 7(10 Feb - 23 Mar)",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ongoing Preceptor Feedback, Discussion, Evaluation</strong><br><p><strong>Ongoing Preceptor &amp; Peer Feedback, Discussion, Evaluation</strong> </p>\n<p>Students are encouraged to actively seek out appropriate opportunities to discuss their Placement progress and ask their Preceptor for feedback in an ongoing manner. Students are encouraged to seek peer feedback on reflections to inform their development of professional skills, including reflective practice.  </p></br></p></div></td>",
            "topic_title": "<strong>Ongoing Preceptor Feedback, Discussion, Evaluation</strong>",
            "topic_description": "Ongoing Preceptor Feedback, Discussion, Evaluation Ongoing Preceptor & Peer Feedback, Discussion, Evaluation Students are encouraged to actively seek out appropriate opportunities to discuss their Placement progress and ask their Preceptor for feedback in an ongoing manner. Students are encouraged to seek peer feedback on reflections to inform their development of professional skills, including reflective practice.",
            "learning_outcomes": []
        }
    ]
}