{
    "course_title": "History of the Built Environment",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/PLAN2005-20685-7520",
    "full_course_code": "PLAN2005-20685-7520",
    "course_code": "PLAN2005",
    "class_code": "20685",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate understanding of the influences that have shaped human settlements globally and in Australia"
        },
        {
            "number": "LO2.",
            "description": "Demonstrate understanding of historical trends and processes affecting city planning and urban form"
        },
        {
            "number": "LO3.",
            "description": "Connect societal developments to city building processes"
        },
        {
            "number": "LO4.",
            "description": "Understand and apply the basic skills that planning historians use in research"
        },
        {
            "number": "LO5.",
            "description": "Work both in groups and independently toward a better understanding of traditional and modern cities"
        },
        {
            "number": "LO6.",
            "description": "Understand the value of diversity across time and place"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Paper and presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                }
            ],
            "weighting": "<dd>50% Group </dd>",
            "due_date": "<dd><p>Presentations 17/03/2025 - 26/05/2025</p>\n<p>Group paper 26/05/2025</p>\n<p>\n</p><p>All assessments are due at 1.00 pm, unless otherwise noted. </p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Oral, Written",
            "category": "Paper/ Report/ Annotation, Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Assessment Rationale:</strong></p>\n<p>30% paper, 18% presentation, 2% peer panel.</p>\n<p>The group will be the same for both presentation and papers. Group members are first required to identify a historical period / time of interest (pre-20th century). Next, groups members should collaborate to compile a critical literature review on the time / place they have selected. After completing the reading, each group member will select one case study of interest from the reading, and conduct in-depth research about its <em>history</em>, <em>social context</em>, <em>meaning</em>, <em>form</em>, <em>function</em>, and <em>scale</em>. The case study will then be applied (compared) to contemporary cities. </p>\n<p>Presentations will take place in class throughout the semester. A detailed description of this assessment will be posted on the Blackboard. Groups present together each week, starting on Week 4. Since case studies will be individual, group members should take turns presenting. One member should be elected to present the theoretical portion, based on the reading. The presentation schedule will be posted on the Blackboard. All group members are expected to be present. If someone must miss a presentation for a legitimate reason, they should apply ahead of time and present evidence (such as a doctor's note) and nominate another group member to present on their behalf. </p>\n<p>Paper submissions are in a group (one group member submits in Turnitin on behalf of group and is then responsible for sharing the feedback with the group members). Presentation and paper marks will vary based on individual performance.</p>\n<p>If students miss a peer panel for a legitimate reason, they should apply ahead of time and submit their feedback to the lecturer via email (see max. extension length). </p>\n<p>If, for whatever reason, you find that your group is not functioning effectively, please contact the Course Coordinator for support.</p>\n<p><strong>Assessment tasks prohibiting use of AI or MT:</strong> This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The School of Architecture, Design and Planning uses Blackboard and Turnitin for assessment submission. Turnitin is accessed through the course Blackboard site. Turnitin also checks for plagiarism or instances where the original work of others is not appropriately acknowledged. Uploaded files must contain readable text and not be rasterised. Students are advised to commence assignment uploads with sufficient amount of time (consider possible technical problems with computers, internet speed, etc). After successfully submitting an assignment through Turnitin, a ‘Submission Complete!’ screen will be displayed. It is the student’s responsibility to check assignment preview and confirm successful submission. If the ‘Submission Complete!’ screen isn’t displayed, the student should regard the submission as unsuccessful. Students should download a copy of the digital receipt as proof they have submitted the assignment. Students who are experiencing upload issues must advise the Course Coordinator immediately by email and should include screenshots and a copy of the assessment for submission. To meet professional accreditation, public engagement and quality assurance obligations, digital copies of all course assessment items must be submitted in addition to any hard copy submission requirements specified in individual Course / Studio Outlines. Any physical models should be photographed and a minimum of two photographs describing the complete and full model must be included in the digital submission. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>The late penalty for this assessment item will be calculated as follows: </p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Final Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                }
            ],
            "weighting": "<dd>50% IVAH </dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>7/06/2025 - 21/06/2025</p></dd>",
            "learning_objectives": "L01, L02, L03, L06",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Assessment Rationale:</strong></p>\n<p>Students will take an exam at the end of the course. The exam will be paper-based and invigilated. The questions will be randomly selected from (a) the lectures and (b) the readings throughout the semester. </p>\n<p><strong>Assessment tasks prohibiting use of AI or MT:</strong> This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>Exams submitted after the end of the submission time will incur a <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/requesting-late-penalty-exemption-online-exam\">late penalty</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture</strong><br><p>Course introduction. What is a city? The city as artifact. The city in history</p>\n<p>Planning History in Australia and SEQ. The evolution of settlements and cities. </p>\n<p>The City Edge. Walled cities, fringe belts, city gates, water edges.</p>\n<p>The City Edge. The open city, the first suburbs, urban extensions, contemporary suburbia, edge cities.</p>\n<p>Urban Divisions. Sovereign districts, religious sites, market towns, capitalist CBDs.</p>\n<p>Urban Divisions. Urban barriers, tower houses, districts, ghettos, colonialism and neo-colonialism, cultural and economic segregation.</p>\n<p>Public Places. Public realm, nature of public space, public space vitality, public space controls, courtyards, squares, public space systems and distribution, size of public space, disencumbering, totalitarian public spaces.</p>\n<p>Public Places. Shapes and uses of public spaces, classifiers, people and space, public parks, modern public spaces.</p>\n<p>The Street. \"Invention\" of streets, private streets, the street as public space, streets as power display, culture and class, regulated streets, sidewalks and paving, design of streets, setbacks, porticoes, porches.</p>\n<p>The Street. Historic street types, waterways, bridge-streets, boulevards, covered streets, modernist streets, modal separation, the return of the street in planning.</p>\n<p>The Urban Skyline. Public and private skylines, landmarks, skyline design principles throughout history, colour and light.</p>\n<p>Nature. Public parks vs. private gardens. Modern Era. Modern urban elements.</p></br></p><p><strong>Learning outcomes:</strong> L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Lecture</strong>",
            "topic_description": "Lecture Course introduction. What is a city? The city as artifact. The city in history Planning History in Australia and SEQ. The evolution of settlements and cities. The City Edge. Walled cities, fringe belts, city gates, water edges. The City Edge. The open city, the first suburbs, urban extensions, contemporary suburbia, edge cities. Urban Divisions. Sovereign districts, religious sites, market towns, capitalist CBDs. Urban Divisions. Urban barriers, tower houses, districts, ghettos, colonialism and neo-colonialism, cultural and economic segregation. Public Places. Public realm, nature of public space, public space vitality, public space controls, courtyards, squares, public space systems and distribution, size of public space, disencumbering, totalitarian public spaces. Public Places. Shapes and uses of public spaces, classifiers, people and space, public parks, modern public spaces. The Street. \"Invention\" of streets, private streets, the street as public space, streets as power display, culture and class, regulated streets, sidewalks and paving, design of streets, setbacks, porticoes, porches. The Street. Historic street types, waterways, bridge-streets, boulevards, covered streets, modernist streets, modal separation, the return of the street in planning. The Urban Skyline. Public and private skylines, landmarks, skyline design principles throughout history, colour and light. Nature. Public parks vs. private gardens. Modern Era. Modern urban elements.",
            "learning_outcomes": [
                "L03",
                "L04",
                "L06"
            ]
        }
    ]
}