{
    "course_title": "Indigenous Politics & Policy",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/POLS2101-21683-7520",
    "full_course_code": "POLS2101-21683-7520",
    "course_code": "POLS2101",
    "class_code": "21683",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Apply a critical understanding of the history and politics of Indigenous and settler relations up to the present day."
        },
        {
            "number": "LO2.",
            "description": "To identify and critically evaluate the assumptions that drive policy frameworks and strategies."
        },
        {
            "number": "LO3.",
            "description": "Apply the necessary tools and skills for critical analysis in reading, textual analysis and writing."
        },
        {
            "number": "LO4.",
            "description": "Demonstrate that the recognition of and respect for cultural and social diversity is not just a matter of identifying racial categories or cultural practices, but also identifying and reflecting on the values and knowledge systems that inform them."
        },
        {
            "number": "LO5.",
            "description": "Grasp and assess the range of arguments and perspectives articulated across the Australian political landscape in relation to issues impacting upon Aboriginal and Torres Strait Islander peoples."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Short Paper Critiques (250 words each)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30% 1,250 words </dd>",
            "due_date": "<dd><p> 18/03/2025 - 13/05/2025</p>\n<p>\n</p><p>submissions to be uploaded by 12pm (midday) of the Tuesday they are due</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>During this course you will submit 5 x 250-word short paper critiques on specific texts that are available in the course reading list (access via the Library). A short paper critique (SPC) is a highly focussed analysis of a text that addresses its structural framing rather than its content. A short paper critique does not apply an external lens to explain or analyse the text. It is not interested in the usual aspects of critical analysis such as theoretical approach, methods, or data, etc. Instead, it uses the author's own words to reveal the frameworks that shape the argument and inform the conclusions or responses to it.</p>\n<p>The ability to structurally critique is a key skill for thinking 'outside the box' and is necessary for critical engagement with Indigenous politics and policy. This task will assist you to develop your ability to identify the ideas, assumptions and beliefs informing the Indigenous-settler relationship and how these go on to inform the way policy is written and operates. This assessment develops the skills you will need to form your own argument and assess the literature you use to support it in the research essay. But learning how to structurally critique is not easy! In just 250 words it requires you to identify the author's framing of the tropic and their responses to it, and pick out the key phrases that demonstrate these frameworks. To do that means you must also become aware of your own ways of thinking about the topic. Because this is not easy there will be plenty of opportunity to practice before your first SPC is due, and the feedback you get for each paper will help you improve. The scenario work we do in tutorials will also assist you. It is therefore to your advantage to attend lectures and tutorials to give yourself the best opportunity to ask questions, practice and see a structural critique in action.</p>\n<p>Each of these short papers is worth 6% for a total of 30%.</p>\n<p>Submit each critique in Word format (<strong><em>not </em></strong>pdf) via Turnitin, by 12:00hrs (12 midday) on the Tuesday of weeks 4, 6, 8, 9 and 11.</p>\n<p>You should structure your short paper critiques in the following way:</p>\n<ul>\n<li>at the top of the page note your full name and student number and identify the text using correct referencing (see POLSIS Essay Guide)</li>\n<li>in paragraph 1 identify the issue/topic and the core argument made by the author about it (125 words). Use their own words wherever possible.</li>\n<li>in paragraph 2 provide your critique of these arguments (125 words). Identify where in the text the frameworks of the author are visible and what this means for their understanding of and response to the issue/topic.</li>\n<li>total 250 words per critique</li>\n<li>write in full sentences (i.e., not in dot point form or abbreviated English)</li>\n</ul>\n<p>You are not required to provide references. However, if you use the ideas or words of another author you must cite them appropriately in the text and include them in a reference list according to the School's Essay Guide.</p>\n<p><strong>NB:</strong> Academic integrity and plagiarism are crucial matters. You may use the Turnitin submission process to test your work for plagiarism if you wish.</p>\n<p>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit each of your completed short paper critiques in Word format (<strong><em>not</em></strong> pdf) via Turnitin. Papers are due by 12:00hrs (12 midday) on the Tuesday of weeks 4, 6, 8, 9, 11.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Tutorial-based Scenario Work",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>40% 1,250 words, hurdle assessment </dd>",
            "due_date": "<dd><p> 23/05/2025 5:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance, Oral, Written",
            "category": "Participation/ Student contribution, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The tutorial-based scenario work is designed to help you learn through doing in collaboration with your peers. In each of five tutorials (weeks 5, 6, 7, 9, 11) you will be presented with a novel stimuli. In small groups you will apply the structural critique presented in the lectures to assess the stimuli. Each group will complete a summary sheet (provided in class) for presentation to the wider tutorial group. Following each tutorial you will complete your own reflection on your engagement and learning in the tutorial. This need be no longer than 250 words and is not submitted. Over the five instances you will thus build up a record of your engagement and learning which will then form the basis of a reflective journal (1,250 words) that <strong><em>will</em></strong> be submitted. Submit this journal in Word format (<strong><em>not</em></strong> pdf) via Turnitin, by 17:00hrs (5pm) on the Friday of week 12.</p>\n<p>The marks for this assessment are divided between your participation in the tutorials (15%, 3 possible marks per week) and your reflective journal (25%, 25 possible marks).</p>\n<p>Attending and participating in tutorials is essential for completing this assessment. You must pass this assessment to pass the course. We understand that illness or other unavoidable matters can arise that prevent you from attending a specific tutorial. In this case you must contact the Course Coordinator as soon as possible, with acceptable evidence (e.g., medical certificate) to arrange an alternative assessment for that week. Please refer to Extensions and Deferrals for more information about what constitutes acceptable reasons for non-attendance/missing due dates.</p>\n<p><strong>NB:</strong> Academic integrity and plagiarism are crucial matters. You may use the Turnitin submission process to test your work for plagiarism if you wish.</p>\n<p>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit your completed reflective journal in Word format (<strong><em>not</em></strong> pdf) via Turnitin by 17:00hrs (5pm) on the Friday of week 12.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Research Essay (2500 words)",
            "special_indicators": [],
            "weighting": "<dd>30% 2,500 words </dd>",
            "due_date": "<dd><p> 9/06/2025 1:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Prepare a 2,500 word research essay in response to one of the topics which will be posted on Blackboard. The task requires you to read widely and engage closely and critically with your chosen topic. You should</p>\n<p>a) state the topic you are engaging with</p>\n<p>b) summarise (with evidence) how the topic is presented in the academic literature and/or public debate (e.g., news reports, social media, policy) and identify key issues raised/responses proposed</p>\n<p>c) critically discuss the framing of the topic and the issues raised/responses proposed in the literature using the structural critique presented in class. This requires you to make an argument about this framing and the issues and responses proposed. That argument needs to be clearly stated and supported. You should show how you have applied the structural critique used in class to the literature and to your own argument, and use the literature to demonstrate the strength of your argument.</p>\n<p>To ensure you are on track, remember to consult the marking criteria while preparing your essay, and to start early! If you have any questions, contact your tutor as early as possible to ensure you give yourself enough time to read and think and write.</p>\n<p>All sources and citations must be adequately referenced. UQ takes plagiarism very seriously and incidents carry significant penalties. For guidance on preparing a reference list and on preferred referencing styles, consult the POLSIS Essay Guide. The reference list is not included in the total word count of the essay, but in-text references (e.g., Brown, 2019) are. Footnote references and brief footnotes are not included in the word count, but more substantive footnotes are.</p>\n<p>The research essay is worth a total of 30% (30 possible marks).</p>\n<p>Submit your essay in Word format (<strong><em>not</em></strong> pdf) via Turnitin, by 13:00 hrs on the Monday of Exam Week 1 (9 June 2025).</p>\n<p><strong>NB:</strong> Academic integrity and plagiarism are crucial matters. Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit your essay in Word format (<strong><em>not</em></strong> pdf) via Turnitin, by <strong>13:00hrs </strong>on the<strong> Monday of Exam Week 1 </strong>(9 June 2025).</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1: Course Introduction and Orientation</strong><br><p>Welcome, introduction and orientation to the course and approach to learning. This lecture will outline the differences you can expect in this course.</p></br></p></div></td>",
            "topic_title": "<strong>Week 1: Course Introduction and Orientation</strong>",
            "topic_description": "Week 1: Course Introduction and Orientation Welcome, introduction and orientation to the course and approach to learning. This lecture will outline the differences you can expect in this course.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2: Worldviews</strong><br><p>Lecture and discussion on first encounters and conceptual frameworks. How has the Indigenous-settler relationship been constructed? How is our understanding of the relationship shaped? What are the implications of this for how we engage with one another, including how we think about and manage our relations?</p></br></p></div></td>",
            "topic_title": "<strong>Week 2: Worldviews</strong>",
            "topic_description": "Week 2: Worldviews Lecture and discussion on first encounters and conceptual frameworks. How has the Indigenous-settler relationship been constructed? How is our understanding of the relationship shaped? What are the implications of this for how we engage with one another, including how we think about and manage our relations?",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 1: Introduction to applying a structural critique</strong><br><p>Begin working with the structural critique introduced in lectures in preparation for scenario-based assessment and short paper critiques.</p></br></p></div></td>",
            "topic_title": "<strong>Tutorial 1: Introduction to applying a structural critique</strong>",
            "topic_description": "Tutorial 1: Introduction to applying a structural critique Begin working with the structural critique introduced in lectures in preparation for scenario-based assessment and short paper critiques.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3: Racialism</strong><br><p>Presentation on the experiences of an Aboriginal family in Queensland over the past 150 years, and implications of this experience for thinking about politics and policy.</p></br></p></div></td>",
            "topic_title": "<strong>Week 3: Racialism</strong>",
            "topic_description": "Week 3: Racialism Presentation on the experiences of an Aboriginal family in Queensland over the past 150 years, and implications of this experience for thinking about politics and policy.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 2: Practice short paper critique</strong><br><p>Attempt to write a short paper critique of a text provided.</p></br></p></div></td>",
            "topic_title": "<strong>Tutorial 2: Practice short paper critique</strong>",
            "topic_description": "Tutorial 2: Practice short paper critique Attempt to write a short paper critique of a text provided.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4: Towards Equality</strong><br><p>Lecture and discussion of the 1965 Freedom Ride and other actions calling for equality which saw the elevation of Indigenous issues to the national policy agenda. </p></br></p></div></td>",
            "topic_title": "<strong>Week 4: Towards Equality</strong>",
            "topic_description": "Week 4: Towards Equality Lecture and discussion of the 1965 Freedom Ride and other actions calling for equality which saw the elevation of Indigenous issues to the national policy agenda.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5: Self-determination</strong><br><p>Lecture and discussion on the concept of self-determination. Where does this idea come from? How is self-determination understood? How has it been used in different contexts? </p></br></p></div></td>",
            "topic_title": "<strong>Week 5: Self-determination</strong>",
            "topic_description": "Week 5: Self-determination Lecture and discussion on the concept of self-determination. Where does this idea come from? How is self-determination understood? How has it been used in different contexts?",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 3: Scenario #1</strong><br><p>This is the first of the tutorial-based activities that form part of your scenario work assessment. </p></br></p></div></td>",
            "topic_title": "<strong>Tutorial 3: Scenario #1</strong>",
            "topic_description": "Tutorial 3: Scenario #1 This is the first of the tutorial-based activities that form part of your scenario work assessment.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6: RCIADIC (Royal Commission in Aboriginal Deaths in Custody)</strong><br><p>Lecture and discussion of the 1991 Royal Commission into Aboriginal Deaths in Custody, established in 1987. What was the process? How did it identify and approach the problem? What questions remain about the structure and utility of Royal Commissions in Indigenous Affairs?</p></br></p></div></td>",
            "topic_title": "<strong>Week 6: RCIADIC (Royal Commission in Aboriginal Deaths in Custody)</strong>",
            "topic_description": "Week 6: RCIADIC (Royal Commission in Aboriginal Deaths in Custody) Lecture and discussion of the 1991 Royal Commission into Aboriginal Deaths in Custody, established in 1987. What was the process? How did it identify and approach the problem? What questions remain about the structure and utility of Royal Commissions in Indigenous Affairs?",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 4: Scenario #2</strong><br/><p>This is the second of the tutorial-based activities that form part of your scenario work assessment.</p></p></div></td>",
            "topic_title": "<strong>Tutorial 4: Scenario #2</strong>",
            "topic_description": "Tutorial 4: Scenario #2 This is the second of the tutorial-based activities that form part of your scenario work assessment.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7: Explanations for Policy Failure</strong><br/><p>Lecture and discussion on the way policy 'failure' is understood. What informs the identification, analysis and assessment of failure? How does this influence the 'solutions' proposed? </p></p></div></td>",
            "topic_title": "<strong>Week 7: Explanations for Policy Failure</strong>",
            "topic_description": "Week 7: Explanations for Policy Failure Lecture and discussion on the way policy 'failure' is understood. What informs the identification, analysis and assessment of failure? How does this influence the 'solutions' proposed?",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 5: Scenario #3</strong><br/><p>This is the third of the tutorial-based activities that form part of your scenario work assessment.</p></p></div></td>",
            "topic_title": "<strong>Tutorial 5: Scenario #3</strong>",
            "topic_description": "Tutorial 5: Scenario #3 This is the third of the tutorial-based activities that form part of your scenario work assessment.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8: Liberalism and Colonialism</strong><br/><p>Lecture and discussion on the relationship of liberalism and colonialism. Where do these ideas come from? How do they shape contemporary Australia, including the structure and actions of government? How do they shape the way we think about politics, policy and our relations in this place?</p></p></div></td>",
            "topic_title": "<strong>Week 8: Liberalism and Colonialism</strong>",
            "topic_description": "Week 8: Liberalism and Colonialism Lecture and discussion on the relationship of liberalism and colonialism. Where do these ideas come from? How do they shape contemporary Australia, including the structure and actions of government? How do they shape the way we think about politics, policy and our relations in this place?",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MID-SEMESTER BREAK</strong><br/><p>Please do schedule a rest this week! Enjoy time with friends or family, and doing things that refresh and revive you. </p></p></div></td>",
            "topic_title": "<strong>MID-SEMESTER BREAK</strong>",
            "topic_description": "MID-SEMESTER BREAK Please do schedule a rest this week! Enjoy time with friends or family, and doing things that refresh and revive you.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9: Human Rights</strong><br/><p>Lecture and discussion on the concept and practice of human rights. How is the concept 'human rights' understood and applied? Are human rights an effective mechanism for Indigenous people to address the impacts of colonisation? </p></p></div></td>",
            "topic_title": "<strong>Week 9: Human Rights</strong>",
            "topic_description": "Week 9: Human Rights Lecture and discussion on the concept and practice of human rights. How is the concept 'human rights' understood and applied? Are human rights an effective mechanism for Indigenous people to address the impacts of colonisation?",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 6: Scenario #4</strong><br/><p>This is the fourth of the tutorial-based activities that form part of your scenario work assessment.</p></p></div></td>",
            "topic_title": "<strong>Tutorial 6: Scenario #4</strong>",
            "topic_description": "Tutorial 6: Scenario #4 This is the fourth of the tutorial-based activities that form part of your scenario work assessment.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10: NO LECTURE or TUTORIAL</strong><br/><p>There is <strong>no lecture</strong> this week due to a public holiday on Monday. There are also <strong>no tutorials</strong> scheduled for this week. Use this time for your own independent study, particularly preparing for your research essay. The earlier you start the better your essay will be, as you will have sufficient time to read, think and write. We will be available if you wish to make an appointment to discuss your essay. </p></p></div></td>",
            "topic_title": "<strong>Week 10: NO LECTURE or TUTORIAL</strong>",
            "topic_description": "Week 10: NO LECTURE or TUTORIAL There is no lecture this week due to a public holiday on Monday. There are also no tutorials scheduled for this week. Use this time for your own independent study, particularly preparing for your research essay. The earlier you start the better your essay will be, as you will have sufficient time to read, think and write. We will be available if you wish to make an appointment to discuss your essay.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11: NTER/CTG (NT Emergency Response/Closing the Gap)</strong><br/><p>Lecture and discussion of the 2007 Northern Territory Emergency Response (\"the Intervention\") and resulting Commonwealth Government strategic policy framework Closing the Gap, aimed at reducing the discrepancies between the lives of Indigenous and settler peoples in Australia as a whole.</p></p></div></td>",
            "topic_title": "<strong>Week 11: NTER/CTG (NT Emergency Response/Closing the Gap)</strong>",
            "topic_description": "Week 11: NTER/CTG (NT Emergency Response/Closing the Gap) Lecture and discussion of the 2007 Northern Territory Emergency Response (\"the Intervention\") and resulting Commonwealth Government strategic policy framework Closing the Gap, aimed at reducing the discrepancies between the lives of Indigenous and settler peoples in Australia as a whole.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 7: Scenario #5</strong><br/><p>This is the fifth, and final, tutorial-based activity as part of your scenario work assessment.</p></p></div></td>",
            "topic_title": "<strong>Tutorial 7: Scenario #5</strong>",
            "topic_description": "Tutorial 7: Scenario #5 This is the fifth, and final, tutorial-based activity as part of your scenario work assessment.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12: Constitutional Recognition</strong><br/><p>Lecture and discussion on the recognition of Indigenous people within the colonial state. What kinds of actions have been forwarded? How do these actions understand and respond to the Indigenous-settler relationship?</p></p></div></td>",
            "topic_title": "<strong>Week 12: Constitutional Recognition</strong>",
            "topic_description": "Week 12: Constitutional Recognition Lecture and discussion on the recognition of Indigenous people within the colonial state. What kinds of actions have been forwarded? How do these actions understand and respond to the Indigenous-settler relationship?",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 8: Reflection</strong><br/><p>Reflection on and celebration of our learning in the course in preparation for the submission of your scenario journal.</p></p></div></td>",
            "topic_title": "<strong>Tutorial 8: Reflection</strong>",
            "topic_description": "Tutorial 8: Reflection Reflection on and celebration of our learning in the course in preparation for the submission of your scenario journal.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13: Affirming or Unsettling the Settler State?</strong><br/><p>Reflection on the course. Where have we come to? Does Indigenous politics and policy exist beyond the settler state? How? </p></p></div></td>",
            "topic_title": "<strong>Week 13: Affirming or Unsettling the Settler State?</strong>",
            "topic_description": "Week 13: Affirming or Unsettling the Settler State? Reflection on the course. Where have we come to? Does Indigenous politics and policy exist beyond the settler state? How?",
            "learning_outcomes": []
        }
    ]
}