{
    "course_title": "Security and Development",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/POLS7325-22141-7520",
    "full_course_code": "POLS7325-22141-7520",
    "course_code": "POLS7325",
    "class_code": "22141",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Appreciate the complex and dynamic interplay between development and security in global politics."
        },
        {
            "number": "LO2.",
            "description": "Critically analyse social and political challenges around the security-development nexus at project and policy levels."
        },
        {
            "number": "LO3.",
            "description": "Critically evaluate policy and doctrinal responses to the merging of security and development."
        },
        {
            "number": "LO4.",
            "description": "Critically examine and analyse case examples of security and development."
        },
        {
            "number": "LO5.",
            "description": "Reconstruct and critically evaluate competing approaches to the link between security and development."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "First Essay (between 1800 and 2000 words)",
            "special_indicators": [],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 11/04/2025 4:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Essay Questions:</strong> You will be provided a list of essay questions and you will be required answer one question from this list. The required word length is between 1800 and 2000 words.</p>\n<p>For your essay, you have to engage with the required as well as recommended readings for POLS7325, in addition to any other academic input you find in your research. Your essay should be written as a well-integrated and consistently argued analysis and engage with the topic in the context of how this is explored and discussed in our course. Avoid serialising self-contained paragraphs, and make sure you reference appropriately throughout, especially with regard to providing full details (including page numbers) where you cite or refer to specific points in your sources.</p>\n<p><br/></p>\n<p><strong>Please note that submissions have to be made via the designated Turnitin Link (Blackboard), using Word-encoding (.doc, or .docx extensions); .pdf files are <em>not </em>acceptable!!! </strong></p>\n<p><strong>Word count:</strong> Please ensure that you provide a <strong>word count at the end </strong>of your essay excluding the bibliographic list.</p>\n<p>The essay should demonstrate a high standard of grammar, spelling and general presentation and conform to the standards set out in the School of Political Science and International Studies <a href=\"https://polsis.uq.edu.au/files/6947/POLS_Essay_Guide_2017.pdf\">Essay Guide</a>.</p>\n<p>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>See task description.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Political Analysis of Movements, Organisations and States - (between 2800 and 3000 words)",
            "special_indicators": [],
            "weighting": "<dd>60%</dd>",
            "due_date": "<dd><p> 29/05/2025 4:00 pm</p>\n<p>\n</p><p>Draft to be completed two weeks before the due date.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Essay Questions:</strong> You will be provided a list of essay questions and you will be required answer one question from this list. The required word length is between 2800 and 3000 words.</p>\n<p>For your essay, you have to engage with the required as well as recommended readings for POLS7325, in addition to any other academic input you find in your research. Your essay should be written as a well-integrated and consistently argued analysis and engage with the topic in the context of how this is explored and discussed in our course. Avoid serialising self-contained paragraphs, and make sure you reference appropriately throughout, especially with regard to providing full details (including page numbers) where you cite or refer to specific points in your sources.</p>\n<p><br/></p>\n<p><strong>Presentation: </strong>Your essay must be typed (1.5-line-spaced) fully referenced and include a bibliographic list. You are required to use the author-date in-text referencing system.</p>\n<p><strong>Please note that submissions have to be made via the designated Turnitin Link (Blackboard), using Word-encoding( .doc, or .docx extensions); .pdf files are <em>not </em>acceptable!!! </strong></p>\n<p><strong>Word count:</strong> Please ensure that you provide a <strong>word count at the end </strong>of your essay excluding the bibliographic list.</p>\n<p>The essay should demonstrate a high standard of grammar, spelling and general presentation and conform to the standards set out in the School of Political Science and International Studies <a href=\"https://polsis.uq.edu.au/files/6947/POLS_Essay_Guide_2017.pdf\">Essay Guide</a>.</p>\n<p>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Please see Task Description.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Welcome and Introduction to the Course</strong><br><p>Introduction to the course themes, topics, and modalities. We will establish some preliminaries on how to think about the relationship between security and development. </p>\n<p><br/></p>\n<p>Questions that will help us open this topic include: </p>\n<p>Who is the referent of security and development? For instance, are they states or peoples or both? </p>\n<p>What changes and why, depending on how we conceptualize security and development? </p>\n<p>Why should we critically engage with underlying assumptions of approaches to security and development? </p>\n<p>How are insecurities and inequalities thought of in relation to security and development?</p></br></p><p><strong>Learning outcomes:</strong> L01, L05</p></div></td>",
            "topic_title": "<strong>Welcome and Introduction to the Course</strong>",
            "topic_description": "Welcome and Introduction to the Course Introduction to the course themes, topics, and modalities. We will establish some preliminaries on how to think about the relationship between security and development. Questions that will help us open this topic include: Who is the referent of security and development? For instance, are they states or peoples or both? What changes and why, depending on how we conceptualize security and development? Why should we critically engage with underlying assumptions of approaches to security and development? How are insecurities and inequalities thought of in relation to security and development?",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Security &amp; Development: An overview (Guest Lecture)</strong><br><p>In this session, we introduce and engage with two different accounts of security and development. The Seminar will be led by the guest lecturer, Sara Mejia-Munoz.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Security &amp; Development: An overview (Guest Lecture)</strong>",
            "topic_description": "Security & Development: An overview (Guest Lecture) In this session, we introduce and engage with two different accounts of security and development. The Seminar will be led by the guest lecturer, Sara Mejia-Munoz.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Development and Security: Modernization Theory</strong><br><p>Modernization Theory and its Influence <br/><br/>This session focuses on how security and development are linked in the contemporary context, and considers how this aligns with premises of Modernisation Theory (MT). MT is a liberal political ideology of development and security that has been highly influential throughout the post-1945 era. MT considers the integrity and capacity of the ﾓstateﾔ to be central to achieving and maintaining both, security and development, while emphasizing that the latter is to be realised through frameworks oriented to liberal capitalism. Our objective is to identify and critically examine these assumptions about security and development. <br/>In this first of two sessions dealing with MT and its legacies, we focus more on conceptual and analytical aspects of MT as well as the global political context in which it emerged.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Development and Security: Modernization Theory</strong>",
            "topic_description": "Development and Security: Modernization Theory Modernization Theory and its Influence This session focuses on how security and development are linked in the contemporary context, and considers how this aligns with premises of Modernisation Theory (MT). MT is a liberal political ideology of development and security that has been highly influential throughout the post-1945 era. MT considers the integrity and capacity of the ﾓstateﾔ to be central to achieving and maintaining both, security and development, while emphasizing that the latter is to be realised through frameworks oriented to liberal capitalism. Our objective is to identify and critically examine these assumptions about security and development. In this first of two sessions dealing with MT and its legacies, we focus more on conceptual and analytical aspects of MT as well as the global political context in which it emerged.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Inequality and Insecurity: The Critique of Modernization Theory</strong><br><p>In today's session, we critically interrogate the premises and implications of how MT frames and determines 'order', 'security', and 'development'. <br/>What issues, problems or interests are misrepresented or disarticulated in MT? <br/>What analytical and substantive implications does the critique of MT entail?</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Inequality and Insecurity: The Critique of Modernization Theory</strong>",
            "topic_description": "Inequality and Insecurity: The Critique of Modernization Theory In today's session, we critically interrogate the premises and implications of how MT frames and determines 'order', 'security', and 'development'. What issues, problems or interests are misrepresented or disarticulated in MT? What analytical and substantive implications does the critique of MT entail?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In/securities and Colonialism</strong><br><p>What can we learn about security and development from anti-colonial struggles? <br/> <br/>In this session we will deepen our understanding of the significance of colonialism and its legacies for security and development. In this session we will examine how experiences of insecurities and violence of colonialism were reflected upon by those subject to it and consider what alternatives to the colonial order were imagined as possible futures. What can we learn from anti-colonial struggles that aimed to overcome violence of colonial logics of (in)security and development?</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>In/securities and Colonialism</strong>",
            "topic_description": "In/securities and Colonialism What can we learn about security and development from anti-colonial struggles? In this session we will deepen our understanding of the significance of colonialism and its legacies for security and development. In this session we will examine how experiences of insecurities and violence of colonialism were reflected upon by those subject to it and consider what alternatives to the colonial order were imagined as possible futures. What can we learn from anti-colonial struggles that aimed to overcome violence of colonial logics of (in)security and development?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The security-development nexus: 'fragile states'</strong><br><p>The contemporary security-development nexus: the case of ﾑfragile statesﾒ<br/><br/>In this session we will examine in some detail an example at the forefront of the contemporary security ﾖ development nexus: 'fragile states'. Our task is to understand how state fragility is conceptualised and 'measured' through a complex mix of performance indicators in the fields of security and development. A close look at the practices of ﾑscoringﾒ states according to their development and security performances will allow us to discuss the problems and implications these entail. <br/><br/>This dominant framing of security and development has been contested, including from postcolonial perspectives that emphasize the importance of critical historical analytical frameworks. Core points of contention between the mainstream and critics concern questions of appropriate methods of analyses, as well as of normative commitments. We will draw on examples to substantiate our discussion.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>The security-development nexus: 'fragile states'</strong>",
            "topic_description": "The security-development nexus: 'fragile states' The contemporary security-development nexus: the case of ﾑfragile statesﾒ In this session we will examine in some detail an example at the forefront of the contemporary security ﾖ development nexus: 'fragile states'. Our task is to understand how state fragility is conceptualised and 'measured' through a complex mix of performance indicators in the fields of security and development. A close look at the practices of ﾑscoringﾒ states according to their development and security performances will allow us to discuss the problems and implications these entail. This dominant framing of security and development has been contested, including from postcolonial perspectives that emphasize the importance of critical historical analytical frameworks. Core points of contention between the mainstream and critics concern questions of appropriate methods of analyses, as well as of normative commitments. We will draw on examples to substantiate our discussion.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Independent Study</strong><br><p>This week is 'Independent Study'-week to provide you with extra time to focus on your assignment. Please make sure that you have understood the task as outlined in the 'Assessment' Section of your course profile. </p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Independent Study</strong>",
            "topic_description": "Independent Study This week is 'Independent Study'-week to provide you with extra time to focus on your assignment. Please make sure that you have understood the task as outlined in the 'Assessment' Section of your course profile.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Human Security and Development</strong><br><p>To what extent is Human Security an alternative approach to security and development? <br/><br/>In the context of the end of the cold war, Modernisation Theoretic premises appeared to be in decline in both, approaches to security and to development. In international relations as well as at the level of international institutions more generally, Human Security (HS) as an approach to ﾑsecurity and developmentﾒ emerged in the 1980s. From its early days, HS focused on individuals as the key referent of security and development, thereby bringing questions of poverty and inequality to the forefront of analyses of insecurities. According to some analysts, however, the original critical outlook of HS has been gradually abandoned in favour of aligning it more closely with dominant and more conventional approaches to security and development. We will examine the debates this has generated, and consider how in the light of those we ought to evaluate the United Nations Human Security Unit with its approach to the linking of ﾑfreedom from wantﾒ and ﾑFreedom from fearﾒ (otherwise presented in terms of ﾑprotectionﾒ and ﾑempowermentﾒ).</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Human Security and Development</strong>",
            "topic_description": "Human Security and Development To what extent is Human Security an alternative approach to security and development? In the context of the end of the cold war, Modernisation Theoretic premises appeared to be in decline in both, approaches to security and to development. In international relations as well as at the level of international institutions more generally, Human Security (HS) as an approach to ﾑsecurity and developmentﾒ emerged in the 1980s. From its early days, HS focused on individuals as the key referent of security and development, thereby bringing questions of poverty and inequality to the forefront of analyses of insecurities. According to some analysts, however, the original critical outlook of HS has been gradually abandoned in favour of aligning it more closely with dominant and more conventional approaches to security and development. We will examine the debates this has generated, and consider how in the light of those we ought to evaluate the United Nations Human Security Unit with its approach to the linking of ﾑfreedom from wantﾒ and ﾑFreedom from fearﾒ (otherwise presented in terms of ﾑprotectionﾒ and ﾑempowermentﾒ).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MID-SEMESTER BREAK</strong><br><p>NO SEMINAR THIS WEEK</p></br></p></div></td>",
            "topic_title": "<strong>MID-SEMESTER BREAK</strong>",
            "topic_description": "MID-SEMESTER BREAK NO SEMINAR THIS WEEK",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Extractivism and development</strong><br><p>Extractivism, transnational corporations, development and insecurities<br/><br/>Mining for minerals has been at the centre of many contemporary conflicts, and has obvious linkages with development, not least because resource extraction is often promoted as a key component of development policies aimed at ﾑadvancingﾒ a developing nation up the ﾑladderﾒ. In this session we will focus on examples that illustrate the practices around the extraction of and trade in 'conflict minerals'. We will identify key actors and agents involved, including the ecological impact and the implications of the latter for livelihoods of local communities.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Extractivism and development</strong>",
            "topic_description": "Extractivism and development Extractivism, transnational corporations, development and insecurities Mining for minerals has been at the centre of many contemporary conflicts, and has obvious linkages with development, not least because resource extraction is often promoted as a key component of development policies aimed at ﾑadvancingﾒ a developing nation up the ﾑladderﾒ. In this session we will focus on examples that illustrate the practices around the extraction of and trade in 'conflict minerals'. We will identify key actors and agents involved, including the ecological impact and the implications of the latter for livelihoods of local communities.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Borders and migration, in/security and development</strong><br><p>Movement, risk and markets: politics around borders. <br/><br/>In this seminar, we will examine the relationship between development, poverty and migrations. We will also examine implications of the policing of borders in relation to development and insecurities by drawing on case examples; we focus, for instance, on questions of who stands to benefit from linkages between 'border force' and penal labour, look at examples of agencies and corporations involved, and consider the implications of the denial of protection to those conceived as 'aliens'. How do borders connect peoples' fate, and what justifications are given for suppressing or denying these connections?</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Borders and migration, in/security and development</strong>",
            "topic_description": "Borders and migration, in/security and development Movement, risk and markets: politics around borders. In this seminar, we will examine the relationship between development, poverty and migrations. We will also examine implications of the policing of borders in relation to development and insecurities by drawing on case examples; we focus, for instance, on questions of who stands to benefit from linkages between 'border force' and penal labour, look at examples of agencies and corporations involved, and consider the implications of the denial of protection to those conceived as 'aliens'. How do borders connect peoples' fate, and what justifications are given for suppressing or denying these connections?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Authoritarian Populism</strong><br><p>Over the past decades there has been a growing body of research on the link between neoliberal development and tendencies towards authoritarian rule in countries in the North and the South. This dynamic has also been identified in terms of neoliberal populism and also 'racist populism'. This week we explore debates through examples, identifying differences and similarities, and how such rule is justified.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Authoritarian Populism</strong>",
            "topic_description": "Authoritarian Populism Over the past decades there has been a growing body of research on the link between neoliberal development and tendencies towards authoritarian rule in countries in the North and the South. This dynamic has also been identified in terms of neoliberal populism and also 'racist populism'. This week we explore debates through examples, identifying differences and similarities, and how such rule is justified.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Development 'revolutionaries': Zapatismo</strong><br><p>Development ﾑrevolutionariesﾒ: the example of Zapatismo<br/><br/>This topic examines the example of ﾑZapatismoﾒ, one instance of the ﾑdevelopment revolutionsﾒ of the twentieth (and twenty-first) century. As an indigenous armed struggle against the Mexican state, the ideology of Zapatismo has been explicitly political, and aimed at countering colonial practices of discrimination and marginalisation as well as neoliberal politics of development. The Zapatistas have been studied for their specific approach to democratic practices of governance, their discipline and political consciousness-raising, as well as their practices of resistance.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Development 'revolutionaries': Zapatismo</strong>",
            "topic_description": "Development 'revolutionaries': Zapatismo Development ﾑrevolutionariesﾒ: the example of Zapatismo This topic examines the example of ﾑZapatismoﾒ, one instance of the ﾑdevelopment revolutionsﾒ of the twentieth (and twenty-first) century. As an indigenous armed struggle against the Mexican state, the ideology of Zapatismo has been explicitly political, and aimed at countering colonial practices of discrimination and marginalisation as well as neoliberal politics of development. The Zapatistas have been studied for their specific approach to democratic practices of governance, their discipline and political consciousness-raising, as well as their practices of resistance.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Security and development: wrap-up &amp; outlook</strong><br><p>Critical reflections on security and development: wrap up and outlook<br/><br/>In this final session we will discuss lessons learnt and consider the outlook for taking these forward. What progress have we made analytically and why is that important? <br/>The link between theory and practice will be revisited, as well as its implications for practical political transformations.</p></br></p><p><strong>Learning outcomes:</strong> L01, L05</p></div></td>",
            "topic_title": "<strong>Security and development: wrap-up &amp; outlook</strong>",
            "topic_description": "Security and development: wrap-up & outlook Critical reflections on security and development: wrap up and outlook In this final session we will discuss lessons learnt and consider the outlook for taking these forward. What progress have we made analytically and why is that important? The link between theory and practice will be revisited, as well as its implications for practical political transformations.",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        }
    ]
}