{
    "course_title": "International Crisis Management",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "Online",
    "url": "https://course-profiles.uq.edu.au/course-profiles/POLS7306-22368-7520",
    "full_course_code": "POLS7306-22368-7520",
    "course_code": "POLS7306",
    "class_code": "22368",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "1. Demonstrate an accurate critical understanding - 1. Demonstrate an accurate critical understanding of contemporary disasters and their impacts in various international contexts."
        },
        {
            "number": "LO2.",
            "description": "1. Demonstrate an accurate critical understanding - 2. Investigate, diagnose and evaluate the causes of disaster with particular reference to weaknesses caused by development practice (or lack thereof)."
        },
        {
            "number": "LO3.",
            "description": "1. Demonstrate an accurate critical understanding - 3. Critically appraise efforts to resolve disaster emergencies in developing nations. Problematize and reflect upon the unique leadership challenges of crisis response in a development context."
        },
        {
            "number": "LO4.",
            "description": "1. Demonstrate an accurate critical understanding - 4. Analyse the dynamics of post-crisis change and inertia with a specific emphasis on politics and participatory governance."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Pre-Crisis Preparation Assessment",
            "special_indicators": [],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 7/04/2025 5:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This will be emailed at 9am, Friday and is due back 5pm, Monday. The paper will be sent to your UQ student email address and it should be returned via electronically via Turnitin (details given out in class).</p>\n<p>The exam paper will contain 3 questions that reflect the pre-crisis preparedness sections of the course. These three questions will also reflect the core aims of the course. Thus one question will demand that you engage with a strand of disaster management literature, a second will demand that you think about disaster management from a practitioner-orientated perspective and the third will expect you to think critically (and independently) about a problem pertaining to disaster management knowledge and practice.</p>\n<p>You are required to type roughly 1 page responses to each question (ie.500 words). More details are in the course learning guide. </p>\n<p>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments for this course will be submitted electronically via Blackboard and using <em>Turnitin</em>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Acute-Phase Assessment",
            "special_indicators": [],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 13/05/2025 5:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This will be emailed at 9am, Friday and is due back on Monday at 5pm. The paper will be sent to your UQ student email address and it should be returned via electronically via Turnitin (details given out in class).</p>\n<p>The exam paper will contain questions that reflect the acute-stage crisis management sections of the course. These three questions will also reflect the core aims of the course. Thus one question will demand that you engage with a strand of disaster management literature, a second will demand that you think about disaster management from a practitioner-orientated perspective and the third will expect you to think critically (and independently) about the problems of disaster management knowledge and practice.</p>\n<p>You are required to type roughly 1 page responses to each question (500 words).</p>\n<p>More details can be found in the course learning guide.</p>\n<p>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments for this course will be submitted electronically via Blackboard and using <em>Turnitin</em>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Case Study Research Essay",
            "special_indicators": [],
            "weighting": "<dd>50% 3000 Words </dd>",
            "due_date": "<dd><p> 30/05/2025 5:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You must choose a case study of a specific crisis or disaster. You must then write an essay that: 1) summarises the case chronologically with reference to the PPRR stages; 2) presents an argument about the case which reflects a theme found in our specific course literature; 3) presents lessons for crisis management practitioners and/or researchers. More details are available in the learning guide. </p>\n<p>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments for this course will be submitted electronically via Blackboard and using <em>Turnitin</em>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction to Crisis Management</strong><br/><p>In this introductory lecture I will be aiming to spark your enthusiasm for the study of crisis. The focus of the lecture will be on types of crises, the characteristics of crisis management and the way in which these events provide a lens into our (rather dystopian) future.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Introduction to Crisis Management</strong>",
            "topic_description": "Introduction to Crisis Management In this introductory lecture I will be aiming to spark your enthusiasm for the study of crisis. The focus of the lecture will be on types of crises, the characteristics of crisis management and the way in which these events provide a lens into our (rather dystopian) future.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Crisis Management Paradigms</strong><br/><p>his week the lecture will introduce three paradigms which have underpinned how researchers and policymakers have thought about crisis management for the past 40 years. These are the hazard paradigm, the vulnerability paradigm and most recently the resilience paradigm.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Crisis Management Paradigms</strong>",
            "topic_description": "Crisis Management Paradigms his week the lecture will introduce three paradigms which have underpinned how researchers and policymakers have thought about crisis management for the past 40 years. These are the hazard paradigm, the vulnerability paradigm and most recently the resilience paradigm.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Pre-Crisis Planning and Preparedness</strong><br/><p>In this lecture we begin to make a gear change by moving away from academic issues and moving towards practical thinking about how to prepare for crises. We do that in this lecture by working through three aspects of the pre-crisis stage. First, the preparedness cycle. Second, sensemaking processes. Finally, crisis planning, which is one of my favourite topics because it allows us to examine how modes of rational crisis management can be completely undone when they meet the real world in all its glorious uncertainty.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Pre-Crisis Planning and Preparedness</strong>",
            "topic_description": "Pre-Crisis Planning and Preparedness In this lecture we begin to make a gear change by moving away from academic issues and moving towards practical thinking about how to prepare for crises. We do that in this lecture by working through three aspects of the pre-crisis stage. First, the preparedness cycle. Second, sensemaking processes. Finally, crisis planning, which is one of my favourite topics because it allows us to examine how modes of rational crisis management can be completely undone when they meet the real world in all its glorious uncertainty.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Crisis Politics</strong><br/><p>Prior to discussing the more practical elements of a crisis response I want to spend a week discussing politics because it is a fallacy to believe that politics go on hold during an emergency. Perceptions about what constitutes successful and unsuccessful crisis management, and corresponding notions of legitimacy and illegitimacy (winners and losers) are bound up with political dynamics. In this regard a crucial part of understanding crisis management performance requires us to understand how certain types of communication can, for example, reassure citizens, assert control or court controversy, allocate blame, reward heroism and ultimately determine our understanding of who is affected and how they should be helped.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Crisis Politics</strong>",
            "topic_description": "Crisis Politics Prior to discussing the more practical elements of a crisis response I want to spend a week discussing politics because it is a fallacy to believe that politics go on hold during an emergency. Perceptions about what constitutes successful and unsuccessful crisis management, and corresponding notions of legitimacy and illegitimacy (winners and losers) are bound up with political dynamics. In this regard a crucial part of understanding crisis management performance requires us to understand how certain types of communication can, for example, reassure citizens, assert control or court controversy, allocate blame, reward heroism and ultimately determine our understanding of who is affected and how they should be helped.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Guest Lecture and Position Statement</strong><br/><p>This week we will have a guest lecturer who can talk to us about crisis planning in the real world. This is an opportunity for you to see how our theories play out in the reality of crises via an interaction with an experienced crisis manager. We will also have a 'position statement' session in which I recap what we have learned in anticipation for our first assessment.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Guest Lecture and Position Statement</strong>",
            "topic_description": "Guest Lecture and Position Statement This week we will have a guest lecturer who can talk to us about crisis planning in the real world. This is an opportunity for you to see how our theories play out in the reality of crises via an interaction with an experienced crisis manager. We will also have a 'position statement' session in which I recap what we have learned in anticipation for our first assessment.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Crisis Response Frameworks</strong><br/><p>We are now entering another two-week block of teaching which will once again end in an assessment. When we talk about the acute-stage of disaster management we are using a generic term for the period in a disaster which is most demanding; a period in which individuals and organisations often need to make life or death decisions under conditions of high uncertainty. In this lecture I will focus on crisis coordination via a conceptual and empirical introduction to response frameworks, which represent the primary mechanisms for responding to crises.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Crisis Response Frameworks</strong>",
            "topic_description": "Crisis Response Frameworks We are now entering another two-week block of teaching which will once again end in an assessment. When we talk about the acute-stage of disaster management we are using a generic term for the period in a disaster which is most demanding; a period in which individuals and organisations often need to make life or death decisions under conditions of high uncertainty. In this lecture I will focus on crisis coordination via a conceptual and empirical introduction to response frameworks, which represent the primary mechanisms for responding to crises.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Participation in Emergencies</strong><br/><p>This week we shift the lens from the mechanics of a crisis response to the environment in which responses have to operate. We do this by examining the different ways that crisis management scholars have analysed public participation during crises. These are important because participatory governance solutions are now very fashionable in pre-crisis planning and crisis response but we often forget that we are always the initial emergency responders in any disaster.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Participation in Emergencies</strong>",
            "topic_description": "Participation in Emergencies This week we shift the lens from the mechanics of a crisis response to the environment in which responses have to operate. We do this by examining the different ways that crisis management scholars have analysed public participation during crises. These are important because participatory governance solutions are now very fashionable in pre-crisis planning and crisis response but we often forget that we are always the initial emergency responders in any disaster.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The Post-Crisis Stage: Learning v Accountability</strong><br/><p>We are now moving on to examine the post-crisis recovery period. Many people believe that when the acute-stage ends the disaster or crisis is over. However, crisis researchers know that post-crisis periods often share all of the characteristics of the preceding stage in the sense that they are uncertain, highly dynamic and require decision making with serious consequences attached. In this environment practitioners need to get to grips with the tension between learning and accountability and the politics of recovery and reform. This is the focus of this lecture.</p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>The Post-Crisis Stage: Learning v Accountability</strong>",
            "topic_description": "The Post-Crisis Stage: Learning v Accountability We are now moving on to examine the post-crisis recovery period. Many people believe that when the acute-stage ends the disaster or crisis is over. However, crisis researchers know that post-crisis periods often share all of the characteristics of the preceding stage in the sense that they are uncertain, highly dynamic and require decision making with serious consequences attached. In this environment practitioners need to get to grips with the tension between learning and accountability and the politics of recovery and reform. This is the focus of this lecture.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>No Class</strong><br/></p></div></td>",
            "topic_title": "<strong>No Class</strong>",
            "topic_description": "No Class",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Guest Lecture and Position Statement</strong><br/><p>This week we will have a guest lecturer who can talk to us about emergency decision making in the real world. We will also consolidate what we have learned about crisis responses so that we are ready for the second class test.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Guest Lecture and Position Statement</strong>",
            "topic_description": "Guest Lecture and Position Statement This week we will have a guest lecturer who can talk to us about emergency decision making in the real world. We will also consolidate what we have learned about crisis responses so that we are ready for the second class test.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Post-Crisis Recovery: Social Capital</strong><br/><p>his week we will explore the role of social capital in relation to recovery and specifically focus (once again) on how participatory mechanisms can leverage community efforts to collectively recover from crises. I am hoping to be joined by a recovery practitioner this week who will help us bridge theory and practice in terms of this stage.</p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Post-Crisis Recovery: Social Capital</strong>",
            "topic_description": "Post-Crisis Recovery: Social Capital his week we will explore the role of social capital in relation to recovery and specifically focus (once again) on how participatory mechanisms can leverage community efforts to collectively recover from crises. I am hoping to be joined by a recovery practitioner this week who will help us bridge theory and practice in terms of this stage.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Overview</strong><br/><p>This is the final lecture and at this point in the semester, I will be keeping it brief! A short synopsis of what we have learned so far.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Overview</strong>",
            "topic_description": "Overview This is the final lecture and at this point in the semester, I will be keeping it brief! A short synopsis of what we have learned so far.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lesson Learned Workshop</strong><br/><p>In this final week we will summarise what we have learned from the course and from our research on our lesson learning essays.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Lesson Learned Workshop</strong>",
            "topic_description": "Lesson Learned Workshop In this final week we will summarise what we have learned from the course and from our research on our lesson learning essays.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}