{
    "course_title": "Politics of Development",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/POLS7302-22133-7520",
    "full_course_code": "POLS7302-22133-7520",
    "course_code": "POLS7302",
    "class_code": "22133",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Competently discuss and evaluate theoretical and methodological premises underpinning contending approaches to development."
        },
        {
            "number": "LO2.",
            "description": "Appreciate the transdisciplinary character of development, and gain a more inclusive understanding of what constitutes the politics of development."
        },
        {
            "number": "LO3.",
            "description": "Engage, assess, and contextualise case-based analyses, and critically evaluate their scope and implications."
        },
        {
            "number": "LO4.",
            "description": "Identify institutional, formal and informal actors involved in development processes and assess the challenges and problems they face, using a global-to-local approach."
        },
        {
            "number": "LO5.",
            "description": "Appreciate the significance of a critical historical approach in the study of the politics of global development."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "First Essay (between 1800 and 2000 words)",
            "special_indicators": [],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 10/04/2025 4:00 pm</p>\n<p>\n</p><p>You are required to have a full draft of your essay two weeks before the due date.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Essay Questions:</strong> You will be provided a list of essay questions and you will be required to answer one question from this list. The required word length is between 1800 and 2000 words. </p>\n<p>For your essay, you have to engage with the required as well as recommended readings for POLS7302, in addition to any other academic input you find in your research. Your essay should be written as a well-integrated and consistently argued  analysis and engage with the topic in the context of how this is explored and discussed in our course. Avoid serialising self-contained paragraphs, and make sure you reference appropriately throughout, especially with regard to providing full details (including page numbers) where you cite or refer to specific points in your sources.</p>\n<p><strong>Presentation: </strong>Your essay must be typed (1.5-line-spaced) fully referenced and include a bibliographic list. You are required to use the author-date in-text referencing system.</p>\n<p><strong>Please note that submissions have to be made via the designated Turnitin Link (Blackboard), using Word-encoding (.doc, or .docx extensions); .pdf files are <em>not </em>acceptable!!! </strong></p>\n<p><strong>Word count:</strong> Please ensure that you provide a <strong>word count at the end </strong>of your essay excluding the bibliographic list.</p>\n<p>The essay should demonstrate a high standard of grammar, spelling and general presentation and conform to the standards set out in the School of Political Science and International Studies <a href=\"https://polsis.uq.edu.au/student-support#5\">Essay Guide</a>.</p>\n<p>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments for this course will be submitted electronically via Blackboard and using <em>Turnitin</em>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Political Analysis of Movements, Organisations and States (between 2800 and 3000 words)",
            "special_indicators": [],
            "weighting": "<dd>60%</dd>",
            "due_date": "<dd><p> 29/05/2025 4:00 pm</p>\n<p>\n</p><p>You are required to have a full draft of your essay two weeks before the due date.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Essay Questions:</strong> You will be provided a list of essay questions and you will be required to answer one question from this list. The required word length is between 2800 and 3000 words. </p>\n<p>For your essay, you have to engage with the required as well as recommended readings for POLS7302, in addition to any other academic input you find in your research. Your essay should be written as a well-integrated and consistently argued analysis and engage with the topic in the context of how this is explored and discussed in our course. Avoid serialising self-contained paragraphs, and make sure you reference appropriately throughout, especially with regard to providing full details (including page numbers) where you cite or refer to specific points in your sources.</p>\n<p><strong>Presentation: </strong>Your essay must be typed (1.5-line-spaced), fully referenced, and include a bibliographic list. You are required to use the author-date in-text referencing system.</p>\n<p><strong>Please note that submissions have to be made via the designated Turnitin Link (Blackboard), using Word-encoding ( .doc, or .docx extensions); .pdf files are <em>not </em>acceptable!!! </strong></p>\n<p><strong>Word count:</strong> Please ensure that you provide a <strong>word count at the end </strong>of your essay, excluding the bibliographic list.</p>\n<p>The essay should demonstrate a high standard of grammar, spelling and general presentation and conform to the standards set out in the School of Political Science and International Studies <a href=\"https://polsis.uq.edu.au/student-support#5\">Essay Guide</a>.</p>\n<p>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments for this course will be submitted electronically via Blackboard and using <em>Turnitin</em>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Topic 1: Welcome and Introduction</strong><br><p>Introduction to the course, including topics and course organization.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Topic 1: Welcome and Introduction</strong>",
            "topic_description": "Topic 1: Welcome and Introduction Introduction to the course, including topics and course organization.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Topic 2:  Politics of Development Theory (Guest Lecturer, Sara Mejia-Munoz)</strong><br><p>Politics of theory, method and poverty.</p>\n<p> In this seminar we introduce and critically examine the conventional approach to the study of poverty and development. We will identify how this approach aligns with the premises of Modernization Theory and its 'stages of growth' framing of development. We will then critically interrogate its underlying assumptions. Our objective is to develop an appreciation of the relationship between development theory(ies), their underlying assumptions, and inequality. We will draw on empirical examples to further our understanding of the link between theory, method(s) and poverty.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Topic 2:  Politics of Development Theory (Guest Lecturer, Sara Mejia-Munoz)</strong>",
            "topic_description": "Topic 2:  Politics of Development Theory (Guest Lecturer, Sara Mejia-Munoz) Politics of theory, method and poverty. In this seminar we introduce and critically examine the conventional approach to the study of poverty and development. We will identify how this approach aligns with the premises of Modernization Theory and its 'stages of growth' framing of development. We will then critically interrogate its underlying assumptions. Our objective is to develop an appreciation of the relationship between development theory(ies), their underlying assumptions, and inequality. We will draw on empirical examples to further our understanding of the link between theory, method(s) and poverty.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Topic 3: 'The Object of Development'</strong><br><p>In this session, we critically examine the conventional approach to development, its underlying assumptions, and social and political implications.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Topic 3: 'The Object of Development'</strong>",
            "topic_description": "Topic 3: 'The Object of Development' In this session, we critically examine the conventional approach to development, its underlying assumptions, and social and political implications.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Topic 4: Historicizing Development</strong><br><p>Critical questions about the past and present of development.</p>\n<p>This seminar introduces and examines important historical relations underpinning contemporary development. An objective is to identify the global and transnational dimension of these historical relations of development and consider their implications for conventional analyses of development. While we want to gain an appreciation of the historical specificities of development, we also want to consider the extent to which unequal relations have been central to the process of the unfolding of colonial capitalism. We will ground our conceptual analysis in concrete historical examples, such as the relationship between enslavement (e.g. the triangular trade)and European industrialisation. The history of development has important legacies for contemporary struggles over development and inequality. It also raises important questions about injustices and development.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Topic 4: Historicizing Development</strong>",
            "topic_description": "Topic 4: Historicizing Development Critical questions about the past and present of development. This seminar introduces and examines important historical relations underpinning contemporary development. An objective is to identify the global and transnational dimension of these historical relations of development and consider their implications for conventional analyses of development. While we want to gain an appreciation of the historical specificities of development, we also want to consider the extent to which unequal relations have been central to the process of the unfolding of colonial capitalism. We will ground our conceptual analysis in concrete historical examples, such as the relationship between enslavement (e.g. the triangular trade)and European industrialisation. The history of development has important legacies for contemporary struggles over development and inequality. It also raises important questions about injustices and development.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Topic 5: Politics of Race and Development</strong><br/><p>We examine how the the politics of race has been quite central to development. We explore how colonialism was justified and consider the continuing relevance for the contemporary development project. We consider the different ways in which race had served as justifications of domination, and rule but also engendered resistance in development.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Topic 5: Politics of Race and Development</strong>",
            "topic_description": "Topic 5: Politics of Race and Development We examine how the the politics of race has been quite central to development. We explore how colonialism was justified and consider the continuing relevance for the contemporary development project. We consider the different ways in which race had served as justifications of domination, and rule but also engendered resistance in development.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Topic 6: Domination and Resistance in development</strong><br/><p>Infrapolitics of the poor: Contesting domination.</p>\n<p>In this seminar we examine the role and significance of social struggles, practices of resistance and social movements in development. Our objective is to develop an appreciation of their significance as key political dynamics of social change as well as their analytical implications. We consider what a more inclusive account of actors and perspectives in development discloses about relations of development, and the sources of power in development and social change. In this seminar we deepen our understanding of development as a relational process, and one that is inherently political. This week we will enjoy learning about 'domination and the arts of resistance' in development.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Topic 6: Domination and Resistance in development</strong>",
            "topic_description": "Topic 6: Domination and Resistance in development Infrapolitics of the poor: Contesting domination. In this seminar we examine the role and significance of social struggles, practices of resistance and social movements in development. Our objective is to develop an appreciation of their significance as key political dynamics of social change as well as their analytical implications. We consider what a more inclusive account of actors and perspectives in development discloses about relations of development, and the sources of power in development and social change. In this seminar we deepen our understanding of development as a relational process, and one that is inherently political. This week we will enjoy learning about 'domination and the arts of resistance' in development.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Topic 7: Global Politics of Trade and Development</strong><br/><p>Trade, development and poverty: the NAFTA and the WTO</p>\n<p>Against the background of previous topics, we examine the theoretical, institutional and social implications of the (liberal) governance of development through trade. In particular, we focus on the relationship between diverse everyday lived experiences and global governance through the example of trade and development. </p>\n<p>What are the substantive development implications of free-trade agreements? For instance, what kinds of rights do different actors have in these trade agreements and what does this mean for questions of inequality, poverty and justice? We examine the North American Free Trade Agreement (NAFTA) as a case example, and we will also consider the World Trade Organization (WTO).</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Topic 7: Global Politics of Trade and Development</strong>",
            "topic_description": "Topic 7: Global Politics of Trade and Development Trade, development and poverty: the NAFTA and the WTO Against the background of previous topics, we examine the theoretical, institutional and social implications of the (liberal) governance of development through trade. In particular, we focus on the relationship between diverse everyday lived experiences and global governance through the example of trade and development. What are the substantive development implications of free-trade agreements? For instance, what kinds of rights do different actors have in these trade agreements and what does this mean for questions of inequality, poverty and justice? We examine the North American Free Trade Agreement (NAFTA) as a case example, and we will also consider the World Trade Organization (WTO).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Topic 8: Politics of 'rights' to water (Guest Lecturer, Sara Mejia-Munoz)</strong><br/><p>Commons versus commodities: struggles over rights to water.</p>\n<p>We examine the politics of 'rights' to water in substantive terms, but also use it as a lens to identify some of the conceptual and analytical issues introduced and examined throughout the course. We will draw on the case example of Bolivia where water services and resources were privatised, which almost 70,000 peoples actively resisted, and eventually the government fell! This example will allow us to appreciate how new powerful corporate actors are increasingly empowered in development, though not without challenges and resistance.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Topic 8: Politics of 'rights' to water (Guest Lecturer, Sara Mejia-Munoz)</strong>",
            "topic_description": "Topic 8: Politics of 'rights' to water (Guest Lecturer, Sara Mejia-Munoz) Commons versus commodities: struggles over rights to water. We examine the politics of 'rights' to water in substantive terms, but also use it as a lens to identify some of the conceptual and analytical issues introduced and examined throughout the course. We will draw on the case example of Bolivia where water services and resources were privatised, which almost 70,000 peoples actively resisted, and eventually the government fell! This example will allow us to appreciate how new powerful corporate actors are increasingly empowered in development, though not without challenges and resistance.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MID-SEMESTER BREAK</strong><br/><p>No seminar this week.</p></p></div></td>",
            "topic_title": "<strong>MID-SEMESTER BREAK</strong>",
            "topic_description": "MID-SEMESTER BREAK No seminar this week.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Topic 9: Politics of microcredit and poverty</strong><br/><p>Microcredit, debt and poverty <br/> <br/>In this seminar we examine a key strategy for global poverty reduction, microcredit schemes. We analyse microcredit schemes from the perspective of their advocates and critics. We will draw on examples of microcredit and poverty from different contexts to develop our critical analyses. Does the adoption of microcredit schemes as a response to poverty reflect a radical break in development policy?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Topic 9: Politics of microcredit and poverty</strong>",
            "topic_description": "Topic 9: Politics of microcredit and poverty Microcredit, debt and poverty In this seminar we examine a key strategy for global poverty reduction, microcredit schemes. We analyse microcredit schemes from the perspective of their advocates and critics. We will draw on examples of microcredit and poverty from different contexts to develop our critical analyses. Does the adoption of microcredit schemes as a response to poverty reflect a radical break in development policy?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Labour Day- No Seminar</strong><br><p>Labour Day</p></br></p></div></td>",
            "topic_title": "<strong>Labour Day- No Seminar</strong>",
            "topic_description": "Labour Day- No Seminar Labour Day",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Topic 11: Politics of the post-2015 SDGs</strong><br><p>The post-2015 Sustainable Development Goals (SDGs) &amp; poverty<br/><br/>This week we introduce and critically investigate-the post-2015 Sustainable Development Goals initiative, which has succeeded the Millennium Development Goals (MDGs). Our objective is to consider their implications for poverty and inequality and global development.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Topic 11: Politics of the post-2015 SDGs</strong>",
            "topic_description": "Topic 11: Politics of the post-2015 SDGs The post-2015 Sustainable Development Goals (SDGs) & poverty This week we introduce and critically investigate-the post-2015 Sustainable Development Goals initiative, which has succeeded the Millennium Development Goals (MDGs). Our objective is to consider their implications for poverty and inequality and global development.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Topic 12:'Living Well':An alternative development? Plus Outlook</strong><br><p>'living well'/ﾑsumak kawsayﾒ: Learning from Indigenous conceptions of 'development</p>\n<p> In this seminar we examine a more recent articulation of an alternative conception of development that has it roots in Latin American indigenous conceptions of 'living well'. This conception of development recognizes the value and 'rights' of nature and seeks to both defend practices of 'living well' and advance it as a political project in ways that counter mainstream approaches to development. In practice, this idea of 'living well' has been incorporated in the constitutions of countries such as Bolivia and Ecuador. 'Living well' has also been embraced by non-indigenous peoples committed to pursuing a more just, equitable and sustainable development project. This is an inspiring example of contemporary struggles for and challenges to the realization of alter-development.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Topic 12:'Living Well':An alternative development? Plus Outlook</strong>",
            "topic_description": "Topic 12:'Living Well':An alternative development? Plus Outlook 'living well'/ﾑsumak kawsayﾒ: Learning from Indigenous conceptions of 'development In this seminar we examine a more recent articulation of an alternative conception of development that has it roots in Latin American indigenous conceptions of 'living well'. This conception of development recognizes the value and 'rights' of nature and seeks to both defend practices of 'living well' and advance it as a political project in ways that counter mainstream approaches to development. In practice, this idea of 'living well' has been incorporated in the constitutions of countries such as Bolivia and Ecuador. 'Living well' has also been embraced by non-indigenous peoples committed to pursuing a more just, equitable and sustainable development project. This is an inspiring example of contemporary struggles for and challenges to the realization of alter-development.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Topic 13: Independent Study (Finalising second Essay)</strong><br><p>This week is for you to focus on polishing and fine-tuning your draft essays to ready them for submission.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Topic 13: Independent Study (Finalising second Essay)</strong>",
            "topic_description": "Topic 13: Independent Study (Finalising second Essay) This week is for you to focus on polishing and fine-tuning your draft essays to ready them for submission.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}