{
    "course_title": "Ethics and Human Rights",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/POLS7503-22137-7520",
    "full_course_code": "POLS7503-22137-7520",
    "course_code": "POLS7503",
    "class_code": "22137",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand different approaches and ways of thinking and ethics and politics."
        },
        {
            "number": "LO2.",
            "description": "Develop the ability to apply ethical approaches to practical dilemmas in local and global politics."
        },
        {
            "number": "LO3.",
            "description": "Identify, analyse, and critically reflect on key ethical dilemmas in politics and international relations today, including the provision of human rights."
        },
        {
            "number": "LO4.",
            "description": "Effectively communicate ideas, information and analysis in spoken and/or written form."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Seminar Participation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>22%</dd>",
            "due_date": "<dd><p> 27/02/2025 - 23/05/2025</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Activity/ Performance, Written",
            "category": "Participation/ Student contribution",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Seminar participation is worth 22% of the overall course grade. Students will be assessed on participation in 11 seminars (Week 7 and Week 10 is excluded from participation marks because of scheduled in-class assessment), with 2 marks awarded per seminar. Participation is assessed not merely on attendance but the quality of participation. Participation requires active listening, constructive participation, and engaging in activities. In order to make this possible, students are required to complete the weekly readings.</p>\n<p><strong>Note well: </strong>A student can make up the mark for having missed a seminar by submitting a synopsis on the weekly readings to the course coordinator <strong>only in the case </strong>that this has been previously agreed to by the course coordinator due to medical reasons, Student Disability Action Plan, or exceptional circumstances. The weekly synopsis should address the following questions:</p>\n<p>1) What argument is made by the author/s?</p>\n<p>2) How do the readings interact with each other, if at all? For example, is there consensus across the readings, or are contrasting arguments being made?</p>\n<p>3) What is your personal perspective on the arguments made? Do you agree or disagree, and why?</p>\n<p><strong>Note:</strong> Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The submission of the synopsis on the weekly readings is via email to the course coordinator <strong>only in the case </strong>that this has been previously agreed to by the course coordinator due to medical reasons, Student Disability Action Plan, or exceptional circumstances.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "In-class Assessment - Reflection Essay",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 10/04/2025 4:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Performance, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will be required to complete and submit a task during the seminar in Week 7. It is therefore important students attend this seminar. If you are unable to attend this seminar, please contact the course coordinator as soon as possible to arrange an alternative date to complete the task.</p>\n<p>The task will be a reflection essay related to the course content. An essay question will be distributed at the beginning of the seminar which students must respond to in their reflection essay. Clear instructions for reflective essay writing will be provided, as well as an in-depth practical seminar on argumentative academic writing versus reflective essay writing in Week 6.</p>\n<p>This in-class reflection essay provides POLS7503 scholars with the opportunity to consider the spectrum of ethical approaches and ways of thinking studied in the first five weeks of the course, as well as to critically engage and reflect on how the respective theoretical approaches interrelate with and affect their own mindset and daily negotiations in what is becoming an increasingly interconnected and fast-paced world. Particularly significant for the reflection essay are questions concerning what an understanding of the respective ethical approaches might have added or complemented or changed, in each students’ thinking and doing and being in the world around them.</p>\n<p>While the reflection essay is not an argumentative essay per se, each student’s reflection must still develop and maintain a clear central point and be structured logically, as per the formal criteria. When students are developing their reflections, students are encouraged to engage with and reflect on their own daily lived experiences in their own local and global communities, in whatever forms these interactions take shape.</p>\n<p><strong>Note:</strong> Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments for this course will be submitted electronically via Blackboard and using <em>Turnitin </em>during class.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Research Essay Part One: In-class Assessment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>18%</dd>",
            "due_date": "<dd><p> 8/05/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>During the seminar in <strong>week 10 (Thursday 8 May), </strong>you will be given a task related to your Research Essay to <strong>complete and submit during the seminar. </strong>It is therefore important that you attend this seminar. You will be informed of the task at the beginning of the seminar. This in-class assessment is worth a total of 18 marks.</p>\n<p>This is a scaffolded assessment, which means students must use the results of this assessment in their Research Essay Part Two. Part One and Part Two of this scaffolded assessment will be clearly explained during the seminar in Week 1 of semester.</p>\n<p><strong>Note: </strong>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments for this course will be submitted electronically via Blackboard and using <em>Turnitin</em>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Research Essay Part Two (3,000 words)",
            "special_indicators": [],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 9/06/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The research essay gives POLS7503 scholars the opportunity to explore in greater detail a key ethical issue or dilemmas in politics and international relations. It also provides the opportunity to apply the knowledge and analytical skills acquired through the course in their own unique way. The essay must therefore do more than present factual evidence. The major research essay is analytical and argumentative in nature and must integrate knowledge derived from the seminars, required readings, independently sourced readings, and specific research conducted by the student.</p>\n<p>In the first half of semester, students will be given a list of essay topics from which to choose from. They also have the opportunity to formulate a topic of their choice (in close consultation with the course coordinator). Should students wish to formulate their own essay topic and question, it must directly relate to the content of this course and bear no semblances to written work submitted for a previous course. Students need to approach the course coordinator well in advance (first half of semester) if they aim to formulate their own essay question. It is recommended students pick their essay topic by Week 6 at the latest.</p>\n<p>Further guidelines will be posted on Blackboard to assist students, and the major essay will be discussed during the weekly seminars. There will also be some time allocated in-class during seminars for students to research and work on their essays.</p>\n<p><strong>Note: </strong>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments for this course will be submitted electronically via Blackboard and using <em>Turnitin</em>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction - Why Study Ethics and Human Rights</strong><br><p>Every day we are exposed to challenging issues and questions concerning moral and just practices in world politics. From decisions to wage war and the question of what constitutes a legitimate or appropriate use of force, to the struggle for self-determination and the need to empower communities through the provision of aid and humanitarian relief: these are some of the central dilemmas that international relations scholars, practitioners, and policy analysts continue to face. Yet, these issues comprise not only the ostensible realities of world politics, but also the point at which political realities and ethics collide. Ethical approaches underpin these and many other dilemmas and how, and indeed even whether, states and other international actors respond and seek to address particular political challenges.</p>\n<p>In this introductory seminar, we introduce and overview the course focusing on preliminary questions such as: what are ethics and how do they intersect with the practices of international relations today? And, how do understandings of ethics help us to both understand the make-up of world politics and also contemplate the nature and possibilities of a just international order? We also use this first seminar to get to know each other a little as well as discuss the structure of the course, seminars, learning activities and goals, and assessments.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Introduction - Why Study Ethics and Human Rights</strong>",
            "topic_description": "Introduction - Why Study Ethics and Human Rights Every day we are exposed to challenging issues and questions concerning moral and just practices in world politics. From decisions to wage war and the question of what constitutes a legitimate or appropriate use of force, to the struggle for self-determination and the need to empower communities through the provision of aid and humanitarian relief: these are some of the central dilemmas that international relations scholars, practitioners, and policy analysts continue to face. Yet, these issues comprise not only the ostensible realities of world politics, but also the point at which political realities and ethics collide. Ethical approaches underpin these and many other dilemmas and how, and indeed even whether, states and other international actors respond and seek to address particular political challenges. In this introductory seminar, we introduce and overview the course focusing on preliminary questions such as: what are ethics and how do they intersect with the practices of international relations today? And, how do understandings of ethics help us to both understand the make-up of world politics and also contemplate the nature and possibilities of a just international order? We also use this first seminar to get to know each other a little as well as discuss the structure of the course, seminars, learning activities and goals, and assessments.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ethical Thinking in Global Politics</strong><br><p>To begin our exploration of the significance of ethics and human rights, we work through the nature of and possibilities for ethical thinking in global politics. The traditional view of international relations as an anarchical system or society holds particular assumptions about ethical possibilities: that states should and do pursue national interests to the exclusion of competing values, moral ideals and principles. State interests thus seem to present a challenge for ethical thought and political practices. But, should we think of the world as divided between sovereignty/power and ethics, and does the prevalence of realist national interests mean that states cannot act ethically? And, while we still live in a world of states, are states the only actors capable of ethical thinking and practices?</p>\n<p>This seminar explores these central questions with attention to the purpose and potentials for thinking and acting ethically in a fast-changing and only increasingly globalised world. We will discuss how our perceptions of ethics are originated from the historical, social, and cultural complexities that underpin our society, how the question of 'good' and 'bad' in our society establishes our conceptions of ethics, and how cross-cultural interactions and interactions between societies have created challenges to establish a universal conceptions of ethics. Linking these challenges to the broader transformation of international society in the 20th century, we will discuss the political nature of ethics and human rights and the contestation in contemporary international society.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Ethical Thinking in Global Politics</strong>",
            "topic_description": "Ethical Thinking in Global Politics To begin our exploration of the significance of ethics and human rights, we work through the nature of and possibilities for ethical thinking in global politics. The traditional view of international relations as an anarchical system or society holds particular assumptions about ethical possibilities: that states should and do pursue national interests to the exclusion of competing values, moral ideals and principles. State interests thus seem to present a challenge for ethical thought and political practices. But, should we think of the world as divided between sovereignty/power and ethics, and does the prevalence of realist national interests mean that states cannot act ethically? And, while we still live in a world of states, are states the only actors capable of ethical thinking and practices? This seminar explores these central questions with attention to the purpose and potentials for thinking and acting ethically in a fast-changing and only increasingly globalised world. We will discuss how our perceptions of ethics are originated from the historical, social, and cultural complexities that underpin our society, how the question of 'good' and 'bad' in our society establishes our conceptions of ethics, and how cross-cultural interactions and interactions between societies have created challenges to establish a universal conceptions of ethics. Linking these challenges to the broader transformation of international society in the 20th century, we will discuss the political nature of ethics and human rights and the contestation in contemporary international society.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Cosmopolitanism and Communitarianism </strong><br/><p>In this seminar we overview some of the most established and influential approaches to global ethics, which are essential to understand how moral discourses function and human rights are articulated and defended. We focus in particular on communitarian and cosmopolitan thought. While the former emphasises the bounds of the community in ethics and human rights, the latter emphasises the cosmopolitan obligation towards humanities regardless of their identities. We will discuss how and why the two perspectives diverge in understanding ethics, and whether the convergence or reconciliation between the two are possible.</p>\n<p>Applying these approaches to contemporary world politics, the seminar reflects on the extent to which categorical ethics, such as the cosmopolitan/communitarian divide, assists international actors to make the 'right' policy choices. Our exploration of the two theoretical traditions in ethics will also shed light to the current tensions between the quest from nation-state for 'international order' and demands for 'international justice' from marginalised groups in contemporary international politics.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Cosmopolitanism and Communitarianism </strong>",
            "topic_description": "Cosmopolitanism and Communitarianism In this seminar we overview some of the most established and influential approaches to global ethics, which are essential to understand how moral discourses function and human rights are articulated and defended. We focus in particular on communitarian and cosmopolitan thought. While the former emphasises the bounds of the community in ethics and human rights, the latter emphasises the cosmopolitan obligation towards humanities regardless of their identities. We will discuss how and why the two perspectives diverge in understanding ethics, and whether the convergence or reconciliation between the two are possible. Applying these approaches to contemporary world politics, the seminar reflects on the extent to which categorical ethics, such as the cosmopolitan/communitarian divide, assists international actors to make the 'right' policy choices. Our exploration of the two theoretical traditions in ethics will also shed light to the current tensions between the quest from nation-state for 'international order' and demands for 'international justice' from marginalised groups in contemporary international politics.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Critical Approaches: Poststructural, Feminist and Postcolonial</strong><br/><p>We move on to explore critical perspectives that enable us to view ethical questions and priorities in a different light. Since the later stages of the twentieth century, critical approaches such as poststructuralism, feminism and postcolonialism have challenged dominant visions of international relations by highlighting silenced ethical dilemmas in societies and their politics. Of particular significance is the plight of marginalised individuals and communities, whose voices have traditionally existed outside of power and whose experiences are often neglected by rationalist traditions that draw on categorical ethical codes.</p>\n<p>In the seminar, we discuss the idea that ethical thinking can be not only normative but also deconstructionist in nature and purpose. Empirical examples include the women's movement and the need to analyse and rethink gendered conventions while also cultivating inclusion and an ethics of care. Poststructuralist and postcolonial ethics have also been important to advancing dialogue, rights, and sovereignty through the various waves of decolonisation. Discussing these perspectives is essential to show the weaknesses of established communitarian and cosmopolitan approaches in an increasingly global and connected world politics.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Critical Approaches: Poststructural, Feminist and Postcolonial</strong>",
            "topic_description": "Critical Approaches: Poststructural, Feminist and Postcolonial We move on to explore critical perspectives that enable us to view ethical questions and priorities in a different light. Since the later stages of the twentieth century, critical approaches such as poststructuralism, feminism and postcolonialism have challenged dominant visions of international relations by highlighting silenced ethical dilemmas in societies and their politics. Of particular significance is the plight of marginalised individuals and communities, whose voices have traditionally existed outside of power and whose experiences are often neglected by rationalist traditions that draw on categorical ethical codes. In the seminar, we discuss the idea that ethical thinking can be not only normative but also deconstructionist in nature and purpose. Empirical examples include the women's movement and the need to analyse and rethink gendered conventions while also cultivating inclusion and an ethics of care. Poststructuralist and postcolonial ethics have also been important to advancing dialogue, rights, and sovereignty through the various waves of decolonisation. Discussing these perspectives is essential to show the weaknesses of established communitarian and cosmopolitan approaches in an increasingly global and connected world politics.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Decolonial Theory and Indigenous Knowledges</strong><br/><p>Having gained an understanding of the potentials and limits of a broad range of well-known traditional and critical ethical approaches, we will now explore the history of international ethics by looking at the history of colonialism. Understanding histories of colonialism is essential to uncover (1) the creation of global injustice through colonial means and (2) the traditions of non-Western thinking in ethics that have been excluded due to perceived racial superiority.</p>\n<p>This seminar will discuss how colonialism imposes a problematic legacy on how we know, be and act ethically. Colonialism generates structural and material injustice particularly to indigenous people, whose knowledges and ways of life have been marginalised in the process of Western colonial modernity. By exploring the histories of and legacies of colonialism, we will look at how exclusion, hierarchy, and dehumanisation took place in world politics, and how ethical thinking seek to challenge this legacies through the innovative and inherently pluralistic engagement between Indigenous and Western ontologies.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Decolonial Theory and Indigenous Knowledges</strong>",
            "topic_description": "Decolonial Theory and Indigenous Knowledges Having gained an understanding of the potentials and limits of a broad range of well-known traditional and critical ethical approaches, we will now explore the history of international ethics by looking at the history of colonialism. Understanding histories of colonialism is essential to uncover (1) the creation of global injustice through colonial means and (2) the traditions of non-Western thinking in ethics that have been excluded due to perceived racial superiority. This seminar will discuss how colonialism imposes a problematic legacy on how we know, be and act ethically. Colonialism generates structural and material injustice particularly to indigenous people, whose knowledges and ways of life have been marginalised in the process of Western colonial modernity. By exploring the histories of and legacies of colonialism, we will look at how exclusion, hierarchy, and dehumanisation took place in world politics, and how ethical thinking seek to challenge this legacies through the innovative and inherently pluralistic engagement between Indigenous and Western ontologies.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Practical: Argumentative Academic versus Reflective Writing</strong><br/><p>This seminar will be run by a guest from UQ's Institute for Teaching and Learning Innovation. It will be a practical workshop providing students with a deep-dive into argumentative academic writing and reflective essay writing.</p>\n<p>The purpose of this practical is to prepare students for their key assessment pieces throughout semester. It is also highly recommended that students have their Research Essay topics chosen by Week 6 at the latest.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Practical: Argumentative Academic versus Reflective Writing</strong>",
            "topic_description": "Practical: Argumentative Academic versus Reflective Writing This seminar will be run by a guest from UQ's Institute for Teaching and Learning Innovation. It will be a practical workshop providing students with a deep-dive into argumentative academic writing and reflective essay writing. The purpose of this practical is to prepare students for their key assessment pieces throughout semester. It is also highly recommended that students have their Research Essay topics chosen by Week 6 at the latest.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In-class Assessment: Reflective Essay</strong><br/><p>Students will be tasked with an assessment to <strong>complete and submit </strong>during this seminar. See Assessment information for more detail.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>In-class Assessment: Reflective Essay</strong>",
            "topic_description": "In-class Assessment: Reflective Essay Students will be tasked with an assessment to complete and submit during this seminar. See Assessment information for more detail.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ethics in Practice II: The Ethics of Development</strong><br/><p>In this seminar we start to analyse several cases of ethics and human rights that have been institutionalised in the international order, through history to the present day. This weeks seminar will kick-off our first case study by assessing the ethics of development and contemporary economics. It is often thought that economic development operates through a rational logic of society: people considers seriously the cost and benefits in their choice and decision. But over-emphasising individual rationality also creates an ethical dilemma to the society. The most challenging of these involves the problem of structural inequalities, which some argue manifest and perpetuate the need for economic development.</p>\n<p>In this seminar, we question the roles that ethics have played in the moral development, salience and attention given to a range of dilemmas. There are questions surrounding the obligations of the global rich to assist the poor, the structural inequality and injustice, and ethical implications of government's economic policies. Addressing these questions inevitably raise further questions about the core assumptions of economics, particularly individual rationality, the role of the state, and the nature of the market.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Ethics in Practice II: The Ethics of Development</strong>",
            "topic_description": "Ethics in Practice II: The Ethics of Development In this seminar we start to analyse several cases of ethics and human rights that have been institutionalised in the international order, through history to the present day. This weeks seminar will kick-off our first case study by assessing the ethics of development and contemporary economics. It is often thought that economic development operates through a rational logic of society: people considers seriously the cost and benefits in their choice and decision. But over-emphasising individual rationality also creates an ethical dilemma to the society. The most challenging of these involves the problem of structural inequalities, which some argue manifest and perpetuate the need for economic development. In this seminar, we question the roles that ethics have played in the moral development, salience and attention given to a range of dilemmas. There are questions surrounding the obligations of the global rich to assist the poor, the structural inequality and injustice, and ethical implications of government's economic policies. Addressing these questions inevitably raise further questions about the core assumptions of economics, particularly individual rationality, the role of the state, and the nature of the market.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Case Study I: The Ethics of Force? Just War and Peacekeeping, to Humanitarian Intervention and R2P</strong><br/><p>In this seminar we move on to the first of four cases that interrogate the codification and practical potentials for ethical conduct in global politics.</p>\n<p>This seminar examines one central question: can it be ethical to use force in conflict and international relations more generally? The first guiding rules/principles now codified in international law for using force in conflict and war emerged in the mid-nineteenth century. Since this time, international actors have sought to make war more humane and more just. A range of international humanitarian laws, laws of war, and measures to account for military conduct during war and protect civilians during times of civil conflict have been established. The International Committee on the Responsibility to Protect and the established norm of R2P is one potential example. The International Criminal Court is also meanwhile now responsible for upholding such ethical and juridical standards. In this seminar, we work through these developments while constantly returning to the philosophical and practical dilemma of whether the use of force can be 'ethical'.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Case Study I: The Ethics of Force? Just War and Peacekeeping, to Humanitarian Intervention and R2P</strong>",
            "topic_description": "Case Study I: The Ethics of Force? Just War and Peacekeeping, to Humanitarian Intervention and R2P In this seminar we move on to the first of four cases that interrogate the codification and practical potentials for ethical conduct in global politics. This seminar examines one central question: can it be ethical to use force in conflict and international relations more generally? The first guiding rules/principles now codified in international law for using force in conflict and war emerged in the mid-nineteenth century. Since this time, international actors have sought to make war more humane and more just. A range of international humanitarian laws, laws of war, and measures to account for military conduct during war and protect civilians during times of civil conflict have been established. The International Committee on the Responsibility to Protect and the established norm of R2P is one potential example. The International Criminal Court is also meanwhile now responsible for upholding such ethical and juridical standards. In this seminar, we work through these developments while constantly returning to the philosophical and practical dilemma of whether the use of force can be 'ethical'.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In-class Assessment: Research Essay Part One</strong><br/><p>Students will be tasked with an assessment to <strong>complete and submit </strong>during the seminar.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>In-class Assessment: Research Essay Part One</strong>",
            "topic_description": "In-class Assessment: Research Essay Part One Students will be tasked with an assessment to complete and submit during the seminar.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Case Study II: The Ethics of Peace: Cultural Difference, Conflict, and Reconcilisation</strong><br/><p>Having examined the ethics of force, we now turn to the ethics of establishing and keeping peace after violence and in long divided societies. While war may have become increasingly codified, how to cultivate peaceful social relations in the cases of civil and international conflict lacks a clear framework. At the same time, how to create genuine and enduring cultures of peace in societies fraught with antagonism, hostile cultural identities and differences, and traumatic legacies of violence, presents a challenging and often urgent political and ethical problem. In this seminar, we examine the possibilities for cultivating peace. We focus on how individuals and communities can reckon with and account for legacies of violence; the challenges of forgiveness, reconciliation, and transitional justice processes; and ethical debates about structural inequality and how to work towards political inclusion in previously divided societies.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Case Study II: The Ethics of Peace: Cultural Difference, Conflict, and Reconcilisation</strong>",
            "topic_description": "Case Study II: The Ethics of Peace: Cultural Difference, Conflict, and Reconcilisation Having examined the ethics of force, we now turn to the ethics of establishing and keeping peace after violence and in long divided societies. While war may have become increasingly codified, how to cultivate peaceful social relations in the cases of civil and international conflict lacks a clear framework. At the same time, how to create genuine and enduring cultures of peace in societies fraught with antagonism, hostile cultural identities and differences, and traumatic legacies of violence, presents a challenging and often urgent political and ethical problem. In this seminar, we examine the possibilities for cultivating peace. We focus on how individuals and communities can reckon with and account for legacies of violence; the challenges of forgiveness, reconciliation, and transitional justice processes; and ethical debates about structural inequality and how to work towards political inclusion in previously divided societies.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Case Study III: Conflict, Disaster, and the Ethics of Aid</strong><br/><p>Humanitarian aid has increasingly become an important part of international order, particularly since the 20th century. First taking shape through charity for those less fortunate, practices constitute an international humanitarian order that encompasses the administering of aid, emerging relief and, longer-term development. To address human hardship that often goes beyond the national border, the questions of ethics and human rights also consider one important aspect: how to distribute humanitarian aid, especially in the context of conflict and disasters, in a just and ethical manner. But, as we work through this week, the question of humanitarianism and aid increasingly raises a range of ethical conundrums between the Global North and the Global South, or between the developed, developing, and less developed countries.</p>\n<p>This seminar will discuss the ethical questions that shape debates on humanitarian assistance. We will discuss the importance of reconciling the good intent of humanitarian assistance and ethical practice of distribution that considers local vulnerabilities. In this seminar, we will give a particular look to humanitarian aids in the context of disasters and conflict. More specifically, we will uncover how and why human rights is important to conduct an ethical humanitarian aid distribution that protect human rights, particularly in the context of armed conflict and disaster emergency.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Case Study III: Conflict, Disaster, and the Ethics of Aid</strong>",
            "topic_description": "Case Study III: Conflict, Disaster, and the Ethics of Aid Humanitarian aid has increasingly become an important part of international order, particularly since the 20th century. First taking shape through charity for those less fortunate, practices constitute an international humanitarian order that encompasses the administering of aid, emerging relief and, longer-term development. To address human hardship that often goes beyond the national border, the questions of ethics and human rights also consider one important aspect: how to distribute humanitarian aid, especially in the context of conflict and disasters, in a just and ethical manner. But, as we work through this week, the question of humanitarianism and aid increasingly raises a range of ethical conundrums between the Global North and the Global South, or between the developed, developing, and less developed countries. This seminar will discuss the ethical questions that shape debates on humanitarian assistance. We will discuss the importance of reconciling the good intent of humanitarian assistance and ethical practice of distribution that considers local vulnerabilities. In this seminar, we will give a particular look to humanitarian aids in the context of disasters and conflict. More specifically, we will uncover how and why human rights is important to conduct an ethical humanitarian aid distribution that protect human rights, particularly in the context of armed conflict and disaster emergency.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Conclusion: The Future of Ethics and Human Rights: Pandemic, Climate Change, and the Question of Borders</strong><br/><p>This final seminar brings the course full circle. In doing so it returns to questions that have been central to ethics since the first cosmopolitan thinkers: what is 'humanity' and are there inherent rights owed to every human? Who, then, is responsible for ensuring human rights? What practices are ethically permissible to ensure human rights and how are these practices justified? To grapple with these issues the seminar focuses on the one of the most pressing contemporary ethical dilemmas in world politics emerge: the questions of border.</p>\n<p>We discuss the extents to which borders open up and foreclose ethical possibilities in global politics. Proponents of globalization argue that open border will bring positive impacts in terms of trade and cross-cultural understandings, which make the world more peaceful. But certainly open border does not diminish the threat of racism and hatred towards 'others', as well as health and ecological risk, as evidenced by the COVID-19 pandemic. This seminar will discuss the tension between open and closed border, which reflects the broader tension between communitarian and cosmopolitan view of ethics. The politics of disease outbreaks, climate change, and asylum seekers/refugees offer urgent empirical cases for the week's discussion.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Conclusion: The Future of Ethics and Human Rights: Pandemic, Climate Change, and the Question of Borders</strong>",
            "topic_description": "Conclusion: The Future of Ethics and Human Rights: Pandemic, Climate Change, and the Question of Borders This final seminar brings the course full circle. In doing so it returns to questions that have been central to ethics since the first cosmopolitan thinkers: what is 'humanity' and are there inherent rights owed to every human? Who, then, is responsible for ensuring human rights? What practices are ethically permissible to ensure human rights and how are these practices justified? To grapple with these issues the seminar focuses on the one of the most pressing contemporary ethical dilemmas in world politics emerge: the questions of border. We discuss the extents to which borders open up and foreclose ethical possibilities in global politics. Proponents of globalization argue that open border will bring positive impacts in terms of trade and cross-cultural understandings, which make the world more peaceful. But certainly open border does not diminish the threat of racism and hatred towards 'others', as well as health and ecological risk, as evidenced by the COVID-19 pandemic. This seminar will discuss the tension between open and closed border, which reflects the broader tension between communitarian and cosmopolitan view of ethics. The politics of disease outbreaks, climate change, and asylum seekers/refugees offer urgent empirical cases for the week's discussion.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}