{
    "course_title": "Policy Development and Practice",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/POLY3000-21645-7520",
    "full_course_code": "POLY3000-21645-7520",
    "course_code": "POLY3000",
    "class_code": "21645",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Identify and explain aspects of the policy process and the various roles social workers and policy professionals play."
        },
        {
            "number": "LO2.",
            "description": "Describe, explain and apply key policy concepts that can be used to explore and explain policy practice."
        },
        {
            "number": "LO3.",
            "description": "Apply a selection of core skills and strategies for undertaking policy practice; including stakeholder engagement and policy analysis."
        },
        {
            "number": "LO4.",
            "description": "Demonstrate the relevant skills to access, analyse and synthesise policy related material."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate the capacity to research and write ministerial policy documents following prescribed formats and accepted conventions, using a professional writing style."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Ministerial Briefing (Week 5)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 24/03/2025 5:00 pm</p></dd>",
            "learning_objectives": "L03, L04, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Ministerial Briefing Note</strong></p>\n<p>Imagine you are a policy officer in a government department. You are to write a succinct ministerial briefing note to advise the minister of a recent policy research report relevant to the minister’s portfolio. Policy officers working within government departments can be required to prepare these kinds of briefings on a regular basis and may need to do this within very tight timeframes (sometimes just a few hours!) for high profile policy issues.</p>\n<p><strong>What you will need to do for this task:</strong></p>\n<p>Select one report (a selection of policy research reports will be provided on Blackboard).</p>\n<p>Identify a minister and government department that have responsibility for the topic of the research report.</p>\n<p>Write a succinct and informative ministerial briefing note. In the body of the briefing note summarise the research and offer a critical analysis of the findings. Conclude with implications of the research for the government (department).</p>\n<p>The ministerial brief should:</p>\n<ul>\n<li>be <strong>two pages</strong> – one page for the cover sheet and one page for the body of the briefing note - (word limit of <strong>500 words</strong>)</li>\n<li>follow the structure listed in the template provided on Blackboard</li>\n<li>use single line spacing</li>\n<li>use Arial font with font size 11 points</li>\n<li>be a maximum of 500 words (excluding the template and any references).</li>\n</ul>\n<p>The task will be discussed as part of the course overview in the week 1 lecture/workshop. Further, the first tutorial will focus on government report writing (including ministerial briefings). Additionally, the course Blackboard Discussion Board will be used as a forum for students to ask questions and receive guidance.</p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. This will be explained in class.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments for this course will be submitted electronically via Blackboard and using <em>Turnitin</em>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Policy Idea for Ministerial Submission (Week 6)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p> Week 6 Mon - Week 6 Fri</p>\n<p>\n</p><p>You will submit a hardcopy in class. Feedback will be provided via Grade Centre.</p>\n<p><br/></p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>OVERVIEW OF POLICY PROPOSAL / MINISTERIAL SUBMISSION (ASSESSMENTS 2, 3, 4)</strong></p>\n<p>Writing policy submissions is a key element of policy practice, both for policy officers working within government but also for practitioners aiming to inform or influence public policy. This task is designed to closely replicate actual activities in government while providing a learning experience.</p>\n<p>Assessments 2, 3 and 4 all form part of one larger policy proposal. Imagine you are a policy analyst in a government department, and you have identified a real-life problem that calls for a policy change. This can occur because e.g. the current policy is inadequate (or no longer adequate) in addressing the very problem it is trying to solve, or because you identified a policy problem for which there is simply no policy in place yet.</p>\n<p>In Assessment 4, you will prepare a policy proposal for submission to the Minister for consideration and decision, which outlines:</p>\n<ul>\n<li>what the problem is / why there is a need for the introduction or change of a policy,</li>\n<li>what the proposed changes / policy interventions are,</li>\n<li>how this is an improvement on what is currently in place,</li>\n<li>how the changes are cost-effective, or value-for-money,</li>\n<li>how the changes will be practically implemented (like a recipe or a program)</li>\n</ul>\n<p>The proposal may involve a new or revised service, benefit, form of service delivery or administrative setup. It must denote a specific action. </p>\n<p>As the Ministerial Submission in assessment 4 is a substantial piece of work, assessments 2 and 3 are designed to be the foundation:</p>\n<p><strong>In assessment 2 you will define the problem and define a policy idea, which will then become the foundation for the Ministerial Submission (assessments 3 and 4). You will not be able to make substantive changes to this policy idea.</strong></p>\n<p>Assessment 3 forms the first part of the actual Ministerial Submission (outlining the background and issues as well as the proposed policy).</p>\n<p>Assessment 4 forms the second part of the Ministerial Submission (outlining the impacts of the proposed policy, financial considerations, implementation issues, communications as well as a cover sheet).</p>\n<p>This staged process will enable students to receive continuous feedback while they develop their policy proposals for the ministerial submission over the course of the semester.</p>\n<p><strong>ASSESSMENT 2 DETAILS: POLICY IDEA FOR MINISTERIAL SUBMISSION</strong></p>\n<p>To help you identify a realistic policy proposal for the Ministerial submission (in assessments 3 and 4), you will need to submit a brief description of:</p>\n<ul>\n<li>what real-life problem you are aiming to address (e.g. increase in domestic violence, increase in homelessness, lack of skilled workers in regional areas, etc.). Have some general statistics or media examples of why this is something the minister should care about.</li>\n<li>the general idea for your policy intervention that will help solve the problem you identified.</li>\n</ul>\n<p>This process is designed to ensure that you start thinking about your policy proposal as soon as possible and that you are able to receive early feedback on the feasibility of your proposal. You are welcome to choose any social or public policy topic you wish, from any country, and you will be given advice and resources to assist you in identifying a policy area to focus on. </p>\n<p>This will be drafted and submitted DURING the tutorial in Week 6. <strong>It will need to be handwritten and submitted by the end of the tutorial. </strong></p>\n<p>You<strong> will not be allowed to change your chosen policy problem </strong>(although we accept your policy intervention may change as you learn more about the topic). This means if you choose homelessness and propose a service for providing temporary housing in this assessment, you may submit A3/4 on the topic of homelessness but have polished your policy idea to be a specific online portal for people wanting to access temporary housing or, perhaps expansion of an existing service for people experiencing homelessness. You will not be able to submit A3/4 on youth justice, or drug and alcohol support services. While there is a potential relationship between the two, they are too far removed from the policy problem you submitted in A2.</p>\n<p>This will mean that this assignment works a little like a 'soft' exam. It WILL require you to have done your research in advance of the tutorial. <strong>No laptops or phones will be used in class. </strong></p>\n<p><strong>See the rubric for further guidance on what we expect from this assessment. </strong></p>\n<p>Word count:</p>\n<ul>\n<li>As a guide you should be aiming for one page or<strong> 500 words.</strong></li>\n</ul>\n<p>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students unable to attend this tutorial due to circumstances beyond their control (e.g., illness, jury duty, care duties) may be granted the opportunity to compensate for their absence. Please contact the course coordinator prior to the tutorial.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Ministerial Submission - Part 1 (Week 9)",
            "special_indicators": [],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 2/05/2025 5:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>MINISTERIAL SUBMISSION - PART 1</strong></p>\n<p>Writing a policy proposal is a key element of policy practice. This assessment represents the first stage of writing your Ministerial submission and builds upon the policy idea you developed in assessment 2 as well as the feedback you received for it.</p>\n<p>In assessment 3, you will need to outline the first three sections of your Ministerial submission:</p>\n<ul>\n<li>Identify a minister and government department that have responsibility for the issue</li>\n<li>Background and issues</li>\n<li>Proposed policy</li>\n<li>Stakeholder engagement/consultation plan</li>\n</ul>\n<p>The ‘background and issues’ section should set the scene as to why your policy idea <em>should</em> be implemented. It must present the key pressures and the problems the policy proposal seeks to address and be supported by relevant evidence (e.g. reference to relevant reports, research, findings, etc.). It must also summarise the current policy setting in a succinct and accessible way (are there any policies in place already? If yes, which ones?) It should outline any problems with the current policy setting and explain why your policy proposal needs to be considered at this time.</p>\n<p>Based on these considerations, you will need to suggest a policy intervention in the ‘proposed policy’ section. This could be an amendment of an existing policy / changes to the delivery methods of the current policy (e.g. changing payment rates or eligibility criteria, different delivery mechanisms, expanding or limiting the target population, increasing or decreasing the generosity of the service, etc.), the introduction of a new policy or the abolition of (parts of) the current policy.</p>\n<p>The stakeholder engagement or consultation plan will suggest some key stakeholders who will need to be consulted, how will they be engaged with and how potential challenges will be addressed.</p>\n<p>The feedback you will receive for this assessment will be a critical foundation for your work on assessment 4, which outlines the details of your proposed policy, e.g. impact, implementation, financial considerations and communications.</p>\n<p>The word limit for this assessment is <strong>2000 words</strong>.</p>\n<p>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments for this course will be submitted electronically via Blackboard and using <em>Turnitin</em>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Ministerial Submission - Part 2 (Week 13)",
            "special_indicators": [],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 30/05/2025 5:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>MINISTERIAL SUBMISSION - PART 2</strong></p>\n<p>Writing a policy proposal is a key element of policy practice. This assessment represents the final stage of writing your Ministerial submission and builds upon the background and issues and proposed policy you outlined in assessment 3 as well as the feedback you received for it.</p>\n<p>In assessment 4, you will need to incorporate the feedback you received for assessment 3 into the “background and issues” and “proposed policy” sections. As these sections are essentially copied from assessment 3 and only updated based on the feedback you received, they will not count towards the word limit for assessment 4. It is however important to include them, as they are the foundation for the remaining four sections plus cover sheet of the Ministerial submission:</p>\n<ul>\n<li>Impact statement</li>\n<li>Implementation plan</li>\n<li>Financial considerations</li>\n<li>Include a cover sheet for the whole submission</li>\n</ul>\n<p>Only these sections count towards the word limit of <strong>2000 words</strong>.</p>\n<p>A template which also includes the cover sheet for the submission will be provided on Blackboard. </p>\n<p>The workshops will provide the input you need to write your assessments, while the tutorials are specifically designed to help you work on your policy idea as well as your Ministerial submission.</p>\n<p>Referencing style should be APA, Harvard or other in-text referencing format (referencing requirements will be discussed in class). It should be <strong><em>1.5 line spacing</em></strong>. See the <a href=\"https://guides.library.uq.edu.au/referencing/apa6\">UQ Library Guide</a> for details. </p>\n<p>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments for this course will be submitted electronically via Blackboard and using <em>Turnitin</em>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1 - What is policy and why should I care?</strong><br><p>Why study applied policy? What makes good policy? Course overview.</p></br></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Week 1 - What is policy and why should I care?</strong>",
            "topic_description": "Week 1 - What is policy and why should I care? Why study applied policy? What makes good policy? Course overview.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2 - Who makes policy? Policy actors and institutions</strong><br><p>We will discuss institutions and key policy actors. Who is responsible for what? </p></br></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Week 2 - Who makes policy? Policy actors and institutions</strong>",
            "topic_description": "Week 2 - Who makes policy? Policy actors and institutions We will discuss institutions and key policy actors. Who is responsible for what?",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3 - Policy in practice: Models vs reality</strong><br><p>What is the policy cycle? How can it help? Is it a genuine reflection of reality?</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Week 3 - Policy in practice: Models vs reality</strong>",
            "topic_description": "Week 3 - Policy in practice: Models vs reality What is the policy cycle? How can it help? Is it a genuine reflection of reality?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4 - Identifying issues and agenda setting</strong><br><p>How do things get into the policy agenda? We will have a guest speaker today to discuss how external actors work to get their concerns onto the policy agenda (or at least try!)</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Week 4 - Identifying issues and agenda setting</strong>",
            "topic_description": "Week 4 - Identifying issues and agenda setting How do things get into the policy agenda? We will have a guest speaker today to discuss how external actors work to get their concerns onto the policy agenda (or at least try!)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Preparation for Assessment 1 and 2 - Defining a problem</strong><br><p>Introduction to writing reports and defining a policy problem</p></br></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Preparation for Assessment 1 and 2 - Defining a problem</strong>",
            "topic_description": "Preparation for Assessment 1 and 2 - Defining a problem Introduction to writing reports and defining a policy problem",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5 - Policy analysis and designing solutions</strong><br/></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Week 5 - Policy analysis and designing solutions</strong>",
            "topic_description": "Week 5 - Policy analysis and designing solutions",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Preparation for Assessment 2  - defining the problem and exploring solutions</strong><br/><p>Preparation for Assessment 2: Whose problem is it, and how can we think about what needs to be done?</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Preparation for Assessment 2  - defining the problem and exploring solutions</strong>",
            "topic_description": "Preparation for Assessment 2  - defining the problem and exploring solutions Preparation for Assessment 2: Whose problem is it, and how can we think about what needs to be done?",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6 - Stakeholder engagement</strong><br/><p>Who do we engage and when? What tools can we use?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Week 6 - Stakeholder engagement</strong>",
            "topic_description": "Week 6 - Stakeholder engagement Who do we engage and when? What tools can we use?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Assessment 2 - In class</strong><br/><p>Please see information under A2 for how this tutorial will work. If you cannot attend get in touch with the course coordinator as early as possible!</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Assessment 2 - In class</strong>",
            "topic_description": "Assessment 2 - In class Please see information under A2 for how this tutorial will work. If you cannot attend get in touch with the course coordinator as early as possible!",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7 - Making decisions</strong><br/><p>What shapes policy decisions? What is the role of key players in decision making? How does evidence play a role?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Week 7 - Making decisions</strong>",
            "topic_description": "Week 7 - Making decisions What shapes policy decisions? What is the role of key players in decision making? How does evidence play a role?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Preparation for Assessment 3 - Who do I need to engage?</strong><br/><p>Stakeholder engagement, who do we need to include? How can we engage them?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Preparation for Assessment 3 - Who do I need to engage?</strong>",
            "topic_description": "Preparation for Assessment 3 - Who do I need to engage? Stakeholder engagement, who do we need to include? How can we engage them?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8 - No classes this week</strong><br/></p></div></td>",
            "topic_title": "<strong>Week 8 - No classes this week</strong>",
            "topic_description": "Week 8 - No classes this week",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MID-SEMESTER BREAK</strong><br/><p>NO CLASSES</p></p></div></td>",
            "topic_title": "<strong>MID-SEMESTER BREAK</strong>",
            "topic_description": "MID-SEMESTER BREAK NO CLASSES",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9 - Frameworks for Analysing Policy</strong><br/><p>Ethics, equity and economics. What shapes how policy is designed and implemented?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Week 9 - Frameworks for Analysing Policy</strong>",
            "topic_description": "Week 9 - Frameworks for Analysing Policy Ethics, equity and economics. What shapes how policy is designed and implemented?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Feedback and advice: refining my policy problem and solution</strong><br/><p>Feedback from assessment, hints and tips for moving toward A3 and A4. This is quite close to A3, so come with directed questions.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Feedback and advice: refining my policy problem and solution</strong>",
            "topic_description": "Feedback and advice: refining my policy problem and solution Feedback from assessment, hints and tips for moving toward A3 and A4. This is quite close to A3, so come with directed questions.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10 - Implementing Policy </strong><br/><p>Governance, instruments and implementation</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Week 10 - Implementing Policy </strong>",
            "topic_description": "Week 10 - Implementing Policy Governance, instruments and implementation",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>No tutorials this week</strong><br/><p>Public holiday</p></p></div></td>",
            "topic_title": "<strong>No tutorials this week</strong>",
            "topic_description": "No tutorials this week Public holiday",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11: Impact and costings</strong><br/><p>Impact and costings</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Week 11: Impact and costings</strong>",
            "topic_description": "Week 11: Impact and costings Impact and costings",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Preparation for Assessments  4</strong><br/><p>Implementation strategy</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Preparation for Assessments  4</strong>",
            "topic_description": "Preparation for Assessments  4 Implementation strategy",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12: Evaluation</strong><br/><p>How will I know if it works? </p>\n<p>Refining your argument, developing a theory of change</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Week 12: Evaluation</strong>",
            "topic_description": "Week 12: Evaluation How will I know if it works? Refining your argument, developing a theory of change",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Preparation for Assessment 4</strong><br/><p>Impact and costings - how do I budget!</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Preparation for Assessment 4</strong>",
            "topic_description": "Preparation for Assessment 4 Impact and costings - how do I budget!",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Last week: Policy panel and summary of the course</strong><br/><p>We will have a chance to go over anything you want to revisit in the first half of the class. The second half we will hear from practitioners from across policy about the challenges and opportunities in policy making. </p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Last week: Policy panel and summary of the course</strong>",
            "topic_description": "Last week: Policy panel and summary of the course We will have a chance to go over anything you want to revisit in the first half of the class. The second half we will hear from practitioners from across policy about the challenges and opportunities in policy making.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Preparation for Assessment 4</strong><br/><p>Refining your argument</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Preparation for Assessment 4</strong>",
            "topic_description": "Preparation for Assessment 4 Refining your argument",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}