{
    "course_title": "Individual Research Thesis",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/PSYC4071-21147-7520",
    "full_course_code": "PSYC4071-21147-7520",
    "course_code": "PSYC4071",
    "class_code": "21147",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "demonstrate mastery of basic terminology, conventions, methodologies and codes of ethical conduct associated with the discipline of Psychology and its fields of application."
        },
        {
            "number": "LO2.",
            "description": "interpret psychological knowledge/principles by elaborating with examples (translation), simplifications (transformation), and mastery of the basic skills required to communicate these attributes in written and oral form."
        },
        {
            "number": "LO3.",
            "description": "demonstrate mastery of the techniques and conventions for accessing and applying the psychological knowledge base; the ability to apply these to specific tasks and/or issues; and the ability to report outcomes in a manner consistent with the techniques and conventions for oral and written communication in the discipline."
        },
        {
            "number": "LO4.",
            "description": "demonstrate mastery of the methodological conventions, techniques and procedures for undertaking empirical research in Psychology, and applying these conventions and techniques for analysing the outcomes of such research."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Honours presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Program Requirement </dd>",
            "due_date": "<dd><p> 24/02/2025 - 30/05/2025</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Activity/ Performance",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Presenting your work formally is a requirement for obtaining your thesis grade. Students are required to present proposed projects within an individual lab group or clusters of lab groups early in the academic year. It is up to you to ask when you are expected to present, and to be absolutely clear about the date, venue and time of the presentation.</p>\n<p><br/></p>\n<p>The aim of earlier presentations is an improved learning experience: we hope to provide a forum for students to receive feedback on their proposed project design.</p>\n<p><br/></p>\n<p>There are a small number of rules we need to adhere to:</p>\n<ul>\n<li> Students must present their material (be this project design, lit review, research question) in person. This presentation forms part of the Graduate Attributes.</li>\n<li> At least 2 academics must be present in the audience, including your supervisor; one of the academics must be a 100% psychology FTE.</li>\n<li> As proof that they have presented, students must complete this presentation by the the Friday of Week 13, 2025.</li>\n<li> The student will be responsible for getting the attending academics to sign a template document (available on the PSYC4071 elearning site) with a small section of comments as proof the student has presented. <strong>The form will be submitted by the student by Friday Week 13, 2025 via blackboard link on the PSYC4071 elearning site.</strong></li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Individual Research Project",
            "special_indicators": [],
            "weighting": "<dd>100%</dd>",
            "due_date": "<dd><p> 8/10/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Thesis",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students carry out all of the steps involved in research, including the formulation of research questions, the design of the study (including selection of appropriate methodology), the collection and analysis of data to test the research question, the interpretation of findings and the writing up of the report.</p>\n<p><br/></p>\n<p>Starting at the beginning of the introduction, and without the Abstract, Tables, Figures, Reference List or Appendices, the upper limit for an individual thesis is 8,000 words and the lower limit is 7,000 words. Theses below 7,000 words or above 8,000 words <strong>will not be accepted for marking. </strong>Theses that are below the minimum or above the maximum word length will be returned to the student for further editing prior to submission. The time taken to edit the thesis to an acceptable length will accrue as a late penalty that cannot be appealed.  </p>\n<p><br/></p>\n<p>Students should refer to the 2025 Honours Handbook for specific information regarding thesis format and submission details.</p>\n<p><br/></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>By 2pm you must submit one full electronic copy via Turnitin. See 2025 handbook for further format details.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": []
}