{
    "course_title": "Judgement & Decision-Making",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/PSYC3052-21227-7520",
    "full_course_code": "PSYC3052-21227-7520",
    "course_code": "PSYC3052",
    "class_code": "21227",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Identify and explain the fundamental concepts and theories in judgement and decision making, including heuristics and biases, dual-process theories, metacognition, expertise, and decision making under uncertainty."
        },
        {
            "number": "LO2.",
            "description": "Apply judgement and decision making principles to real-world situations, from everyday choices to high-stakes decisions in medicine, law, and education."
        },
        {
            "number": "LO3.",
            "description": "Evaluate decision-making strategies—including nudging, choice architecture, and group decision making—and assess their effectiveness and ethical implications."
        },
        {
            "number": "LO4.",
            "description": "Critically assess research methods used to study judgement and decision making, evaluating the quality, rigour, and reproducibility of empirical claims."
        },
        {
            "number": "LO5.",
            "description": "Communicate and defend evidence-based positions on judgement and decision making through written and verbal presentation."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Weekly In-Class Quizzes",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 6/03/2025 - 29/05/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Each week in class, you’ll complete a pencil-and-paper quiz using traditional bubble sheets. These quizzes build on the assigned readings and activities—such as scientific papers, book chapters, videos, and live demonstrations—and help solidify your grasp of the material. Research shows that frequent testing promotes better long-term retention than studying alone (Roediger et al., 2011), so you’ll have regular opportunities to recall and apply key concepts.</p>\n<p><br/></p>\n<p>There are 12 quizzes in total, each worth 5%. Only your top 10 scores will be counted, making up 50% of your overall grade. You can expect to see your quiz results on Blackboard within a week or two; if you have any questions or concerns about your marks, feel free to contact the tutors.</p>\n<p><br/></p>\n<p><strong>No AI Allowed</strong></p>\n<p>These quizzes measure your understanding of the material without assistance from artificial intelligence. Using AI tools or any other form of unauthorised help may be treated as academic misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": null,
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Weekly AI Explorations",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 6/03/2025 - 29/05/2025</p>\n<p>\n</p><p>The Weekly AI Exploration exercises are due before class each Tuesday at 5pm—this gives us time to review submissions before our class on Thursday.</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Each week, you’ll be assigned a specific short exercise using a generative AI tool, directly tied to that week’s content. You’ll produce an AI-generated output (earning 1%) and then write a brief reflection (another 1%) describing what you tried, what you learned, and whether the AI proved helpful or misleading. Note that you must submit the AI output to earn marks for the reflection. Over the semester, there are 12 such tasks; your best 10 count toward a total of 20%.</p>\n<p><br/></p>\n<p><strong>Allowed Generative AI</strong></p>\n<p>In line with UQ’s goal of preparing you for responsible AI use, you may choose any appropriate generative AI tool to complete each exercise. While we’ll define the weekly tasks in detail, potential examples range from critiquing a cognitive bias or creating an infographic on dual-process thinking to drafting a mini research proposal or outlining a high-stakes crisis response scenario.</p>\n<p><br/></p>\n<p><strong>Rationale</strong></p>\n<p>By pairing hands-on AI practice with thoughtful reflection, you’ll sharpen your critical thinking about the capabilities and limits of AI—skills you can carry forward into real-world decision-making contexts.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": null,
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Final Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>7/06/2025 - 21/06/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Examination",
            "task_description": null,
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Class 1: Making AI Your Study Partner</strong><br><p>This first class shows you how to use generative AI tools (such as ChatGPT) effectively to succeed in your weekly assignments and quizzes. You will learn strategies for organising ideas, summarising key readings, generating self-test questions, and receiving immediate feedback on practice writing. By establishing good practices early, you'll be better equipped to engage deeply with Judgement and Decision Making concepts in the weeks to come.</p></br></p></div></td>",
            "topic_title": "<strong>Class 1: Making AI Your Study Partner</strong>",
            "topic_description": "Class 1: Making AI Your Study Partner This first class shows you how to use generative AI tools (such as ChatGPT) effectively to succeed in your weekly assignments and quizzes. You will learn strategies for organising ideas, summarising key readings, generating self-test questions, and receiving immediate feedback on practice writing. By establishing good practices early, you'll be better equipped to engage deeply with Judgement and Decision Making concepts in the weeks to come.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Class 2: Foundations of Judgement and Decision Making</strong><br><p>Provides a high-level overview of the key questions and methods in cognitive science that underpin JDM research. Covers foundational theories, dual-process frameworks (System 1 vs. System 2), and introduces the major figures and classic studies in JDM (e.g., Tversky and Kahneman). Emphasis is placed on robust, reproducible findings.</p></br></p></div></td>",
            "topic_title": "<strong>Class 2: Foundations of Judgement and Decision Making</strong>",
            "topic_description": "Class 2: Foundations of Judgement and Decision Making Provides a high-level overview of the key questions and methods in cognitive science that underpin JDM research. Covers foundational theories, dual-process frameworks (System 1 vs. System 2), and introduces the major figures and classic studies in JDM (e.g., Tversky and Kahneman). Emphasis is placed on robust, reproducible findings.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Class 3: Heuristics, Biases, and Cognitive Shortcuts</strong><br><p>Explores the core heuristics (availability, representativeness, anchoring) and the biases that arise from them. Students learn how these mental shortcuts can be adaptive but also lead to systematic errors. Contemporary and historical research illustrates how biases operate in everyday judgement.</p></br></p></div></td>",
            "topic_title": "<strong>Class 3: Heuristics, Biases, and Cognitive Shortcuts</strong>",
            "topic_description": "Class 3: Heuristics, Biases, and Cognitive Shortcuts Explores the core heuristics (availability, representativeness, anchoring) and the biases that arise from them. Students learn how these mental shortcuts can be adaptive but also lead to systematic errors. Contemporary and historical research illustrates how biases operate in everyday judgement.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Class 4: Thinking, Reasoning, and Problem-Solving</strong><br><p>Dives deeper into the cognitive processes that govern how we reason and solve problems, from mental models to mental logic. Also examines how AI-driven approaches can shed new light on problem-solving strategies. Students compare human and AI approaches to solving the same problems, refining their own reasoning in the process.</p></br></p></div></td>",
            "topic_title": "<strong>Class 4: Thinking, Reasoning, and Problem-Solving</strong>",
            "topic_description": "Class 4: Thinking, Reasoning, and Problem-Solving Dives deeper into the cognitive processes that govern how we reason and solve problems, from mental models to mental logic. Also examines how AI-driven approaches can shed new light on problem-solving strategies. Students compare human and AI approaches to solving the same problems, refining their own reasoning in the process.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Class 5: Metacognition, Insight, and the Nature of Expertise</strong><br><p>Focuses on how we monitor our own thought processes (metacognition) and how moments of insight arise. Examines mental representations, chunking, and the role of deliberate practice in developing expertise. Students consider how experts differ from novices in how they perceive and solve problems, and how generative AI might augment or mislead expert judgement.</p></br></p></div></td>",
            "topic_title": "<strong>Class 5: Metacognition, Insight, and the Nature of Expertise</strong>",
            "topic_description": "Class 5: Metacognition, Insight, and the Nature of Expertise Focuses on how we monitor our own thought processes (metacognition) and how moments of insight arise. Examines mental representations, chunking, and the role of deliberate practice in developing expertise. Students consider how experts differ from novices in how they perceive and solve problems, and how generative AI might augment or mislead expert judgement.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Class 6: Decision Making Under Uncertainty</strong><br><p>Addresses how humans assess probabilities, manage risks, and navigate ambiguity. Reviews classical models (e.g., Subjective Expected Utility) and alternative approaches (e.g., bounded rationality, prospect theory). Interactive activities demonstrate how AI tools can assist in risk analysis and probability estimations—while underscoring the need for critical oversight.</p></br></p></div></td>",
            "topic_title": "<strong>Class 6: Decision Making Under Uncertainty</strong>",
            "topic_description": "Class 6: Decision Making Under Uncertainty Addresses how humans assess probabilities, manage risks, and navigate ambiguity. Reviews classical models (e.g., Subjective Expected Utility) and alternative approaches (e.g., bounded rationality, prospect theory). Interactive activities demonstrate how AI tools can assist in risk analysis and probability estimations—while underscoring the need for critical oversight.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Class 7: Non-Human Intelligence and Comparative Cognition</strong><br/><p>Investigates non-human feats of intelligence in animals and AI systems, asking what we can learn about judgement and decision making from these comparative perspectives. Explores how different forms of cognition solve complex tasks, and what that implies about the boundaries and uniqueness of human thinking.</p></p></div></td>",
            "topic_title": "<strong>Class 7: Non-Human Intelligence and Comparative Cognition</strong>",
            "topic_description": "Class 7: Non-Human Intelligence and Comparative Cognition Investigates non-human feats of intelligence in animals and AI systems, asking what we can learn about judgement and decision making from these comparative perspectives. Explores how different forms of cognition solve complex tasks, and what that implies about the boundaries and uniqueness of human thinking.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Class 8: Group Decision Making and Social Influences</strong><br/><p>Examines how decisions change in group settings, covering phenomena like groupthink, polarisation, and social influence. Students learn about consensus-building, the \"wisdom of crowds,\" and how AI-driven platforms can amplify or reduce biases in group contexts. Emphasis is placed on practical strategies to avoid common group pitfalls and harness positive collaboration.</p></p></div></td>",
            "topic_title": "<strong>Class 8: Group Decision Making and Social Influences</strong>",
            "topic_description": "Class 8: Group Decision Making and Social Influences Examines how decisions change in group settings, covering phenomena like groupthink, polarisation, and social influence. Students learn about consensus-building, the \"wisdom of crowds,\" and how AI-driven platforms can amplify or reduce biases in group contexts. Emphasis is placed on practical strategies to avoid common group pitfalls and harness positive collaboration.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-semester Break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-semester Break</strong>",
            "topic_description": "Mid-semester Break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Class 9: Nudging, Choice Architecture, and Behaviour Change</strong><br/><p>Dives into how subtle changes in context—\"choice architecture\"—can influence decisions. Reviews the evidence base for nudging and other behaviour-change interventions. Students discuss ethical implications and practise using AI to design or evaluate real-life nudges in areas such as health, education, or environmental policy.</p></p></div></td>",
            "topic_title": "<strong>Class 9: Nudging, Choice Architecture, and Behaviour Change</strong>",
            "topic_description": "Class 9: Nudging, Choice Architecture, and Behaviour Change Dives into how subtle changes in context—\"choice architecture\"—can influence decisions. Reviews the evidence base for nudging and other behaviour-change interventions. Students discuss ethical implications and practise using AI to design or evaluate real-life nudges in areas such as health, education, or environmental policy.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Class 10: Brain Training, Transfer, and the Limits of Expertise</strong><br/><p>Investigates claims around brain training, deliberate practice, and cognitive transfer. Explores how memory, attention, and mental representations develop with training, and whether expertise in one domain can transfer to another. Focuses on evaluating the rigour and reproducibility of studies, encouraging students to critically assess sensational claims.</p></p></div></td>",
            "topic_title": "<strong>Class 10: Brain Training, Transfer, and the Limits of Expertise</strong>",
            "topic_description": "Class 10: Brain Training, Transfer, and the Limits of Expertise Investigates claims around brain training, deliberate practice, and cognitive transfer. Explores how memory, attention, and mental representations develop with training, and whether expertise in one domain can transfer to another. Focuses on evaluating the rigour and reproducibility of studies, encouraging students to critically assess sensational claims.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Class 11: Fact vs. Fiction: Misinformation and Cognitive Resilience</strong><br/><p>Focuses on cognitive strategies to detect and resist misinformation in everyday life. Discusses confirmation bias, motivated reasoning, and the distinction between evidence-based claims and pseudoscience. Demonstrations with AI-generated content highlight how quickly misinformation can spread—and the vigilance needed to maintain critical thinking.</p></p></div></td>",
            "topic_title": "<strong>Class 11: Fact vs. Fiction: Misinformation and Cognitive Resilience</strong>",
            "topic_description": "Class 11: Fact vs. Fiction: Misinformation and Cognitive Resilience Focuses on cognitive strategies to detect and resist misinformation in everyday life. Discusses confirmation bias, motivated reasoning, and the distinction between evidence-based claims and pseudoscience. Demonstrations with AI-generated content highlight how quickly misinformation can spread—and the vigilance needed to maintain critical thinking.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Class 12: Synthesis and Future Directions in Judgement and Decision Making</strong><br/><p>Integrates the concepts covered throughout the course, with a look at emerging areas such as AI-assisted decision making in real-world contexts. Students consolidate their understanding of core JDM theories, reflecting on how these can be applied beyond the classroom. This class also examines ongoing challenges in the field, including reproducibility and open science initiatives.</p></p></div></td>",
            "topic_title": "<strong>Class 12: Synthesis and Future Directions in Judgement and Decision Making</strong>",
            "topic_description": "Class 12: Synthesis and Future Directions in Judgement and Decision Making Integrates the concepts covered throughout the course, with a look at emerging areas such as AI-assisted decision making in real-world contexts. Students consolidate their understanding of core JDM theories, reflecting on how these can be applied beyond the classroom. This class also examines ongoing challenges in the field, including reproducibility and open science initiatives.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Class 13: High-Stakes Decision Making</strong><br/><p>Concludes the course by exploring how JDM research can inform decisions with significant real-world consequences—from medical diagnostics and legal judgements to large-scale corporate or governmental strategies. Students synthesise course concepts to evaluate risk management, mitigating cognitive biases, and adapting to pressure in critical scenarios. This final class encourages them to translate their newly honed insights into high-stakes professional and personal settings.</p></p></div></td>",
            "topic_title": "<strong>Class 13: High-Stakes Decision Making</strong>",
            "topic_description": "Class 13: High-Stakes Decision Making Concludes the course by exploring how JDM research can inform decisions with significant real-world consequences—from medical diagnostics and legal judgements to large-scale corporate or governmental strategies. Students synthesise course concepts to evaluate risk management, mitigating cognitive biases, and adapting to pressure in critical scenarios. This final class encourages them to translate their newly honed insights into high-stakes professional and personal settings.",
            "learning_outcomes": []
        }
    ]
}