{
    "course_title": "Practicum 3 in Art Therapy",
    "study_period": "Sem 1 2025",
    "location": "Herston",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/PXMH7109-20511-7520",
    "full_course_code": "PXMH7109-20511-7520",
    "course_code": "PXMH7109",
    "class_code": "20511",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Under general supervision, undertake an assessment for suitability for art therapy in an appropriate practice setting."
        },
        {
            "number": "LO2.",
            "description": "Under general supervision, develop, record and implement an art therapy treatment plan; monitor progress and adjust the plan if required. Work may be done face to face or online."
        },
        {
            "number": "LO3.",
            "description": "Under general supervision, communicate with other professionals and/or family members involved in treatment or care of clients receiving art therapy. This may be carried out face to face and/or online."
        },
        {
            "number": "LO4.",
            "description": "Provide mental health services that take into account the specific needs and/or values and perspectives of cultural minorities."
        },
        {
            "number": "LO5.",
            "description": "Make routine use of process and/or outcome measurement in provision of mental health services."
        },
        {
            "number": "LO6.",
            "description": "Demonstrate the use art therapy interventions as a way of deepening clinical awareness and understanding of responses to clinical situations"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Practicum",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Performance Hurdle </dd>",
            "due_date": "<dd><p> 24/02/2025 - 9/06/2025</p>\n<p>\n</p><p>17:00 (AEST)</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Activity/ Performance",
            "category": "Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You will undertake 200 hours in a work environment that provides the opportunity to work with people seeking help for concerns that may include mental health problems. You will have a placement supervisor and are required to engage in at least 10 hours of supervision with the on-site supervisor, in addition you will participate in weekly university supervision classes. The practicum provides an opportunity for art therapy students to develop specific art therapy clinical skills in treatment settings. You will focus on evidence based-practice, assessment, interventions, and treatment planning and ensure that the work takes place in an effective and sensitive manner that builds therapeutic alliances. Refer to the Learning Activities section for more detail.</p>\n<p>To complete the practicum successfully, all of the following requirements must be met.</p>\n<ol>\n<li>Undertake the required practicum in an appropriate setting that provides the opportunity to work with people seeking help for concerns that may include mental health problems. (If you have any concerns about the appropriateness of your workplace or placement setting, contact the course coordinator to discuss. Any alternative plan to meet the learning objectives of the course will need the permission of the course coordinator.)</li>\n<li>Provide a signed placement contract.</li>\n<li>Provide accurate logs, appropriately verified, that demonstrate minimum 200 hours of work including 50 hours of direct practice with clients.</li>\n<li>Provide appropriate evidence of a minimum of 10 hours of direct supervision and appropriate participation in weekly university group supervision.</li>\n<li>Provide a signed mid-placement and end of placement report. –The final report rates achievement in relation to each learning objective. You will attain and pass this placement when these have been assessed as Fully Achieved on the Final End of Semester Evaluation Report. Mostly-Fully Achieved is relevant where placements have limited access/opportunity to offer in depth learning in a maximum of one of the criteria</li>\n</ol>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission requirements are described in the Placement Booklet and Learning Activities.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Reflective Journal",
            "special_indicators": [],
            "weighting": "<dd>50% 10 posts 300/400 words each </dd>",
            "due_date": "<dd><p> 27/02/2025 - 9/06/2025</p>\n<p>\n</p><p>17:00 (AEST)</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You are required to complete a weekly journal of self-reflection, related to field placement experiences. You are to upload you written and visual reflections on the day prior to the weekly supervision class for the preceding week on placement. This is a self-evaluation process - a personal journey of learning and deepening awareness. You will use references to deepen your understanding or to support your experiences. The marking is accorded to how well you have taken the opportunity to reflect on your learning and experiences throughout the semester.</p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p>1. You have engaged in weekly self-reflection through a minimum of 10 written and visual reflective journal entries (300-400 words each) with supporting references and visual/art-based reflection. The journal entries are accessible, comprehensible and use a consistent referencing style.</p>\n<p>2. Journal entries are focused on learnings, experiences and reflection relating to working in mental health care and the use of art therapy. Journal entries use references and literature to deepen understanding and/or support experiences.</p>\n<p>3. You are able to discuss your feelings, thoughts, behaviours, actions, knowledge and skills in the role of an emerging Art Therapist and critically reflect on your professional use of self.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The online journal is available via the <a href=\"https://learn.uq.edu.au/ultra/course\">Learn.UQ (Blackboard)</a> site - Assessment</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Case Report",
            "special_indicators": [],
            "weighting": "<dd>50% 3000 words </dd>",
            "due_date": "<dd><p> 19/05/2025</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>A written de-identified case report (3000 words) that presents a vivid portrait of your work with a client, family or treatment group in a Mental Health or School or Non-Government Organisation placement setting. It should describe the assessment, formulation and treatment planning, the process of the work you have done and your understanding of the outcome or current state of the intervention. This is a formal report using a format that is appropriate to the work environment. It should demonstrate competence in assessment, formulation, collaborative treatment planning, the interventions conducted, including art therapy intervention. The report makes recommendations as to appropriate art therapy interventions and evidence-based treatments that are relevant and clinically appropriate for the client and or presenting situation/environment. Permission to use client artwork is required.</p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p>1. A formal case report that describes the context of the work, a summary of the client story and presenting concerns, assessment, formulation, provision or confirmed diagnosis, the treatment plan/hopes, and the interventions conducted by yourself and others with the client. Where relevant, the student can provide measurement of treatment effect and outcomes using approved assessment and outcome data and client feedback.</p>\n<p>2. You will demonstrate assessment and treatment planning skills and makes clear descriptions of or recommendation regarding interventions. You will discuss art therapy interventions that may be relevant to client/s presentation. You will demonstrate problem solving skills for challenges that arose in the client work. </p>\n<p>3. You will demonstrate that they have incorporated the client story, development, culture and identity into their formulation, treatment planning and interventions. </p>\n<p>4. Report is well written, formatted and referenced. It includes diagrams/tables &amp; visual images. The report demonstrates ethical practices using appropriate language and terminology suitable to practice environment.  </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submitted via Turnitin on the <a href=\"https://learn.uq.edu.au/ultra/course\">Learn.UQ (Blackboard)</a> site</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Practicum:</strong><br/><p> You will undertake 200 hours of mental health art therapy practice consisting of a minimum of 50 hours of direct client work and 10 hours supervision with onsite supervisor.</p>\n<ul>\n<li>Placement Agreement between UQ &amp; Placement site: completed prior to placement commencing.</li>\n<li>Placement Contract: to be signed on or before the first day of placement scanned (photographs not accepted) and emailed to the course coordinator (local), lecturer and course coordinator (remote).</li>\n<li>Individual On-site Supervision: You will meet with an on-site supervisor for a minimum of 10 hours during the practicum. For each 20 hours you spend at placement, the on-site supervisor will provide a minimum of one hour of supervision to you. The purpose of supervision is for practice reflection, the use of self and therapeutic skill/knowledge, to utilise the expertise of the supervisor, to address the placement learning objectives and to review progress in relation to achievement of these objectives.</li>\n<li>Mid &amp; End of Semester Evaluation Reports: completed and emailed to your lecturer.</li>\n<li>Evaluation Meeting: mid and possibly end of semester meeting (phone call, Zoom or face-to-face) with on-site supervisor and your lecturer/s (minimum of one meeting).</li>\n<li>Student Logs: you maintain an up-to-date log of all hours conducted on or relevant to placement.</li>\n<li>You need to fill out both a Non-Client Contact and Client-Contact Log.</li>\n<li>Logs must be typed in Word or Excel format.</li>\n<li>Logs are required to be reviewed by the on-site supervisor &amp; lecturer.</li>\n<li>Logs are required to be emailed to lecturer mid-semester and end-semester.</li>\n</ul>\n<p>There are circumstances where your placement may begin earlier and/or finish later than dates listed in Assessment Section; this must be arranged with course coordinator.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Practicum:</strong>",
            "topic_description": "Practicum: You will undertake 200 hours of mental health art therapy practice consisting of a minimum of 50 hours of direct client work and 10 hours supervision with onsite supervisor. Placement Agreement between UQ & Placement site: completed prior to placement commencing. Placement Contract: to be signed on or before the first day of placement scanned (photographs not accepted) and emailed to the course coordinator (local), lecturer and course coordinator (remote). Individual On-site Supervision: You will meet with an on-site supervisor for a minimum of 10 hours during the practicum. For each 20 hours you spend at placement, the on-site supervisor will provide a minimum of one hour of supervision to you. The purpose of supervision is for practice reflection, the use of self and therapeutic skill/knowledge, to utilise the expertise of the supervisor, to address the placement learning objectives and to review progress in relation to achievement of these objectives. Mid & End of Semester Evaluation Reports: completed and emailed to your lecturer. Evaluation Meeting: mid and possibly end of semester meeting (phone call, Zoom or face-to-face) with on-site supervisor and your lecturer/s (minimum of one meeting). Student Logs: you maintain an up-to-date log of all hours conducted on or relevant to placement. You need to fill out both a Non-Client Contact and Client-Contact Log. Logs must be typed in Word or Excel format. Logs are required to be reviewed by the on-site supervisor & lecturer. Logs are required to be emailed to lecturer mid-semester and end-semester. There are circumstances where your placement may begin earlier and/or finish later than dates listed in Assessment Section; this must be arranged with course coordinator.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Visual &amp; Written Journal</strong><br/><p>You are required to complete and submit online visual and written reflective journal entries related to placement experiences. (See Assessment section for details)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Visual &amp; Written Journal</strong>",
            "topic_description": "Visual & Written Journal You are required to complete and submit online visual and written reflective journal entries related to placement experiences. (See Assessment section for details)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Art Therapy Supervision Group</strong><br><p>You will attend a weekly university supervision group with an experienced art therapist. You will explore and reflect on practicum experience by engaging in discussion and art making.</p>\n<p>There are circumstances where your placements may begin and/or finish later than dates listed; in these circumstances the lecturer and course coordinator will make arrangements to offer student/s supervision.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Art Therapy Supervision Group</strong>",
            "topic_description": "Art Therapy Supervision Group You will attend a weekly university supervision group with an experienced art therapist. You will explore and reflect on practicum experience by engaging in discussion and art making. There are circumstances where your placements may begin and/or finish later than dates listed; in these circumstances the lecturer and course coordinator will make arrangements to offer student/s supervision.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Residential Workshops</strong><br/><p>Compulsory for you to attend in-person. The workshops related directly to this course focus on attachment and reflective functioning, expressive therapies continuum and experiential art making. They are all designed to support and strengthen knowledge, reflective capacity, peer collaboration and enhance placement and professional experiences.</p>\n<p>5/3/25 9am - 5pm - Expressive Therapies Continuum</p>\n<p>6/3/25 9am - 5pm - Attachment the Clinician's Style and Reflective Functioning</p>\n<p>8/3/25 9:30am - 12:30pm - PXMH7107 &amp; PXMH7109 Welcome and Experiential Art Making + Sharing of Wisdom from Graduate/s and Current Students</p></p><p><strong>Learning outcomes:</strong> L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Residential Workshops</strong>",
            "topic_description": "Residential Workshops Compulsory for you to attend in-person. The workshops related directly to this course focus on attachment and reflective functioning, expressive therapies continuum and experiential art making. They are all designed to support and strengthen knowledge, reflective capacity, peer collaboration and enhance placement and professional experiences. 5/3/25 9am - 5pm - Expressive Therapies Continuum 6/3/25 9am - 5pm - Attachment the Clinician's Style and Reflective Functioning 8/3/25 9:30am - 12:30pm - PXMH7107 & PXMH7109 Welcome and Experiential Art Making + Sharing of Wisdom from Graduate/s and Current Students",
            "learning_outcomes": [
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Case-based learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Case Report</strong><br/><p>You will complete de-identified case study (see Assessment Section for further details).</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Case Report</strong>",
            "topic_description": "Case Report You will complete de-identified case study (see Assessment Section for further details).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        }
    ]
}