{
    "course_title": "Ethics and Mental Health Practice",
    "study_period": "Sem 1 2025",
    "location": "Herston",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/PXMH7102-20500-7520",
    "full_course_code": "PXMH7102-20500-7520",
    "course_code": "PXMH7102",
    "class_code": "20500",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand the challenges and opportunities of working alongside consumers and carers."
        },
        {
            "number": "LO2.",
            "description": "Understand the role of ethics in maintaining a safe and effective therapeutic relationship:"
        },
        {
            "number": "LO3.",
            "description": "Understand the structure of mental health professions in Australia and have a critical understanding of the role and process of professional registration and discipline procedures."
        },
        {
            "number": "LO4.",
            "description": "Recognise the complexity of and understand the skills needed for working in the broad range of mental health and other clinical services."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "The Consumer Experience - Report",
            "special_indicators": [],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 24/03/2025 5:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You should interview a consumer or carer of mental health services or art therapy, psychotherapy or counselling, in which the person’s experience of both good (respectful, valuable, effective) and poor (disrespectful, not valuable, ineffective) practice are considered. The report should include a reflection by you on your experience of conducting the interview and the implications for your own practice. 1500 words.</p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p>Students will be marked according to a Rubrics available on the PXMH7102 course on <a href=\"https://learn.uq.edu.au/ultra/course\">Learn.UQ (Blackboard)</a>.</p>\n<p>Key marking criteria includes:</p>\n<p>1. Report has an introduction that demonstrates that the student has identified an appropriate person to interview and demonstrates that they have appropriately negotiated the person's informed agreement to be interviewed for this report. (approximately 200 words)</p>\n<p>2. Report demonstrates that, in a sensitive and respectful manner, the student is able to elicit from the interviewee information and opinion about his or her experience of mental health service and that this material clearly forms the basis of report. (approximately 800 words)</p>\n<p>3. Report includes a considered reflection by the student that demonstrates that the student can articulate their own experience of interviewing the person and turning that material into a report as well as demonstrating capacity to reflect on their own, or prospective, mental health practice. (approximately 500 words)</p>\n<p>4. Report is written in a structured, well written manner appropriate to the task, uses appropriate referencing where the intellectual work of others is used and has a maximum of 3 references. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submitted through Turnitin on the <a href=\"https://learn.uq.edu.au/ultra/course\">Learn.UQ (Blackboard)</a> site.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>Please refer to the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184#:~:text=of%20submitted%20work).-,Penalties%20for%20Late%20Submission,-(48)\">UQ policy</a> on late submission.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Investigation of an Ethical Dilemma - Case Study",
            "special_indicators": [],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 28/04/2025 5:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Case study that explores an ethical dilemma that has arisen in the students’ mental health practice. The report will begin with a description of the case and their relevant network (e.g., stake holders, MH team, NGO, school community, friends, family); the mental health presentation and the clinical work that has occurred thus far. Next, students will identify and detail an ethical dilemma that arose during the clinical work. Any organisational, legal, and ethical aspects of the dilemma will be described, in conjunction with relevant literature. Students will create and apply an ethical decision-making model, informed by research and self-reflection. The case report will close with the outcomes of this ethical decision-making model and practice recommendations for managing the ethical dilemma.</p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p>All students will be marked according to a Rubrics which is available on PXMH7102 course on <a href=\"https://learn.uq.edu.au/ultra/course\">Learn.UQ (Blackboard)</a>. Key criteria include:</p>\n<p>1. A description of the case which identifies the client (a person, family or group) and their network of stakeholders. A summary of the mental health presentation which includes key symptoms, historical factors, and current presentation. An outline of mental health engagement and work that was undertaken with the client, including consideration of ethical mental health care. 15%</p>\n<p>2. Identify and detail an ethical dilemma that arose during the clinical work. Consider the implications of this dilemma in conjunction with relevant literature. 10%</p>\n<p>3. The student will research and choose an ethical decision making model that best suits their mental health practice. The key steps in the model will be explained and applied to the identified ethical dilemma. The model will foster critical reflection whilst maintaining a consumer focus. 10%</p>\n<p>4. The outcomes of the decision making model will be detailed including recommendations for ethical mental health practice. 10%</p>\n<p>5. The report is well structures (i.e., headings can be used to define this) and uses clear and grammatically sound language, including correct spelling and a consistent referencing style (a maximum of 6 references). The essay is written within a 3000 word limit and demonstrates the students own original work.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submitted through Turnitin on the <a href=\"https://learn.uq.edu.au/ultra/course\">Learn.UQ (Blackboard)</a> site.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>Please refer to the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184#:~:text=of%20submitted%20work).-,Penalties%20for%20Late%20Submission,-(48)\">UQ policy</a> on late submission.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Ethical Safeguards - Presentation",
            "special_indicators": [],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 12/05/2025 - 30/05/2025</p>\n<p>\n</p><p>Tutors will schedule your presentation during class time.</p></dd>",
            "learning_objectives": "L01, L02, L04",
            "mode": "Activity/ Performance, Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Ethical mental health care includes developing preventative measures for potential ethical dilemmas. Students will develop clinical guidelines and a brief policy relevant to their area of mental health practice that intends on preventing the emergence of ethical dilemmas. The policy will be the students original ideas, but also be guided relevant research. Students will present their policy to their colleagues in a brief 10-minute presentation and also highlight guidelines and potential caveats to the application of the policy. A 5-minute discussion time will explore the practice implications.</p>\n<p>Some examples of Ideas include (but are not limited to):</p>\n<p>-      Email use with adolescent clients</p>\n<p>-      Social Media policy for clinicians in private practice (i.e., website, LinkedIn, Facebook)</p>\n<p>-      Consent to treatment for clients presenting with drug and alcohol issues, but are ambivalent to change</p>\n<p>-      Communication policy with clients when they are struggling with suicidal presentations</p>\n<p>-      Managing confidentiality with primary school children in a school setting</p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p>Students will be marked according to a Rubrics which is available on the PXMH7102 course on <a href=\"https://learn.uq.edu.au/ultra/course\">Learn.UQ (Blackboard)</a>. Key criteria include:</p>\n<p>1. A brief policy is developed and presented with the purpose of preventing an ethical dilemma found in the students mental health practice. The student demonstrate critical reflection of the policy by providing guidelines for the use of the policy and potential caveats (i.e., problems that may occur when implementing the policy) to its application. 10%</p>\n<p>2. The presentation includes a review of the ethical, legal, and organisational implications of the policy by examining literature from scientific research and professional resources. 10%</p>\n<p>3. Quality of communication: The presentation is engaging and designed to persuade colleagues to consider this aspect of ethical mental health care. There are presentation materials for classmates, that can be uploaded (i.e., tip-sheet; power-point). The presentation is within the 10-minute time limit (and 5-minute discussion time). The presenters can engage with their colleagues on the materials. 5%</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>Please refer to the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184#:~:text=of%20submitted%20work).-,Penalties%20for%20Late%20Submission,-(48)\">UQ policy</a> on late submission.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction to PXMH7102</strong><br/><p>You will be oriented to the learning activities of PXMH7102, including relevant resources, assessment and expectations. <br/>You will have the opportunity to meet your tutor and fellow students and reflect on the following questions:<br/>1. Why am I studying a degree in Mental Health?<br/>2. What are the professional, ethical, personal questions I want addressed?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Introduction to PXMH7102</strong>",
            "topic_description": "Introduction to PXMH7102 You will be oriented to the learning activities of PXMH7102, including relevant resources, assessment and expectations. You will have the opportunity to meet your tutor and fellow students and reflect on the following questions: 1. Why am I studying a degree in Mental Health? 2. What are the professional, ethical, personal questions I want addressed?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ethical Care: Developing a Consumer Focus</strong><br><p>You will explore what constitutes ethical care through the lens of the consumer. You will critically reflect on the mental health system in Australia and whether it delivers consumer focused care. Guidance on the first assessment piece will be provided.</p></br></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Ethical Care: Developing a Consumer Focus</strong>",
            "topic_description": "Ethical Care: Developing a Consumer Focus You will explore what constitutes ethical care through the lens of the consumer. You will critically reflect on the mental health system in Australia and whether it delivers consumer focused care. Guidance on the first assessment piece will be provided.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Student Orientation</strong><br><p>First year students are encouraged to attend this orientation which will provide guidance on successful study at UQ.</p></br></p></div></td>",
            "topic_title": "<strong>Student Orientation</strong>",
            "topic_description": "Student Orientation First year students are encouraged to attend this orientation which will provide guidance on successful study at UQ.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ethical Violations: Ethics Tribunal</strong><br><p>You will engage in an ethical tribunal which will highlight key ethical issues that need to be considered and the impact of ethical violations. <br/>You should develop an understanding of: <br/>- How are professionals involved in mental health and psychotherapy in Australia trained, structured and regulated?<br/>- What is the role and process of professional registration and discipline procedures? What are the outcomes of ethics tribunals?</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Ethical Violations: Ethics Tribunal</strong>",
            "topic_description": "Ethical Violations: Ethics Tribunal You will engage in an ethical tribunal which will highlight key ethical issues that need to be considered and the impact of ethical violations. You should develop an understanding of: - How are professionals involved in mental health and psychotherapy in Australia trained, structured and regulated? - What is the role and process of professional registration and discipline procedures? What are the outcomes of ethics tribunals?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ethical Practice with Priority Populations</strong><br><p>You will explore Ethical Mental Health Practice using an Indigenous Australian Lens.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Ethical Practice with Priority Populations</strong>",
            "topic_description": "Ethical Practice with Priority Populations You will explore Ethical Mental Health Practice using an Indigenous Australian Lens.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ethical Principles and Professionalism</strong><br><p>You will develop understanding of: </p>\n<ul>\n<li>ethical principles underlying mental health practice and professions</li>\n<li>common characteristics of ethics codes for professions in mental health and psychotherapy</li>\n<li>the landscape of mental health care in Australia and critically analyse whether mental health services have the capacity to deliver ethical care</li>\n<li>personal values or other factors that can be integrated into your ethical mental health practice.</li>\n</ul></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Ethical Principles and Professionalism</strong>",
            "topic_description": "Ethical Principles and Professionalism You will develop understanding of: ethical principles underlying mental health practice and professions common characteristics of ethics codes for professions in mental health and psychotherapy the landscape of mental health care in Australia and critically analyse whether mental health services have the capacity to deliver ethical care personal values or other factors that can be integrated into your ethical mental health practice.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ethical Decision Making: Developing a Framework</strong><br><p>You will have the opportunity to:<br/>-to identify and define ethical dilemmas <br/>-develop a strategy of response to ethical dilemmas <br/>-Account for societal, legal, organisational and personal influences on ethical decision making</p></br></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Ethical Decision Making: Developing a Framework</strong>",
            "topic_description": "Ethical Decision Making: Developing a Framework You will have the opportunity to: -to identify and define ethical dilemmas -develop a strategy of response to ethical dilemmas -Account for societal, legal, organisational and personal influences on ethical decision making",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ethical Practice: The Psychotherapy Relationship</strong><br><p>You will explore the psychotherapy relationship, how to define it and pertinent ethical issues such as, dual relationships, boundary crossings and violations.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Ethical Practice: The Psychotherapy Relationship</strong>",
            "topic_description": "Ethical Practice: The Psychotherapy Relationship You will explore the psychotherapy relationship, how to define it and pertinent ethical issues such as, dual relationships, boundary crossings and violations.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ethical Practice: Client Rights</strong><br><p>You will explore how to maintain client rights (such as client dignity and autonomy) during the therapeutic process. The specific ethical issues of confidentiality and privacy, and informed consent and decisional capacity will be examined.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Ethical Practice: Client Rights</strong>",
            "topic_description": "Ethical Practice: Client Rights You will explore how to maintain client rights (such as client dignity and autonomy) during the therapeutic process. The specific ethical issues of confidentiality and privacy, and informed consent and decisional capacity will be examined.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ethical Practice: High Risk Situations</strong><br><p>You will be able to identify high risk situations that can emerge in mental health practice. The ethical challenges that arise in this context will be explored including: duty to care, duty to warn, using power ethically.</p></br></p><p><strong>Learning outcomes:</strong> L02, L04</p></div></td>",
            "topic_title": "<strong>Ethical Practice: High Risk Situations</strong>",
            "topic_description": "Ethical Practice: High Risk Situations You will be able to identify high risk situations that can emerge in mental health practice. The ethical challenges that arise in this context will be explored including: duty to care, duty to warn, using power ethically.",
            "learning_outcomes": [
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ethical Practice: Professional Integrity</strong><br/><p>Understand how to practice within the bounds of competence, and the importance of therapist self care and determining fitness to practice.</p></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Ethical Practice: Professional Integrity</strong>",
            "topic_description": "Ethical Practice: Professional Integrity Understand how to practice within the bounds of competence, and the importance of therapist self care and determining fitness to practice.",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ethical Practice: Emerging Issues</strong><br/><p>The evolving practice of psychotherapy and art therapy will be explored and the unique emerging ethical issues that technology presents.</p></p><p><strong>Learning outcomes:</strong> L04</p></div></td>",
            "topic_title": "<strong>Ethical Practice: Emerging Issues</strong>",
            "topic_description": "Ethical Practice: Emerging Issues The evolving practice of psychotherapy and art therapy will be explored and the unique emerging ethical issues that technology presents.",
            "learning_outcomes": [
                "L04"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 11 To Week 13(12 May - 01 Jun)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Presentations: Ethical Safeguards</strong><br><p>You will have the opportunity to learn from their colleagues. Specific learning will be focused on:<br/>-recognising the complexity and skills required for working in diverse mental health settings<br/>-identifying pertinent ethical issues in specific mental health settings<br/>- developing an understanding of a range of mental health practices designed to prevent the emergence of ethical dilemmas.</p></br></p><p><strong>Learning outcomes:</strong> L02, L04</p></div></td>",
            "topic_title": "<strong>Presentations: Ethical Safeguards</strong>",
            "topic_description": "Presentations: Ethical Safeguards You will have the opportunity to learn from their colleagues. Specific learning will be focused on: -recognising the complexity and skills required for working in diverse mental health settings -identifying pertinent ethical issues in specific mental health settings - developing an understanding of a range of mental health practices designed to prevent the emergence of ethical dilemmas.",
            "learning_outcomes": [
                "L02",
                "L04"
            ]
        }
    ]
}