{
    "course_title": "Practicum 1 in Art Therapy",
    "study_period": "Sem 1 2025",
    "location": "Herston",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/PXMH7107-20501-7520",
    "full_course_code": "PXMH7107-20501-7520",
    "course_code": "PXMH7107",
    "class_code": "20501",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate capacity to provide mental health services, at industry appropriate levels, in collaboration with others."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate capacity to use industry standard assessment, formulation and treatment planning."
        },
        {
            "number": "LO3.",
            "description": "Use principles of evidence based practice in the design and implementation of mental health services."
        },
        {
            "number": "LO4.",
            "description": "Provide mental health services that take into account the specific needs and/ or values and perspectives of cultural minorities."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate the use art making and visual imagery as a way of deepening clinical awareness and understanding of responses to clinical situations."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Practicum",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Performance Hurdle </dd>",
            "due_date": "<dd><p> 24/02/2025 - 30/05/2025</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Activity/ Performance",
            "category": "Practical/ Demonstration",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You should be engaged in work environment that provides the opportunity to work with people seeking help for concerns that may include mental health problems. In this practicum the major focus will be on ensuring that you provide, in a form appropriate to the workplace, a mental health assessment, formulation and treatment plan as well as ensuring that the work takes place in an effective and sensitive manner that builds therapeutic alliance. You will have 150 hours of work in that environment that should include at least 37.5 hours of direct work with clients. You will have a work-based supervisor who will meet with you for at least 7.5 hours during the semester. You will meet in weekly supervision classes with a lecturer and fellow students.</p>\n<p>If you have any concerns about the appropriateness of your workplace, you should contact the lecturer and course coordinator to discuss.</p>\n<p>Any alternative plan to meet the learning objectives of the course will need the permission of the course coordinator.</p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<ol>\n<li>Student has a practicum in an appropriate workplace that provides the opportunity to work with people seeking help for concerns that may include mental health problems. That placement or an alternative arranged with the course coordinator, provides the opportunities to meet the learning objectives of the course.</li>\n<li>Student provides off site supervisor a signed placement contract</li>\n<li>Student provides logs, appropriately verified, that demonstrate minimum 150 hours of work including 37.5 hours of direct practice and an end of placement evaluation. A student attains and passes this placement when they have been assessed as Fully Achieved on the Final End of Semester Evaluation Report. Mostly-Fully Achieved is relevant where placements have limited access/opportunity to offer in depth learning in a maximum of one of the criteria.</li>\n<li>Student provides a signed mid-placement and end of placement report to offsite supervisor</li>\n<li>Student provides appropriate evidence of 7.5 hours of direct supervision of practice and appropriate participation in weekly group supervision - 1 hour supervision for every 20 hours of practice </li>\n</ol>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>Please refer to the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184#:~:text=of%20submitted%20work).-,Penalties%20for%20Late%20Submission,-(48)\">UQ policy</a> on late submission.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Visual and Written Reflective Journal",
            "special_indicators": [],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 24/02/2025 - 30/05/2025</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You are to upload a weekly Reflective and Visual Journal to demonstrate the development of self-reflective practice, the use of visual imagery as a tool for self-reflection, the ability to use when appropriate art making in order to explore complex issues involved in the interactions between trainee and or the client-agency.</p>\n<p>You should make at least 10 written entries in an online journal, able to be accessed only by student and course staff on Learn.UQ (Blackboard), that reflect on your experience of working in a practice environment and in learning about the practice of art therapy. These entries should be regular, uploaded weekly, and be an appropriate combination of personal, practice literature and research informed reflection where relevant. The journal should be readable and able to be understood by the assessor. Where the written ideas of others are used they should be referenced. Visual and reflective art is to accompany the written reflections.</p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<ol>\n<li>Student to maintain a weekly reflective journal consisting of both written and visual/art based reflection. </li>\n<li>In combination, the entries demonstrate that the student has used reflection on personal experience, practice experience, client work, organisational/workplace experiences and published literature to develop their capacity to work in a mental health workplace and make effective and sensitive therapeutic relationships with clients.</li>\n<li>The Journal contains at least 10 entries that have been written approximately weekly. Each entry is required to be the length of 300-400 words. The journal entries are accessible and able to be understood. Appropriate referencing is used with consistent referencing style.</li>\n<li>Demonstrates an emerging understanding of the use of personal art processes for professional development as an art therapist.</li>\n</ol>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The online journal is available via the <a href=\"https://learn.uq.edu.au/ultra/course\">Learn.UQ (Blackboard)</a> site - Assessment</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>Please refer to the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184#:~:text=of%20submitted%20work).-,Penalties%20for%20Late%20Submission,-(48)\">UQ policy</a> on late submission.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Art Therapy Case Study",
            "special_indicators": [],
            "weighting": "<dd>50% 3000 Words </dd>",
            "due_date": "<dd><p> 16/05/2025 12:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>A Case Study report presents a vivid portrait of your work with a client, family or treatment group in a Mental Health (MH) setting. It should outline your assessment approach, formulation (diagnosis where relevant), describe the findings of your assessment, and how they inform your treatment planning, describe the process of the work you have done together with the client/group and your understanding of the outcome or current state of the work. This is a formal report using a report format that is appropriate to your work environment and additionally follows an appropriate assessment template/format. The case study should include at minimum a mental state examination, diagnostic explanation (formulation and presentation, explain if or why client does not meet the criteria for diagnosis), a clear formulation of key client concerns and a treatment plan that describes the client needs, appropriate treatment goals and art therapy interventions. It should demonstrate developing competency in assessment, formulation, collaborative treatment planning and, as appropriate, art therapy intervention throughout the assessment phase. Permission to share client artwork is required, where permission is not granted, response art pieces by the student are recommended. A deidentified version of the client case is required. 3000 words 50%.</p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<ol>\n<li>Student has submitted a de-identified Case Study report that describes the clinical work with a client, family or group with whom the student has worked. It is 3,000 words (+/- 10%) and is in formal report, appropriate to your work environment and following appropriate assessment, diagnostic, and treatment planning templates/formats/frameworks. APA7 format is required. </li>\n<li>As appropriate, the report describes the MH assessment, formulation, goal setting and treatment planning that was conducted in collaboration with the client over a minimum of two-three therapy sessions. </li>\n<li>The report describes the process of the work that has been done together with the client/group and your understanding of the outcome or current state of the work. Art therapy assessment interventions and/or treatment planning is required. </li>\n<li>The report demonstrates developing competency in assessment, use of art based assessment methods, formulation (and diagnostic consideration), collaborative treatment planning, and additionally proposes an art therapy treatment model or plan if the person were to engage in the modality following the assessment phase. </li>\n<li>The report is to contain appropriate art therapy consent forms for any imagery included in the case material or response art by the student where applicable, clear images of artwork and accurate descriptions of artwork discussed. </li>\n</ol>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submitted via Turnitin on the <a href=\"https://learn.uq.edu.au/ultra/course\">Learn.UQ (Blackboard)</a> site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>Please refer to the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184#:~:text=of%20submitted%20work).-,Penalties%20for%20Late%20Submission,-(48)\">UQ policy</a> on late submission.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Team Based Learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Art Therapy Supervision Group</strong><br/><p>Weekly group supervision and learning, you will attend university supervision group with an experienced art therapist.</p>\n<p>There are circumstances where the student placements may finish later than dates listed; in these circumstances the lecturer and course coordinator will make arrangements to offer student/s supervision.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Art Therapy Supervision Group</strong>",
            "topic_description": "Art Therapy Supervision Group Weekly group supervision and learning, you will attend university supervision group with an experienced art therapist. There are circumstances where the student placements may finish later than dates listed; in these circumstances the lecturer and course coordinator will make arrangements to offer student/s supervision.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Fieldwork",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Art Therapy Placement</strong><br/><p>You will undertake 150 hours of mental health art therapy practice consisting of a minimum of 37.5 hours of direct client work and 7.5 hours supervision with onsite supervisor. Attend Placement 2 days a week.</p>\n<p>Placement Agreement between UQ &amp; Placement site: completed prior to placement commencing.</p>\n<p>Placement Contract: to be signed on or before the first day of placement and scanned (photographs not accepted) and emailed to lecturer &amp; course coordinator.</p>\n<p>Mid &amp; End of Semester Evaluation Reports: completed scanned (photographs not accepted) and emailed to lecturer &amp; course coordinator.</p>\n<p>Evaluation Meeting: mid and possibly end of semester phone call, Zoom or face-to-face meeting/s with on-site supervisor, student, and lecturer/course coordinator (minimum of one meeting).</p>\n<p>Student Logs: Students maintain an up-to-date log of all hours conducted on or relevant to placement. Students need to fill out both a Non-Client Contact and Client-Contact Log. Logs must be typed in Word or Excel format. Logs are required to be reviewed by the on-site &amp; university supervisor and emailed to lecturer and course coordinator.</p>\n<p>There are circumstances where the student placements may finish later than dates listed; this must be arranged with course coordinator.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Art Therapy Placement</strong>",
            "topic_description": "Art Therapy Placement You will undertake 150 hours of mental health art therapy practice consisting of a minimum of 37.5 hours of direct client work and 7.5 hours supervision with onsite supervisor. Attend Placement 2 days a week. Placement Agreement between UQ & Placement site: completed prior to placement commencing. Placement Contract: to be signed on or before the first day of placement and scanned (photographs not accepted) and emailed to lecturer & course coordinator. Mid & End of Semester Evaluation Reports: completed scanned (photographs not accepted) and emailed to lecturer & course coordinator. Evaluation Meeting: mid and possibly end of semester phone call, Zoom or face-to-face meeting/s with on-site supervisor, student, and lecturer/course coordinator (minimum of one meeting). Student Logs: Students maintain an up-to-date log of all hours conducted on or relevant to placement. Students need to fill out both a Non-Client Contact and Client-Contact Log. Logs must be typed in Word or Excel format. Logs are required to be reviewed by the on-site & university supervisor and emailed to lecturer and course coordinator. There are circumstances where the student placements may finish later than dates listed; this must be arranged with course coordinator.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}