{
    "course_title": "Text Analysis and Corpus Linguistics",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SLAT7829-21767-7520",
    "full_course_code": "SLAT7829-21767-7520",
    "course_code": "SLAT7829",
    "class_code": "21767",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Describe and explain how language is used in different contexts"
        },
        {
            "number": "LO2.",
            "description": "Understanding of concepts and methods in text analysis and corpus linguistics"
        },
        {
            "number": "LO3.",
            "description": "Effectively apply the concepts and theories studied in the course to the analysis of language data (texts)"
        },
        {
            "number": "LO4.",
            "description": "Practically apply text analysis and corpus linguistics methods"
        },
        {
            "number": "LO5.",
            "description": "Critically evaluate analyses of language data"
        },
        {
            "number": "LO6.",
            "description": "Identify differences between learners and native speakers of English"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Weekly Study Online Task",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 10/03/2025 1:00 pm</p>\n<p> 17/03/2025 1:00 pm</p>\n<p> 24/03/2025 1:00 pm</p>\n<p> 31/03/2025 1:00 pm</p>\n<p> 7/04/2025 1:00 pm</p>\n<p> 14/04/2025 1:00 pm</p>\n<p> 28/04/2025 1:00 pm</p>\n<p> 6/05/2025 1:00 pm</p>\n<p> 12/05/2025 1:00 pm</p>\n<p> 19/05/2025 1:00 pm</p></dd>",
            "learning_objectives": "L01, L02",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Every week from Week 3 to Week 12, there will be an Online Study Task consisting of 10 questions that you need to answer and submit in preparation for that week.</p>\n<p>These tasks are available 7 days before the due date and must be submitted by Monday at 1 pm (or Tuesday if Monday is a public holiday).</p>\n<p>The questions will cover the lecture content and required readings for that week. For example, the Week 3 Online Study Task will be about the Week 3 lecture and readings, and you need to submit it by 1 pm on Monday of Week 3.</p>\n<p>Each Online Study Task is worth 2% of your final grade. You have 60 minutes and one attempt to complete each task.</p>\n<p>After all ten Online Study Tasks are completed, your total study task score will be calculated. Please note that tasks not completed and awarded 0 points are included in the average calculation. The percentage of the maximum achievable points will determine your final grade for this assessment.</p>\n<p>The link to each week's Online Study Task will be available on Blackboard.</p>\n<p><strong>Marking Information</strong></p>\n<p>The weekly Online Study Tasks must be accessed, completed, and submitted via Blackboard.</p>\n<p>Answers will be assessed automatically, and results will be made available to students within the week of submission. Answers to questions will be rated as correct or incorrect. For each correct answer, students will receive 1 point. Each Online Study Task consists of 10 questions, and there are 10 tasks in total, meaning students can earn up to 100 points if they answer all questions correctly. The marks for the Online Study Tasks follow the marking scheme of the School of Language and Cultures.</p>\n<p><strong>Statement on Gen AI &amp; MT</strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The online study tasks have to be submitted weekly from Week 3 at Monday 1 pm via UQ.learn/Blackboard.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Research Project Presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 9/05/2025 4:00 pm</p>\n<p>\n</p><p>Week 10</p></dd>",
            "learning_objectives": "L01, L02, L03, L05",
            "mode": "Activity/ Performance, Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Research Project Presentation carries a weight of 30% in your final grade. This assessment entails the submission of a video presentation outlining your research proposal, centred around corpus analysis. The primary objective is to guide students in structuring and preparing their research projects while providing an opportunity for valuable feedback.</p>\n<p><strong>Submission Format</strong></p>\n<p>Submit a recorded video presentation lasting 10 minutes (the presentation must not be longer than 11 minutes).</p>\n<p><strong>Purpose</strong></p>\n<p>This task is designed to showcase your ability to articulate and present a novel and original research project in the language sciences, utilizing corpus data.</p>\n<p><strong>Video Presentation Structure</strong></p>\n<p>Introduction</p>\n<ul>\n<li>Clearly state your research topic.</li>\n<li>Establish the relevance of your research.</li>\n<li>Provide a succinct outline of your presentation's organization.</li>\n</ul>\n<p>Literature Review</p>\n<ul>\n<li>Present a structured literature review.</li>\n<li>Ensure seamless transitions between themes, points, and sections.</li>\n<li>Demonstrate mastery of relevant theories and concepts, backed by a detailed understanding of previous findings.</li>\n</ul>\n<p>Research Question</p>\n<ul>\n<li>Provide a clear and specific statement of the Research Question.</li>\n<li>Motivate the Research Question based on insights from the literature review.</li>\n</ul>\n<p>Data and Methodology</p>\n<ul>\n<li>Describe the data and method intended for answering the research question.</li>\n<li>Offer detailed information about the research context, data sources, and data analysis.</li>\n</ul>\n<p>Conclusion and Evaluation</p>\n<ul>\n<li>Present a critical evaluation of the proposed study.</li>\n<li>Discuss potential contributions to the relevant field.</li>\n<li>Acknowledge and address any identified limitations.</li>\n</ul>\n<p>References (APA7 format)</p>\n<ul>\n<li>Bibliographic details should be presented in APA 7 citation style. Any sources or citations mentioned in your presentation need to be added in a reference list at the end of your presentation (which should also be formatted according to APA7).</li>\n</ul>\n<p><strong>Important Guidelines</strong></p>\n<ul>\n<li>The entire presentation should be between 9 and a maximum of 11 minutes (recordings must not be longer than 11 minutes).</li>\n<li>Articulate your points clearly, maintaining a balance between conciseness and detail.</li>\n<li>Leverage visual aids if necessary to enhance the presentation's clarity.</li>\n<li>Aim to engage your audience, fostering an understanding of the significance of your proposed research.</li>\n<li>Prepare slides for your presentation and record yourself and the slides (we suggest you use Zoom and share your screen).</li>\n</ul>\n<p>This task serves as a vital step in the preparation of your research project, offering a platform for you to convey the essence of your work effectively. Utilize the provided rubric (accessible via UQ.learn/Blackboard) as a reference for your presentation. Please refer to the rubic (available via UQ.learn/Blackboard) for details.</p>\n<p><strong>Statement on Gen AI &amp; MT</strong></p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Online via Turnitin.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Research Project Write-Up",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 13/06/2025 4:00 pm</p>\n<p>\n</p><p>Exam Week 1 </p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>SLAT7829 Corpus and Text Analysis: Research Project Write-Up</strong></p>\n<p><strong>Overview</strong></p>\n<p>The Research Project Write-Up contributes <strong>50%</strong> to your final grade. This assessment requires you to submit a <strong>written report</strong> detailing your research project focusing on a corpus-based analysis of a topic in <strong>Applied Linguistics. </strong>This research project write-up allows you to apply the knowledge and skills acquired throughout the course. The objective is to demonstrate your ability to design, execute, and document an <strong>original and insightful</strong> corpus-based research study. This assessment serves as a significant milestone in developing your research skills.</p>\n<p><strong>Assessment Criteria</strong></p>\n<p>Your Research Project Write-Up will be evaluated out of <strong>50 points</strong>. Please refer to the <strong>detailed marking criteria</strong> in the <strong>rubric (available via UQ.learn/Blackboard)</strong> for a breakdown of assessment components.</p>\n<p><strong>Submission Guidelines</strong></p>\n<ul>\n<li>Submit a <strong>written report</strong> with a maximum of <strong>2000 words</strong> (excluding references and Appendix).</li>\n<li>Ensure your submission adheres to <strong>APA 7 formatting</strong> for citations and references.</li>\n<li>The report must be written in academic English and it must be structured <strong>logically and coherently</strong>, following the format outlined below.</li>\n</ul>\n<p><strong>Purpose</strong></p>\n<p>This task is designed to assess your ability to conduct <strong>independent and original research</strong> focusing on a corpus-based analysis of a topic in <strong>Applied Linguistics</strong>. You will demonstrate:</p>\n<p>✔ The ability to define a <strong>research problem</strong> and formulate <strong>research questions</strong>.</p>\n<p>✔ A clear understanding of relevant <strong>theories and literature</strong>.</p>\n<p>✔ Competence in <strong>data selection, analysis, and interpretation</strong> using corpus methodologies.</p>\n<p>✔ The capacity to present findings in a <strong>clear, well-structured, and engaging manner</strong>.</p>\n<p><strong>Report Structure</strong></p>\n<p><strong>1. Introduction (What are you doing, and why is it relevant?)</strong></p>\n<ul>\n<li>Clearly define your <strong>research topic</strong>.</li>\n<li>Describe and exemplify the <strong>phenomenon</strong> under investigation that is relevant in Applied Linguistics.</li>\n<li>Justify the <strong>relevance and significance</strong> of your research.</li>\n<li>Provide a <strong>brief outline</strong> of the report structure.</li>\n</ul>\n<p><strong>2. Literature Review (Motivation and Background)</strong></p>\n<ul>\n<li>Present a <strong>structured review</strong> of relevant research.</li>\n<li>Ensure logical and smooth <strong>transitions</strong> between themes.</li>\n<li>Demonstrate mastery of <strong>theories and key concepts</strong>.</li>\n<li>Conclude with well-defined <strong>Research Questions and/or Hypotheses</strong>, motivated by the literature.</li>\n</ul>\n<p><strong>3. Data and Methodology (What data and methods will you use, and why are they appropriate?)</strong></p>\n<ul>\n<li>Describe your <strong>data </strong>(e.g., corpus details, size, mode, compilers). Use <strong>tables</strong> where appropriate to present your data.</li>\n<li>Justify the <strong>methodology</strong>, explaining why it is appropriate for addressing your research questions.</li>\n<li>Explain the <strong>methodology</strong>, including any <strong>software tools</strong> you intend to use.</li>\n<li>Detail the <strong>data processing steps, analytical techniques, and tools/software</strong> used.</li>\n</ul>\n<p><strong>4. Results</strong></p>\n<ul>\n<li>Present the <strong>findings</strong> of your study using <strong>textual descriptions, tables, and visualizations</strong> (charts/graphs) where appropriate.</li>\n<li>Ensure clarity and coherence in presenting analytical outcomes.</li>\n</ul>\n<p><strong>5. Discussion and Conclusion</strong></p>\n<ul>\n<li>Reflect on how your study <strong>addresses the research questions</strong>.</li>\n<li>Compare and contrast your findings with <strong>existing research</strong>.</li>\n<li>Critically evaluate the <strong>strengths, limitations, and potential contributions</strong> of your study.</li>\n</ul>\n<p><strong>6. References (APA 7 Format)</strong></p>\n<ul>\n<li>Provide a complete and correctly formatted <strong>reference list</strong> following APA 7 guidelines.</li>\n</ul>\n<p><strong>7. Appendix (what does not belong in the main text)</strong></p>\n<ul>\n<li>Add additional and relevant resources such as code you have written, regular expression you have used, or extended tables detailing statistical results.</li>\n</ul>\n<p><strong>Important Guidelines</strong></p>\n<ul>\n<li><strong>Conciseness &amp; Clarity:</strong> Each section should be <strong>succinct yet comprehensive</strong> and written in academic English as used in high-quality journal papers.</li>\n<li><strong>Originality &amp; Depth:</strong> Ensure your project presents an <strong>original and meaningful contribution</strong> to corpus research.</li>\n<li><strong>Structure &amp; Formatting:</strong> Follow the provided structure for <strong>clarity and coherence</strong>.</li>\n</ul>\n<p><strong>Statement on Gen AI &amp; MT</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit a written report of a research project of no longer than 2000 words (excluding references) via Turnitin.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial: Corpus Linguistics and Text Analysis</strong><br><p>How to design and build a corpus?</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Tutorial: Corpus Linguistics and Text Analysis</strong>",
            "topic_description": "Tutorial: Corpus Linguistics and Text Analysis How to design and build a corpus?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Recorded Lecture: Corpus Linguistics and Text Analysis</strong><br/><p>Weekly lecture content consists of pre-recorded hour-long lectures that are uploaded to Blackboard one week before the scheduled week.ﾠ Students are expected to watch the recorded lecture content before taking the Online Study Tasks for the respective week and before attending the tutorials.</p></p><p><strong>Learning outcomes:</strong> L02, L05, L06</p></div></td>",
            "topic_title": "<strong>Recorded Lecture: Corpus Linguistics and Text Analysis</strong>",
            "topic_description": "Recorded Lecture: Corpus Linguistics and Text Analysis Weekly lecture content consists of pre-recorded hour-long lectures that are uploaded to Blackboard one week before the scheduled week.ﾠ Students are expected to watch the recorded lecture content before taking the Online Study Tasks for the respective week and before attending the tutorials.",
            "learning_outcomes": [
                "L02",
                "L05",
                "L06"
            ]
        }
    ]
}