{
    "course_title": "Globalisation & Development in Post-Colonial Societies",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SOCY2220-21648-7520",
    "full_course_code": "SOCY2220-21648-7520",
    "course_code": "SOCY2220",
    "class_code": "21648",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate your understanding of major concepts and theories of international development, including by applying them to explain contemporary development-related debates and issues."
        },
        {
            "number": "LO2.",
            "description": "Discuss how intersecting social location shapes development experiences in post-colonial and settler colonial societies"
        },
        {
            "number": "LO3.",
            "description": "Explain the causes of, and imagine diverse responses to, experiences of global inequalities"
        },
        {
            "number": "LO4.",
            "description": "Analyse the interconnections between environmental and social justice in development debates"
        },
        {
            "number": "LO5.",
            "description": "Apply development ethics in analysing global development issues"
        },
        {
            "number": "LO6.",
            "description": "Practice careful listening and respectful engagement with others, as part of demonstrating your understanding of the importance of collective learning environments."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Concepts and Theories of Development Quiz",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>20% 4 short answer questions, each worth 5% </dd>",
            "due_date": "<dd><p> 16/04/2025 5:00 pm</p>\n<p>\n</p><p>This is an in class quiz. </p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>A short answer in class quiz will be held in week 8 Wed (16 April). Questions will require students to showcase learnings related to key theories and development debates covered in the course up to and including week 8. This will be in class, with students required to hand write answers. There will be 4 questions, worth 5 marks (5%) each. Students will be required to write up to 250 words per answer, a total of 1000 words Max. A printed copy of the quiz and paper for answers will be provided.</p>\n<p><strong>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submitted in class in week 8 (16 April).</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Development Book Club: Group Presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>40% 15 minutes, with 5 min questions </dd>",
            "due_date": "<dd><p>Student presentations will run from week 9 - week 12 (30 April - 21 May). Students will be allocated groups and presentation time slots by week 3 (12 March). All student presentations will be recorded. </p></dd>",
            "learning_objectives": null,
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You are required to work as a group to deliver an oral presentation of a book review, based on a book provided from the list below, or an alternative book approved by the course convenor. The purpose of this assessment is for your group to reflect on the effectiveness of different forms of writing in engaging complex development theories and ideas. Please select a book that interests your group (keeping in mind that you will need to compromise as a group to reach a shared agreement about which one book you will read together). The list below is not intended to be exhaustive, merely to get you excited about which book might be right for you and your group. Please have a chat to the course convenor about selecting a book if needed. Please note you MUST seek approval for any book not included on this list. Please note that you are NOT ALLOWED TO USE ARTIFICIAL INTELLIGENCE AT ALL for this assessment task. You will receive in class training on how to work effectively in groups.</p>\n<p>In preparing your group presentation, the group should regularly meet to discuss the ideas of the book as you read it (think of it as your own small book club).</p>\n<p>As a guide, a book review presentation should contain the following:</p>\n<p>- an introduction to the book, including an overview of key themes/contents of the book and why your group selected the book;</p>\n<p>- the purpose of the book, including with particular focus on its relevance to development scholarship and thinking;</p>\n<p>- strengths and weaknesses of the book - from the perspective of your group members, and</p>\n<p>- who you would recommend to read it and why?</p>\n<p>The presentation will need to show that all of you have contributed to the presentation; that is, you will all stand up and present together, and share the division of labour regarding the content to be delivered. You should also all be there to support each other in addressing questions from the audience.</p>\n<p>This is a 15 minute presentation, with 5 minutes for discussion and questions with the class.</p>\n<p><strong>The Books:</strong></p>\n<p>Ghosh, A. (2021) The Nutmeg's Curse. Parables for a Planet in Crisis. The University of Chicago Press. </p>\n<p>Klein, N. (2023) Doppelganger. A Trip into the Mirror World. Penguin Books. </p>\n<p>Marya, R. and Patel, R. (2021) Inflamed. Deep Medicine and the Anatomy of Injustice. Farrar, Straus and Giroux, New York. </p>\n<p>McKenna, M. (2021) 'Return to Uluru' Black Inc. Victoria. </p>\n<p>Shiva, Vandana, (2016) 'Who Really Feeds the World? The Failures of Agribusiness and the Promise of AgroEcology', North Atlantic Books, USA.  </p>\n<p><strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>In class presentations</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Weekly in class reflection journal",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>40% 2200 words </dd>",
            "due_date": "<dd><p> 26/02/2025 5:00 pm</p>\n<p> 12/03/2025 5:00 pm</p>\n<p> 26/03/2025 5:00 pm</p>\n<p> 2/04/2025 5:00 pm</p>\n<p> 9/04/2025 5:00 pm</p>\n<p> 16/04/2025 5:00 pm</p>\n<p> 30/04/2025 5:00 pm</p>\n<p> 7/05/2025 5:00 pm</p>\n<p> 14/05/2025 5:00 pm</p>\n<p> 21/05/2025 5:00 pm</p>\n<p> 28/05/2025 5:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>At the end of each workshop you will be required to reflect on your weekly learnings. This will include reflecting on content delivered by the lecturer, in class discussion and set readings for the week. You should aim to write up to 200 words each week (some weeks you might find you want to write in sentences, other weeks perhaps you will want to draw a diagram, or a picture, to reflect your learnings), and this will be submitted to the lecturer before leaving the class for the week. You will be provided with a reflective journal, which the lecturer will bring each week for you to add your weekly reflections to. Feel free to bring things to decorate your journal, to make it your own. You will receive feedback on your writing around week 3, and reflections will be marked at the end of semester.</p>\n<p>To assist you in this activity, you should engage with some of these questions each week. You should aim to engage in diverse ways each week, for example, some weeks picking up some of these questions, and then in other weeks taking on different questions listed. </p>\n<p>- What are the key themes and ideas you have learnt about this week (for example in the readings, through lecture content or in class discussion)? </p>\n<p>- Was there anything that particularly excited and/or challenged you this week, that you would like to talk about, including related to your values, or about yourself more broadly?</p>\n<p>- Are there aspects of course content that raise ethical questions for you? </p>\n<p>The reflections journal is expected to be undertaken weekly, starting in week 1 and ending in week 13 (there is no class in week 4, so there is no requirement to reflect this week). Each week you will write 200 words (week 1 - 12, excluding week 2 &amp; 4). This will add to a total of 10 weeks, or 2200 words MAX. In week 13 you will then have the opportunity to select your 7 best weeks of reflection, which will then be marked.</p>\n<p><strong>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your reflective journal each week in class, directly to the lecturer. This will be submitted as a hard copy journal, which you will be provided with in week 1. </p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1: Introduction and Course Overview</strong><br/><p>Introduction to course content, teaching team, key concepts, readings, requirements and assessment. Including time for in class reflection journal writing. Lecturer Prof Kristen Lyons</p></p></div></td>",
            "topic_title": "<strong>Week 1: Introduction and Course Overview</strong>",
            "topic_description": "Week 1: Introduction and Course Overview Introduction to course content, teaching team, key concepts, readings, requirements and assessment. Including time for in class reflection journal writing. Lecturer Prof Kristen Lyons",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2: Development and Globalisation</strong><br/><p>Introduction to our global world: Defining development, globalisation and post-colonial societies. Including time for in class reflection journal writing. Lecturer Prof Kristen Lyons</p>\n<p>**Due to the University-wide closures in response to Cyclone Alfred, assessment and teaching activities in this course have been revised. Please refer to the course Blackboard site for the revised teaching and assessment plan.**</p></p></div></td>",
            "topic_title": "<strong>Week 2: Development and Globalisation</strong>",
            "topic_description": "Week 2: Development and Globalisation Introduction to our global world: Defining development, globalisation and post-colonial societies. Including time for in class reflection journal writing. Lecturer Prof Kristen Lyons **Due to the University-wide closures in response to Cyclone Alfred, assessment and teaching activities in this course have been revised. Please refer to the course Blackboard site for the revised teaching and assessment plan.**",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3: Post Colonial/Settler Colonial Societies</strong><br/><p>Including time for in class reflection journal writing. Lecturer Professor Kristen Lyons</p>\n<p>Allocate book club groups. Basic group work training commences. </p></p></div></td>",
            "topic_title": "<strong>Week 3: Post Colonial/Settler Colonial Societies</strong>",
            "topic_description": "Week 3: Post Colonial/Settler Colonial Societies Including time for in class reflection journal writing. Lecturer Professor Kristen Lyons Allocate book club groups. Basic group work training commences.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Team Based Learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4: Establishing Your Book Club! </strong><br/><p>Each book club group should meet to discuss which book they will review. There is no formal class today, students can meet anywhere (either face to face or zoom) for this initial book club meeting. The lecture room will be available however please note there will be no teaching staff, this is intended as a space for students to establish their club, and to settle on their book for the assessment task. </p></p></div></td>",
            "topic_title": "<strong>Week 4: Establishing Your Book Club! </strong>",
            "topic_description": "Week 4: Establishing Your Book Club! Each book club group should meet to discuss which book they will review. There is no formal class today, students can meet anywhere (either face to face or zoom) for this initial book club meeting. The lecture room will be available however please note there will be no teaching staff, this is intended as a space for students to establish their club, and to settle on their book for the assessment task.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5: Self Care in the Development Space</strong><br/><p>Workshop on self care and emotional labour led by Ass Prof Christine Slade. Including time for in class reflection journal writing. </p></p></div></td>",
            "topic_title": "<strong>Week 5: Self Care in the Development Space</strong>",
            "topic_description": "Week 5: Self Care in the Development Space Workshop on self care and emotional labour led by Ass Prof Christine Slade. Including time for in class reflection journal writing.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6: Explaining Development/Underdevelopment</strong><br/><p>Structural Analysis of Development and its failings. Including time for in class reflection journal writing. Lecturer Prof Kristen Lyons</p>\n<p>follow up on group work dynamics - progress and responding to challenges. </p></p></div></td>",
            "topic_title": "<strong>Week 6: Explaining Development/Underdevelopment</strong>",
            "topic_description": "Week 6: Explaining Development/Underdevelopment Structural Analysis of Development and its failings. Including time for in class reflection journal writing. Lecturer Prof Kristen Lyons follow up on group work dynamics - progress and responding to challenges.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7: Responses to the Failings of Development</strong><br/><p>Alternative, Grassroots and Post Development. Including time for in class reflection journal writing. Lecturer Prof Kristen Lyons</p>\n<p>Visit to UQ Art Museum https://art-museum.uq.edu.au/these-entanglements </p></p></div></td>",
            "topic_title": "<strong>Week 7: Responses to the Failings of Development</strong>",
            "topic_description": "Week 7: Responses to the Failings of Development Alternative, Grassroots and Post Development. Including time for in class reflection journal writing. Lecturer Prof Kristen Lyons Visit to UQ Art Museum https://art-museum.uq.edu.au/these-entanglements",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8: Gender and Development</strong><br/><p>Including time for in class reflection journal writing. Lecturer Prof Kristen Lyons</p></p></div></td>",
            "topic_title": "<strong>Week 8: Gender and Development</strong>",
            "topic_description": "Week 8: Gender and Development Including time for in class reflection journal writing. Lecturer Prof Kristen Lyons",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9: Aboriginal Australia and Development (Book club presentations start) </strong><br/><p>Including time for in class reflection journal writing. Lecturer: TBC</p>\n<p>Book club presentations start today.</p>\n<p>readings to be confirmed. </p></p></div></td>",
            "topic_title": "<strong>Week 9: Aboriginal Australia and Development (Book club presentations start) </strong>",
            "topic_description": "Week 9: Aboriginal Australia and Development (Book club presentations start) Including time for in class reflection journal writing. Lecturer: TBC Book club presentations start today. readings to be confirmed.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10: Sustainable Development &amp; Green Economy (Book club presentations continue) </strong><br/><p>Including time for in class reflection journal writing. Lecturer Prof Kristen Lyons</p>\n<p>Book club presentations continue today.</p></p></div></td>",
            "topic_title": "<strong>Week 10: Sustainable Development &amp; Green Economy (Book club presentations continue) </strong>",
            "topic_description": "Week 10: Sustainable Development & Green Economy (Book club presentations continue) Including time for in class reflection journal writing. Lecturer Prof Kristen Lyons Book club presentations continue today.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11: Globalisation, Resistance and Hope</strong><br/><p>Including time for in class reflection journal writing. Lecturer Prof Kristen Lyons</p>\n<p>Book club presentations continue today.</p></p></div></td>",
            "topic_title": "<strong>Week 11: Globalisation, Resistance and Hope</strong>",
            "topic_description": "Week 11: Globalisation, Resistance and Hope Including time for in class reflection journal writing. Lecturer Prof Kristen Lyons Book club presentations continue today.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12: Future Directions: Where to from here? (Book club presentations continue) </strong><br/><p>Including time for in class reflection journal writing. Lecturer Prof Kristen Lyons</p>\n<p>Book club presentations continue today.</p></p></div></td>",
            "topic_title": "<strong>Week 12: Future Directions: Where to from here? (Book club presentations continue) </strong>",
            "topic_description": "Week 12: Future Directions: Where to from here? (Book club presentations continue) Including time for in class reflection journal writing. Lecturer Prof Kristen Lyons Book club presentations continue today.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13: Final Reflections</strong><br/><p>Book club presentations completed today. </p>\n<p>Final reflections and submission of reflections journal in class today. </p></p></div></td>",
            "topic_title": "<strong>Week 13: Final Reflections</strong>",
            "topic_description": "Week 13: Final Reflections Book club presentations completed today. Final reflections and submission of reflections journal in class today.",
            "learning_outcomes": []
        }
    ]
}