{
    "course_title": "Advanced Studies in Social Thought: Getting the Big Picture",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SOCY3345-21650-7520",
    "full_course_code": "SOCY3345-21650-7520",
    "course_code": "SOCY3345",
    "class_code": "21650",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Identify key conceptual problems and questions in society using social theory"
        },
        {
            "number": "LO2.",
            "description": "Demonstrate a critical understanding of the key ideas, theories and thinkers in social theory and sociological thought"
        },
        {
            "number": "LO3.",
            "description": "Articulate and evaluate the similarities and differences between different perspectives on the same key idea or problem"
        },
        {
            "number": "LO4.",
            "description": "Select and apply social ideas and theories to understand, analyse and critique various perspectives on social problems and phenomena, including how they interact with your own experiences and the world around you"
        },
        {
            "number": "LO5.",
            "description": "Prepare written work that demonstrates the skills required of sociologists: a clear understanding and critical appreciation of the key social problems and phenomena presented in the course"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Weekly Critical Topic Review (5 reviews)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>40% (8% per review) </dd>",
            "due_date": "<dd><p>Your topic review for each topic is due at 12pm on the day of the following class.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Warning:</strong> <strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to write responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</strong></p>\n<p><strong>Padlet Digital Reflections </strong></p>\n<p>This assessment is worth 40% of your semester marks</p>\n<p>Assessment: 5 weekly reflections from the 10 topics between weeks 2 and 12 </p>\n<p>Length of contribution: 400 - 500 words (+/- 10%) each week and other media.</p>\n<p>Each Padlet contribution is <strong>due</strong> at 12 pm on the Monday morning after that topic (e.g. your reflection on Week 2's topic is due on Monday of Week 3).</p>\n<p>If you fail to complete a compulsory reflection, you will be marked zero, and will contribute to your tally of five reflections.</p>\n<p>There will be no Padlet reflection due in the week where one of the three in-class quizzes are held.</p>\n<p><strong>What’s a Padlet digital story?</strong></p>\n<p>PadletUQ is a free UQ online application featuring a virtual wall that allows you to post contributions each week to the same Padlet page,</p>\n<p>For more information on Padlet and how to install it and use it, see <a href=\"https://web.library.uq.edu.au/library-services/it/learnuq-blackboard-help/collaborative-tools/padlet\">https://web.library.uq.edu.au/library-services/it/learnuq-blackboard-help/collaborative-tools/padlet</a>. You will be introduced to Padlet in Week 1 and for detailed instructions see Blackboard.</p>\n<p><strong>How do I do it?</strong></p>\n<p>Each reflection journal entry will be based on the topic for that week of the course. You don't need to cover the whole topic. It will be up to you what particular ideas, issues, theories and real-world examples you write about. How to approach your Padlet contribution:</p>\n<ul>\n<li>Write in the first person (me, I)</li>\n<li>Refer to Blackboard resources provided for each topic (readings, videos, lecture notes, additional resources)</li>\n<li>For some weeks, the course coordinator will set a question to be answered during class; in other cases, you will be free to select a component of the topic that interests you.</li>\n<li>When you are free to select your own reflection topic: Demonstrate that you understand the week’s topic by describing and reflecting on it. <strong>You don't need to cover the entire week's content</strong>. You should choose a particular aspect of the week's material and deal with it more comprehensively (i.e. go for depth rather than breadth)</li>\n<li>Apply what you have learnt to a ‘real world’ example. This can be something you have experienced yourself, something you have read out or seen in the news – anything that has happened or exists in the world around you.</li>\n<li>Use the features of the Padlet to introduce any visual representations – photos, short videos, diagrams, artwork - be creative!</li>\n</ul>\n<p><strong>How is it assessed? </strong></p>\n<p>Your marker will award marks for the following: </p>\n<ul>\n<li>demonstrated understanding of the topic and reading beyond the lecture notes</li>\n<li>creativity in applying your sociological imagination to everyday examples </li>\n<li>written expression and imaginative use of media</li>\n</ul>\n<p>Your contribution will be marked on the quality of the research that went into it (i.e. engagement with and understanding of readings, lecture materials, and other sources), your presentation of materials and, importantly, your willingness to reflect on the material rather than just summarise it.  </p>\n<p>There will be an opportunity to ask questions/clarify during our first class, and I will post an example Padlet contribution on Blackboard. I will also post examples of high-scoring contributions (with students' permission) during the early weeks of the semester to allow you to learn from others' work. </p>\n<p><strong>Warning:</strong> <strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to write responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>How do I submit? On UQ Padlet - you will receive instructions about how to register and use UQ Padlet. The course coordinator reserves the right to submit your text to Turnitin if academic misconduct is suspected.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Application of Theory to Actual Events",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 26/05/2025 12:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to write responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</strong></p>\n<p>Essay</p>\n<p>Length: 2000 words</p>\n<p>Due: Monday 26 May 2pm</p>\n<p><br/></p>\n<p>In this essay task you are required to answer one from a choice of questions which link the theories and ideas you have studied this semester to a current event in the world around us . Essay questions will be posted on Blackboard 'Assessment' by week 3. We will explore the questions in more detail during class time, and you will be provided with strategies for answering them.</p>\n<p><br/></p>\n<p>·     Essays to be submitted by due date on Turnitin (in Blackboard ‘Assessments’)</p>\n<p>·     Please write your essay in 12 point font, using 1.5 line spacing</p>\n<p>·     Referencing: APA 7 (link to library resources in Blackboard ‘Assessment’)</p>\n<p><br/></p>\n<p><strong>Warning:</strong> <strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to write responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Workshop Quizzes (3 x 10% each)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p>Assessment will occur during scheduled workshops from 24/2/25 - 26/5/25</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Workshop quizzes (each worth 10%) will be held during 3 of the workshops during the semester. You will be informed that there is a workshop quiz at the start of the chosen workshops (not before). You will have 30 minutes to complete the quiz at the end of the workshop. The quiz will be a combination of short answer questions related to the readings and content for that week. The quiz is closed book, and answers are to be handwritten on the quiz material provided by the course coordinator.</p>\n<p><strong>Warning:</strong> <strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction to the Course</strong><br><p>At its most basic, a theory is someone's explanation, supported by evidence and reason, for how a particular phenomenon occurs or works. Social theory is the body of explanations about how the social world works. In this introductory week, after an introduction to the course, we will get down to the business of laying the foundations for the rest of the semester by discussing in more detail what we mean by society, or the social world. We will use our everyday lives to discover how we use our own quite sophisticated personal theories about how to survive in the world. We'll discuss the tension between art, science and prediction that exists in social theories and some of inherent, and perhaps outdated, assumptions that we make about the social world when we study the evolution of social theory.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Introduction to the Course</strong>",
            "topic_description": "Introduction to the Course At its most basic, a theory is someone's explanation, supported by evidence and reason, for how a particular phenomenon occurs or works. Social theory is the body of explanations about how the social world works. In this introductory week, after an introduction to the course, we will get down to the business of laying the foundations for the rest of the semester by discussing in more detail what we mean by society, or the social world. We will use our everyday lives to discover how we use our own quite sophisticated personal theories about how to survive in the world. We'll discuss the tension between art, science and prediction that exists in social theories and some of inherent, and perhaps outdated, assumptions that we make about the social world when we study the evolution of social theory.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Knowledge and Truth</strong><br><p>Knowledge and Truth: The sociology of knowledge - how we know things and believe things - is dependent on social context. What passes for legitimate knowledge in society has always been contingent on power and social organisation. At the moment it is science under attack, but it was science that posed a radical threat to organised monotheistic religion in the early enlightenment and before that it was organised monotheistic religion which threatened pantheistic and superstitious understandings of the world. None of these knowledge systems disappeared with the advent of the next mode of knowledge, but they were relegated to marginal roles and treated with suspicion. We will discuss \"truth\" in a historical trajectory, from the primacy of science and the enlightenment project to the now radical reinterpretation of truth and mistrust in formerly unimpeachable sources of knowledge. </p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Knowledge and Truth</strong>",
            "topic_description": "Knowledge and Truth Knowledge and Truth: The sociology of knowledge - how we know things and believe things - is dependent on social context. What passes for legitimate knowledge in society has always been contingent on power and social organisation. At the moment it is science under attack, but it was science that posed a radical threat to organised monotheistic religion in the early enlightenment and before that it was organised monotheistic religion which threatened pantheistic and superstitious understandings of the world. None of these knowledge systems disappeared with the advent of the next mode of knowledge, but they were relegated to marginal roles and treated with suspicion. We will discuss \"truth\" in a historical trajectory, from the primacy of science and the enlightenment project to the now radical reinterpretation of truth and mistrust in formerly unimpeachable sources of knowledge.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Cyclone Alfred</strong><br/></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Cyclone Alfred</strong>",
            "topic_description": "Cyclone Alfred",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong> Trust</strong><br/><p>Trust: Trust is the glue that holds relationships together at every level, from the implicit trust we have in family members, the more contingent trust we give to acquaintances and perhaps strangers to the varying levels of trust we place in institutions like the government, banks and our health system. Despite being fundamental to the success of social life, trust is often overlooked by sociology as a theme and left to psychology. This week we will investigate the bases of trust, the conditions for existence and what happens in societies and intimate relationships when trust evaporates.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong> Trust</strong>",
            "topic_description": "Trust Trust: Trust is the glue that holds relationships together at every level, from the implicit trust we have in family members, the more contingent trust we give to acquaintances and perhaps strangers to the varying levels of trust we place in institutions like the government, banks and our health system. Despite being fundamental to the success of social life, trust is often overlooked by sociology as a theme and left to psychology. This week we will investigate the bases of trust, the conditions for existence and what happens in societies and intimate relationships when trust evaporates.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong> Power</strong><br/><p>Power: Power is the fundamental structuring force of society. Power in a very general sense is the ability to control or influence others using a variety of techniques and practises. Power is what positions us in relation to others in social space (society). Power and its application are fundamental to understanding social life and social outcomes. Sociology has a range of interesting ways to think about this concept and this week we will evaluate and contrast some classic understandings and how they help us to comprehend how power is exerted very directly or quite subtly in achieving social outcomes in contemporary society.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong> Power</strong>",
            "topic_description": "Power Power: Power is the fundamental structuring force of society. Power in a very general sense is the ability to control or influence others using a variety of techniques and practises. Power is what positions us in relation to others in social space (society). Power and its application are fundamental to understanding social life and social outcomes. Sociology has a range of interesting ways to think about this concept and this week we will evaluate and contrast some classic understandings and how they help us to comprehend how power is exerted very directly or quite subtly in achieving social outcomes in contemporary society.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Authenticity </strong><br/><p>Authenticity: Authenticity is one of those words that we understand intuitively - we have human understanding of what is authentic, particularly when it comes to people and objects. It's a \"modern\" term, in that it has only become an important value as our roles, life trajectories and identities became a project rather than a 'given'. How do we become 'authentic'?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Authenticity </strong>",
            "topic_description": "Authenticity Authenticity: Authenticity is one of those words that we understand intuitively - we have human understanding of what is authentic, particularly when it comes to people and objects. It's a \"modern\" term, in that it has only become an important value as our roles, life trajectories and identities became a project rather than a 'given'. How do we become 'authentic'?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong> The Market</strong><br/><p>The Market: This week we investigate and reflect on the dominating paradigm of our times, consumer capitalism, and how it shapes politics, social relations at the macro and micro levels, and our subjectivities.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong> The Market</strong>",
            "topic_description": "The Market The Market: This week we investigate and reflect on the dominating paradigm of our times, consumer capitalism, and how it shapes politics, social relations at the macro and micro levels, and our subjectivities.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Love and Hate</strong><br/><p>Love and Hate: This week's title is a 'catch-all' theme. We look at contemporary understandings of intimate relations, how understandings and expectations of romantic love have changed through time, and how they differ across cultures. We will also discuss friendship, another form of \"-ship\" that has not come under enough scrutiny in sociology. It does not fit into the classical structures that social relations have traditionally informed sociological inquiry, such as the family, geographical community, the state and other social institutions. The nature and importance of friendship require some new attention as old institutions fragment and transform, and online platforms mediate our lives. In this topic, we also explore the nature of hate and how society and culture are becoming strident and polarised.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Love and Hate</strong>",
            "topic_description": "Love and Hate Love and Hate: This week's title is a 'catch-all' theme. We look at contemporary understandings of intimate relations, how understandings and expectations of romantic love have changed through time, and how they differ across cultures. We will also discuss friendship, another form of \"-ship\" that has not come under enough scrutiny in sociology. It does not fit into the classical structures that social relations have traditionally informed sociological inquiry, such as the family, geographical community, the state and other social institutions. The nature and importance of friendship require some new attention as old institutions fragment and transform, and online platforms mediate our lives. In this topic, we also explore the nature of hate and how society and culture are becoming strident and polarised.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Assignment</strong><br/><p>This week has been reserved for you to work on your final assignment. </p></p></div></td>",
            "topic_title": "<strong>Assignment</strong>",
            "topic_description": "Assignment This week has been reserved for you to work on your final assignment.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Poverty and Stigma</strong><br/><p>Poverty and Stigma: In Australia, 14 percent of people (and 18 percent of children) live below the poverty line (Davidson et al., 2020). In India, that figure is 22 percent (Mahapatra, 2020). What does \"poverty\" mean? What does it mean to be poor? How different is poverty in the Global South to poverty in wealth industrial economies? This week we will dip into a rich body of theory that attempts to explain poverty from both objective and subjective perspectives. We will investigate whether the effects of large wealth gaps in some societies can have more corrosive effects on wellbeing that more uniform poverty, to help us better understand questions of relativity, justice and the stigma of being poor.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Poverty and Stigma</strong>",
            "topic_description": "Poverty and Stigma Poverty and Stigma: In Australia, 14 percent of people (and 18 percent of children) live below the poverty line (Davidson et al., 2020). In India, that figure is 22 percent (Mahapatra, 2020). What does \"poverty\" mean? What does it mean to be poor? How different is poverty in the Global South to poverty in wealth industrial economies? This week we will dip into a rich body of theory that attempts to explain poverty from both objective and subjective perspectives. We will investigate whether the effects of large wealth gaps in some societies can have more corrosive effects on wellbeing that more uniform poverty, to help us better understand questions of relativity, justice and the stigma of being poor.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Loneliness and Happiness</strong><br/><p>Loneliness and Happiness: Loneliness is often described as an epidemic of late modern life. There are few more emotionally devastating conditions than loneliness. To be lonely is a subversion of sociability as one of the key sources of meaning in life and an existential threat. High mobility, contingent relationships, the fragmentation of traditional meanings and roles of family, and low-density car-based urban life are all factors that contribute to loneliness. To add to this, the effects of prolonged Covid lockdowns and the resultant changing nature of work and study serve to complicate the possibilities for loneliness. This week we look at what loneliness means, we place loneliness in a historical context and account for some of the explanations and possible remedies for the increasing prevalence of loneliness in advanced industrial societies.</p>\n<p>Happiness is our final topic and, hopefully, an uplifting way to wrap up the various big ideas covered so far this semester. Happiness and its closely related cousin, authenticity, have become prominent themes in past few decades as an industry and an object of academic study. This week we will look at some of the competing conceptualisations of what it means to be \"happy\" through history and across cultures. We will try and answer the question of why happiness has become such a postmodern preoccupation and we will discuss whether happiness is a worthy life goal, or merely an outcome of other more weighty and noble aspirations.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Loneliness and Happiness</strong>",
            "topic_description": "Loneliness and Happiness Loneliness and Happiness: Loneliness is often described as an epidemic of late modern life. There are few more emotionally devastating conditions than loneliness. To be lonely is a subversion of sociability as one of the key sources of meaning in life and an existential threat. High mobility, contingent relationships, the fragmentation of traditional meanings and roles of family, and low-density car-based urban life are all factors that contribute to loneliness. To add to this, the effects of prolonged Covid lockdowns and the resultant changing nature of work and study serve to complicate the possibilities for loneliness. This week we look at what loneliness means, we place loneliness in a historical context and account for some of the explanations and possible remedies for the increasing prevalence of loneliness in advanced industrial societies. Happiness is our final topic and, hopefully, an uplifting way to wrap up the various big ideas covered so far this semester. Happiness and its closely related cousin, authenticity, have become prominent themes in past few decades as an industry and an object of academic study. This week we will look at some of the competing conceptualisations of what it means to be \"happy\" through history and across cultures. We will try and answer the question of why happiness has become such a postmodern preoccupation and we will discuss whether happiness is a worthy life goal, or merely an outcome of other more weighty and noble aspirations.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Assignment</strong><br/><p>This week we will review the course and discuss how the various concepts we have studies relate to each other. Evaluate and celebrate!</p></p></div></td>",
            "topic_title": "<strong>Assignment</strong>",
            "topic_description": "Assignment This week we will review the course and discuss how the various concepts we have studies relate to each other. Evaluate and celebrate!",
            "learning_outcomes": []
        }
    ]
}