{
    "course_title": "Qualitative Social Research",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SOCY3329-21649-7520",
    "full_course_code": "SOCY3329-21649-7520",
    "course_code": "SOCY3329",
    "class_code": "21649",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "distinguish the assumptions, theories and concepts which have been developed by various approaches to social inquiry, from post-positivist to interpretivist, critical, participatory and Indigenous methodologies;"
        },
        {
            "number": "LO2.",
            "description": "identify the specific concepts, methods, data and approaches relevant to the qualitative exploration and analysis of particular issues, problems and social phenomena;"
        },
        {
            "number": "LO3.",
            "description": "generate original research questions informed by relevant theories and concepts, and identify the corresponding methods for ethically generating data to answer these questions;"
        },
        {
            "number": "LO4.",
            "description": "identify and evaluate the strengths and limitations of research techniques in qualitative inquiry;"
        },
        {
            "number": "LO5.",
            "description": "describe and apply sociological knowledge and understanding through oral and written means of expression;"
        },
        {
            "number": "LO6.",
            "description": "collaborate effectively as a member of a social research team."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Thematic Analysis Report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>35% 1,500 words </dd>",
            "due_date": "<dd><p> 14/04/2025 2:00 pm</p>\n<p>\n</p><p>Please submit your assessment through Turnitin.</p></dd>",
            "learning_objectives": "L01, L02, L04, L05, L06",
            "mode": "Activity/ Performance, Written",
            "category": "Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Please note: the course study guide (available on Blackboard) provides more in-depth information on assessment requirements. </p>\n<p>This assessment asks students to practice data collection, analysis and group work skills, following the interpretivist tradition. There are two tasks:</p>\n<p>1.    Students (in groups) will work together to conduct a focus group (week 4) and transcribe the recording. Participation in this task is required (transcription due 28 March, 2pm).</p>\n<p>2.   Students (individually) will apply the method of thematic analysis demonstrated in this course to the focus group data and write a report on their methods and findings (due 14 April, 2pm). The word limit is 1,500 words for SOCY3329 students; 2,000 words for SOCY7329 students (+/- 10%).</p>\n<p>The research question that the <strong>Thematic Analysis Report</strong> addresses will be decided collectively in class during the first week of the semester. Students will work individually to analyse two key themes emerging from the focus groups.</p>\n<p>The report should use two transcripts as data: one transcript from the student’s own focus group, and one from another group. The report should also respond to the following issues:</p>\n<p>·     How do your methods and analysis show reflexivity?</p>\n<p>·     What were the two main themes raised in the focus groups? (i.e., where do your 2 chosen themes fit within your broader thematic analysis?)</p>\n<p>·     What are your conclusions about the topic? (e.g., what are the implications for practice – yours and others?)</p>\n<p>·     Do you have any suggestions for further research?</p>\n<p>The report should include the following sections: Introduction/background, methods, findings, discussion/conclusion and references. However, it is anticipated that the methods and findings section will comprise the bulk of the word count. Further subheadings within the findings section are permitted.</p>\n<p>Use of AI or machine translation</p>\n<p>For the translation associated with task 1: Artificial Intelligence (AI) and Machine Translation (MT) may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>For task 2, thematic analysis and report writing: This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<p>For this and all assignments in SOCY3329, students must submit a coversheet (available on Blackboard) attesting to their use/non-use of AI/MT technologies.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "CDA Proposal & 'Show Your Work' Write Up",
            "special_indicators": [],
            "weighting": "<dd>35% 1,500 words </dd>",
            "due_date": "<dd><p> 12/05/2025 2:00 pm</p>\n<p>\n</p><p>Please submit your assessment through Turnitin.</p></dd>",
            "learning_objectives": "L01, L02, L03, L05",
            "mode": "Written",
            "category": "Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Please note: the course study guide (available on Blackboard) provides more in-depth information on assessment requirements.</p>\n<p>This assessment asks students to practice the research design, data collection and analysis skills following the critical tradition. Aligned with module 3, this project supports students in developing and practicing their critical discourse/visual analysis skills. Students start with an injustice (e.g., ageism, sexism, racism, ableism, classism) and work to reveal how this injustice is discursively (through texts, symbols and/or images) perpetuated in one current (including posts from the past 10 months) online community. Module 3 Interactive Book<strong> </strong>will demonstrate how to do both CDA and visual analysis; workshops will give students opportunities to discuss their proposals and analysis with tutors and classmates.</p>\n<p>There are two steps to this assessment. After completing the two steps detailed here, students are ready to submit their CDA assessment as one assignment with two sections included: proposal &amp; ‘Show your work’.</p>\n<p>1.    <strong>Proposal</strong>: Students will work individually and in-class (especially week 9) using the pro forma provided below to develop an ethical CDA research project proposal to study an online community or online space using a critical discourse approach. The word limit for this step is 500 words for SOCY3329; 750 words for SOCY7329.</p>\n<p>2.    <strong>‘Show your work’</strong>: Students will work individually from their CDA proposal to analyse an online community or website using CDA or Critical Visual Analysis and present two findings along with supporting data displays and interpretation to ‘show your work’. The word limit for this step is 1,000 words for SOCY3329; 1,250 words for SOCY7329.</p>\n<p>As detailed in the Course Profile, the first section of the <strong>CDA Assessment</strong> asks students to develop a research plan addressing the questions listed below (see figure 1). Please use these questions, or a truncated version of them, as subheadings in the proposal section of your assignment.</p>\n<p><strong>Figure 1. CDA Proposal Pro forma</strong></p>\n<p>Project’s working title:</p>\n<p>Provide a summary of the background or research context (two/three sentences):</p>\n<p>State your research question(s) (No more than two. Remember, CDA projects seek to ‘unearth’ hidden meanings and messages, rather than examining influence or effect):</p>\n<p>Which method(s) (CDA / CVA) are you using to collect your data? (cite specific authors and techniques; ensure the research questions are complementary to the method)</p>\n<p>Where are you collecting your data / materials for analysis? (Be specific – which online communities/websites? Show that they are current: from the past 10 months; Provide URLs)</p>\n<p>What is your sampling strategy? (This could be 2-3 pages within a large website, or a few pages across websites. Why/how have you selected these websites?)</p>\n<p>How will you manage the ethical concerns associated with conducting qualitative research online (explicitly address the issues of confidentiality, consent and trust discussed in the week 8 lecture materials)?</p>\n<p>In responding to the questions listed above, students should ensure they have thoroughly outlined the ethical considerations associated with their CDA/CVA project and how any concerns are being addressed or mitigated (see readings and module activities for week 9). Due to the ethical constraints, <strong>social media sites are NOT permitted</strong> to be used as data material for this assessment.</p>\n<p>The second section of your <strong>CDA Assessment</strong> – the ‘show your work’ section – asks students to practice the methods outlined in step 1 – the proposal – and present two findings from your analysis. Rather than presenting these findings in report format, we are asking you to provide a write up of these two findings and ‘show your work’.</p>\n<p>Formatting requirements</p>\n<p>·     Spacing and font are up to you;</p>\n<p>·     The proposal section must comply with the 500-word (SOCY3329) or 750-word limit (SOCY7329) +/- 10%;</p>\n<p>·     The ‘show your work’ section must comply with the 1,000-word (SOCY3329) or 1,250-word limit (SOCY7329) +/- 10%;</p>\n<p>·     The reference list (not in-text references) is exclusive of the word limits and should follow APA 7th edition guidelines.</p>\n<p>Use of AI or machine translation</p>\n<p>For both the proposal and 'show your work' sections of this CDA assignment, AI and MT are not permitted. This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<p>For this and all assignments in SOCY3329, students must submit a coversheet (available on Blackboard) attesting to their use/non-use of AI/MT technologies.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Yarning Methodology Reflection Paper",
            "special_indicators": [],
            "weighting": "<dd>30% 1,000 words </dd>",
            "due_date": "<dd><p> 9/06/2025 2:00 pm</p>\n<p>\n</p><p>Please submit your assessment through Turnitin.</p></dd>",
            "learning_objectives": "L01, L02, L04, L05, L06",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Please note: the course study guide (available on Blackboard) provides more in-depth information on assessment requirements.</p>\n<p>This assessment asks students to practice relational data collection following one method – yarning – aligned with Indigenous methodology, and reflect on their experience. There are two steps involved:</p>\n<p>1.    Students (in groups) will participate in yarning during workshops in week 12. Students must attend workshops in week 12. These group yarns will be facilitated by a paid facilitator(s) with relevant cultural knowledge and experience.</p>\n<p>2.    Students (individually) will reflect on their experience of participating in yarning as an Indigenous qualitative method by drafting a reflection paper (due Monday 9 June, 2pm). In the paper, students are asked to contrast yarning with approaches to data collection underpinned by interpretivist, critical and emancipatory paradigms; and foreground reflections on their experience in terms of relationality and positionality.</p>\n<p>Unlike the other two written assessments in this course, the structure and content of this paper is less prescriptive. It should, however, include the following sections: Introduction/background including a thesis statement introducing your argument; body paragraphs where you develop your argument; a conclusion; and a list of references. As a reflection paper, the argument will originate from students’ own experiences. Students are instructed to draw on course resources in drafting their reflection papers, including:</p>\n<p>·     Data displays / quotes / field notes from the in-class yarn</p>\n<p>·     Required and recommended readings (especially the week 12 reading by Bessarab &amp; Ng’andu)</p>\n<p>·     Lecture materials (interactive book content, videos)</p>\n<p>Use of materials (e.g., references) from beyond the course is not required, but permitted. As with other assessments, all references cited in-text should appear in the reference list.</p>\n<p>Formatting:</p>\n<p>·     Word limit is 1,000 words (+/- 10%) for SOCY3329 students; 1,500 words (+/- 10%) for SOCY7329 students;</p>\n<p>·     Word count includes quotes/data displays and in-text references, but does not include full references (e.g., the list of references).</p>\n<p>·     References should be formatted following APA 7th edition conventions;</p>\n<p>·     First person pronouns (e.g., ‘I’ or ‘We’) are accepted.</p>\n<p>Use of AI or machine translation</p>\n<p>For the yarning methodology reflection paper, use of AI/MT is not permitted. This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<p>For this and all assignments in SOCY3329, students must submit a coversheet (available on Blackboard) attesting to their use/non-use of AI/MT technologies.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MODULE 1: Week 1. Course Overview &amp; Epistemology</strong><br/><p>In the module 1, week 1 interactive book (includes pre-recorded videos, links and activities: available through Blackboard), Dr Kiah Smith overviews content and forms of assessment. The focus is on introducing paradigms of qualitative research - interpretivist, critical, participatory &amp; Indigenous. Students should also watch the video 'Applying qualitative research' to learn the many ways alumni apply their qualitative research skills.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>MODULE 1: Week 1. Course Overview &amp; Epistemology</strong>",
            "topic_description": "MODULE 1: Week 1. Course Overview & Epistemology In the module 1, week 1 interactive book (includes pre-recorded videos, links and activities: available through Blackboard), Dr Kiah Smith overviews content and forms of assessment. The focus is on introducing paradigms of qualitative research - interpretivist, critical, participatory & Indigenous. Students should also watch the video 'Applying qualitative research' to learn the many ways alumni apply their qualitative research skills.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introductions</strong><br/><p>In this first workshop, students will collectively select the topic for the focus groups informing project 1: Thematic Analysis. </p>\n<p>Please come to class having watched all of the videos that explain the course and assessment.</p></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Introductions</strong>",
            "topic_description": "Introductions In this first workshop, students will collectively select the topic for the focus groups informing project 1: Thematic Analysis. Please come to class having watched all of the videos that explain the course and assessment.",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MODULE 1: Week 2</strong><br/><p>In this second week of Module 1, watch Dr Kiah Smith and Dr Zoe Staines go into more depth in exploring the interpretivist paradigm and different disciplinary approaches to qualitative research, including Indigenous methodologies.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>MODULE 1: Week 2</strong>",
            "topic_description": "MODULE 1: Week 2 In this second week of Module 1, watch Dr Kiah Smith and Dr Zoe Staines go into more depth in exploring the interpretivist paradigm and different disciplinary approaches to qualitative research, including Indigenous methodologies.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Prepare for focus groups</strong><br/><p>Brainstorm and refine focus group questions related to the topic selected in week 1.</p></p><p><strong>Learning outcomes:</strong> L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Prepare for focus groups</strong>",
            "topic_description": "Prepare for focus groups Brainstorm and refine focus group questions related to the topic selected in week 1.",
            "learning_outcomes": [
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MODULE 2: Week 4. Doing interpretivist research</strong><br/><p>Methods of data collection central to interpretivist qualitative research - interviews, focus groups - are the focus of online videos, along with concerns related to objectivity, subjectivity, ethics and reflexivity. Students are encouraged to watch a video where the first project assessment is explained.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>MODULE 2: Week 4. Doing interpretivist research</strong>",
            "topic_description": "MODULE 2: Week 4. Doing interpretivist research Methods of data collection central to interpretivist qualitative research - interviews, focus groups - are the focus of online videos, along with concerns related to objectivity, subjectivity, ethics and reflexivity. Students are encouraged to watch a video where the first project assessment is explained.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Focus Groups</strong><br/><p>In group work teams, prepare for, facilitate/participate in and record (using audio recorders) 10-15 minute focus groups.</p>\n<p>All students MUST attend workshops this week.</p></p><p><strong>Learning outcomes:</strong> L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Focus Groups</strong>",
            "topic_description": "Focus Groups In group work teams, prepare for, facilitate/participate in and record (using audio recorders) 10-15 minute focus groups. All students MUST attend workshops this week.",
            "learning_outcomes": [
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MODULE 2: Week 5</strong><br/><p>Explore what it means to analyse textual data thematically, based in grounded theory, in this week's interactive book: How to do thematic analysis.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>MODULE 2: Week 5</strong>",
            "topic_description": "MODULE 2: Week 5 Explore what it means to analyse textual data thematically, based in grounded theory, in this week's interactive book: How to do thematic analysis.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Thematic analysis 1</strong><br/><p>Practice thematic analysis coding in this week's workshop using in-class example 'Why young people drink'</p></p><p><strong>Learning outcomes:</strong> L04, L05</p></div></td>",
            "topic_title": "<strong>Thematic analysis 1</strong>",
            "topic_description": "Thematic analysis 1 Practice thematic analysis coding in this week's workshop using in-class example 'Why young people drink'",
            "learning_outcomes": [
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MODULE 2: Week 6.</strong><br/><p>This week's interactive book content continues exploration of thematic analysis within the interpretivist tradition - going from codes to themes to findings - including writing and presentation of your data. Continue engaging with the interactive book: How to do thematic analysis.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>MODULE 2: Week 6.</strong>",
            "topic_description": "MODULE 2: Week 6. This week's interactive book content continues exploration of thematic analysis within the interpretivist tradition - going from codes to themes to findings - including writing and presentation of your data. Continue engaging with the interactive book: How to do thematic analysis.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Thematic analysis 2</strong><br/><p>Continue with coding themes in this week's workshop using the in-class example; Group discussion based on the reading (Smith et al., 2015).</p></p><p><strong>Learning outcomes:</strong> L04, L05</p></div></td>",
            "topic_title": "<strong>Thematic analysis 2</strong>",
            "topic_description": "Thematic analysis 2 Continue with coding themes in this week's workshop using the in-class example; Group discussion based on the reading (Smith et al., 2015).",
            "learning_outcomes": [
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MODULE 3: Week 7. Critical approaches to research</strong><br/><p>The focus shifts in module 3 to critical theory and critical approaches to research. Interactive book videos with A/Prof Rebecca Olson introduce critical theory. Videos with Dr Zoe Staines introduce critical criminology and critical race theories. Be sure to watch the video on Project 2 where the CDA assessment is explained.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>MODULE 3: Week 7. Critical approaches to research</strong>",
            "topic_description": "MODULE 3: Week 7. Critical approaches to research The focus shifts in module 3 to critical theory and critical approaches to research. Interactive book videos with A/Prof Rebecca Olson introduce critical theory. Videos with Dr Zoe Staines introduce critical criminology and critical race theories. Be sure to watch the video on Project 2 where the CDA assessment is explained.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Thematic analysis 3</strong><br/><p>In this last workshop supporting the thematic analysis assessment, we will discuss writing up as part of analysis and share 1 page of coding with a classmate.</p></p><p><strong>Learning outcomes:</strong> L04, L05</p></div></td>",
            "topic_title": "<strong>Thematic analysis 3</strong>",
            "topic_description": "Thematic analysis 3 In this last workshop supporting the thematic analysis assessment, we will discuss writing up as part of analysis and share 1 page of coding with a classmate.",
            "learning_outcomes": [
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MODULE 3: Week 8. Critical discourse analysis</strong><br/><p>This week's interactive book focuses on exploring a key approach to data collection within the critical paradigm: critical discourse analysis (CDA). We practice popular linguistic techniques used within CDA. Engage with the Module 3 interactive book to practice how to do CDA.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>MODULE 3: Week 8. Critical discourse analysis</strong>",
            "topic_description": "MODULE 3: Week 8. Critical discourse analysis This week's interactive book focuses on exploring a key approach to data collection within the critical paradigm: critical discourse analysis (CDA). We practice popular linguistic techniques used within CDA. Engage with the Module 3 interactive book to practice how to do CDA.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Critical Discourse Analysis</strong><br/><p>This workshop focuses on the CDA assessment. We will discuss and critique research proposals, practice CDA techniques and reflect on reading and video activities. Students are encouraged to engage with the first section of the interactive book on Critical Discourse Analysis prior to this workshop.</p></p><p><strong>Learning outcomes:</strong> L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Critical Discourse Analysis</strong>",
            "topic_description": "Critical Discourse Analysis This workshop focuses on the CDA assessment. We will discuss and critique research proposals, practice CDA techniques and reflect on reading and video activities. Students are encouraged to engage with the first section of the interactive book on Critical Discourse Analysis prior to this workshop.",
            "learning_outcomes": [
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-semester break</strong><br/><p>No lectures or workshops</p></p></div></td>",
            "topic_title": "<strong>Mid-semester break</strong>",
            "topic_description": "Mid-semester break No lectures or workshops",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MODULE 3: Week 9. Online research &amp; ethics</strong><br/><p>In this week's interactive book content, A/Prof Rebecca Olson explores the context of online qualitative research and the ethical challenges of conducting qualitative inquiry online. Dr Mair Underwood provides insight into her experience of conducting digital ethnographies.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>MODULE 3: Week 9. Online research &amp; ethics</strong>",
            "topic_description": "MODULE 3: Week 9. Online research & ethics In this week's interactive book content, A/Prof Rebecca Olson explores the context of online qualitative research and the ethical challenges of conducting qualitative inquiry online. Dr Mair Underwood provides insight into her experience of conducting digital ethnographies.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ethical challenges of online research</strong><br/><p>In this workshop, we will be workshopping the CDA proposals. All students MUST attend class this week. In particular, we will discuss the ethical challenges of online research and applying these considerations to your CDA projects.</p></p><p><strong>Learning outcomes:</strong> L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Ethical challenges of online research</strong>",
            "topic_description": "Ethical challenges of online research In this workshop, we will be workshopping the CDA proposals. All students MUST attend class this week. In particular, we will discuss the ethical challenges of online research and applying these considerations to your CDA projects.",
            "learning_outcomes": [
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MODULE 3: Week 10. Analysing visual data</strong><br/><p>In this final week of module 3, A/Prof Olson explores visual qualitative analysis, with an emphasis on critical visual analysis for those who may wish to employ such techniques in their CDA assessment. Videos from Dr Mair Underwood are also included in the interactive book to offer illustration from her own research.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>MODULE 3: Week 10. Analysing visual data</strong>",
            "topic_description": "MODULE 3: Week 10. Analysing visual data In this final week of module 3, A/Prof Olson explores visual qualitative analysis, with an emphasis on critical visual analysis for those who may wish to employ such techniques in their CDA assessment. Videos from Dr Mair Underwood are also included in the interactive book to offer illustration from her own research.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Practice critical visual analysis techniques</strong><br/><p>In this workshop, we will practice critical visual techniques to qualitative research. We will also workshop CDA/CVA analysis and interpretation. Students are encouraged to engage with section 3 of the interactive book on CDA prior to attending this tutorial.</p>\n<p><strong>Please note: due to the public holiday on Monday of week 10, we will be replacing workshops scheduled for Monday of week 10 with zoom workshops - to be scheduled for Tuesday, Wednesday and Thursday. </strong>If you are in a Monday workshop, please attend the zoom workshop that fits best with your schedule in week 10. If you are in a Wednesday workshop, please attend your usually scheduled in-person workshop.</p></p><p><strong>Learning outcomes:</strong> L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Practice critical visual analysis techniques</strong>",
            "topic_description": "Practice critical visual analysis techniques In this workshop, we will practice critical visual techniques to qualitative research. We will also workshop CDA/CVA analysis and interpretation. Students are encouraged to engage with section 3 of the interactive book on CDA prior to attending this tutorial. Please note: due to the public holiday on Monday of week 10, we will be replacing workshops scheduled for Monday of week 10 with zoom workshops - to be scheduled for Tuesday, Wednesday and Thursday. If you are in a Monday workshop, please attend the zoom workshop that fits best with your schedule in week 10. If you are in a Wednesday workshop, please attend your usually scheduled in-person workshop.",
            "learning_outcomes": [
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MODULE 4: Week 11. Indigenous Methodology</strong><br/><p>In our first week of Module 4, we introduce Indigenous and emancipatory knowledge production practices. Engage with the related interactive book content on qualitative Indigenous methodologies, and watch the video on the yarning methodology reflection paper assessment.</p>\n<p><br/></p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>MODULE 4: Week 11. Indigenous Methodology</strong>",
            "topic_description": "MODULE 4: Week 11. Indigenous Methodology In our first week of Module 4, we introduce Indigenous and emancipatory knowledge production practices. Engage with the related interactive book content on qualitative Indigenous methodologies, and watch the video on the yarning methodology reflection paper assessment.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Indigenous qualitative methodology - research at the 'interface'</strong><br><p>In this workshop, we will consider what it means to adopt an Indigenous methodology and prepare for yarning in week 12.</p></br></p><p><strong>Learning outcomes:</strong> L04, L05</p></div></td>",
            "topic_title": "<strong>Indigenous qualitative methodology - research at the 'interface'</strong>",
            "topic_description": "Indigenous qualitative methodology - research at the 'interface' In this workshop, we will consider what it means to adopt an Indigenous methodology and prepare for yarning in week 12.",
            "learning_outcomes": [
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MODULE 4: Week 12. Indigenous qualitative methodology - yarning as method</strong><br/><p>In our second week of Module 4, we explore Indigenous knowledge production in more depth. Engage with the related interactive book content on yarning as method.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>MODULE 4: Week 12. Indigenous qualitative methodology - yarning as method</strong>",
            "topic_description": "MODULE 4: Week 12. Indigenous qualitative methodology - yarning as method In our second week of Module 4, we explore Indigenous knowledge production in more depth. Engage with the related interactive book content on yarning as method.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Yarning as method</strong><br/><p>In this week's workshop, we will form yarning circles to participate in yarning as an Indigenous qualitative research method. All students MUST attend class this week.</p></p><p><strong>Learning outcomes:</strong> L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Yarning as method</strong>",
            "topic_description": "Yarning as method In this week's workshop, we will form yarning circles to participate in yarning as an Indigenous qualitative research method. All students MUST attend class this week.",
            "learning_outcomes": [
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MODULE 4: Week 13. Participatory Action Research</strong><br/><p>In this week's interactive book, the final lecture for Module 4 and for the semester, A/Prof Olson and Dr Smith introduce a key emancipatory methodology: Participatory Action Research (PAR). We end the course with reflections on how the skills you have learnt over the semester are coveted by future employers. Return to the video provided in week 1, to consider the many ways you might use qualitative methods in your future careers.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>MODULE 4: Week 13. Participatory Action Research</strong>",
            "topic_description": "MODULE 4: Week 13. Participatory Action Research In this week's interactive book, the final lecture for Module 4 and for the semester, A/Prof Olson and Dr Smith introduce a key emancipatory methodology: Participatory Action Research (PAR). We end the course with reflections on how the skills you have learnt over the semester are coveted by future employers. Return to the video provided in week 1, to consider the many ways you might use qualitative methods in your future careers.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>PAR</strong><br/><p>In our final workshop, we will plan a PAR study, reflect on the course and reflect on yarning as an Indigenous qualitative research methodology.</p></p><p><strong>Learning outcomes:</strong> L04, L05</p></div></td>",
            "topic_title": "<strong>PAR</strong>",
            "topic_description": "PAR In our final workshop, we will plan a PAR study, reflect on the course and reflect on yarning as an Indigenous qualitative research methodology.",
            "learning_outcomes": [
                "L04",
                "L05"
            ]
        }
    ]
}