{
    "course_title": "Introduction to Social Research",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SOCY2019-21647-7520",
    "full_course_code": "SOCY2019-21647-7520",
    "course_code": "SOCY2019",
    "class_code": "21647",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Design methodologically coherent research across all stages of the research process"
        },
        {
            "number": "LO2.",
            "description": "Demonstrate a growing capacity to undertake research with Indigenous peoples and communities guided by Indigenous values and priorities"
        },
        {
            "number": "LO3.",
            "description": "Make ethical choices in the design and conduct of social research"
        },
        {
            "number": "LO4.",
            "description": "Apply and transfer social research skills in a variety of contexts and domains"
        },
        {
            "number": "LO5.",
            "description": "Demonstrate critical use and appraisal of Gen. AI in the research process"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Assignment 1 Problem Statement",
            "special_indicators": [],
            "weighting": "<dd>30% 700 words </dd>",
            "due_date": "<dd><p> 1/04/2025 2:00 pm</p>\n<p>\n</p><p>Submit via Course Blackboard (TurnItIn).</p></dd>",
            "learning_objectives": "L04, L05",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Paper/ Report/ Annotation, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Developing a coherent research topic, writing it up in the form of a problem statement that briefly explains to the reader why the issue is research worthy, and formulating some workable research questions are the first sets of skills that you need as researchers. This assignment enables you to develop and test your skills.</p>\n<p>There are three parts to this assignment. All the information you require to complete the assignment is provided below.</p>\n<ol>\n<li><strong>Draft a problem statement and two research questions.</strong> Your first task is to come up with a viable research topic and ask Gen.AI to draft a problem statement around that topic, and two research questions that logically connect to your problem statement, all in 300 words.</li>\n<li><strong>Critical appraisal of Gen. AI</strong>. Next, in 300-350 words, you are to critically appraise the problem statement and research questions that Gen. AI has formulated for you using the criteria provided below.</li>\n<li><strong>Revise your problem statement</strong>. Based on your assessment of the Gen. AI output, you then have the opportunity to revise your work if you wish to do. This is the problem statement and questions that you will submit for assessment. The first version is not assessed and not included in the total word count.  </li>\n</ol>\n<p><em>Selecting your topic</em></p>\n<p>In undertaking this assignment and the next assignment (Article Review), you will begin by identifying a suitable research topic that interests you. This is a skill you will already have developed in this course.</p>\n<p><em>Formulating a problem statement</em></p>\n<p>Having selected your research topic, your next task is to formulate your problem statement on your selected topic. You will also have learned how to do this in class. For a 300-word problem statement, 4-7 references should be adequate. Your problem statement then needs to be followed by two research questions that logically connect to the problem statement.</p>\n<p><em>Using Gen. AI for this assignment</em></p>\n<p>Before you start preparing your own work, you are to experiment with writing a problem statement and research questions using any Gen. AI tool. If you are new to Gen. AI, consider using ChatGPT since a user guide has been provided for you on Blackboard. Using whatever prompts you like, see how close you can get to generating a quality research problem and research questions that relate to your chosen topic. Paste your Gen. AI content (i.e. your Gen. AI produced research problem and research questions), including all prompts, into the body of your assignment. The Gen. AI content and related prompts are not included in your word count.</p>\n<p>Your next task is to critically assess the problem statement that Gen. AI has produced for you. In 300-350 words, review the problem statement and research questions and evaluate the quality of the output according to requirements of a good problem statement and research questions. In doing so, consider the following issues as identified in the course learning materials:</p>\n<ol>\n<li>Relevance</li>\n<li>Ethics</li>\n<li>Accuracy</li>\n<li>Quality</li>\n</ol>\n<p>Reflection: Provide a short personal refection on how you found the experience of using Gen. AI for this assignment. Where did you find it useful and what were its shortcomings for you? What additional work do you now need to do to revise the output so that it works as a research problem statement and strong set of research questions.</p>\n<p>This reflection is an important component of the exercise, but its purpose is to help you write a better problem statement rather than to come up with perfectly formed answers to the questions.</p>\n<p><em>Bringing the human research back in.</em></p>\n<p>You may decide that you are happy with the problem statement and research questions produced by Gen. AI and want to submit them for your assignment. Or you may decide that the work is not up to scratch and needs revision to improve it. Or you may feel the need to start from the beginning if Gen. AI is unable to produce a decent problem statement that does the job. If your critical assessment of the output tells you that it is insufficient as a piece of work, revise, rewrite or redo the problem statement and research questions as much as you think is necessary to create a quality piece of work.</p>\n<p>The maximum word count for this assignment is 700 words excluding any references, appendices, or Gen. AI prompts or output. Note: you must reference all the content from Gen. AI tools that you include. Failure to reference externally sourced, non-original work can result in Academic Misconduct. For information on how to cite Gen. AI content, see <a href=\"https://guides.library.uq.edu.au/referencing/chatgpt-and-generative-aitools#s-lg-box-22362866 (https://guides.library.uq.edu.au/referencing/chatgpt-and-generative-ai-tools#s-lg-box-22362866)\">https://guides.library.uq.edu.au/referencing/chatgpt-and-generative-aitools#s-lg-box-22362866 (https://guides.library.uq.edu.au/referencing/chatgpt-and-generative-ai-tools#s-lg-box-22362866)</a>.</p>\n<p>When preparing your reference list, ensure you use an acknowledged academic referencing system (e.g., APA). It does not matter which one you use (although endnotes are not acceptable), as long as the referencing style is consistent.</p>\n<p><strong>Note: Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Assignment 2 Article Review",
            "special_indicators": [],
            "weighting": "<dd>30% 1,300 words total </dd>",
            "due_date": "<dd><p> 6/05/2025 2:00 pm</p>\n<p>\n</p><p>Submit via Course Blackboard (TurnItIn)</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You will start to understand from your learning that <em>how </em>we conduct research is very much informed by <em>what we want to know</em>. In all research, it is important to be clear about the aims and focus of the research, not only in terms of the stated research questions, hypotheses or aims, but equally about the features of social life under study and how they are defined and understood. We have spent considerable time in this course working through these issues.</p>\n<p>Any detailed review of research on any given topic starts to reveal the different ways in which researchers approach that same topic, and – in good research – the connection between the features of the topic under study, how they are defined for practical purposes, and the research methods used to study them. Not all researchers make these links obvious and, as a reader, you have to look hard to draw the connections, if they are there at all.</p>\n<p>Using the same topic that you developed for your first assignment, your task for this second assignment is to critically review four (4) research articles that research your topic in different ways. These articles should be research-based where the authors are presenting the results of a research study with methods and data. You will struggle with this assignment if you select a literature or systematic review, or summary discussion of the topic rather than an actual research study.</p>\n<p>You will also learn from this course that Western forms of knowledge have historically been privileged over Indigenous and other non-Western ways of knowing. Researchers often replicate and reinforce this marginalisation by selecting readings and reference materials written by scholars using Western paradigms and/or that treat Indigenous and other minority groups as objects of research, but not as research partners. It is important to be aware of this bias in your work and to overcome it by actively seeking out and including research materials that highlight the important contribution to scholarship and practice of Indigenous scholars and those working outside the Western paradigm. To this end, you are strongly encouraged to find at least one research article written by authors working beyond a traditional Western paradigm, such as Indigenous or other minority scholars, where relevant to your topic.</p>\n<p>The assignment is like a standard annotated bibliography that you might have undertaken in previous courses, but it is also different in that you are specifically to focus on the methodological features of the research described and the relationship between what the researchers want to find out in the study (i.e. research questions, key concepts) and how they go about doing the research (i.e. methodological approach, research methods). In undertaking your review, reflect on the following for each article:</p>\n<ol>\n<li>What, specifically, does each paper focus on in the context of your chosen topic?</li>\n<li>What are the aims, research questions or hypotheses of the study?</li>\n<li>What concepts are being used in each article and how are they defined and operationalised?</li>\n<li>What research method(s) does the study use, and how do the methods link to the research aim(s) or question(s) – is this made clear to the reader?</li>\n</ol>\n<p>Begin your assignment with the problem statement on your chosen topic that you devised earlier (there is no need to include the research questions this time). Use the feedback from assignment 1 to improve your problem statement. Then discuss each of the four articles in turn in around 250 words each. In some cases, the information you need may not be readily apparent from the article. If so, see if you can work out the connections yourself based on your understanding of different methodological approaches and/or reflect on which information is missing in your discussion.</p>\n<p>The maximum word limit on this assignment is 1,300 words excluding the reference list and any appendices. When preparing your reference list, ensure you use an acknowledged academic referencing system (e.g., APA). It does not matter which one you use (although endnotes are not acceptable), as long as the referencing style is consistent.</p>\n<p><em>Using Gen. AI in this assignment.</em></p>\n<p>You have already learned that Gen. AI tools such as Chat PDF provide excellent article summaries, including specific summaries of the research methods used in any study. As a start, you are welcome to use a tool like Chat PDF to create your article summaries, providing the articles are available through open-source sites and you are not breaching copyright by downloading them from a university-subscribed database. But you are also likely to find that Gen. AI can only describe the concepts and the methods, even if it does this very well. It is unable to draw the connection between ontology (what do you want to know?) and epistemology (how can you know?) for each article, and it won’t be able to deduce how concepts are operationalised empirically unless the authors have spelled this out explicitly. Only you can do this by eliciting meaning from the material, making connections, and drawing on what you have already learned. If you rely only on Gen. AI outputs for this assignment, you will not develop the skills you need to design methodologically sound research projects that logically connect the research questions, aims and methods. Instead, you are strongly encouraged to ask Gen. AI to create initial summaries that you build on and extend by reading parts of the articles and adding your own ideas.</p>\n<p><strong>Note: This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</strong></p>\n<p>If you use Gen. AI to produce article summaries, you must reference all the content from Gen. AI tools that you include, and append the prompts and outputs to your assignment. Failure to reference externally sourced, non-original work can result in Academic Misconduct. For information on how to cite Gen. AI content, see <a href=\"https://guides.library.uq.edu.au/referencing/chatgpt-and-generative-ai-tools#s-lg-box-22362866 (https:// guides.library.uq.edu.au/referencing/chatgpt-and-generative-ai-tools#s-lg-box-22362866).\">https://guides.library.uq.edu.au/referencing/chatgpt-and-generative-ai-tools#s-lg-box-22362866 (https://guides.library.uq.edu.au/referencing/chatgpt-and-generative-ai-tools#s-lg-box-22362866).</a></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Assignment 3 Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>40% approximately 1000 words </dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>7/06/2025 - 21/06/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The aim of this final assessment is to enable you to demonstrate the research skills that you have acquired across all elements of the research design process including research methodologies, research questions, conceptualisation and operationalisation, sampling, recruitment, ethics, and methods. Under exam conditions, you will be provided with a series of research proposals and asked to reflect on the quality of those proposals by answering a series of specific questions about them. Researchers routinely prepare research proposals for consideration by funding agencies, research partners and and other assessors in which they set out the proposed piece of research and seek to convince the assessor that the research is important, methodologically coherent, feasible and ethical. Learning how to develop a research proposal is a core skill. In this case, you will develop these skills through critical appraisal of others' work.</p>\n<p><strong>Note: This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</strong></p>\n<p><br/></p>\n<p><br/></p>\n<p> </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The principles of social research</strong><br><p><strong>Online content (self paced) and tutorial workshop</strong></p>\n<p>This first week of class will give you a gentle introduction to some of the key features of research. Through a combination on online content and tutorial activities, you will explore the concept of research, the logic of the research process; the role of the researcher in this process; and the emerging affordances of Generative AI as a research tool. The tutorial workshop will also give you the opportunity to meet your fellow students and work collaboratively as co-researchers.</p></br></p></div></td>",
            "topic_title": "<strong>The principles of social research</strong>",
            "topic_description": "The principles of social research Online content (self paced) and tutorial workshop This first week of class will give you a gentle introduction to some of the key features of research. Through a combination on online content and tutorial activities, you will explore the concept of research, the logic of the research process; the role of the researcher in this process; and the emerging affordances of Generative AI as a research tool. The tutorial workshop will also give you the opportunity to meet your fellow students and work collaboratively as co-researchers.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The nature of the social world</strong><br><p><strong>Online introduction (self-paced) and lecture </strong><strong>masterclass </strong></p>\n<p>Our journey through the research endeavour begins with philosophy. Here, we grapple with the dual concepts of 'ontology' and 'epistemology' and learn why philosophy is relevant to our research and how it informs the very practice of what we do. Ontology relates to the question of what constitutes social reality. In simpler terms, this involves identifying the properties or features of social life that we might be interested in studying and thinking about how we define them and how they relate to one another. Next, we turn to epistemology and the question of 'how can we know?'. In practical terms, epistemology forces us to think about what counts as data for the things we want to study, however we define them. The online material will help you familiarise yourselves with questions of ontology and epistemology, the way they are approached by different research traditions, and the role of theory in our research. In the masterclass, you will work with the course coordinator to see how the different research paradigms are made practical in research.  You will also have plenty of opportunity to ask questions so that you start to feel more comfortable with these important concepts.  Don't worry, though, it takes time to feel competent with them. </p></br></p></div></td>",
            "topic_title": "<strong>The nature of the social world</strong>",
            "topic_description": "The nature of the social world Online introduction (self-paced) and lecture masterclass Our journey through the research endeavour begins with philosophy. Here, we grapple with the dual concepts of 'ontology' and 'epistemology' and learn why philosophy is relevant to our research and how it informs the very practice of what we do. Ontology relates to the question of what constitutes social reality. In simpler terms, this involves identifying the properties or features of social life that we might be interested in studying and thinking about how we define them and how they relate to one another. Next, we turn to epistemology and the question of 'how can we know?'. In practical terms, epistemology forces us to think about what counts as data for the things we want to study, however we define them. The online material will help you familiarise yourselves with questions of ontology and epistemology, the way they are approached by different research traditions, and the role of theory in our research. In the masterclass, you will work with the course coordinator to see how the different research paradigms are made practical in research.  You will also have plenty of opportunity to ask questions so that you start to feel more comfortable with these important concepts.  Don't worry, though, it takes time to feel competent with them.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Indigenous methodologies</strong><br/><p>**Due to the University-wide closures in response to Cyclone Alfred, assessment and teaching activities in this course may be revised. Please refer to the course Blackboard site for the revised teaching and assessment plan.**</p>\n<p><strong>Online introduction (self-paced) and lecture masterclass </strong></p>\n<p>What happens to research when the researched become the researchers? (Smith 2021: 239). This week introduces you to the importance of Indigenous methodologies. This begins with an exploration of the political issues behind knowledge production and the impact that this has on Indigenous peoples. These political power dynamics have informed the development and application of Indigenous methodologies in the academy. The purpose of Indigenous methodologies is to ensure that Indigenous peoples can not only contribute to future research outcomes, but also regain control over the parameters of research that impacts upon Indigenous peoples and communities. This requires Indigenous peoples, communities, and scholars to introduce Indigenous concepts and methods that may not align with existing Western research paradigms to reveal the multiple perspectives on subjects or topics of inquiry. Indigenous methodologies ultimately seek to foreground Indigenous knowledges and perspectives in research.</p></p></div></td>",
            "topic_title": "<strong>Indigenous methodologies</strong>",
            "topic_description": "Indigenous methodologies **Due to the University-wide closures in response to Cyclone Alfred, assessment and teaching activities in this course may be revised. Please refer to the course Blackboard site for the revised teaching and assessment plan.** Online introduction (self-paced) and lecture masterclass What happens to research when the researched become the researchers? (Smith 2021: 239). This week introduces you to the importance of Indigenous methodologies. This begins with an exploration of the political issues behind knowledge production and the impact that this has on Indigenous peoples. These political power dynamics have informed the development and application of Indigenous methodologies in the academy. The purpose of Indigenous methodologies is to ensure that Indigenous peoples can not only contribute to future research outcomes, but also regain control over the parameters of research that impacts upon Indigenous peoples and communities. This requires Indigenous peoples, communities, and scholars to introduce Indigenous concepts and methods that may not align with existing Western research paradigms to reveal the multiple perspectives on subjects or topics of inquiry. Indigenous methodologies ultimately seek to foreground Indigenous knowledges and perspectives in research.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Formulating research questions</strong><br/><p><strong>Online content (self-paced) and tutorial workshop</strong></p>\n<p>The fundamental aim of research is to find out something that we did not know before about how the world works. This may involve: seeking explanations for why people behave in particular ways, understanding the drivers and effects of social phenomena (e.g., crime or racism), delineating the relationships between social processes (e.g., those between ethnicity and educational attainment), and assessing whether policy interventions have the desired effect. This week focuses on the art of designing good research questions or hypotheses, based on a clear understanding of which ontological properties and processes we are focusing on and what kind of data we might need to answer them. We will learn how good research design depends a clear understanding of the problem or phenomena under study (a problem statement) based on a review of prior research (a literature review) and the careful articulation of well thought-out research questions or hypotheses. In your tutorial workshops, you you will be given the opportunity to practice the art of formulating good research questions and connecting them with particular research paradigms. You'll also learn how Gen. AI can assist in this process, but also explore its limits. You'll also have the opportunity to work through your first assignment with your tutor. </p></p></div></td>",
            "topic_title": "<strong>Formulating research questions</strong>",
            "topic_description": "Formulating research questions Online content (self-paced) and tutorial workshop The fundamental aim of research is to find out something that we did not know before about how the world works. This may involve: seeking explanations for why people behave in particular ways, understanding the drivers and effects of social phenomena (e.g., crime or racism), delineating the relationships between social processes (e.g., those between ethnicity and educational attainment), and assessing whether policy interventions have the desired effect. This week focuses on the art of designing good research questions or hypotheses, based on a clear understanding of which ontological properties and processes we are focusing on and what kind of data we might need to answer them. We will learn how good research design depends a clear understanding of the problem or phenomena under study (a problem statement) based on a review of prior research (a literature review) and the careful articulation of well thought-out research questions or hypotheses. In your tutorial workshops, you you will be given the opportunity to practice the art of formulating good research questions and connecting them with particular research paradigms. You'll also learn how Gen. AI can assist in this process, but also explore its limits. You'll also have the opportunity to work through your first assignment with your tutor.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Conceptualisation to operationalisation</strong><br/><p><strong>Online introduction (self-paced) and lecture masterclass</strong></p>\n<p>By this point of the course, we have learnt how to formulate research questions that are of interest to us, identify the features of social life bound up in those questions, and thought through the kind of data that we need and can generate in seeking answers to those questions. This week we take a step forward in beginning to 'operationalise' our research questions, theories and objects of study, such that abstract ideas and concepts can be measured, observed, tested and understood. While some concepts (e.g., age and height) are relatively easy to measure, other social science contents such as power or inequality are intangible and thus far harder to define, examine and understand.  In the lecture masterclass, you are</p>\n<p>given a guided tour into the conceptualisation of concepts and the way they can be operationalised for research purposes. </p></p></div></td>",
            "topic_title": "<strong>Conceptualisation to operationalisation</strong>",
            "topic_description": "Conceptualisation to operationalisation Online introduction (self-paced) and lecture masterclass By this point of the course, we have learnt how to formulate research questions that are of interest to us, identify the features of social life bound up in those questions, and thought through the kind of data that we need and can generate in seeking answers to those questions. This week we take a step forward in beginning to 'operationalise' our research questions, theories and objects of study, such that abstract ideas and concepts can be measured, observed, tested and understood. While some concepts (e.g., age and height) are relatively easy to measure, other social science contents such as power or inequality are intangible and thus far harder to define, examine and understand.  In the lecture masterclass, you are given a guided tour into the conceptualisation of concepts and the way they can be operationalised for research purposes.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The importance of a good sampling framework</strong><br/><p><strong>Online content (self-paced) and tutorial workshop</strong></p>\n<p>When designing our research projects, we often cannot study every instance of the phenomena that we are interested in, regardless of whether our units of analysis are individuals, social groups, households, localities or countries. In these situations, we must select a number of 'cases' which are available to us from the total number of cases for detailed study. The process of selecting these cases in a logical and defensible manner, deciding how many we need, and determining the extent to which we can generalise from those cases to the broader population is referred to as 'sampling'. In this week, we will introduce and discuss the main sampling procedures available to social researchers. Our goal is twofold: first, to ensure that our sampling framework is as rigorous as possible; second, to ensure that such framework is consistent with our research questions, data and epistemological approach. You will also work through some of the strategies for recruiting research participants once you've sampled them, and you will have the chance to discuss your second assignment with your tutor. </p></p></div></td>",
            "topic_title": "<strong>The importance of a good sampling framework</strong>",
            "topic_description": "The importance of a good sampling framework Online content (self-paced) and tutorial workshop When designing our research projects, we often cannot study every instance of the phenomena that we are interested in, regardless of whether our units of analysis are individuals, social groups, households, localities or countries. In these situations, we must select a number of 'cases' which are available to us from the total number of cases for detailed study. The process of selecting these cases in a logical and defensible manner, deciding how many we need, and determining the extent to which we can generalise from those cases to the broader population is referred to as 'sampling'. In this week, we will introduce and discuss the main sampling procedures available to social researchers. Our goal is twofold: first, to ensure that our sampling framework is as rigorous as possible; second, to ensure that such framework is consistent with our research questions, data and epistemological approach. You will also work through some of the strategies for recruiting research participants once you've sampled them, and you will have the chance to discuss your second assignment with your tutor.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>An ethical approach to research</strong><br/><p><strong>Online introduction (self-paced) and lecture masterclass</strong></p>\n<p>This week examines the ethical and moral obligations that researchers have whenever they conduct research with 'human subjects'. Research ethics require researchers to weigh up the balance between the pursuit of knowledge and the rights of research participants, and the perceived benefits of the research against the potential costs or risks for those who participate.</p>\n<p>In the early stages of research design, these issues are generally addressed by obtaining 'ethical clearance' from a university or research body, and abiding by ethical codes laid out for researchers working with Indigenous and non-Indigenous peoples and communities. Yet ethical practice extends beyond ethics applications and requires researchers to continue making ethical decisions over the course of their research and even after the research account is written up via responsible authorship. The online material will provide you with an understanding of the principles of responsible and ethical research with Indigenous and non-Indigenous peoples. The lecture masterclass will help you develop the skills necessary to resolve ethical dilemmas as they arise at all stages of the research process.</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>An ethical approach to research</strong>",
            "topic_description": "An ethical approach to research Online introduction (self-paced) and lecture masterclass This week examines the ethical and moral obligations that researchers have whenever they conduct research with 'human subjects'. Research ethics require researchers to weigh up the balance between the pursuit of knowledge and the rights of research participants, and the perceived benefits of the research against the potential costs or risks for those who participate. In the early stages of research design, these issues are generally addressed by obtaining 'ethical clearance' from a university or research body, and abiding by ethical codes laid out for researchers working with Indigenous and non-Indigenous peoples and communities. Yet ethical practice extends beyond ethics applications and requires researchers to continue making ethical decisions over the course of their research and even after the research account is written up via responsible authorship. The online material will provide you with an understanding of the principles of responsible and ethical research with Indigenous and non-Indigenous peoples. The lecture masterclass will help you develop the skills necessary to resolve ethical dilemmas as they arise at all stages of the research process.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Generating statistical data: social surveys</strong><br/><p><strong>Online content (self-paced) and tutorial workshop</strong></p>\n<p>In this week, we focus on specific approaches to data collection, often referred to as research methods. However, as you will learn, the selection of methods is not simply a technical</p>\n<p>task. Instead, it is critically influenced by the ontological properties of the social phenomena under study, the research questions posed, and epistemological beliefs about knowledge</p>\n<p>and data. As Indigenous researchers have critically reported, statistical data are not neutral and do not simply record the 'facts' despite their status of having scientific rigor. Instead, they collect and report particular versions of reality that, in the case of Indigenous populations, are typically deficit focussed and do not include the kinds of data that Indigenous people and communities find useful. We begin our methodological foray into statistics via the online content by introducing and discussing one of the most widely used instruments in social research: the social survey. You will learn the logic of survey research, its forms and uses, some basic survey design principles, and Indigenous critiques of survey data. Understanding the science behind surveys also requires an appreciation of the importance of measurement in surveys and the strategies for ensuring constructs are both reliable and valid measures of the phenomenon under study. In your tutorial workshops, you will have a hands-on opportunity to critically engage with surveys and their design, including from Indigenous perspectives, so that you become ethically informed designers and users of survey and survey data.</p></p></div></td>",
            "topic_title": "<strong>Generating statistical data: social surveys</strong>",
            "topic_description": "Generating statistical data: social surveys Online content (self-paced) and tutorial workshop In this week, we focus on specific approaches to data collection, often referred to as research methods. However, as you will learn, the selection of methods is not simply a technical task. Instead, it is critically influenced by the ontological properties of the social phenomena under study, the research questions posed, and epistemological beliefs about knowledge and data. As Indigenous researchers have critically reported, statistical data are not neutral and do not simply record the 'facts' despite their status of having scientific rigor. Instead, they collect and report particular versions of reality that, in the case of Indigenous populations, are typically deficit focussed and do not include the kinds of data that Indigenous people and communities find useful. We begin our methodological foray into statistics via the online content by introducing and discussing one of the most widely used instruments in social research: the social survey. You will learn the logic of survey research, its forms and uses, some basic survey design principles, and Indigenous critiques of survey data. Understanding the science behind surveys also requires an appreciation of the importance of measurement in surveys and the strategies for ensuring constructs are both reliable and valid measures of the phenomenon under study. In your tutorial workshops, you will have a hands-on opportunity to critically engage with surveys and their design, including from Indigenous perspectives, so that you become ethically informed designers and users of survey and survey data.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-semester break</strong><br/><p>In this part of the course, we begin to focus on specific approaches to research, often referred to as research methods. However, as we will show, the selection of methods is not simply a technical task. Instead, it is critically influenced by the ontological properties of the social phenomena under study, the research questions posed, and epistemological beliefs about knowledge and data. We begin this methodological foray by introducing and discussing one of the most widely used instruments in social research: the social survey. Specifically, in this module we will outline the logic of survey research, its forms and uses, and some basic survey design principles. Understanding the science behind surveys also requires an appreciation of the importance of measurement in surveys and the strategies for ensuring constructs are both reliable and valid measures of the phenomenon you want to study.</p></p></div></td>",
            "topic_title": "<strong>Mid-semester break</strong>",
            "topic_description": "Mid-semester break In this part of the course, we begin to focus on specific approaches to research, often referred to as research methods. However, as we will show, the selection of methods is not simply a technical task. Instead, it is critically influenced by the ontological properties of the social phenomena under study, the research questions posed, and epistemological beliefs about knowledge and data. We begin this methodological foray by introducing and discussing one of the most widely used instruments in social research: the social survey. Specifically, in this module we will outline the logic of survey research, its forms and uses, and some basic survey design principles. Understanding the science behind surveys also requires an appreciation of the importance of measurement in surveys and the strategies for ensuring constructs are both reliable and valid measures of the phenomenon you want to study.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Eliciting experience and meaning through interview</strong><br/><p><strong>Online content (self-paced) and tutorial workshop</strong></p>\n<p>Another commonly used tool for generating data in the social sciences is the interview. Here, researchers gain access to participants' views and experiences through the medium of talk, based on asking them a series of questions. Interviews are often a means of administering a survey, and hence adopted within a highly scientific paradigm. However, interviews are more commonly associated with (i) a humanistic paradigm that places people as social actors, and their meanings and experiences, at the core of the research endeavour; and (ii) a discursive approach to the study of social life that uses language, talk and text as a lens for understanding the socially constructed nature of reality and the power relations bound up in it. In this week, you will come to see the ontological properties of social life that interviewing helps to explore, consider epistemological issues associated with interviewing (including the socially constructed nature of interview talk or discourse) and identify different forms of interviews (semi-structured, focus groups, narrative/life history, and Dadirri - a term belonging to the language of the Ngangikurungkurr people of the Daly River in the Northern Territory that describes an Indigenous research methodology which centres Indigenous voices and knowledge through deep, comtemplative and reciprocal listening and reflection. You will also develop practical strategies on how to conduct interviews to generate culturally and methodologically sound interview data. </p></p></div></td>",
            "topic_title": "<strong>Eliciting experience and meaning through interview</strong>",
            "topic_description": "Eliciting experience and meaning through interview Online content (self-paced) and tutorial workshop Another commonly used tool for generating data in the social sciences is the interview. Here, researchers gain access to participants' views and experiences through the medium of talk, based on asking them a series of questions. Interviews are often a means of administering a survey, and hence adopted within a highly scientific paradigm. However, interviews are more commonly associated with (i) a humanistic paradigm that places people as social actors, and their meanings and experiences, at the core of the research endeavour; and (ii) a discursive approach to the study of social life that uses language, talk and text as a lens for understanding the socially constructed nature of reality and the power relations bound up in it. In this week, you will come to see the ontological properties of social life that interviewing helps to explore, consider epistemological issues associated with interviewing (including the socially constructed nature of interview talk or discourse) and identify different forms of interviews (semi-structured, focus groups, narrative/life history, and Dadirri - a term belonging to the language of the Ngangikurungkurr people of the Daly River in the Northern Territory that describes an Indigenous research methodology which centres Indigenous voices and knowledge through deep, comtemplative and reciprocal listening and reflection. You will also develop practical strategies on how to conduct interviews to generate culturally and methodologically sound interview data.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Undertaking ethnography  and observation</strong><br/><p><strong>Online content (self-paced) and tutorial workshop</strong></p>\n<p>'Ethnography' is an umbrella term for a variety of research methods used to collect data through direct observation of and communication with the people under study. Ethnography has human subjectivity (i.e., the different meanings that people attach to the world around them) as its focus, and sees the role of the researcher as attempting to understand or interpret how those meanings are derived. Researchers operating from this paradigm often use methods of participant-observation that allow them to observe and interact with people in specific contexts to elicit rich detail about their lives. Through the online material, you will be introduced to the tradition of ethnography and the method of participant observation. You will also become familiar with the ontological and epistemological bases of these methods, the kinds of data that can be gathered through them, the important role played by the researcher in the research process, and the ways in which data gathered through participant observation might be presented. These kinds of questions require us to be critical in our adoption of ethnography particularly given its colonial legacies as a method of gazing upon and writing about the 'exotic other' in Australia and internationally. In the tutorial workshop, you will develop your skills in field research and observational methods through practice with your peers and reflection on ways to reduce the power disparity between researcher and researched using decolonising methodologies.</p></p></div></td>",
            "topic_title": "<strong>Undertaking ethnography  and observation</strong>",
            "topic_description": "Undertaking ethnography  and observation Online content (self-paced) and tutorial workshop 'Ethnography' is an umbrella term for a variety of research methods used to collect data through direct observation of and communication with the people under study. Ethnography has human subjectivity (i.e., the different meanings that people attach to the world around them) as its focus, and sees the role of the researcher as attempting to understand or interpret how those meanings are derived. Researchers operating from this paradigm often use methods of participant-observation that allow them to observe and interact with people in specific contexts to elicit rich detail about their lives. Through the online material, you will be introduced to the tradition of ethnography and the method of participant observation. You will also become familiar with the ontological and epistemological bases of these methods, the kinds of data that can be gathered through them, the important role played by the researcher in the research process, and the ways in which data gathered through participant observation might be presented. These kinds of questions require us to be critical in our adoption of ethnography particularly given its colonial legacies as a method of gazing upon and writing about the 'exotic other' in Australia and internationally. In the tutorial workshop, you will develop your skills in field research and observational methods through practice with your peers and reflection on ways to reduce the power disparity between researcher and researched using decolonising methodologies.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Using administrative &amp; naturally occurring data</strong><br/><p><strong>Online content (self-paced) and tutorial workshop</strong></p>\n<p>The approaches to research that we have explored so far involve the collection or generation of data through primary research. However, there is also a vast corpus of existing data that researchers can sometimes access to answer research questions they may be interested in. These data take two forms. The first is existing datasets that have been generated by large research teams for other researchers to use (e.g., large-scale social surveys administered as part of a national program of research). The second is what we might term 'naturally occurring data'; that is, data that have been produced independently of the actions of the researcher. These data may take the form of government and other administrative datasets; online blogs, posts and other social-media interactions; company databases on clients and users; and recordings of telephone and other 'naturally-occurring' conversations. These datasets differ widely in terms of the features of social life they offer up for study, the kinds of research questions that they can answer, and the forms of analysis that they can be subjected to. This week, the online material introduces you to the different types of secondary and naturally occurring data and the ways in which it is used. It also introduces you to the concept of Indigenous Data Sovereignty, enshrined in the United Nations Declaration on the Rights of Indigenous Peoples, which asserts Indigenous ownership and control over data pertaining to Indigenous peoples and ensures those data are used to enhance their collective well-being. In the tutorial workshop, you will have an opportunity to develop skills in designing research projects that use naturally occurring data, and using them to answer your research questions while being proactive around Indigenous data sovereignty. In doing so, you will come to see some of the opportunities but also the challenges that arise from dealing with data that you had no involvement in creating. In this final tutorial workshop, we will also work through the final piece of assessment (the exam) with you so you know what to expect. </p></p></div></td>",
            "topic_title": "<strong>Using administrative &amp; naturally occurring data</strong>",
            "topic_description": "Using administrative & naturally occurring data Online content (self-paced) and tutorial workshop The approaches to research that we have explored so far involve the collection or generation of data through primary research. However, there is also a vast corpus of existing data that researchers can sometimes access to answer research questions they may be interested in. These data take two forms. The first is existing datasets that have been generated by large research teams for other researchers to use (e.g., large-scale social surveys administered as part of a national program of research). The second is what we might term 'naturally occurring data'; that is, data that have been produced independently of the actions of the researcher. These data may take the form of government and other administrative datasets; online blogs, posts and other social-media interactions; company databases on clients and users; and recordings of telephone and other 'naturally-occurring' conversations. These datasets differ widely in terms of the features of social life they offer up for study, the kinds of research questions that they can answer, and the forms of analysis that they can be subjected to. This week, the online material introduces you to the different types of secondary and naturally occurring data and the ways in which it is used. It also introduces you to the concept of Indigenous Data Sovereignty, enshrined in the United Nations Declaration on the Rights of Indigenous Peoples, which asserts Indigenous ownership and control over data pertaining to Indigenous peoples and ensures those data are used to enhance their collective well-being. In the tutorial workshop, you will have an opportunity to develop skills in designing research projects that use naturally occurring data, and using them to answer your research questions while being proactive around Indigenous data sovereignty. In doing so, you will come to see some of the opportunities but also the challenges that arise from dealing with data that you had no involvement in creating. In this final tutorial workshop, we will also work through the final piece of assessment (the exam) with you so you know what to expect.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Assessing causality: Experimental methods</strong><br/><p><strong>Online content (self-paced)</strong></p>\n<p>Experimental research has a long tradition as a research strategy within the natural sciences. In the social sciences, experiments are becoming a more popular research approach to conduct evaluation research that investigates the effects of particular interventions (e.g., policies and programs). Given its scientific legacy, experimental research draws on many of the same principles and assumptions of other scientific methods in its quest to generate and test evidence about causal relationships in a specific setting or context or among a specific group of people (e.g., students in a class or patients undergoing a form of treatment). While experiments are a powerful way of determining causality, they are not suited to answer all research questions. In this week, you will be introduced to the logic and design of experimental research, the types of research questions that can be answered using these methods, and some of the ethical challenges involved in the process. There will be no tutorial workshops associated with this topic. Instead,  the material is available online for those who want to up-skill their research methods with a more advanced set of research approaches. </p></p></div></td>",
            "topic_title": "<strong>Assessing causality: Experimental methods</strong>",
            "topic_description": "Assessing causality: Experimental methods Online content (self-paced) Experimental research has a long tradition as a research strategy within the natural sciences. In the social sciences, experiments are becoming a more popular research approach to conduct evaluation research that investigates the effects of particular interventions (e.g., policies and programs). Given its scientific legacy, experimental research draws on many of the same principles and assumptions of other scientific methods in its quest to generate and test evidence about causal relationships in a specific setting or context or among a specific group of people (e.g., students in a class or patients undergoing a form of treatment). While experiments are a powerful way of determining causality, they are not suited to answer all research questions. In this week, you will be introduced to the logic and design of experimental research, the types of research questions that can be answered using these methods, and some of the ethical challenges involved in the process. There will be no tutorial workshops associated with this topic. Instead,  the material is available online for those who want to up-skill their research methods with a more advanced set of research approaches.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Digital methods and e-research</strong><br/><p><strong>Online content (self-paced)</strong></p>\n<p>In this final week you are introduced to a growing area of research: digital methods and e-research. Through the online material, you will be introduced to the role of digital media and new technologies in social research, both as a means to enhance traditional research designs (e.g., ethnographic or survey research) and as a vehicle for new and exciting research approaches (e.g., text mining and network analyses of social media). Consistent with the propositions discussed throughout the course, you will learn that digital methods can be deployed to answer research questions from multiple epistemological perspectives, informed by different ways of conceptualising the nature of the social world. There will be no tutorial workshops associated with this topic. Instead,  the material is available online for those who want to up-skill their research methods with a  more advanced set of research approaches. </p></p></div></td>",
            "topic_title": "<strong>Digital methods and e-research</strong>",
            "topic_description": "Digital methods and e-research Online content (self-paced) In this final week you are introduced to a growing area of research: digital methods and e-research. Through the online material, you will be introduced to the role of digital media and new technologies in social research, both as a means to enhance traditional research designs (e.g., ethnographic or survey research) and as a vehicle for new and exciting research approaches (e.g., text mining and network analyses of social media). Consistent with the propositions discussed throughout the course, you will learn that digital methods can be deployed to answer research questions from multiple epistemological perspectives, informed by different ways of conceptualising the nature of the social world. There will be no tutorial workshops associated with this topic. Instead,  the material is available online for those who want to up-skill their research methods with a  more advanced set of research approaches.",
            "learning_outcomes": []
        }
    ]
}