{
    "course_title": "Human Bodies, Culture & Society",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SOSC2190-21652-7520",
    "full_course_code": "SOSC2190-21652-7520",
    "course_code": "SOSC2190",
    "class_code": "21652",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "describe how human bodies have social and cultural dimensions, and provide examples to demonstrate these dimensions."
        },
        {
            "number": "LO2.",
            "description": "appreciate how social and cultural factors have shaped how bodies are lived in different cultures, and at different times, and describe this process of shaping (including in relation to your own lived experience of the body)."
        },
        {
            "number": "LO3.",
            "description": "articulate some of the differences between biomedical approaches to human bodies, and social science approaches to human bodies."
        },
        {
            "number": "LO4.",
            "description": "create a critical essay on the human body by (1) identifying a real-world issue about how bodies are lived, (2) designing a viable research question to explore this issue among a specific group of people, (3) compiling and analysing the academic literature to answer your research question, and (4) presenting your findings in written form."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "The beginnings of your essay",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p> 2/04/2025 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This exercise is designed to assist you in developing your ability to (1) design a viable research question, and (2) locate relevant and appropriate sources, and to evaluate their usefulness in a research context. These are skills you will require if you go on to work in academia, or as a research or policy officer within government and non-profit sectors.</p>\n<p>Your essay will be based on a question of your choosing (see essay instructions). This exercise (the annotated bibliography) is designed to ensure that you:</p>\n<ul>\n<li>have chosen an appropriate (i.e. focussed on the social and cultural aspects of bodies) topic for your essay</li>\n<li>have chosen a viable topic for your essay (i.e., there is enough literature available to answer your question)</li>\n<li>have found sources that will allow you to answer your chosen question.</li>\n</ul>\n<p>Only include academic sources in your annotated bibliography. You need to only include academic sources so that the marker can see that there is enough literature for you to answer your chosen question.</p>\n<ol>\n<li>Using the instructions for the individual essay to <strong>choose a media example</strong> and <strong>design a question for your essay</strong>. Your <strong>question, the reference for your media example, and a brief description of your media example, must be provided at the beginning</strong> of your annotated bibliography so that the marker can judge how well you have chosen your media, and how well your bibliography covers your specific topic.</li>\n<li>Using the library catalogue, electronic databases, and associated literature search skills, locate books and journal articles relevant to your chosen topic. </li>\n<li>Select the <strong>seven</strong> most relevant sources. No source is perfect so consider the limitations of the source and whether the source’s utility outweighs these limitations. In both your annotated bibliography and essay <strong>the focus should be on the social and cultural aspects of the body</strong> (not health or psychology). Obviously health will be relevant to many of your topics, but you need to approach it from a social and cultural perspective (e.g. How is health socially constructed? How is the medical gaze socially constructed? etc). Whilst psychological or health literature can be used to explore the impact of a certain bodily ideal or practice, the focus of your annotated bibliography (and final essay) should be on the social and cultural aspects of the body (such as the ideals and practices themselves), rather than specific health and medical implications of certain bodies or body practices.</li>\n<li>Create from these sources an <strong>annotated bibliography</strong> that sets out the bibliographic details for each source and write a few sentences or a short paragraph (up to <strong>150 words</strong>) about it. Provide the bibliographic details for the source in APA referencing style (guides available on UQ library website) and be consistent. The paragraph about the source – the annotation – should set out what kind of work the source is, briefly describe its contents and give some indication of its worth or significance for your essay (i.e., how it will help build your argument). <em>So, your annotation should include a brief description of the content of the source, but your focus should be on how the source will contribute to your essay</em>. Use the annotation to demonstrate why you have considered this source to be relevant and appropriate to your essay topic. For example, you may discuss the source’s limitations, but how these limitations are outweighed by its benefits.</li>\n</ol>\n<p><br/></p>\n<p>Below is an example of an annotation. This annotation is completely fictitious and does not refer to a real source.</p>\n<p>Research question: How is tattoo used to construct gender in Samoa?</p>\n<p>Underwood, M. (2019). <em>Gender and tattooing in the Samoan context.</em> Sydney: Parker Publications.<strong> </strong></p>\n<p>This book presents the results of ethnographic fieldwork conducted in Samoa during the 1990s. It provides the most comprehensive discussion of Samoan tattooing available. Through its detailed descriptions of tattoo practices it will provide an invaluable resource for my essay. However, the author tends to treat gender as if it were a category rather than a relationship as she focuses on women and only mentions men in passing. Therefore, the information provided in this book will need to be supplemented with other sources that provide more detail on Samoan men’s tattoo practices. Also, the author does not provide an in-depth discussion of the cultural context of the tattoo practices so it will be supplemented with other literature on Samoan gender relations.</p>\n<p><br/></p>\n<p>The point is to fully reference the source (using APA referencing style) and include a paragraph that indicates that you understand the source and its utility for your research. The annotation should emphasise the relevance of the source to the essay question you have chosen. Also, you might comment on the scope and purpose of the work (e.g., Is it an overview? Is it a case study? Is it a critique?); the origin or context of the source (e.g., Was it presented at a conference? Is it a rebuttal of some other specific work?); the format of the source and its length (Is it a book? Is it a book chapter? Is it a journal article?); as well as on the content of the source (What is its principal argument? or its theoretical position?), depending on what you consider most relevant about that particular work.</p>\n<p>Set the annotated bibliography out neatly in alphabetical order (i.e. from A-Z) by author’s surname.</p>\n<p>Submit your annotated bibliography through Turnitin on Blackboard.</p>\n<p>There is more information on the construction of annotated bibliographies in the School of Social Science Guide for Written Assessments (which has been added to your learning resources on Blackboard).</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>Student use of AI: </strong>For all graded assessments in this course, use of Artificial Intelligence (AI) software is not permitted. Graded assessments evaluate students' abilities, skills and knowledge without the aid of AI. Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Discussion of plan",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p> 28/04/2025 - 19/05/2025</p>\n<p>\n</p><p>Book a time during your the third hour of class in weeks 9, 10, 11 or 12.</p></dd>",
            "learning_objectives": null,
            "mode": "Oral",
            "category": "Practical/ Demonstration",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This task is designed to ensure you:</p>\n<ul>\n<li>are on track to complete an essay that meets the requirements</li>\n<li>that you have considered the feedback you were given on your annotated bibliography and have made changes to your essay plans where appropriate</li>\n<li>receive further feedback on your essay plans so that you can produce your best essay possible.</li>\n</ul>\n<p>For this assessment you will prepare a one-page plan of your essay (in dot points) submit it via Turnitin on Blackboard prior to your plan discussion, and discuss it with course staff on <strong>Zoom</strong> (the link will be circulated closer to the time) at your designated time. Please make sure you arrive on Zoom at least 10 minutes before your time and have your essay plan open on your device and ready to share with course staff. You will be asked to explain your plan, and what you have done to address the feedback you received on your annotated bibliography. This discussion of your essay plan will last approximately <strong>5 minutes</strong> (depending on the number of students enrolled), and it will take place in the third hour of class during weeks 9, 10, 11 or 12 (depending on when you book).</p>\n<p>You do not have to prepare a presentation. You just need to prepare your plan, and come ready to answer questions about it.</p>\n<p>Please book a time through the <strong>Google doc</strong> that will be circulated closer to the time. Please ensure you book a time ASAP, so that you get the time that suits you best. You may want to have more time to prepare your plan, and therefore book in for week 11, or 12, or you may want more time to write your essay, and therefore book in for weeks 9 or 10. Consider the timing of your assessments in other courses when you make your decision. <strong>You must book a time for your plan discussion by the end of week 6.</strong> While your fellow students are discussing their plans with the tutor you can study independently.</p>\n<p><strong>If you are unwell </strong>at the designated time of your plan discussion and cannot go ahead via Zoom please contact the course coordinator as soon as possible to arrange an alternative time.</p>\n<p>During the discussion of your essay plan course staff will assess you according to the marking criteria.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>Student use of AI: </strong>For all graded assessments in this course, use of Artificial Intelligence (AI) software is not permitted. Graded assessments evaluate students' abilities, skills and knowledge without the aid of AI. Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit your plan via Turnitin on Blackboard prior to your plan discussion time, and then have your plan open on your device ready to share during your plan discussion.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Final essay",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>35%</dd>",
            "due_date": "<dd><p> 30/05/2025 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This task is designed to assist you in developing your ability to:</p>\n<ol>\n<li>identify a real-world issue and design a research question to explore it;</li>\n<li>locate, evaluate and utilise academic literature to construct an argument, and</li>\n<li>write in a clear and logically structured way to convey your argument.</li>\n</ol>\n<p>These are skills you will require if you go on to work in academia, or as a research or policy officer within government and non-profit sectors.</p>\n<p>Students will follow these steps in order to construct their own question and answer it in <strong>2000 words</strong> or less.</p>\n<p><strong>Step 1: Identify a real-world issue</strong></p>\n<p>Students will identify a real-world issue that relates to the social and cultural aspects of human bodies that has appeared in the media after the 1st of January 2025. To do this you could read current online news or newspapers, or search a database such as Google News (e.g. search for terms such as body, body image, body decoration, body modification, bodybuilding, muscle, fat, thin, cosmetic surgery etc). This real world issue will be the starting point for your annotated bibliography and essay.</p>\n<p>Some examples (these are older so you cannot use these, please find your own):</p>\n<ol>\n<li>Race influences our response to cosmetic surgery – <em>Cosmos Magazine</em> 26th January 2019 <a href=\"https://cosmosmagazine.com/society/race-influences-our-response-to-cosmetic-surgery\">https://cosmosmagazine.com/society/race-influences-our-response-to-cosmetic-surgery</a> </li>\n<li>The Sudden Demise Of Ms. Olympia Competition In Women’s Bodybuilding – <em>Fitness Volt</em> 27th February 2019 <a href=\"https://fitnessvolt.com/34157/ms-olympia-women-bodybuilding/\">https://fitnessvolt.com/34157/ms-olympia-women-bodybuilding/</a></li>\n<li>Body modification – when consent is not a defence – <em>The Conversation</em> February 13th 2019 <a href=\"http://theconversation.com/body-modification-when-consent-is-not-a-defence-87816\">http://theconversation.com/body-modification-when-consent-is-not-a-defence-87816</a></li>\n<li>Meet 4 of the Last Ladies in China with Bound Feet - <em>That’s Magazine</em> February 14th 2019 <a href=\"http://www.thatsmags.com/shanghai/post/26891/tradition-bound-the-last-ladies-with-bound-feet\">http://www.thatsmags.com/shanghai/post/26891/tradition-bound-the-last-ladies-with-bound-feet</a></li>\n</ol>\n<p><strong>Step 2: Design your own research question</strong></p>\n<p>On the basis of the issues raised by your chosen media example, and the available academic literature, design your own research question. So, think about what your question might be and then go look at the academic literature and make sure you will be able to answer it (i.e., that there is enough literature available).</p>\n<p>Questions that lead to a yes or no answer don’t make for a good argument. e.g., ‘does the media contribute to eating disorders?’</p>\n<p>Neither do questions where you have pre-empted the answer. e.g., ‘how do high heels oppress women?’ Or ‘how do high heels increase a woman’s sexual attractiveness?’</p>\n<p>It is much preferable to ask a question that leads to you revealing the answer in your essay e.g., ‘how do high heels socially construct gender?’ Then you can talk about how high heels are constructed as feminine (at least in modern Western societies), how they construct sexual attractiveness as a key feature of femininity and women’s worth, how they limit women’s movements (running, traversing uneven ground etc.) and therefore construct them as passive, as dependent, and as having to trust in their environment to be safe/ or on others to protect them etc.</p>\n<p>‘How’ questions are good as they don’t just ask if something is the case or not, but ask the writer to discuss how something is the case or not. e.g., rather than ‘does the media contribute to eating disorders?’ ask ‘how does the media contribute to eating disorders?’.</p>\n<p><strong>Narrow your research to one cultural context (e.g. country, region, subculture etc)</strong> so you can go in depth, and so that you can acknowledge and do justice to the cultural specificity of constructions of bodies. You will need to make sure that there is enough literature for you to be able to narrow down and still have adequate depth. </p>\n<p> </p>\n<p>You could use this formula to construct your question:</p>\n<p>“How does [insert body modification or body decoration practice] construct [insert social boundary] among [insert society]?”.</p>\n<p>For example, using this formula you could come up with questions such as “How do breast surgeries construct gender in Western societies?” or “How does cosmetic surgery construct race among Koreans?”. In some cases your question may need to be broader as there may be a number of social boundaries being socially constructed e.g. “How does tattoo construct social boundaries among the Maori?”.</p>\n<p> </p>\n<p>In all cases you will probably have to work backwards from the literature to your question. That is, you will have to see what literature is available on a topic and then work out what question you can answer using that literature. There is no point constructing a question such as “how do hairstyles construct subcultural boundaries among Australian surfers?” If there is no literature you can use to answer the question.</p>\n<p>You may have some false starts, so allow enough time to change your question if you need to. You may come up with a topic and find you can’t explore it as there is not enough literature. Then you will have to come up with another topic. Allow time for this.</p>\n<p>It is up to the student to <strong>choose a question that is viable</strong> (i.e., that you can find enough information to answer in depth). Information on bodies and body modifications/ decorations is often scarce so make sure you see how much information is in your area of interest before you finalise your question. You don’t want to get close to the deadline and realize that you can’t answer your question!</p>\n<p> </p>\n<p>For example, using the above media examples you could design questions such as (feel free to use these or design your own):</p>\n<ol>\n<li>“How does cosmetic surgery construct gender boundaries?” or “How is cosmetic surgery used to negotiate racial boundaries?” or “how do race and class intersect when it comes to cosmetic surgery amongst [insert group]?”</li>\n<li>“How is muscle gendered and are women bodybuilders revolutionaries?” or “How is muscle gendered and what consequences does that have for women?”</li>\n<li>“How do cultural norms inform the boundary between ‘body modification’ and ‘body mutilation’?” or “Where is the boundary between normal and pathological body modification and how is this boundary constructed?”.</li>\n<li>“How has footbinding constructed gender in China?”.</li>\n</ol>\n<p> </p>\n<p> </p>\n<p><strong>Step 3: Write your annotated bibliography </strong>(see above).</p>\n<p><strong>Step 4: Participate in a discussion of your plan</strong> (see above).</p>\n<p><strong>Step 5: Incorporate feedback</strong> – make changes to your essay based on feedback given in steps 3 and 4, and write your feedback coversheet (maximum 200 words).</p>\n<p>On a separate page before you begin your essay <strong>you must include a feedback coversheet</strong> that answers the following question in 200 words or less:</p>\n<p> -       what action did you take in response to the feedback provided (on your annotated bibliography and in the discussion of your plan)?</p>\n<p>In your answer to this question include the detail of the feedback and your response to it.</p>\n<p>It may be that you decided not to make some of the suggested changes. If this is the case, you need to explain why you did not (maybe the marker misunderstood what you meant). You may not have been told to change much, if anything, because your work was already excellent. In this case state this.</p>\n<p><strong>Step 6: Research and write your essay.</strong></p>\n<p>Read the available academic literature and answer your question in 2000 words or less. You will be given the opportunity to get feedback on your ideas during class, and through the annotated bibliography and essay plan.</p>\n<p>In your essay:</p>\n<ol>\n<li> briefly <strong>outline the issue with reference to your chosen media example</strong>.</li>\n<li>i.e., what is the issue you are focusing on and how does your media reflect this issue.</li>\n<li>The media is only the launch pad for your essay – it is not part of the research. The research must consist of academic sources. You only need to mention the media at the start of your essay (but if you want you can return to your media example at the end of your essay and discuss it again briefly in relation to the academic literature you have described).</li>\n<li><strong>introduce your question</strong> in the first paragraph, and.</li>\n<li><strong>answer the question</strong> using academic literature.</li>\n</ol>\n<p>While you may use literature from across academic disciplines your emphasis should be on social science literature. In both your annotated bibliography and essay <strong>the focus should be on the social and cultural aspects of the body</strong> (not health or psychology). Obviously, health will be relevant to many of your topics, but you need to approach it from a social and cultural perspective (e.g., how is health socially constructed? how is the medical gaze socially constructed? Etc.). Psychological literature can be used to look at the impact of certain ideals (e.g., setting up the context and background for the issue that you are researching), but this should not be the main focus of your essay. Instead, the focus should be on the social and cultural aspects such as the ideals themselves. In short, you can briefly mention the effects of the meanings, norms, and values on health/body image, but your focus should primarily be on the meanings, norms, and values themselves.</p>\n<p>It is often appropriate to use a case study (or two) to answer your question. For instance, with regards to the above examples you could answer them using case studies:</p>\n<p>a.        Choose a certain society and look at how cosmetic surgery fits into that cultural context. For example, look at eyelid surgery in Korea, or skin bleaching in Jamaica.</p>\n<p>b.        You may choose to focus on how muscle is gendered by looking at how female athletes negotiate the meaning of muscle.</p>\n<p>c.        You may choose to focus on the boundary between ‘scarification’ (body modification) and ‘cutting’ (body mutilation).</p>\n<p>d.        China is the obvious case study here, but you may choose to briefly compare Chinese footbinding to the wearing of high heels in Western societies.</p>\n<p>You may use one or two non-academic sources (e.g., news item, opinion pieces, magazine articles) in your final essay (but only with a good reason that you explain to the reader) – the vast majority of the material you use in your essay should be academic (e.g., peer-reviewed journal articles, academic books).</p>\n<p>It is OK if not all of your sources are on your exact topic, in fact this is probably going to be the case for many topics. For instance, there may only be a few sources that describe your chosen practice, but you will use other courses to put the practice in context. For example, you may only find a few sources that discuss Chinese footbinding, but you would then use other more general sources that discuss the roles and status of women in ancient China to put the practice in context.</p>\n<p>Your paper must contain an <strong>argument</strong>. Purely descriptive papers are not acceptable. Your argument is just your answer to your question. It is whatever you find when you do your research. You should state your argument in your paper. Your argument could be “Footbinding was used to construct Chinese women as chaste, pure, as property of their husbands … (whatever you find)”. If you are in doubt about your argument ask your tutor for help. </p>\n<p><br/></p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>Student use of AI: </strong>For all graded assessments in this course, use of Artificial Intelligence (AI) software is not permitted. Graded assessments evaluate students' abilities, skills and knowledge without the aid of AI. Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "SOSC2190 Online quiz",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>35%</dd>",
            "due_date": "<dd><p> 10/06/2025 - 11/06/2025</p>\n<p>\n</p><p>The quiz will be open from 12pm on the 10th of June until 12pm on the 11th of June. Once you start you will have 2 hours to complete your quiz. Make sure you have sufficient time to complete before it closes (i.e. start the quiz before 10am on the 11th).</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The online quiz will be administered via Learn.UQ. It will open at 12pm on the 10th of June and remain open until 12pm the next day (11th). Once you start the quiz you will have 2 hours to complete it.</p>\n<p>The quiz will be multiple choice and short answer, and will cover all course material (lectures, readings, tutorials and videos).</p>\n<p>15 Multiple choice questions @ 1 mark each = 15 marks</p>\n<p>6 short answer questions of 75 words or less each @ 1 mark each = 6 marks                    </p>\n<p>4 short answer questions of 100 words or less each @ 2 marks each = 8 marks              </p>\n<p>2 short answer questions of 150 words or less each @ 3 marks each = 6 marks       </p>\n<p><strong>Student use of AI: </strong>For all graded assessments in this course, use of Artificial Intelligence (AI) software is not permitted. Graded assessments evaluate students' abilities, skills and knowledge without the aid of AI. Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct.     </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The quiz will appear in the Assessment section of your Blackboard (eLearn) at the stated time.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction</strong><br><p>What is the body? Why study the social and cultural aspects of bodies? This week serves as an introduction to the course and some of the key concepts and theories used.</p></br></p></div></td>",
            "topic_title": "<strong>Introduction</strong>",
            "topic_description": "Introduction What is the body? Why study the social and cultural aspects of bodies? This week serves as an introduction to the course and some of the key concepts and theories used.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Thinness, fatness and eating</strong><br><p>A discussion of the thin ideal, the social significance of fat, and eating disorders.</p></br></p></div></td>",
            "topic_title": "<strong>Thinness, fatness and eating</strong>",
            "topic_description": "Thinness, fatness and eating A discussion of the thin ideal, the social significance of fat, and eating disorders.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Marking boundaries through body modification</strong><br><p>A discussion of African scarification and the construction of gendered bodies as well as a discussion of scarification and other extreme body modifications in Western societies.</p></br></p></div></td>",
            "topic_title": "<strong>Marking boundaries through body modification</strong>",
            "topic_description": "Marking boundaries through body modification A discussion of African scarification and the construction of gendered bodies as well as a discussion of scarification and other extreme body modifications in Western societies.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Cosmetic surgery</strong><br/><p>A discussion of cosmetic surgery and non-surgical cosmetic procedures cross-culturally.</p></p></div></td>",
            "topic_title": "<strong>Cosmetic surgery</strong>",
            "topic_description": "Cosmetic surgery A discussion of cosmetic surgery and non-surgical cosmetic procedures cross-culturally.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Body-self relations at different ages</strong><br/><p>A discussion of how people of different ages relate to their bodies.</p></p></div></td>",
            "topic_title": "<strong>Body-self relations at different ages</strong>",
            "topic_description": "Body-self relations at different ages A discussion of how people of different ages relate to their bodies.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Disability</strong><br/><p>A discussion of disability in relation to the body, and how the different approaches to understanding disability impact our understanding of disabled embodiment.</p></p></div></td>",
            "topic_title": "<strong>Disability</strong>",
            "topic_description": "Disability A discussion of disability in relation to the body, and how the different approaches to understanding disability impact our understanding of disabled embodiment.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Race</strong><br/><p>A discussion of the racial classification of humans and its consequences.</p></p></div></td>",
            "topic_title": "<strong>Race</strong>",
            "topic_description": "Race A discussion of the racial classification of humans and its consequences.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-Semester Break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-Semester Break</strong>",
            "topic_description": "Mid-Semester Break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Muscle</strong><br/><p>A discussion of the ideal of muscularity, and it's consequences for health.</p></p></div></td>",
            "topic_title": "<strong>Muscle</strong>",
            "topic_description": "Muscle A discussion of the ideal of muscularity, and it's consequences for health.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Genital surgeries</strong><br/><p>A discussion of male and female genital surgeries in different societies.</p></p></div></td>",
            "topic_title": "<strong>Genital surgeries</strong>",
            "topic_description": "Genital surgeries A discussion of male and female genital surgeries in different societies.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Breasts</strong><br/><p>A discussion of the symbolism and experience of breasts.</p></p></div></td>",
            "topic_title": "<strong>Breasts</strong>",
            "topic_description": "Breasts A discussion of the symbolism and experience of breasts.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Social media and online embodiment</strong><br/><p>A discussion of the body and embodiment online through a case study of the Zyzz fandom.</p></p></div></td>",
            "topic_title": "<strong>Social media and online embodiment</strong>",
            "topic_description": "Social media and online embodiment A discussion of the body and embodiment online through a case study of the Zyzz fandom.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Enhancement, the future of bodies &amp; course overview</strong><br/><p>The predicted future of bodies through a discussion of transhumanism. Overview of the course, and revision for the quiz.</p></p></div></td>",
            "topic_title": "<strong>Enhancement, the future of bodies &amp; course overview</strong>",
            "topic_description": "Enhancement, the future of bodies & course overview The predicted future of bodies through a discussion of transhumanism. Overview of the course, and revision for the quiz.",
            "learning_outcomes": []
        }
    ]
}