{
    "course_title": "Research, Planning and Design",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SOSC3201-21653-7520",
    "full_course_code": "SOSC3201-21653-7520",
    "course_code": "SOSC3201",
    "class_code": "21653",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Undertake necessary preparation for applied research projects, including liaising with research and industry partners, evaluating published research, and applying research design skills."
        },
        {
            "number": "LO2.",
            "description": "Engage actively and effectively in teamwork."
        },
        {
            "number": "LO3.",
            "description": "Report on research work in progress to various audiences."
        },
        {
            "number": "LO4.",
            "description": "Relate your learning to the practice of social science, and to your identity and position as an emerging social scientist."
        },
        {
            "number": "LO5.",
            "description": "Recognise and articulate interpersonal skills that are transferable to other contexts."
        },
        {
            "number": "LO6.",
            "description": "Identify and articulate the ethical implications of social research methods, data, analysis and reporting."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Annotated Bibliography",
            "special_indicators": [],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 24/03/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Identify and summarise 5 pieces of literature to inform your research proposal. You must:</p>\n<ol>\n<li>provide a brief statement summarising your research problem; </li>\n<li>explain the focus of your reviewed literature;</li>\n<li>critically summarise the key findings/argument of each piece;</li>\n<li>explain how each piece is relevant to your proposed research;</li>\n<li>critically reflect on your use (or nonuse) of GenAI in preparing and completing this assessment. </li>\n</ol>\n<p>There is no set word limit on each item but the overall length of your Annotated Bibliography assignment is <strong>1400 words</strong>, excluding the bibliographic details of key references. You can work as a team in formulating your research problem or devise your own. If you all use the exact same research problem, you will still need to explain the specific focus of your review. Writing separate ones may benefit you as a team as you'll have multiple versions of your research problem, allowing you to make comparisons on how you each perceive the project and come to a shared understanding.</p>\n<p>Research teams must work together to plan the focus and scope of each team member's Annotated Bibliography so that they are complementary, not overlapping. Taken together, the references submitted by each student will help form the basis of the team's review of literature for your Research Proposal (Assessment 3). As a group, you are encouraged to engage your academic advisor to assist in identifying literature and ensure you have covered the main texts and bodies of literature. <em>Do not send Academic Advisors your individual annotated bibliographies for review.</em></p>\n<p>In compiling your key references , you should use an acknowledged, in-text, author-date academic referencing system (e.g., APA or Chicago). It does not matter which one you use (although footnote or endnotes are not acceptable), as long as you are consistent in your referencing style. Use of a referencing tool (e.g. Zotero) is highly encouraged.</p>\n<p>An <strong>assessment template </strong>for your use in setting out this assignment is provided on Blackboard. </p>\n<p><strong>Artificial Intelligence (such as ChatGPT) and Assignment writing</strong>:ﾠArtificial Intelligence (AI) provides tools that may support students in completing your assessment tasks. Students may appropriately use AI in completing this assessment task. Students must clearly reference any use of AI in each instance. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct.</p>\n<p><strong>Large Language Generative AI Tools. </strong>You may choose to use LLM-GenAI tools (such as ChatGPT, Microsoft CoPilot and Claude) to assist you. Failure to acknowledge using such resource may constitute unethical writing practice/plaigarism.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>You must submit your assignment electronically by the due time, on the due date.</strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Group Ethics Application - Part 1",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>35% + Peer Assessment* </dd>",
            "due_date": "<dd><p> 9/05/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L04, L05, L06",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>It is a legal requirement that all Australian university based research involving human subjects, or secondary data derived from human subjects, require ethical clearance. Your ethics application for your proposed research project forms the basis of this piece of assessment. (Should you be undertaking a project that does not require ethical clearance, an explanation of assessment requirements will be provided.) Each group must complete an application for ethical clearance using the online Ethics application form via <a href=\"https://my-research.research.uq.edu.au/\">MyResearch</a>. This occurs in two stages.</p>\n<p><strong>Stage 1 involves </strong>completing the form online and upload all the necessary accompanying documents, which includes:</p>\n<ul>\n<li>A project description (on the LNR template)</li>\n<li>Participant Information Sheet/s</li>\n<li>Consent form/s</li>\n<li>A gatekeeper's letter (<strong>where relevant, this will not be assessed</strong>)</li>\n<li>A copy of any draft survey instrument/interview questions (<strong>this will not be assessed</strong>, but feedback will be given).</li>\n<li>Key recruitment paraphenalia, e.g. posters, social media ads (<strong>where relevant</strong>; <strong>this will not be assessed</strong>, but feedback will be given)</li>\n</ul>\n<p>Once you have completed your online application <strong>DO NOT SUBMIT IT TO THE ETHICS COMMITTEE VIA THE ONLINE PORTAL</strong>. Instead, you are to download the full draft copy of the application and submit through Blackboard. Only one person from each group submits the assessment on behalf of the group.</p>\n<p><strong>Marking criteria</strong> and matrix are available on Blackboard. Examples of previous ethics applications, along with participant information sheets, consent forms, university letterhead, project descriptions/protocols are on Blackboard under the assessment/ethical clearance application folder.</p>\n<p><strong>Artificial Intelligence (such as ChatGPT) and Assignment writing</strong>:ﾠArtificial Intelligence (AI) provides tools that may support students in completing your assessment tasks. Students may appropriately use AI in completing this assessment task. Students must clearly reference any use of AI in each instance.ﾠA failure to reference AI use may constitute student misconduct under the Student Code of Conduct.  <em>You may choose to use GenAI in preparing this assessment, but other than for spelling and grammar checking, it would not likely to be useful fo you. If you use AI you must submit the </em><strong><em>AI use form template </em></strong><em>(found on course Blackboard site) with your assessment.</em></p>\n<p><strong>*Each student also must submit a Peer Assesment to accompany this assignment via Blackboard's BuddyCheck within a week of the first submission date. The Peer Assessment is to capture each team members' contribution to the research project design process throughout the semester up to submitting this assessment. </strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>One member of each team must submit their assignment electronically by the due time, on the due date.</strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Group Research Project Proposal",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40% + Peer Assessment </dd>",
            "due_date": "<dd><p> 30/05/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Your group is required to submit a research project proposal outlining your research problem and your plan for undertaking the research. This proposal will be the culmination of your group's work across the semester, building on work you did in your annotated bibliography and reseach plan in your ethics application. You can build on the work you have already done, and this is not considered self-plagiarism in this context. Your project proposal should include the following:</p>\n<ul>\n<li><em>Separate title page</em> (with author names)</li>\n<li><em>Introduction</em>: Describe the problem under investigation and why it is significant. Identify your research aims/questions.</li>\n<li><em>Literature review</em>: Summarise what other people have published about the research area and/or issue, and identify and comment upon relevant debates. Identify the relevant theories and how they might (or might not) apply to the issue at hand. Critically interpret previous research findings. Your review should end with a summary statement that positions your study in the context of the literature so that the reader can see how your work contributes.</li>\n<li>An outline of your <em>key concepts, conceptual framework or any theories </em>you intend to draw upon in your research. This should logically connect to your research questions and develop from the literature. It should also connect to your proposed research methods.</li>\n<li><em>Statement of Method</em>: Provide information about research design, data collection methods, population, sampling strategy, intended sample size and/or composition, and the methods you propose for data collection, data analysis and interpretation of results. You should also consider the ethical implications of your work and how you plan to address them. You must justify your proposed method with reference to the aims of your research, your specific research questions, the context and subjects of your research, and relevant literature on research methods.</li>\n<li><em>Ethical and/or researcher statement: </em>discuss any notable ethical consideration your study raises and how you will address them.</li>\n<li><em>Timeline</em>: Include milestones and stages of the research (e.g., when to trial data collection tools, when to collect data, how long, etc.).</li>\n<li><em>Budget</em>: Identify the categories of expenditure that exist (e.g., personnel, travel, equipment, supplies, office supplies, printing/copying, telephones, postage, etc.) and estimated costs.</li>\n<li><em>References</em>: Use an acknowledged academic referencing system. Be consistent.</li>\n</ul>\n<p>Examples of actual research proposals in different fields of social science will be provided on the Course Blackboard for guidance. <strong>Marking criteria </strong>and matrix is provided on the course Blackboard site.</p>\n<p><strong>Artificial Intelligence (such as ChatGPT) and Assignment writing</strong>:ﾠArtificial Intelligence (AI) provides emerging tools that may support students in completing your assessment tasks. Students may appropriately use AI in completing this assessment task. Students must clearly reference any use of AI in each instance.ﾠA failure to reference AI use may constitute student misconduct under the Student Code of Conduct.  Students are able to use AI in preparing this assessment. <em>Each group </em><em>must submit the </em><strong><em>AI use form template </em></strong><em>(found on course Blackboard site) with your assessment.</em></p>\n<p><strong>Word length:</strong> 3500 words (Reference list and appendices not included in word count).</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>One person on behalf of the team must submit your assignment electronically by the due time, on the due date.</strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Group Ethics Application - Part 2",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": null,
            "due_date": "<dd><p> 9/06/2025 2:00 pm</p>\n<p>\n</p><p>While there is a deadline, <strong>earlier submission is better.</strong> <em>Failure to submit your application before that date may delay fieldwork in Semester 2's SOSC3202.</em></p></dd>",
            "learning_objectives": "L01, L02, L04, L05, L06",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This is the second stage of the Ethics Application requirement that will be required for all projects requiring ethical clearance.</p>\n<p><strong>Task: </strong></p>\n<p>Based on the feedback you received from the assessed draft ethics assessment and feedback in workshop and your Academic Advisor, you are required to revise the draft and resubmit the updated application on MyResearch with <strong>all </strong>relevant attachments.</p>\n<p><strong>Email the course coordinator to advise when the changes have been made </strong>to the online application and you think it is ready to go. Once the course teaching team is satisfied with your changes, they will submit the application on your behalf through the online MyResearch portal.</p>\n<p>Once your ethics application has been assessed by the relevant ethics committee, changes or clarification on specific points in the application is often required. You may be asked to amend the research plan and provide details of the changes you have made. <em>Over the winter break, it is strongly encouraged that at least one team member can check emails and assist the course coordinator to respond to the ethical approval process.</em></p>\n<p><strong>Artificial Intelligence (such as ChatGPT) and Assignment writing</strong>:ﾠArtificial Intelligence (AI) provides emerging tools that may support students in completing your assessment tasks. Students may appropriately use AI in completing this assessment task. Students must clearly reference any use of AI in each instance.ﾠA failure to reference AI use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>There is <strong>no mark </strong>attached to this assessment, but it is a <strong>hurdle requirement to complete SOSC3201</strong>. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>One member of each team must email the Course Coordinator to advise that your team's MyResearch application is ready for submission.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1: Course aims + picking your project</strong><br/><p>An overview of the course content and purpose. The importance of research for your professional careers as both producers and consumers of that research. </p>\n<p>The available research projects will be presented by the industry partners. You will nominate three projects in order of preference and write an Expression of Interest.</p></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Week 1: Course aims + picking your project</strong>",
            "topic_description": "Week 1: Course aims + picking your project An overview of the course content and purpose. The importance of research for your professional careers as both producers and consumers of that research. The available research projects will be presented by the industry partners. You will nominate three projects in order of preference and write an Expression of Interest.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2: Learning to work as a research team</strong><br/><p>In this workshop you will find out <strong>which project you have been allocated </strong>and come together as a research team for the first time, and start to develop a plan for familiarising yourself with the research topic, its aims, and the broader research environment.  You will<strong> hear from previous students</strong> in the course about their experiences and tips for a successful year. You will learn about <strong>working as a team</strong> through team-based work, including how to communicate as a group, establishing a division of labour, familiarising yourselves with each other's working styles, and appreciating the way team dynamics can affect the progression of a project. This will support the development of a <strong>Team Charter</strong>.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 2: Learning to work as a research team</strong>",
            "topic_description": "Week 2: Learning to work as a research team In this workshop you will find out which project you have been allocated and come together as a research team for the first time, and start to develop a plan for familiarising yourself with the research topic, its aims, and the broader research environment.  You will hear from previous students in the course about their experiences and tips for a successful year. You will learn about working as a team through team-based work, including how to communicate as a group, establishing a division of labour, familiarising yourselves with each other's working styles, and appreciating the way team dynamics can affect the progression of a project. This will support the development of a Team Charter .",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4: Getting Started - research problem and literature</strong><br/><p>The workshop will introduce approaches to formulating a <strong>research problem statement</strong>, planning a <strong>literature review</strong>, and creating a schedule of activity.  You will also learn about referencing software (and trial <strong>Zotero</strong>) and project management. We will use Generative AI to start identifying the contours of your literature. Your first assignment - the annotated bibliography - will be explained. As a team, you will plan a strategy to identify and review relevant literature and your individual scope and focus. Check with your academic advisor on your literature choices before writing up your annotated bibliography. You should also spend time this week meeting with your Academic Advisor and Industry Partner.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L05</p></div></td>",
            "topic_title": "<strong>Week 4: Getting Started - research problem and literature</strong>",
            "topic_description": "Week 4: Getting Started - research problem and literature The workshop will introduce approaches to formulating a research problem statement , planning a literature review , and creating a schedule of activity.  You will also learn about referencing software (and trial Zotero ) and project management. We will use Generative AI to start identifying the contours of your literature. Your first assignment - the annotated bibliography - will be explained. As a team, you will plan a strategy to identify and review relevant literature and your individual scope and focus. Check with your academic advisor on your literature choices before writing up your annotated bibliography. You should also spend time this week meeting with your Academic Advisor and Industry Partner.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5: Developing your research project</strong><br/><p>Having developed some preliminary research plans for your project, the aim now is to start working on a coherent and well-thought out research proposal. This occurs in stages over the next three weeks of class. This week focuses on developing some preliminary <strong>research questions </strong>and your <strong>key concepts</strong>.  </p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 5: Developing your research project</strong>",
            "topic_description": "Week 5: Developing your research project Having developed some preliminary research plans for your project, the aim now is to start working on a coherent and well-thought out research proposal. This occurs in stages over the next three weeks of class. This week focuses on developing some preliminary research questions and your key concepts .",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6:  Operationalising your research plan</strong><br/><p>This week you will learn to operationalise your concepts, questions and data collection. You will start to focus on how you plan to actually do your study - what data do you need to answer your research questions and assess/measure your concepts? What methods will you use to generate this data? How can you build rigor into your research design?</p>\n<p>We will also introduce you to <strong>creative and innovative research methods</strong>, that can expand upon standard interviews and survey.</p>\n<p>We will also discuss <strong>culturally competant research</strong>. </p>\n<p>This is also a week where you should share your progress with your Academic Advisor to seek their advice of your plans.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Week 6:  Operationalising your research plan</strong>",
            "topic_description": "Week 6:  Operationalising your research plan This week you will learn to operationalise your concepts, questions and data collection. You will start to focus on how you plan to actually do your study - what data do you need to answer your research questions and assess/measure your concepts? What methods will you use to generate this data? How can you build rigor into your research design? We will also introduce you to creative and innovative research methods , that can expand upon standard interviews and survey. We will also discuss culturally competant research . This is also a week where you should share your progress with your Academic Advisor to seek their advice of your plans.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7: Work in progress presentations</strong><br/><p>This workshop will be dedicated to each group presenting their work in progress to date. It will be an opportunity to get whole-of-class exposure and feedback on your project. You should invite your Academic Advisors to attend (in person or online). All students must be in attendance (preferably physical) at the presentations (unless unwell). You are not only expected to present your research, but also to engage in collegial discussion with other teams, about their research. This requires you to remain in class for the entire time out of professional courtesy to your colleagues.</p>\n<p>You should also contact your industry partner this week to update them on your progress and gain their input into the next steps.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Week 7: Work in progress presentations</strong>",
            "topic_description": "Week 7: Work in progress presentations This workshop will be dedicated to each group presenting their work in progress to date. It will be an opportunity to get whole-of-class exposure and feedback on your project. You should invite your Academic Advisors to attend (in person or online). All students must be in attendance (preferably physical) at the presentations (unless unwell). You are not only expected to present your research, but also to engage in collegial discussion with other teams, about their research. This requires you to remain in class for the entire time out of professional courtesy to your colleagues. You should also contact your industry partner this week to update them on your progress and gain their input into the next steps.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8: Applying for ethical clearance</strong><br/><p>This week you will be introduced to the UQ ethical clearance process and start your online application (for Assessment 2). Detailed guidance on completing the online application process is provided.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L06</p></div></td>",
            "topic_title": "<strong>Week 8: Applying for ethical clearance</strong>",
            "topic_description": "Week 8: Applying for ethical clearance This week you will be introduced to the UQ ethical clearance process and start your online application (for Assessment 2). Detailed guidance on completing the online application process is provided.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9: Managing Group Dynamics</strong><br/><p>By now you will have experience of working with your group and getting a sense of each person's strengths, weaknesses and preferred ways of working. Differences of work practices and expectations can create challenges for group work. Building on a group reflection exercise and peer assessment through BuddyCheck, this workshop will introduce you to ways to manage group dynamics when things do not go as smoothly as hoped.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 9: Managing Group Dynamics</strong>",
            "topic_description": "Week 9: Managing Group Dynamics By now you will have experience of working with your group and getting a sense of each person's strengths, weaknesses and preferred ways of working. Differences of work practices and expectations can create challenges for group work. Building on a group reflection exercise and peer assessment through BuddyCheck, this workshop will introduce you to ways to manage group dynamics when things do not go as smoothly as hoped.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>LABOR DAY HOLIDAY - NO WORKSHOP</strong><br/></p><p><strong>Learning outcomes:</strong> L02</p></div></td>",
            "topic_title": "<strong>LABOR DAY HOLIDAY - NO WORKSHOP</strong>",
            "topic_description": "LABOR DAY HOLIDAY - NO WORKSHOP",
            "learning_outcomes": [
                "L02"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11: Project proposals + data collection</strong><br/><p>In addition to finalising your draft ethics applications, this workshop will explain the key parts and style of a Research Proposal. It will be the culmination of the work across the course, drawing together the different threads: problem statement, research questions, literature,key concepts, methods and data.<br/><br/>We will also progress the data collection instruments, including survey design and survey questions, formulating interview or focus group questions, and establishing ways of structuring your observations or textual analysis. This work will form part of your application for the formal ethics clearance</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Week 11: Project proposals + data collection</strong>",
            "topic_description": "Week 11: Project proposals + data collection In addition to finalising your draft ethics applications, this workshop will explain the key parts and style of a Research Proposal. It will be the culmination of the work across the course, drawing together the different threads: problem statement, research questions, literature,key concepts, methods and data. We will also progress the data collection instruments, including survey design and survey questions, formulating interview or focus group questions, and establishing ways of structuring your observations or textual analysis. This work will form part of your application for the formal ethics clearance",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12: Preparing project proposal</strong><br><p>The workshop today is dedicated to dedicated to progressing your research proposal taking into account any relevant feedback from your draft ethics application.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Week 12: Preparing project proposal</strong>",
            "topic_description": "Week 12: Preparing project proposal The workshop today is dedicated to dedicated to progressing your research proposal taking into account any relevant feedback from your draft ethics application.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13: Consolidating your research proposal</strong><br><p>This workshop is dedicated to finalising your research proposal. By now, you should be able to articulate how you are going to DO your research and how your proposed methods speak directly to your research questions and aims. </p>\n<p>Teams should also plan how they may respond to the Ethics Committee during the inter-semester break. </p>\n<p>In this week you should also update your Industry Partner on your progress and see feedback from your Academic Advisor on your draft proposal.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Week 13: Consolidating your research proposal</strong>",
            "topic_description": "Week 13: Consolidating your research proposal This workshop is dedicated to finalising your research proposal. By now, you should be able to articulate how you are going to DO your research and how your proposed methods speak directly to your research questions and aims. Teams should also plan how they may respond to the Ethics Committee during the inter-semester break. In this week you should also update your Industry Partner on your progress and see feedback from your Academic Advisor on your draft proposal.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        }
    ]
}