{
    "course_title": "Professional Practice in Child, Youth and Family",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SWSP7182-21509-7520",
    "full_course_code": "SWSP7182-21509-7520",
    "course_code": "SWSP7182",
    "class_code": "21509",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Engage in a purposeful, professional and effective manner with vulnerable children, young people, parents and caregivers."
        },
        {
            "number": "LO2.",
            "description": "Undertake assessment processes that appropriately balance risks and strengths when working with vulnerable children, young people and families."
        },
        {
            "number": "LO3.",
            "description": "Articulate an intervention plan that is informed by service user perspectives and by the evidence that has emerged from assessment of strengths and risks in specific cases of child, youth and family practice."
        },
        {
            "number": "LO4.",
            "description": "Demonstrate a capacity to build a sense of professional purpose that is informed by legal and organisational responsibilities, social work ethics and values including respect for the capacity of service users to be self-determining."
        },
        {
            "number": "LO5.",
            "description": "Critically analyse research evidence and use research evidence to inform direct practice with children, young people and their families."
        },
        {
            "number": "LO6.",
            "description": "Build your capacity to continously improve your practice through critical self reflection and the ability to identify and implement strategies for addressing gaps in knowledge and skills."
        },
        {
            "number": "LO7.",
            "description": "Demonstrate the capacity to work in teams of peers to develop your practice and to contribute to learning opportunities for peers."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Practice with Children, Young People and Families",
            "special_indicators": [],
            "weighting": "<dd>40% Workbook (two parts) </dd>",
            "due_date": "<dd><p> 14/04/2025 1:10 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students compile a workbook in two parts: an assessment and intervention report and a cultural support plan. </p>\n<p>The workbook will be based on a case study, which will be released in week 2.</p>\n<p>Word count: 3200 words</p>\n<p><em>A detailed outline of this assessment task is available on the course Blackboard site. It is essential that students read that information.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Family Group Conference Simulation and Review",
            "special_indicators": [],
            "weighting": "<dd>60% (simulation of family conference &amp; structured reflection) </dd>",
            "due_date": "<dd><p> 22/05/2025 - 29/05/2025</p>\n<p>\n</p><p>+ 16/6/2025 @ 13.00 (written part of simulations)</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07",
            "mode": "Oral, Written",
            "category": "Essay/ Critique, Role play/ Simulation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>In Weeks 12 and 13 of the course, the class will engage in a simulated learning exercise centred on a family group conference in a child protection context. Students will be scheduled to participate in the exercise in EITHER week 12 (22 May) or week 13 (29 May) and will need to be present for the entire simulation session for which they have been scheduled.</p>\n<p><strong>Part 1:</strong> The simulation exercise will involve actors playing the role of clients in a child protection setting. The simulation will be conducted as a round-robin, during which each student will play the role of convenor or child protection worker or family support worker for a designated time period (approximately 15-40 minutes, depending of the complexity of the role). Students must attend the entire session in which they are scheduled to play their role. The session will include a simulation of a family group conference and debriefing following the role play. </p>\n<p><strong>Part 2</strong>: A written risk assessment and analysis of family participation in the group conference.</p>\n<p><em>A detailed outline of this assessment task is available on the course Blackboard site. It is essential that students read that information.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><em>Students must complete both the assessed simulation and the written exercise.ﾠﾠ</em></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(24 Feb - 02 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction. What is child abuse &amp; neglect?</strong><br><p>In the first part of this seminar, we will introduce the course structure, assessment, learning process and teaching team. We will discuss the course themes.</p>\n<p>Part 2: We will discuss definitions of child abuse and neglect.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Introduction. What is child abuse &amp; neglect?</strong>",
            "topic_description": "Introduction. What is child abuse & neglect? In the first part of this seminar, we will introduce the course structure, assessment, learning process and teaching team. We will discuss the course themes. Part 2: We will discuss definitions of child abuse and neglect.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>What is assessment in child protection?</strong><br><p>Prior to class, please complete the online learning package for Week 2, that includes key information on assessment in child protection. The class will focus on an interactive exercise to apply to the ecological risk and safety framework to assess child protection concerns. The case study will form the basis of the first assessment piece.</p></br></p><p><strong>Learning outcomes:</strong> L01, L04, L06, L07</p></div></td>",
            "topic_title": "<strong>What is assessment in child protection?</strong>",
            "topic_description": "What is assessment in child protection? Prior to class, please complete the online learning package for Week 2, that includes key information on assessment in child protection. The class will focus on an interactive exercise to apply to the ecological risk and safety framework to assess child protection concerns. The case study will form the basis of the first assessment piece.",
            "learning_outcomes": [
                "L01",
                "L04",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 3(10 Mar - 16 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>What is professional decision-making?</strong><br><p>Please complete the online learning package for Week 3 before the seminar. Our focus in this seminar will be on applying the knowledge we have gained via the online learning package to address the questions: what are our options for preventing and addressing child abuse and neglect, and how do we decide among our options? We will draw on knowledge about the three tiers of child protection intervention and on decision theory to undertake a decision-making exercise in class using a decision-tree. This in-class exercise is important preparation for your first assessment piece.</p>\n<p><br/></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L05, L06</p></div></td>",
            "topic_title": "<strong>What is professional decision-making?</strong>",
            "topic_description": "What is professional decision-making? Please complete the online learning package for Week 3 before the seminar. Our focus in this seminar will be on applying the knowledge we have gained via the online learning package to address the questions: what are our options for preventing and addressing child abuse and neglect, and how do we decide among our options? We will draw on knowledge about the three tiers of child protection intervention and on decision theory to undertake a decision-making exercise in class using a decision-tree. This in-class exercise is important preparation for your first assessment piece.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 4(17 Mar - 23 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>What are child welfare inequalities?</strong><br><p>Please complete the online learning package for Week 4 prior to the seminar. In this seminar, we will consider that the concept of \"child welfare inequalities\", which refers to the unequal chances and outcomes associated with child welfare interventions, is systematically linked to patterns of social advantage/ disadvantage and discrimination. We will consider how poverty, housing instability, and discrimination, particularly related to parents with intellectual disability, contribute to patterns of child welfare involvement in families' lives. We will discuss strategies for acknowledging and addressing these patterns in practice.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>What are child welfare inequalities?</strong>",
            "topic_description": "What are child welfare inequalities? Please complete the online learning package for Week 4 prior to the seminar. In this seminar, we will consider that the concept of \"child welfare inequalities\", which refers to the unequal chances and outcomes associated with child welfare interventions, is systematically linked to patterns of social advantage/ disadvantage and discrimination. We will consider how poverty, housing instability, and discrimination, particularly related to parents with intellectual disability, contribute to patterns of child welfare involvement in families' lives. We will discuss strategies for acknowledging and addressing these patterns in practice.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>What is culturally responsive practice?</strong><br><p>This week, we consider culturally responsive practice with Aboriginal and Torres Strait Islander families. Please complete the Week 5 online learning package prior to class as this introduces definitions of culturally responsive practice and active efforts to support cultural connection and identities with and for Aboriginal and Torres Strait Islander children and families. We also outline \"cultural support plans\" which is part of the first assessment. In the seminar, we introduce the case study for part 2 of the workbook assessment.</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>What is culturally responsive practice?</strong>",
            "topic_description": "What is culturally responsive practice? This week, we consider culturally responsive practice with Aboriginal and Torres Strait Islander families. Please complete the Week 5 online learning package prior to class as this introduces definitions of culturally responsive practice and active efforts to support cultural connection and identities with and for Aboriginal and Torres Strait Islander children and families. We also outline \"cultural support plans\" which is part of the first assessment. In the seminar, we introduce the case study for part 2 of the workbook assessment.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 6(31 Mar - 06 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>What are family group meetings?</strong><br><p>In this session we will introduce family group meetings in child protection contexts. Please complete the Week 6 learning package prior to class as this will provide an introduction to the history of family group meetings and their links to family inclusion and participation in decision-making. In the seminar, we will discuss the structure of the final assessment piece and the learning process in the second half of the course as we prepare to simulate a family group meeting.</p>\n<p>There will be opportunities to raise any questions about the first assessment piece.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L06, L07</p></div></td>",
            "topic_title": "<strong>What are family group meetings?</strong>",
            "topic_description": "What are family group meetings? In this session we will introduce family group meetings in child protection contexts. Please complete the Week 6 learning package prior to class as this will provide an introduction to the history of family group meetings and their links to family inclusion and participation in decision-making. In the seminar, we will discuss the structure of the final assessment piece and the learning process in the second half of the course as we prepare to simulate a family group meeting. There will be opportunities to raise any questions about the first assessment piece.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 7(07 Apr - 13 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Domestic and Family violence &amp; child welfare</strong><br><p>In this seminar, we will consider social work practice with families where family and domestic violence are a concern. Please complete the online learning package before class, which will include material related to identifying DFV and its impact on children and families.</p>\n<p>In the seminar, we will discuss the case study for the final assessment and assess for signs of DFV. The implications of possible DFV for the child protection assessment and for the family group meeting process will be discussed.</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L06</p></div></td>",
            "topic_title": "<strong>Domestic and Family violence &amp; child welfare</strong>",
            "topic_description": "Domestic and Family violence & child welfare In this seminar, we will consider social work practice with families where family and domestic violence are a concern. Please complete the online learning package before class, which will include material related to identifying DFV and its impact on children and families. In the seminar, we will discuss the case study for the final assessment and assess for signs of DFV. The implications of possible DFV for the child protection assessment and for the family group meeting process will be discussed.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L06"
            ]
        },
        {
            "learning_period": "Week 8(14 Apr - 20 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Family group meetings: Addressing concerns</strong><br/><p>The online Week 8 learning package will cover the stages of the family meetings and the themes of a solution focused and family inclusive approach to decision-making with families. In the seminar we will practise applying the themes outlined in the online learning package including:</p>\n<p>a) raising concerns in a solution-focused way;</p>\n<p>b) generating solutions with families;</p>\n<p>c) facilitating inclusive discussions.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Family group meetings: Addressing concerns</strong>",
            "topic_description": "Family group meetings: Addressing concerns The online Week 8 learning package will cover the stages of the family meetings and the themes of a solution focused and family inclusive approach to decision-making with families. In the seminar we will practise applying the themes outlined in the online learning package including: a) raising concerns in a solution-focused way; b) generating solutions with families; c) facilitating inclusive discussions.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Mid-sem break(21 Apr - 27 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid semester break, no classes</strong><br/><p>There are no classes scheduled this week as is it the mid-semester break.</p></p></div></td>",
            "topic_title": "<strong>Mid semester break, no classes</strong>",
            "topic_description": "Mid semester break, no classes There are no classes scheduled this week as is it the mid-semester break.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Working with people affected by trauma - Trauma Informed Care </strong><br/><p>In the session, we shall discuss different types of trauma (childhood trauma, complex trauma, historical intergenerational trauma, mass trauma, etc.), and we shall discuss the principles underpinning trauma-informed care in child, youth and families. Throughout this session, we will engage in meaningful discussions, share insights from real-world scenarios, and reflect on how we can integrate trauma-informed practices into our work with children, youth, and families. By the end of our time together, you will have a deeper understanding of the complexities of trauma and practical strategies to support those who have experienced it.</p>\n<p><strong>We will consider evidence of trauma in the case study for the final assessment and how would manage that in preparing for, and undertaking, the family group meeting.</strong></p></p><p><strong>Learning outcomes:</strong> L01, L03, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Working with people affected by trauma - Trauma Informed Care </strong>",
            "topic_description": "Working with people affected by trauma - Trauma Informed Care In the session, we shall discuss different types of trauma (childhood trauma, complex trauma, historical intergenerational trauma, mass trauma, etc.), and we shall discuss the principles underpinning trauma-informed care in child, youth and families. Throughout this session, we will engage in meaningful discussions, share insights from real-world scenarios, and reflect on how we can integrate trauma-informed practices into our work with children, youth, and families. By the end of our time together, you will have a deeper understanding of the complexities of trauma and practical strategies to support those who have experienced it. We will consider evidence of trauma in the case study for the final assessment and how would manage that in preparing for, and undertaking, the family group meeting.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 10(05 May - 11 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Family Group Meetings - Exploration, Negotiation and Agreement</strong><br/><p>In this seminar we will focus on the knowledge and skills needed to explore concerns, negotiate options for change and to reach agreement. There will be opportunity to rehearse the skills in preparation for the Family Group Meeting assessment.</p>\n<p><br/></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L06</p></div></td>",
            "topic_title": "<strong>Family Group Meetings - Exploration, Negotiation and Agreement</strong>",
            "topic_description": "Family Group Meetings - Exploration, Negotiation and Agreement In this seminar we will focus on the knowledge and skills needed to explore concerns, negotiate options for change and to reach agreement. There will be opportunity to rehearse the skills in preparation for the Family Group Meeting assessment.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L06"
            ]
        },
        {
            "learning_period": "Week 11(12 May - 18 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Review and rehearsal for final simulation</strong><br><p>The online learning package will review the key principles of family group meetings in child protection contexts. Please complete the online package prior to class. The class will be dedicated to final review of the assessment piece and a rehearsal in preparation for the simulation.</p>\n<p><br/></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Review and rehearsal for final simulation</strong>",
            "topic_description": "Review and rehearsal for final simulation The online learning package will review the key principles of family group meetings in child protection contexts. Please complete the online package prior to class. The class will be dedicated to final review of the assessment piece and a rehearsal in preparation for the simulation.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 12(19 May - 25 May)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Assessed simulation, Family Group Meetings</strong><br><p>The final assessed simulations of the family group meetings will occur today. For this assessments, students are required to attend a 180 minute session on either the 22.5.2025 or 29.05.2025. The schedule will be finalised in April, and students will receive their exact roles in week 11 (by the 9th of May). The assessment will involve a Family Group meeting to develop a support and/ or intervention plan to address child protection concerns with a family. Following this there will be time for analysis and debriefing from the exercise.</p>\n<p>All participants should arrive at 10 minutes before the session start time to support timely completion of this exercise.</p>\n<p>Students who fail to participate in their allocated session will be required to apply for a deferred exam in order to be considered to undertake the assessment at a later date. Deferred exams are subject to strict eligibility requirements.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Assessed simulation, Family Group Meetings</strong>",
            "topic_description": "Assessed simulation, Family Group Meetings The final assessed simulations of the family group meetings will occur today. For this assessments, students are required to attend a 180 minute session on either the 22.5.2025 or 29.05.2025. The schedule will be finalised in April, and students will receive their exact roles in week 11 (by the 9th of May). The assessment will involve a Family Group meeting to develop a support and/ or intervention plan to address child protection concerns with a family. Following this there will be time for analysis and debriefing from the exercise. All participants should arrive at 10 minutes before the session start time to support timely completion of this exercise. Students who fail to participate in their allocated session will be required to apply for a deferred exam in order to be considered to undertake the assessment at a later date. Deferred exams are subject to strict eligibility requirements.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 13(26 May - 01 Jun)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Assessed simulation, Family Group Meetings</strong><br/><p>The final assessed simulations of the family group meetings will occur today. For this assessments, students are required to attend a 180 minute session on either the 22.5.2025 or 29.05.2025. The schedule will be finalised in April and students will receive their exact roles on 19th of May. The assessment will involve a Family Group meeting to develop a support and/ or intervention plan to address child protection concerns with a family. Following this there will be time for analysis and debriefing from the exercise.</p>\n<p>All participants should arrive at 10 minutes before the session start time to support timely completion of this exercise.</p>\n<p>Students who fail to participate in their allocated session will be required to apply for a deferred exam in order to be considered to undertake the assessment at a later date. Deferred exams are subject to strict eligibility requirements.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Assessed simulation, Family Group Meetings</strong>",
            "topic_description": "Assessed simulation, Family Group Meetings The final assessed simulations of the family group meetings will occur today. For this assessments, students are required to attend a 180 minute session on either the 22.5.2025 or 29.05.2025. The schedule will be finalised in April and students will receive their exact roles on 19th of May. The assessment will involve a Family Group meeting to develop a support and/ or intervention plan to address child protection concerns with a family. Following this there will be time for analysis and debriefing from the exercise. All participants should arrive at 10 minutes before the session start time to support timely completion of this exercise. Students who fail to participate in their allocated session will be required to apply for a deferred exam in order to be considered to undertake the assessment at a later date. Deferred exams are subject to strict eligibility requirements.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        }
    ]
}