{
    "course_title": "Urban Design: Urban Futures",
    "study_period": "Sem 1 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/UDAD7006-22432-7520",
    "full_course_code": "UDAD7006-22432-7520",
    "course_code": "UDAD7006",
    "class_code": "22432",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Individually and/or collaboratively critically analyse the opportunities and challenges of an urban problem"
        },
        {
            "number": "LO2.",
            "description": "Deploy a reflexive and research-driven design process"
        },
        {
            "number": "LO3.",
            "description": "Integrate contemporary urban design practice and discourse in the design of a complex urban project"
        },
        {
            "number": "LO4.",
            "description": "Communicate the strategic and experiential qualities of an urban design proposal across a range of scales and at exhibition standard."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Urban systems analysis report for design",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                }
            ],
            "weighting": "<dd>40% Individual Assignment </dd>",
            "due_date": "<dd><p>Student presentation and formative feedback in class 3/04/2025</p>\n<p>Blackboard submission 8/04/2025 4:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Oral, Written",
            "category": "Paper/ Report/ Annotation, Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Assessment Rationale:</strong></p>\n<p>In this report, students will present findings from the workshops analysing the system of environmental or societal factors to inform sustainable urban development in Cairns. Having established your sustainability subtopic in Workshop 1, this report will include four parts:</p>\n<p>1) Building an evidence base incorporating data sets and analysis of your urban sustainability subtopic.</p>\n<p>2) Exploring the ‘system’ surrounding your subtopic and clarifying its relationship to urban development in Cairns. </p>\n<p>3) Highlighting priority strategies through which urban design can contribute to sustainability outcomes across scales.</p>\n<p>4) Speculate on a positive vision<strong> </strong>for Cairns in which urban design enhanced social-ecological sustainability.</p>\n<p>The Research Report should contain text, graphic, and mapping diagrams conveying the above components to inform sustainable urban design in Cairns.</p>\n<p>This report is produced and assessed as individual work. It will also form a shared resource document for all course students which will be valuable for your next assignment and future studies. </p>\n<p><strong>Complex / authentic assessment using AI and/or MT to support learning: </strong>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The School of Architecture, Design and Planning uses Blackboard and Turnitin for assessment submission. Turnitin is accessed through the course Blackboard site. Turnitin also checks for plagiarism or instances where the original work of others is not appropriately acknowledged. Uploaded files must contain readable text and not be rasterised. Students are advised to commence assignment uploads with sufficient amount of time (consider possible technical problems with computers, internet speed, etc). After successfully submitting an assignment through Turnitin, a ‘Submission Complete!’ screen will be displayed. It is the student’s responsibility to check assignment preview and confirm successful submission. If the ‘Submission Complete!’ screen isn’t displayed, the student should regard the submission as unsuccessful. Students should download a copy of the digital receipt as proof they have submitted the assignment. Students who are experiencing upload issues must advise the Course Coordinator immediately by email and should include screenshots and a copy of the assessment for submission. To meet professional accreditation, public engagement and quality assurance obligations, digital copies of all course assessment items must be submitted in addition to any hard copy submission requirements specified in individual Course / Studio Outlines. Any physical models should be photographed and a minimum of two photographs describing the complete and full model must be included in the digital submission. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>The late penalty for this assessment item will be calculated as follows: </p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Strategic Urban Design Framework",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                }
            ],
            "weighting": "<dd>60% Individual - Hurdle </dd>",
            "due_date": "<dd><p>Formative presentation in class 15/05/2025</p>\n<p>Digital submission 28/05/2025 4:00 pm</p>\n<p>Final presentation in class 29/05/2025</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Oral, Written",
            "category": "Paper/ Report/ Annotation, Presentation, Product/ Design",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Assessment Rationale:</strong></p>\n<p>Students will apply your collective urban systems analysis (from A1 shared resource with attribution to authors) to inform your <em>Strategic Urban Design Framework</em> and site proposal – in essence, translating complex thinking into a clear, compelling strategy. In the Framework, you will present a compelling argument for a sustainable urban development on your site in Cairns. This will include your analysis of urban systems, and your integrated response to urban sustainability. Your framework will demonstrate how your proposed development will provide complementary sustainability outcomes across the ‘triple bottom line’ of environment, society, and economy. This framework will be presented through a range of techniques and media including images, text, site diagrams and mappings (2D and 3D) at various scales.</p>\n<p><strong>Complex / authentic assessment using AI and/or MT to support learning: </strong>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The School of Architecture, Design and Planning uses Blackboard and Turnitin for assessment submission. Turnitin is accessed through the course Blackboard site. Turnitin also checks for plagiarism or instances where the original work of others is not appropriately acknowledged. Uploaded files must contain readable text and not be rasterised. Students are advised to commence assignment uploads with sufficient amount of time (consider possible technical problems with computers, internet speed, etc). After successfully submitting an assignment through Turnitin, a ‘Submission Complete!’ screen will be displayed. It is the student’s responsibility to check assignment preview and confirm successful submission. If the ‘Submission Complete!’ screen isn’t displayed, the student should regard the submission as unsuccessful. Students should download a copy of the digital receipt as proof they have submitted the assignment. Students who are experiencing upload issues must advise the Course Coordinator immediately by email and should include screenshots and a copy of the assessment for submission. To meet professional accreditation, public engagement and quality assurance obligations, digital copies of all course assessment items must be submitted in addition to any hard copy submission requirements specified in individual Course / Studio Outlines. Any physical models should be photographed and a minimum of two photographs describing the complete and full model must be included in the digital submission.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>The late penalty for this assessment item will be calculated as follows: </p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(24 Feb - 01 Jun)",
            "activity_type": "Studio",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Studio/Lecture</strong><br><p>Week 1 </p>\n<p>LECTURE: Shaping urban futures - Introducing the course philosophy and purpose, and understanding local and regional issues systemically.</p>\n<p>DESIGN WORKSHOP 1: Systems thinking for urban sustainability - Introducing foundational systems concepts, methods, and confirming selection of focus topics.</p>\n<p>Week 2</p>\n<p>ENVIRONMENT LECTURE: Decarbonisation through urban design - Understanding the role and opportunities for urban design to support decarbonisation. </p>\n<p>DESIGN WORKSHOP 2A: Decarbonisation - Systems mapping of decarbonisation drivers to inform urban design</p>\n<p>ENVIRONMENT LECTURE: Biodiversity through urban design - Understanding the role and opportunities for urban design to support biodiversity outcomes. </p>\n<p>DESIGN WORKSHOP 2B: Biodiversity - Systems mapping of urban biodiversity drivers to inform urban design</p>\n<p>Week 3 </p>\n<p>SOCIETY LECTURE: Decarbonisation through urban design - Understanding the role and opportunities for urban design to support local needs in Cairns. </p>\n<p>DESIGN WORKSHOP 3A: Society - Systems mapping of societal drivers to inform urban design</p>\n<p>SOCIETY LECTURE: Building community wellbeing through urban design - Understanding the role and opportunities for urban design to support community and wellbeing. </p>\n<p>DESIGN WORKSHOP 3B: Community wellbeing - Systems mapping of community wellbeing drivers to inform urban design</p>\n<p>Week 4</p>\n<p>LECTURE: Elements of Urban Design for sustainability - Understanding five core elements of urban design</p>\n<p>DESIGN WORKSHOP 4A: Urban systems - Integrating urban design elements into environmental and social systems. </p>\n<p>DESIGN WORKSHOP 4B: Urban sustainability strategies - Integrating sustainable urban design strategies into environmental and social systems.</p>\n<p>Week 5</p>\n<p>Presentations and formative feedback to test ideas and approaches, as you finalise your urban systems analysis.</p>\n<p>Week 6 </p>\n<p>LECTURE: Developing a sustainable urban design framework - Introducing assignment 2.</p>\n<p>LECTURE: Understanding urban context Processes for understanding local context.</p>\n<p>DESIGN WORKSHOP 5: Context analysis - Understanding site scale, and mapping local elements of urban design. </p>\n<p>Week 7</p>\n<p>ECONOMY LECTURE: Urban design case studies and urban economics - Components of an urban design framework, case study examples, and urban economics.</p>\n<p>DESIGN WORKSHOP 6: Site and program options -Developing preliminary options for site response and program based on triple-bottom line requirements. </p>\n<p>Week 8</p>\n<p>LECTURE: Systems and synergy - Identifying core urban design strategies which provide complementary benefits to environmental, social, and economic outcomes. </p>\n<p>DESIGN WORKSHOP 7A: Synergy for urban sustainability - Identifying core urban design strategies which provide complementary benefits to environmental, social, and economic outcomes. </p>\n<p>Mid-semester break</p>\n<p>Week 9</p>\n<p>STUDIO SESSION: Refining strategies</p>\n<p>LECTURE: Urban design case study</p>\n<p>Week 10</p>\n<p>STUDIO SESSION: Clarity and narrative - Individual tutorial sessions to refine your Strategic Urban Design Framework and its communication prior to review.</p>\n<p>LECTURE: Urban design case studies </p>\n<p>Week 11</p>\n<p>Interim reviews - Presentations and formative feedback to test ideas and approaches, as you finalise your Strategic Urban Design Framework.</p>\n<p>Week 12</p>\n<p>STUDIO SESSION: Wrap up - Individual tutorial sessions to finalising your Strategic Urban Design Framework and its communication prior to submission.</p>\n<p>Week 13</p>\n<p>DESIGN WEEK: Final presentation and exhibition - Student presentations of final strategic urban design framework to industry and academic guests.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Studio/Lecture</strong>",
            "topic_description": "Studio/Lecture Week 1 LECTURE: Shaping urban futures - Introducing the course philosophy and purpose, and understanding local and regional issues systemically. DESIGN WORKSHOP 1: Systems thinking for urban sustainability - Introducing foundational systems concepts, methods, and confirming selection of focus topics. Week 2 ENVIRONMENT LECTURE: Decarbonisation through urban design - Understanding the role and opportunities for urban design to support decarbonisation. DESIGN WORKSHOP 2A: Decarbonisation - Systems mapping of decarbonisation drivers to inform urban design ENVIRONMENT LECTURE: Biodiversity through urban design - Understanding the role and opportunities for urban design to support biodiversity outcomes. DESIGN WORKSHOP 2B: Biodiversity - Systems mapping of urban biodiversity drivers to inform urban design Week 3 SOCIETY LECTURE: Decarbonisation through urban design - Understanding the role and opportunities for urban design to support local needs in Cairns. DESIGN WORKSHOP 3A: Society - Systems mapping of societal drivers to inform urban design SOCIETY LECTURE: Building community wellbeing through urban design - Understanding the role and opportunities for urban design to support community and wellbeing. DESIGN WORKSHOP 3B: Community wellbeing - Systems mapping of community wellbeing drivers to inform urban design Week 4 LECTURE: Elements of Urban Design for sustainability - Understanding five core elements of urban design DESIGN WORKSHOP 4A: Urban systems - Integrating urban design elements into environmental and social systems. DESIGN WORKSHOP 4B: Urban sustainability strategies - Integrating sustainable urban design strategies into environmental and social systems. Week 5 Presentations and formative feedback to test ideas and approaches, as you finalise your urban systems analysis. Week 6 LECTURE: Developing a sustainable urban design framework - Introducing assignment 2. LECTURE: Understanding urban context Processes for understanding local context. DESIGN WORKSHOP 5: Context analysis - Understanding site scale, and mapping local elements of urban design. Week 7 ECONOMY LECTURE: Urban design case studies and urban economics - Components of an urban design framework, case study examples, and urban economics. DESIGN WORKSHOP 6: Site and program options -Developing preliminary options for site response and program based on triple-bottom line requirements. Week 8 LECTURE: Systems and synergy - Identifying core urban design strategies which provide complementary benefits to environmental, social, and economic outcomes. DESIGN WORKSHOP 7A: Synergy for urban sustainability - Identifying core urban design strategies which provide complementary benefits to environmental, social, and economic outcomes. Mid-semester break Week 9 STUDIO SESSION: Refining strategies LECTURE: Urban design case study Week 10 STUDIO SESSION: Clarity and narrative - Individual tutorial sessions to refine your Strategic Urban Design Framework and its communication prior to review. LECTURE: Urban design case studies Week 11 Interim reviews - Presentations and formative feedback to test ideas and approaches, as you finalise your Strategic Urban Design Framework. Week 12 STUDIO SESSION: Wrap up - Individual tutorial sessions to finalising your Strategic Urban Design Framework and its communication prior to submission. Week 13 DESIGN WEEK: Final presentation and exhibition - Student presentations of final strategic urban design framework to industry and academic guests.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}