{
    "course_title": "Veterinary Professional Foundations",
    "study_period": "Sem 1 2025",
    "location": "Gatton",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/VETS1018-20645-7520",
    "full_course_code": "VETS1018-20645-7520",
    "course_code": "VETS1018",
    "class_code": "20645",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Outline the origins and contemporary status of the veterinary profession and allied animal health industries including key notions (eg. professionalism, interprofessional practice) and related frameworks and governance."
        },
        {
            "number": "LO2.",
            "description": "Describe the nature of veterinary service provision in terms of inclusive communication, human-animal connections (including Indigenous Australian perspectives), veterinary ethics and one welfare."
        },
        {
            "number": "LO3.",
            "description": "Apply general patient care approaches and management principles within the context of contemporary veterinary practice."
        },
        {
            "number": "LO4.",
            "description": "Apply the principles of evidence-based veterinary medicine to develop and answer research questions."
        },
        {
            "number": "LO5.",
            "description": "Critically evaluate the scientific literature and investigate, analyse and interpret data to make evidence-based decisions in veterinary science."
        },
        {
            "number": "LO6.",
            "description": "Engage in personal and professional development linked to academic support and success, research skills, wellness and career planning."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "In-semester Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 17/04/2025</p></dd>",
            "learning_objectives": "L03",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This examination will cover selected content from Weeks 1-6. See Blackboard Timetable for more information.</p>\n<p><strong>Use of Artificial Intelligence (AI) </strong></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Practical Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>7/06/2025 - 21/06/2025</p>\n<p>\n</p><p>School-based Prac Exam </p></dd>",
            "learning_objectives": "L03",
            "mode": "Activity/ Performance, Oral",
            "category": "Practical/ Demonstration",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>A practical examination relating to the content from all clinical workshops. Refer to Skills List to be provided. See Blackboard for further information. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "End of Semester Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>7/06/2025 - 21/06/2025</p></dd>",
            "learning_objectives": "L02, L04, L05, L06",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This examination will cover selected content from Weeks 1-13. See Blackboard Timetable for more information. </p>\n<p><strong>Use of Artificial Intelligence (AI) </strong></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Not scheduled",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Patient Care Foundations Workshops</strong><br/><p>These Workshops cover key features of clinical veterinary practice in Australia related to staff roles, premises, equipment and workflow; how to establish the general health of a veterinary patient and how to apply general first aid and patient care principles for small and large animals; the general principles, terminology, equipment and team roles that underpin the practice of veterinary medicine, therapeutics and surgery. </p></p><p><strong>Sub-activity:</strong> </p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Patient Care Foundations Workshops</strong>",
            "topic_description": "Patient Care Foundations Workshops These Workshops cover key features of clinical veterinary practice in Australia related to staff roles, premises, equipment and workflow; how to establish the general health of a veterinary patient and how to apply general first aid and patient care principles for small and large animals; the general principles, terminology, equipment and team roles that underpin the practice of veterinary medicine, therapeutics and surgery. Sub-activity:",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Professional Orientations Lectures</strong><br/><p>This lecture series provides a broad introduction to foundational topics relevant to the veterinary profession and industry in Australia, attributes of professions and emergent professions, inter professional practice, reflective practice, professional ethics, one welfare and how these relate to the legislative framework in which the veterinary team operates, general communication strategies useful to the veterinary team and the fundamentals of veterinary medical terminology, the nature of the human-animal bond (including Indigenous Australian perspectives) and why these concepts are important for members of the veterinary healthcare team.</p></p><p><strong>Sub-activity:</strong> Veterinary industry: Foundations Veterinary industry: Current status Professionalism and interprofessional practice 1 Human-Animal Bond (First Nation perspectives) Introduction to clinical communication 1 Introduction to Key Legislation for Veterinary Industry One Welfare Career planning tips Human-animal bond Ethics For Veterinary Teams  International Animal Health BVSc/BVT Careers Forum</p></div></td>",
            "topic_title": "<strong>Professional Orientations Lectures</strong>",
            "topic_description": "Professional Orientations Lectures This lecture series provides a broad introduction to foundational topics relevant to the veterinary profession and industry in Australia, attributes of professions and emergent professions, inter professional practice, reflective practice, professional ethics, one welfare and how these relate to the legislative framework in which the veterinary team operates, general communication strategies useful to the veterinary team and the fundamentals of veterinary medical terminology, the nature of the human-animal bond (including Indigenous Australian perspectives) and why these concepts are important for members of the veterinary healthcare team. Sub-activity: Veterinary industry: Foundations Veterinary industry: Current status Professionalism and interprofessional practice 1 Human-Animal Bond (First Nation perspectives) Introduction to clinical communication 1 Introduction to Key Legislation for Veterinary Industry One Welfare Career planning tips Human-animal bond Ethics For Veterinary Teams  International Animal Health BVSc/BVT Careers Forum",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The 'Science' of Veterinary Science Lectures</strong><br/><p>This lecture series covers the principles of evidence-based veterinary medicine, how to access, review and critically appraise peer-reviewed veterinary medical literature, the general features, advantages and disadvantages of veterinary epidemiological study designs, how to perform calculations of measures of association in veterinary practice and in veterinary research, apply the principles of causality in clinical and research activities and general statistical methods of relevance to veterinary research. </p></p><p><strong>Sub-activity:</strong> How to read a Scientific Paper Introduction to Evidence Based Veterinary Medicine (EBVM)  Study Design Measures of association (MOA)  Bias and confounding Causation Introduction to Statistics Statistical Approaches </p><p><strong>Learning outcomes:</strong> L04, L05</p></div></td>",
            "topic_title": "<strong>The 'Science' of Veterinary Science Lectures</strong>",
            "topic_description": "The 'Science' of Veterinary Science Lectures This lecture series covers the principles of evidence-based veterinary medicine, how to access, review and critically appraise peer-reviewed veterinary medical literature, the general features, advantages and disadvantages of veterinary epidemiological study designs, how to perform calculations of measures of association in veterinary practice and in veterinary research, apply the principles of causality in clinical and research activities and general statistical methods of relevance to veterinary research. Sub-activity: How to read a Scientific Paper Introduction to Evidence Based Veterinary Medicine (EBVM)  Study Design Measures of association (MOA)  Bias and confounding Causation Introduction to Statistics Statistical Approaches",
            "learning_outcomes": [
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The 'Science' of Veterinary Science Tutorials</strong><br/><p>These tutorials cover the principles of evidence-based veterinary medicine, how to access, review and critically appraise peer-reviewed veterinary medical literature, the general features, advantages and disadvantages of veterinary epidemiological study designs, how to perform calculations of measures of association in veterinary practice and in veterinary research, apply the principles of causality in clinical and research activities and general statistical methods of relevance to veterinary research. </p></p><p><strong>Sub-activity:</strong> Study Design Tutorials (online and Face to Face) MOA Tutorial half class (in-class) Causation Tutorial Revision EBVM EBVM Mock Exam</p><p><strong>Learning outcomes:</strong> L04, L05</p></div></td>",
            "topic_title": "<strong>The 'Science' of Veterinary Science Tutorials</strong>",
            "topic_description": "The 'Science' of Veterinary Science Tutorials These tutorials cover the principles of evidence-based veterinary medicine, how to access, review and critically appraise peer-reviewed veterinary medical literature, the general features, advantages and disadvantages of veterinary epidemiological study designs, how to perform calculations of measures of association in veterinary practice and in veterinary research, apply the principles of causality in clinical and research activities and general statistical methods of relevance to veterinary research. Sub-activity: Study Design Tutorials (online and Face to Face) MOA Tutorial half class (in-class) Causation Tutorial Revision EBVM EBVM Mock Exam",
            "learning_outcomes": [
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Patient Care Foundations Lectures</strong><br/><p>This lecture series covers key features of clinical veterinary practice in Australia related to staff roles, premises, equipment and workflow; how to establish the general health of a veterinary patient and how to apply general first aid and patient care principles for small and large animals; the general principles, terminology, equipment and team roles that underpin the practice of veterinary medicine, diagnostics, therapeutics, imaging, anaesthesia and surgery. </p></p><p><strong>Sub-activity:</strong> </p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Patient Care Foundations Lectures</strong>",
            "topic_description": "Patient Care Foundations Lectures This lecture series covers key features of clinical veterinary practice in Australia related to staff roles, premises, equipment and workflow; how to establish the general health of a veterinary patient and how to apply general first aid and patient care principles for small and large animals; the general principles, terminology, equipment and team roles that underpin the practice of veterinary medicine, diagnostics, therapeutics, imaging, anaesthesia and surgery. Sub-activity:",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Academic Success, Self-care, and Wellness Lectures</strong><br/><p>These lectures cover the nature of personal support and wellness programmes available for UQ students; the nature of work in the veterinary industry and strategies for supporting wellness during your studies and following graduation; the nature of academic student support available for UQ students and tips for successfully approaching lectures, note-taking, time management, assignments and study for examinations; foundational research skills, including library and database searching; the nature of employability and tips to prepare a basic resume to build throughout your programme, and capitalise on the range of career preparation opportunities afforded during your time studying at UQ</p></p><p><strong>Sub-activity:</strong> </p><p><strong>Learning outcomes:</strong> L06</p></div></td>",
            "topic_title": "<strong>Academic Success, Self-care, and Wellness Lectures</strong>",
            "topic_description": "Academic Success, Self-care, and Wellness Lectures These lectures cover the nature of personal support and wellness programmes available for UQ students; the nature of work in the veterinary industry and strategies for supporting wellness during your studies and following graduation; the nature of academic student support available for UQ students and tips for successfully approaching lectures, note-taking, time management, assignments and study for examinations; foundational research skills, including library and database searching; the nature of employability and tips to prepare a basic resume to build throughout your programme, and capitalise on the range of career preparation opportunities afforded during your time studying at UQ Sub-activity:",
            "learning_outcomes": [
                "L06"
            ]
        }
    ]
}