{
    "course_title": "Clinical Veterinary Elective",
    "study_period": "Sem 1 2025",
    "location": "Gatton",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/VETS5016-20653-7520",
    "full_course_code": "VETS5016-20653-7520",
    "course_code": "VETS5016",
    "class_code": "20653",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (06/01/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate the skills needed to acquire, store and retrieve information at a depth and breadth appropriate for entry into the veterinary profession."
        },
        {
            "number": "LO2.",
            "description": "Apply critical reasoning and make informed judgements."
        },
        {
            "number": "LO3.",
            "description": "Appreciate other cultures, opinions, feelings, emotions and values."
        },
        {
            "number": "LO4.",
            "description": "Communicate effectively by oral, written and electronic means."
        },
        {
            "number": "LO5.",
            "description": "Perform competent clinical examinations and establish relevant differential diagnoses and prognoses, and provide appropriate and ethical treatment and management plans"
        },
        {
            "number": "LO6.",
            "description": "Understand the key concepts of evidence-based medicine, and use a research-based approach to solve clinical and professional problems"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Activity Report / Case Log",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p> 10/11/2025 5:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L04, L05",
            "mode": "Written",
            "category": "Notebook/ Logbook",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<ul>\n<li>Each student must maintain a current comprehensive case-log of cases seen during elective placement.</li>\n<li>Students must submit a case log of 10 cases they have been primarily involved with in the first 3 weeks of their elective placement. The MyProgress software will be used to log the cases in and students will have to follow the template provided.</li>\n<li>Please note it is the student’s responsibility to submit the caselog to the correct assessor, in this case all case logs are to be sent to</li>\n<li>the course coordinator (Dr Meler); otherwise the submissions may not be graded, or marking may be significantly delayed if they are not submitted properly.</li>\n<li>The template might have to be adjusted for non-client facing rotations such as anesthesia, pathology or abattoir placement. Please talk to your placement supervisor or with the course coordinator if in doubt.</li>\n<li>A portfolio will be done instead for Public health and submitted directly by email to the rotation supervisor.</li>\n<li><strong>The caselog needs to be fully completed by the 10th of November 2025 and submitted through MyProgress by 5pm for review.</strong></li>\n</ul>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<ul>\n<li>This assignment will be marked by attributing 1.5 mark per case. The maximum mark that can be obtained is 15. To obtain the maximum mark, students need to submit by the due date and through the MyProgress platform a complete caselog of 10 individual and original cases seen during elective placement. The quality of the reflection and the degree of detail provided as well as the variety of cases chosen will be taken into account in the final mark.</li>\n<li>The due date for this assignment is at the beginning of the last week of the elective placement. Students that fail to submit their completed caselog will receive a mark of 0.</li>\n<li>Students who do not submit by the due date will lose 1 mark per day past the due date.</li>\n<li>Students who submit a partially or inappropriately filled case log will receive less than 1.5 mark per case and the mark will be attributed based on the quantity and quality of the information provided.</li>\n<li>Students who do submit other than by MyProgress will lose 2 marks unless it is due to a documented technical issue at the time of submission.</li>\n</ul>\n<p><strong>Use of Artificial Intelligence (AI) </strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submitted through MyProgress.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Clinical Elective: Placement Performance Assessment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p>Online submission by placement supervisor by 5pm Monday 17 November 2025</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Activity/ Performance",
            "category": "Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<ul>\n<li>Students will attend four (4) weeks of full-time clinical elective placement as either a UQ internal rotation or an extramural WIL placement. Refer to the Course Description and Additional Timetable Information for details about allocation and confirmation of placements.</li>\n<li>Assessment of performance is completed by the supervisor in the areas of knowledge base, clinical skills, technical skills, professionalism, and communication, according to guidelines set by the School of Veterinary Science. The assessment request is automatically sent to the industry placement partner in week 3 of the 4-week placement.</li>\n</ul>\n<p><strong>Criteria &amp; Marking</strong></p>\n<ul>\n<li>Assessment of student performance is submitted through InPlace. Students are asked to remind their supervisor that their performance assessment is an essential component of their grades.</li>\n<li>Clinical supervisors will receive the request to submit the performance assessment by the end of the third week and at the latest by the last day of the student attendance. This is due to the closeness between the last day of clinical placement and grade finalisation.</li>\n<li>Marking and assessment of the student’s performance during the rotation/placement will be carried out via the InPlace online platform following a standardised rubric (available on Blackboard).</li>\n<li>The clinical elective placement will be assessed using the rubric (available on Blackboard) which comprises 5 equally-weighted categories (Knowledge base; Clinical skills; Technical skills; Professional skills and Communication skills). Each category will have three performance levels (0/Does not meet standard; 1/Meets standard; 2/Exceeds standard). Students who score at least a “Meets standard” (an average of &gt; or equal to 1.0) in all categories pass the rotation. Students who score a “Does not meet standard” (an average of &lt;1.0) for any category will be required to undertake a “Formalised additional learning plan” (FALP). <em>See ADDITIONAL COURSE GRADING INFORMATION.</em></li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>At the end of Week 3 of the placement, UQ will send a request via email to your supervisor to complete an assessment on your performance in the workplace. Supervisors will submit this report directly to UQ as per instructions in the email. The formal feedback will be released to you following review by UQ.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Project Plan: Student details, Topic and Supervisor Confirmation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p> 14/04/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L04, L06",
            "mode": "Written",
            "category": "Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment is designed to enable a timely start for the EBVM (systematic review of an intervention in veterinary medicine) assessment by formally linking the student to a supervisor, independent assessor and topic, and to provide initial feedback and support. Students are required to complete the appended form that details their EBVM plan to the nominated supervisor and course coordinator.</p>\n<ul>\n<li>The student must complete and submit this form to their nominated advisor for signature in advance of the due date. The student must then upload an electronic copy of this completed form on the Blackboard site via TurnItIn.</li>\n<li>Please note that this form will be reviewed and assessed by either the course co-coordinator or an epidemiologist. The main aim of this assessment is to provide support and feedback to student relevant to their systematic review.</li>\n</ul>\n<p>Please note that this form will be reviewed and assessed by either the course co-coordinator or an epidemiologist. The main aim of this assessment is to provide support and feedback to student relevant to their systematic review.</p>\n<p><strong>Criteria &amp; Marking</strong></p>\n<p>To pass the course, students need to achieve a passing mark (&gt;50%) for the combination Project Plan AND Systematic Review of an Intervention assignment pieces, Supervisor assessment form, and caselog.</p>\n<p>The marking sheet for the Project Plan is available on Blackboard and is different to the EBVM which has its own distinct marking criteria.</p>\n<p><strong>Use of Artificial Intelligence (AI) </strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The Project Plan will be submitted via a Turnitin portal on the VETS5016 Blackboard site (located in the Assessments folder).</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "EBVM: Systematic Review of an intervention",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>55%</dd>",
            "due_date": "<dd><p> 5/09/2025 5:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L04, L06",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Evidence-Based Veterinary Medicine: Systematic Review of an intervention in veterinary medicine.</strong></p>\n<p>The focus of this report will be on systematic reviews as they pertain to the evaluation of interventions. In this context, ‘intervention’ refers to a treatment used to prevent, reduce or treat an adverse health outcome or event in animal populations and encompasses strategies such as antimicrobials, biologics and dietary or management manipulation. The report is expected to cover five main elements: a systematic review protocol, a well articulated clinical/research question, search plan for evidence to help answer the question, a critical evaluation of the evidence, and an interpretation and discussion of the results of the review. You are required to adequately address each section address concisely in a structured written report following conventions of scientific writing.</p>\n<p><strong>Sources of information:</strong></p>\n<ul>\n<li>Key references and other sources of information must be identified (the advisor will assist).</li>\n<li>Voluntary session designed to refresh research skills (including the use of databases and the referencing program Endnote) and to discuss the organisation of the systematic review will be scheduled at the UQ Gatton Library including using Zoom. Times and venues will be announced via Blackboard. </li>\n<li>Additional sources of information will be posted on the VETS5016 course Blackboard site and the course library website at <a href=\"http://guides.library.uq.edu.au/VETS5016-systematic_reviews\">http://guides.library.uq.edu.au/VETS5016-systematic_reviews</a></li>\n</ul>\n<p><strong>Criteria &amp; Marking</strong></p>\n<p>Guidelines are available on Blackboard.</p>\n<p><strong>Use of Artificial Intelligence (AI) </strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The EBVM Systematic Review will be submitted via a Turnitin portal on the VETS5016 Blackboard site (located in the Assessments folder).</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-4",
            "assessment_title": "EBVM: Performance Asssessment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p> 31/10/2025 5:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L04, L06",
            "mode": "Activity/ Performance",
            "category": "Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The goal of this form is to assess and testify to the progression of the student over the year, and particularly the acquisition of knowledge on the topic chosen, the development of their critical thinking skills, their time management skills and their diligence in performing the EBVM task while maintaining contact with you as supervisor. The form has been designed to guide discussions between student and supervisor in relation to the topic itself but also on the project management as to set-up expectations early on. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The primary supervisor must complete and submit this form on Blackboard by the due date</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": null,
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeks",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Evidence-based veterinary medicine</strong><br><p>Evidence-based veterinary medicine (Online Research): Systematic review of an intervention: A review of a clearly formulated question that uses systematic and explicit methods to identify, select, and critically appraise relevant research, and to collect and analyse data from the studies that are included in the review. The review will involve a systematic search process to locate studies that address a particular research question, as well as a systematic presentation and synthesis of the characteristics and findings of the results of this search. Criteria for inclusion and exclusion in the review will be objective, explicitly stated and consistently implemented such that the decision to include or exclude particular studies is clear to readers and another researcher using the same criteria would likely make the same decision. This explicit approach aims to minimise bias and allows readers of the review to assess the authors assumptions, procedures, evidence and conclusions, rather than taking the authors conclusions on faith. Specific instructions will be provided in Blackboard. This activity will be submitted through Blackboard Turnitin for marking.</p>\n<p>Readings/Ref: -; Higgins 2011; Thrusfield ch16; Guyatt 2011a; Hopewell 2009; CRD 2009; Dickersin 1994; Kleijnen 2009; O'Connor 2014a</p></br></p><p><strong>Sub-activity:</strong> EBVM Supervisor support</p><p><strong>Learning outcomes:</strong> L01, L02, L04, L06</p></div></td>",
            "topic_title": "<strong>Evidence-based veterinary medicine</strong>",
            "topic_description": "Evidence-based veterinary medicine Evidence-based veterinary medicine (Online Research): Systematic review of an intervention: A review of a clearly formulated question that uses systematic and explicit methods to identify, select, and critically appraise relevant research, and to collect and analyse data from the studies that are included in the review. The review will involve a systematic search process to locate studies that address a particular research question, as well as a systematic presentation and synthesis of the characteristics and findings of the results of this search. Criteria for inclusion and exclusion in the review will be objective, explicitly stated and consistently implemented such that the decision to include or exclude particular studies is clear to readers and another researcher using the same criteria would likely make the same decision. This explicit approach aims to minimise bias and allows readers of the review to assess the authors assumptions, procedures, evidence and conclusions, rather than taking the authors conclusions on faith. Specific instructions will be provided in Blackboard. This activity will be submitted through Blackboard Turnitin for marking. Readings/Ref: -; Higgins 2011; Thrusfield ch16; Guyatt 2011a; Hopewell 2009; CRD 2009; Dickersin 1994; Kleijnen 2009; O'Connor 2014a Sub-activity: EBVM Supervisor support",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>EBVM library session(s)</strong><br><p>EBVM guidance for library search of literature, and EndNote - training provided by the Library.</p></br></p><p><strong>Sub-activity:</strong> Library SDL research</p><p><strong>Learning outcomes:</strong> L01, L02, L06</p></div></td>",
            "topic_title": "<strong>EBVM library session(s)</strong>",
            "topic_description": "EBVM library session(s) EBVM guidance for library search of literature, and EndNote - training provided by the Library. Sub-activity: Library SDL research",
            "learning_outcomes": [
                "L01",
                "L02",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Elective placement</strong><br/><p>The clinical elective placement is designed to expand clinical skills and experiences in the student's particular area of interest. Students will attend four weeks of full-time clinical placement and work with clinical practitioners. Activities within each elective placement will be tailored to each student's particular area of interest. Performance will be assessed by the rotation supervisor and submitted through One45.</p></p><p><strong>Sub-activity:</strong> Clinical Elective Placement</p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Elective placement</strong>",
            "topic_description": "Elective placement The clinical elective placement is designed to expand clinical skills and experiences in the student's particular area of interest. Students will attend four weeks of full-time clinical placement and work with clinical practitioners. Activities within each elective placement will be tailored to each student's particular area of interest. Performance will be assessed by the rotation supervisor and submitted through One45. Sub-activity: Clinical Elective Placement",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}