{
    "course_title": "Aero Design and Manufacturing",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/AERO4100-61117-7560",
    "full_course_code": "AERO4100-61117-7560",
    "course_code": "AERO4100",
    "class_code": "61117",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Apply aerospace structural analysis techniques - Appropriately idealise the geometry of a real wing structure so that it can be assessed using standard thin walled structures analytical techniques."
        },
        {
            "number": "LO2.",
            "description": "Apply aerospace structural analysis techniques - Calculate the shear flow distribution in a multi-cell thin walled tube, and use this information to determine a structurally sound fastener configuration."
        },
        {
            "number": "LO3.",
            "description": "Apply aerospace structural analysis techniques - Calculate section properties, bending stresses/forces, and panel shear flows/stresses, for a single cell box beam subject to externally applied bending, and/or shear, and/or torsion loads."
        },
        {
            "number": "LO4.",
            "description": "Apply aerospace structural analysis techniques - Predict the compressive failure mode of a column (Euler, intermediate, or short column), and then calculate its compressive failure load using the appropriate technique."
        },
        {
            "number": "LO5.",
            "description": "Apply aerospace structural analysis techniques - Identify the appropriate boundary conditions for a rectangular panel loaded in compression, and calculate the stress at which it buckles."
        },
        {
            "number": "LO6.",
            "description": "Apply aerospace structural analysis techniques - Calculate the crippling stress of an angle section using the method of angles technique, and extend this technique to calculating the strength of stiffened panels."
        },
        {
            "number": "LO7.",
            "description": "Design and certify aerospace structures - Use aerospace structural analysis techniques to calculate margins of safety for each member in an externally loaded aerospace structure."
        },
        {
            "number": "LO8.",
            "description": "Design and certify aerospace structures - Use aerospace structural analysis techniques to perform preliminary sizing for an aerospace structural assembly where the applied loads are known, but the structural configuration has not yet been established, and to certify the new design in an engineering report."
        },
        {
            "number": "LO9.",
            "description": "Specify aerospace metallic manufacturing processes - Identify and explain the important characteristics of metallic materials which make them suitable for a range of critical applications in aerospace and near orbit flying vehicles."
        },
        {
            "number": "LO10.",
            "description": "Specify aerospace metallic manufacturing processes - Identify and describe the performance requirements for aerospace metallic materials, in terms of their operating conditions and loading regimes, and their required mechanical properties."
        },
        {
            "number": "LO11.",
            "description": "Specify aerospace metallic manufacturing processes - Identify and quantify the factors which determine the microstructure and properties of aerospace metals (aluminium alloys, titanium alloys, ultra-high strength steels, superalloys and other metals for aerospace applications) and use this knowledge to design material manufacturing processes which achieve pre-defined and specific mechanical properties and other performance characteristics."
        },
        {
            "number": "LO12.",
            "description": "Specify aerospace metallic manufacturing processes - Identify and explain the typical manufacturing processes used for producing aerospace structural engineering components."
        },
        {
            "number": "LO13.",
            "description": "Specify aerospace metallic manufacturing processes - Identify and explain the mechanical loading and state of stress for the major aerospace components."
        },
        {
            "number": "LO14.",
            "description": "Specify aerospace metallic manufacturing processes - Integrate the knowledge from learning objectives 9-13 to conduct material selection for advanced aerospace applications."
        },
        {
            "number": "LO15.",
            "description": "Specify aerospace metallic manufacturing processes - Integrate the knowledge from learning objectives 9-13 and work in a team to design a new manufacturing process for advanced aerospace applications."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "In-class problems",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                }
            ],
            "weighting": "<dd>10% (max 1% per week, capped at 10% total) </dd>",
            "due_date": "<dd><p> 31/07/2025 3:00 pm</p>\n<p> 7/08/2025 3:00 pm</p>\n<p> 14/08/2025 3:00 pm</p>\n<p> 21/08/2025 3:00 pm</p>\n<p> 28/08/2025 3:00 pm</p>\n<p> 4/09/2025 3:00 pm</p>\n<p> 11/09/2025 3:00 pm</p>\n<p> 18/09/2025 3:00 pm</p>\n<p> 25/09/2025 3:00 pm</p>\n<p> 16/10/2025 3:00 pm</p>\n<p> 23/10/2025 3:00 pm</p>\n<p> 30/10/2025 3:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L08, L09, L10, L11, L12, L13",
            "mode": "Written",
            "category": "Tutorial/ Problem Set",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<ul>\n<li>The teaching staff will answer questions and explain the task to be completed individually during the applied class.</li>\n<li>Students will submit their individual solutions electronically via Blackboard (<strong>\\\\Assessment\\\\applied classes\\\\applied class Week X</strong>).</li>\n<li>Solutions to some or all of the applied class problems will be presented and discussed during the course of the applied class.</li>\n</ul>\n<p>The maximum mark which can be obtained for this item of assessment is 10% (i.e. if you submit 9 applied classes during the course of the semester and receive full marks for each, your final mark for this item of assessment will be 9%; whereas if you submit 12 applied classes during the course of the semester and receive full marks for each, your final mark for this item of assessment will be 10%).</p>\n<p>Please refer to Blackboard for a detailed marking criteria.</p>\n<p><em>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit an electronic copy of your working via Blackboard (\\\\Assessment\\\\applied classes\\\\applied class Week X). Applied classes may be hand written, in which case the hardcopy should be scanned or imaged using, for example, a mobile phone and appropriate app (such as the Google Drive scan tool ). Alternatively, you may take photos and insert them as images into another document type such as MS Word (see https://uq.pressbooks.pub/digital-essentials-write-cite-submit/chapter/submitting-your-assignment/#handwritten under Submitting handwritten notes).</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Assignment 1: Aircraft Structural Design",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 25/09/2025 1:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L06, L07, L08",
            "mode": "Written",
            "category": "Product/ Design",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>In this assignment students will design a minimum weight aircraft structural component/assembly and certify the structural integrity of their design.</p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance.</p>\n<p>Please refer to Blackboard for detailed marking criteria.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via TurnItIn on Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Assignment 2: Manufacturing Process Design",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 30/10/2025 1:00 pm</p></dd>",
            "learning_objectives": "L09, L10, L11, L12, L13, L14, L15",
            "mode": "Written",
            "category": "Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assignment is centred around design and testing of a high strength aerospace aluminium alloy, and there are two associated laboratory sessions.</p>\n<p>The initial phase of this assignment is to be performed in groups. Students will design a heat treatment process for an aluminium alloy in order to achieve specified mechanical properties. In the first laboratory session, supplied tensile and compressive test specimens will be subjected to the designed heat treatment schedules. In the second laboratory session the heat treated samples will be mechanically tested, providing tensile and compressive stress-strain data.</p>\n<p>Students will then submit individual reports on this work, on the material design process and experiments, including background discussion. As part of this analysis, students will use stress-strain data from the laboratory experiments to derive mechanical properties for the alloy.</p>\n<p><em>If, for whatever reason, you find that your group is not functioning effectively, please contact your Course Coordinator for support.</em></p>\n<p>You must attend the laboratory sessions to receive all available marks for this item of assessment. If you cannot attend the practical then you need to apply for an extension. This may result in you either being allocated to a new practical time, or else being approved to submit the assessment subject to alternative arrangements, to be determined by the Course Coordinator. Where a student fails to attend their group's practical's without an approved reason, “Experimental Procedure”, “Results and Discussion” and “Conclusions” sections of their assignment will be marked as zero (where they were absent from both practical's) or else each mark against these criteria will be reduced by 50% (where they were absent from one practical).</p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance.</p>\n<p>Please refer to Blackboard for detailed marking criteria.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via TurnItIn on Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Final Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                }
            ],
            "weighting": "<dd>50% Structures(25%)/ Materials (25%) </dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>8/11/2025 - 22/11/2025</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L09, L10, L11, L12, L13",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Exam scope: Entire course.</p>\n<p><strong>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13",
            "activity_type": "Applied Class",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Applied Classes (Weeks 1-10, 12-13)</strong><br/><p>This time is set aside for solving example problems, and includes time to ask questions about the course content and the assignments. Tutorial problems will be issued to students before the scheduled tutorial time. The teaching staff will answer questions and explain the task to be completed individually during the tutorial session. Students are actively encouraged to form in groups during the tutorial and collaborate with group members in completing this learning activity. Solutions to some or all of the tutorial problems will be presented and discussed during the course of the tutorial.</p>\n<p>Note: there will not be a tutorial and a lecture in Week 10 due to the King's Birthday public holiday, but the heat treatment materials prac IS running in Week 10.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09, L10, L11, L12, L13</p></div></td>",
            "topic_title": "<strong>Applied Classes (Weeks 1-10, 12-13)</strong>",
            "topic_description": "Applied Classes (Weeks 1-10, 12-13) This time is set aside for solving example problems, and includes time to ask questions about the course content and the assignments. Tutorial problems will be issued to students before the scheduled tutorial time. The teaching staff will answer questions and explain the task to be completed individually during the tutorial session. Students are actively encouraged to form in groups during the tutorial and collaborate with group members in completing this learning activity. Solutions to some or all of the tutorial problems will be presented and discussed during the course of the tutorial. Note: there will not be a tutorial and a lecture in Week 10 due to the King's Birthday public holiday, but the heat treatment materials prac IS running in Week 10.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09",
                "L10",
                "L11",
                "L12",
                "L13"
            ]
        },
        {
            "learning_period": "Week 1",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Structures </strong><br/><p>Course Introduction. Introduction to thin walled structures.</p></p><p><strong>Learning outcomes:</strong> L07, L08</p></div></td>",
            "topic_title": "<strong>Structures </strong>",
            "topic_description": "Structures Course Introduction. Introduction to thin walled structures.",
            "learning_outcomes": [
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Structures </strong><br/><p>Shear flow in thin walled tubes</p></p><p><strong>Learning outcomes:</strong> L02, L08</p></div></td>",
            "topic_title": "<strong>Structures </strong>",
            "topic_description": "Structures Shear flow in thin walled tubes",
            "learning_outcomes": [
                "L02",
                "L08"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Structures </strong><br/><p>Fasteners</p></p><p><strong>Learning outcomes:</strong> L02, L08</p></div></td>",
            "topic_title": "<strong>Structures </strong>",
            "topic_description": "Structures Fasteners",
            "learning_outcomes": [
                "L02",
                "L08"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Structures </strong><br/><p>Wing box beams - Part 1</p></p><p><strong>Learning outcomes:</strong> L01, L03, L08</p></div></td>",
            "topic_title": "<strong>Structures </strong>",
            "topic_description": "Structures Wing box beams - Part 1",
            "learning_outcomes": [
                "L01",
                "L03",
                "L08"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Structures </strong><br/><p>Wing box beams - Part 2</p></p><p><strong>Learning outcomes:</strong> L03, L08</p></div></td>",
            "topic_title": "<strong>Structures </strong>",
            "topic_description": "Structures Wing box beams - Part 2",
            "learning_outcomes": [
                "L03",
                "L08"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Structures </strong><br/><p>Compressive failure - Part 1</p></p><p><strong>Learning outcomes:</strong> L04, L08</p></div></td>",
            "topic_title": "<strong>Structures </strong>",
            "topic_description": "Structures Compressive failure - Part 1",
            "learning_outcomes": [
                "L04",
                "L08"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Structures </strong><br/><p>Compressive failure - Part 2</p></p><p><strong>Learning outcomes:</strong> L05, L06, L08</p></div></td>",
            "topic_title": "<strong>Structures </strong>",
            "topic_description": "Structures Compressive failure - Part 2",
            "learning_outcomes": [
                "L05",
                "L06",
                "L08"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Materials </strong><br/><p>Introduction to aerospace materials and aluminium alloys</p></p><p><strong>Learning outcomes:</strong> L09, L10, L11, L12, L13</p></div></td>",
            "topic_title": "<strong>Materials </strong>",
            "topic_description": "Materials Introduction to aerospace materials and aluminium alloys",
            "learning_outcomes": [
                "L09",
                "L10",
                "L11",
                "L12",
                "L13"
            ]
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Materials </strong><br/><p>Titanium alloys and ultra-high strength steels</p></p><p><strong>Learning outcomes:</strong> L09, L10, L11, L12, L13</p></div></td>",
            "topic_title": "<strong>Materials </strong>",
            "topic_description": "Materials Titanium alloys and ultra-high strength steels",
            "learning_outcomes": [
                "L09",
                "L10",
                "L11",
                "L12",
                "L13"
            ]
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Materials lab part 1 (heat treatment)</strong><br/></p><p><strong>Learning outcomes:</strong> L10, L11, L13, L14, L15</p></div></td>",
            "topic_title": "<strong>Materials lab part 1 (heat treatment)</strong>",
            "topic_description": "Materials lab part 1 (heat treatment)",
            "learning_outcomes": [
                "L10",
                "L11",
                "L13",
                "L14",
                "L15"
            ]
        },
        {
            "learning_period": "Week 11(13 Oct - 19 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Materials </strong><br/><p>Superalloys and otherr light alloys</p></p><p><strong>Learning outcomes:</strong> L09, L10, L11, L12, L13</p></div></td>",
            "topic_title": "<strong>Materials </strong>",
            "topic_description": "Materials Superalloys and otherr light alloys",
            "learning_outcomes": [
                "L09",
                "L10",
                "L11",
                "L12",
                "L13"
            ]
        },
        {
            "learning_period": "Week 11(13 Oct - 19 Oct)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Materials lab part 2 (tensile/compressive testing)</strong><br/></p><p><strong>Learning outcomes:</strong> L10, L11, L13, L14, L15</p></div></td>",
            "topic_title": "<strong>Materials lab part 2 (tensile/compressive testing)</strong>",
            "topic_description": "Materials lab part 2 (tensile/compressive testing)",
            "learning_outcomes": [
                "L10",
                "L11",
                "L13",
                "L14",
                "L15"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Materials </strong><br/><p>Sheet forming and forging</p></p><p><strong>Learning outcomes:</strong> L12, L13</p></div></td>",
            "topic_title": "<strong>Materials </strong>",
            "topic_description": "Materials Sheet forming and forging",
            "learning_outcomes": [
                "L12",
                "L13"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Materials</strong><br/><p>Manufacturing case studies</p></p><p><strong>Learning outcomes:</strong> L12, L13</p></div></td>",
            "topic_title": "<strong>Materials</strong>",
            "topic_description": "Materials Manufacturing case studies",
            "learning_outcomes": [
                "L12",
                "L13"
            ]
        }
    ]
}