{
    "course_title": "Agronomy 2",
    "study_period": "Sem 2 2025",
    "location": "External",
    "attendance": "Online",
    "url": "https://course-profiles.uq.edu.au/course-profiles/AGRC3002-62261-7560",
    "full_course_code": "AGRC3002-62261-7560",
    "course_code": "AGRC3002",
    "class_code": "62261",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Discuss the application of crop physiology and agronomic principles to grain production in farming systems."
        },
        {
            "number": "LO2.",
            "description": "Discuss the role of biotic stress (pathogens and pests)and herbicide resistance risk in farming systems."
        },
        {
            "number": "LO3.",
            "description": "Discuss the interacting agronomic factors that drive decision-making in sustainable crop production for a changing climate."
        },
        {
            "number": "LO4.",
            "description": "Reflect critically on recently conducted practical activities."
        },
        {
            "number": "LO5.",
            "description": "Communicate effectively in both written and oral format to non-scientific and scientific audiences."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Agronomists report on impact of climate change",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 7/10/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L05",
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Agronomist’s Report on Impact of Climate change and variability on crop productivity</strong></p>\n<p><strong>Type: </strong>Presentation</p>\n<p><strong>Maximum length:</strong> 10 minutes</p>\n<p>This assessment is delivered as a pre-recorded presentation as if contributing to a virtual “Conference”. </p>\n<p>The presentation should be a maximum of 10 minutes.</p>\n<p>In this case study assume you are working as an agronomist. You are interested in developing agronomic systems that are well adapted to climate change that are likely to take place or is already taking place in your region. You need to consider which aspects of climate change (eg, increased temperature, increased frequency of drought, increased sea level causing salinity problem etc.) are an issue in the region. The key issues to be addressed in this assignment are, for a location of your choice, to describe climatic variability and climate change and discuss their likely overall impact as well as the specific effect of a particular aspect of climate change (eg flood occurrence) on crop productivity under the current cropping system, and possible agronomic modifications to maintain or even enhance crop productivity.</p>\n<p><strong>Your presentation should contain sections on:</strong></p>\n<ol>\n<li>Quantification of climatic variability and likely climate change for a selected location,</li>\n<li>The potential impact on crop productivity under the existing agronomic practice of a main cropping system for the location and</li>\n<li>Modified agronomic methods for the location including at least 3 of the following items for the existing main cropping system or alternative cropping system; crop calendar, cultivation method, variety, fertilizer, plant population and weed control.</li>\n</ol>\n<p>Your report will be assessed based on the content for each of the tasks mentioned above.</p>\n<p>The assessment guidelines and marking criteria sheet can be found on the course blackboard site: <strong>Agronomists Report-Pre-recorded Presentation &amp; Marking Criteria</strong></p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. </p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. The use of AI or MT must be referenced appropriately. </p>\n<p>Please see assessment guidelines in blackboard course site for specific instructions. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your Assessment task, in Blackboard, via the Turnitin link by the submission deadline. You should also retain an electronic copy of every piece of assessment you submit.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Journal of field/meeting notes",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 28/10/2025 2:00 pm</p></dd>",
            "learning_objectives": "L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will write up a report that is based on the observations and reflections in the various field and practical activities.</p>\n<p>As an agronomist it is critical to keep a good diary/records of field visits, observations and what issues or concerns may have been raised by farmers, extension officers or experts in a particular field. This assessment task is designed to encourage you to start making notes on field observations and or points that may be useful to reflect on at a later date. Photos are also an excellent way to get snapshots and records of what was observed for reference at a later date but these should always be accompanied by some notes. For the purpose of this activity no photos are required just notes and a summary of data to remind you what you were observing. Eg. 1/8/2019 Plant establishment counts in wheat were X% lower in the rainfed environment compared to the irrigated environment…..  </p>\n<p>The journal should include notes compiled from each of 4 practical session conducted throughout semester, field walks, shed meetings, entomology practical and reflections on any discussions had in practical sessions.</p>\n<p>Your compiled journal should consist of a maximum of one A4 (300 words) page per day/field visit (typed). Each days entries will be weighted equally. Compiled notes need to make logical sense when read in terms of flow of record keeping but doesn’t necessarily have to be all in sentence structure, ie dot points are acceptable for certain parts, but they must make sense to the reader as a summary of the observations/activities for the day. As a minimum entries should include: date, time, location, weather conditions (eg. cloudy, sunny, hot and dry), crop and crop status/development, observations, if an experimental site record whether treatment effects are apparent and what/how these appear. Writing should describe observations clearly and neatly. Descriptions should be unambiguous such that a person returning to the site could find the patterns described in your journal using your notes. Reflections need to briefly summarise material delivered, identify what was interesting and what you gained from the session (max 400 words/session).</p>\n<p>Marking criteria will be provided on blackboard.</p>\n<p>For internal students, there are Practical Classes scheduled. The practicals run for approximately 3 hours and are a combination of laboratory-based and shed/field-based activities.</p>\n<p>To obtain a passing grade for the practical classes (Journal of field/meeting notes assessment item) students must complete a reflection exercise on four of the practical sessions.</p>\n<p>Internal students who cannot attend an in-person prac for legitimate reasons should contact the course coordinator as soon as they know they will not be able to attend, even if on the same day/morning of a scheduled prac activity.</p>\n<p>This assessment task evaluates students' abilities, observational skills and knowledge. Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. </p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. The use of AI or MT must be referenced appropriately. </p>\n<p>Please see assessment guidelines in blackboard course site for specific instructions. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your Assessment task, in Blackboard, via the Turnitin link by the submission deadline. You should also retain an electronic copy of every piece of assessment you submit.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Final (End of Semester) Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>8/11/2025 - 22/11/2025</p></dd>",
            "learning_objectives": "L01, L02, L03, L05",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Exam Structure</strong></p>\n<p>Students will complete an invigilated (paper based) exam during end-of-semester exam period which will cover all lecture and practical material covered in the course. All questions will require a short essay type response integrating content and knowledge. In addition, students will be required to respond to scenario based questions.</p>\n<p><strong>Exam Details</strong></p>\n<p>The exam will be an on-campus exam. Have your UQ student ID card available for all your exams.</p>\n<p>Students enrolled in External delivery must attend the exam in-person, either on campus OR at an approved off-campus venue as organized with UQ Examinations. Students who live within a 200km radius of the campus will be expected to attend campus for the exam.</p>\n<p>Examinations will contact students directly to confirm arrangements. Please ensure to check your UQ student email account regularly throughout semester as One reminder will be sent and students who fail to nominate an exam centre and will be automatically assigned to sit their exam on campus. Late nominations will not be accepted.</p>\n<p>Please ensure you update your semester address in Si-net at the start of the semester to accurately reflect where you are residing.</p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": []
}