{
    "course_title": "Food & Fibre Case Studies III",
    "study_period": "Sem 2 2025",
    "location": "Gatton",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/AGRC3000-62033-7560",
    "full_course_code": "AGRC3000-62033-7560",
    "course_code": "AGRC3000",
    "class_code": "62033",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Critically analyse an agribusiness-related problem using an appropriate method"
        },
        {
            "number": "LO2.",
            "description": "Work collaboratively with a client to develop a detailed plan to solve a specific agribusiness problem"
        },
        {
            "number": "LO3.",
            "description": "Work collaboratively in a group and with the mentor to conduct research and analyse results"
        },
        {
            "number": "LO4.",
            "description": "Document the results of research and analysis into a professional report"
        },
        {
            "number": "LO5.",
            "description": "Articulate the results of research and analysis to different audiences and to an agribusiness client"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Group project proposal",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 28/08/2025 3:00 pm</p>\n<p>\n</p><p>Turnitin submission via Blackboard</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Description</strong></p>\n<p>You will be asked to prepare a maximum 1,500-word project proposal (excluding references, tables, figures and appendix). The assessment is designed to ensure that your group has an appropriate and reasonable plan and workload for the Semester and that your group’s planned work can meet the client organisation's expectations and academic requirements. </p>\n<p><strong>Specific requirements</strong></p>\n<ul>\n<li>At the start of Semester 2, students will have access to the list of client organisations and be asked to select three clients they are interested in working with. The teaching staff will decide the student-client allocation in consultation with the client organisation.</li>\n<li>You should have at least two meetings with your client organisation prior to submitting your group project plan (i) in Week 2 to clarify the client's issues that they request you to address in your group project, and (ii) in Week 4 to seek feedback on your draft group proposal. </li>\n<li>Your proposal must include the following sections:</li>\n</ul>\n<ol>\n<li>Project background</li>\n<li>Project objectives</li>\n<li>Methodology (including how you will collect the information, what information you will compile, and how you will analyse the information)</li>\n<li>A Gantt chart outlining your group project plan (i.e. who will do what by when to achieve the desired final objectives)</li>\n<li>A group charter. Please see <a href=\"https://web.library.uq.edu.au/node/3954/2\">the Library website</a></li>\n</ol>\n<ul>\n<li>Given the nature and duration of the course, the client organisations are advised to direct students to use publicly accessible (e.g., no log-in required and should be accessible without accepting the terms and conditions), non-confidential and non-sensitive data and information only.</li>\n<li>You must cite all ideas in your group work that are not your own. Please use the APA 7th style and see the UQ library site and staff for details and assistance: <a href=\"https://guides.library.uq.edu.au/referencing/apa7\">https://guides.library.uq.edu.au/referencing/apa7</a></li>\n<li>An effectively developed plan will allow students to use their agreed plan each week to monitor progress, guide corrective action, and discuss progress with the course coordinator and client at regular meetings.</li>\n<li>Students are expected to have commenced their project well before submitting this plan. The submission date has been deliberately set in <strong>Week 5</strong> to allow students sufficient time to demonstrate their progress in a well-thought-out and documented plan.</li>\n<li>You might be asked by your client to deliver a separate presentation on the proposal to their organisation. You should respond to this request positively. Your overall engagement with the client will be considered in the assessment marking.</li>\n<li>You will have opportunities to consult with the teaching staff at all stages of your project development by email/in-person consultation.</li>\n<li>You must submit your project proposal to the assignment dropbox on <strong>the Blackboard course site</strong> on or before the due date.</li>\n<li>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of the assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission, independent of AI and MT tools. The use of AI or MT must be referenced appropriately. Please see assessment guidelines in blackboard course site for specific instructions.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>ONE electronic copy of the assignment must be submitted through the Turnitin link on the course Blackboard website by the assessment due date. You should also keep an electronic copy of every piece of assessment you submit. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Group final presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p>Submission via Blackboard 20/10/2025 3:00pm</p>\n<p>Plus, Group Presentation conducted in person in week 12.</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Description</strong></p>\n<p>You will deliver <strong>a maximum 10-minute group presentation</strong>. This mimics the professional context in which you deliver the main outputs from your project to the relevant audience, e.g., managers, colleagues, and clients. You will be assessed on the quality of information you produce from your project and your ability to effectively communicate results concisely and coherently. All client organisations will be invited to attend the presentations. Therefore, your presentations should contain non-confidential, non-sensitive information. Your ability to respond to questions will also be assessed, subject to time availability. </p>\n<p><strong>Specific requirements</strong></p>\n<ul>\n<li>All group members must speak during the presentation. </li>\n<li>Students are required to deliver their group presentations in person.</li>\n<li>The teaching staff will assess your submission with input from the client. Students may not receive the same mark for the group assessment. </li>\n<li>Your presentation will be recorded for your client organisation's reference and marking purposes. </li>\n<li>Given the time limit, you might not be able to present all the information from your report. This is a good exercise for prioritising content and presenting it efficiently. </li>\n<li>All tables and diagrams in your slides must have titles and be numbered and annotated accordingly. Sources of data must be included under each table. You must cite all ideas in your presentation slides that are not your own. Please use the APA 7th style. <a href=\"https://guides.library.uq.edu.au/referencing/apa7\">https://guides.library.uq.edu.au/referencing/apa7</a></li>\n<li>You might be asked by your client to deliver a separate presentation on your final report to their organisation. You should respond to this request positively. Your overall engagement with the client will be considered in the assessment marking.</li>\n<li>You will have opportunities to consult with the teaching staff at all project development stages by email/in-person consultation.</li>\n<li>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of the assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission, independent of AI and MT tools. The use of AI or MT must be referenced appropriately. Please see assessment guidelines in blackboard course site for specific instructions.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Regardless of your presentation time, you must submit <strong>your presentation slides</strong> in a PDF file to the assignment dropbox on the Blackboard course site on or before the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Group final report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 30/10/2025 3:00 pm</p>\n<p>\n</p><p>Turnitin submission via Blackboard</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Description</strong></p>\n<p>You will be asked to submit the final version of <strong>your group’s final project report</strong>. The length and format of your group report are to be discussed with your client. A limit of 4,000 words is for guidance only. The group project report should demonstrate your deep understanding of agribusiness problems raised by the client and your ability to develop and present well-researched, practical and appropriate solutions to their problems.</p>\n<p> <strong>Specific requirements</strong></p>\n<ul>\n<li>Only one report is required to be submitted for each group.</li>\n<li>The teaching staff will assess the report with input from the client and peer members of each group, which means that students may not receive the same mark for the group assessment. </li>\n<li>There is no specific template for the project report. You are given the flexibility to structure your project report in consultation with your client organisation. However, the expectation is that your project report should include the following sections: </li>\n<li><strong>Executive summary</strong> - a one-page summary of the research and findings</li>\n<li><strong>Introduction</strong> - background to the study, the problem that was addressed, information about the industry and the client</li>\n<li><strong>Literature review</strong> - provide evidence of having conducted a review of relevant literature and use it to contribute to the value of the project to the client.</li>\n<li><strong>Methodology</strong> - provide details of the methods employed, supported by references from the literature.</li>\n<li><strong>Results</strong> - convey findings in a concise manner that the client easily understands.</li>\n<li><strong>Discussion and recommendations</strong> - Extend the discussion on interpreting your findings by providing linkages to the secondary data. Formulate practical suggestions for your client based on your results and supported by the evidence of the research and literature, where possible.</li>\n<li><strong>Limitations</strong> - identify any research limitations and suggest how these might be overcome in future research activities.</li>\n<li><strong>Future research</strong> - suggest what future research could be considered by the client</li>\n<li>The length and format of your group report are to be discussed with your client. A limit of 4,000 words is for guidance only. No penalties will be assigned if you exceed or write shorter than this word limit. However, please keep in mind that brevity and clarity are always preferred.</li>\n<li>All tables and diagrams must have titles and be numbered and annotated accordingly. Sources of data must be included under each table.</li>\n<li>You must cite all ideas in your presentation slides that are not your own. Assessment items should use the APA 7th style. Please see the UQ library site and staff for details and assistance: <a href=\"https://guides.library.uq.edu.au/referencing/apa7\">https://guides.library.uq.edu.au/referencing/apa7</a>.</li>\n<li>You must carefully consult with your client organisation regarding the confidentiality of information in your project report. It would be best to consider different ways to synthesise and use de-identified data to produce a high-quality report while maintaining your client's confidential data and information.</li>\n<li>You will have opportunities to consult with the teaching staff at all project development stages by email/in-person consultation.</li>\n<li>In addition to submitting your report to the Blackboard site, your final project report must be emailed to the client or as the course coordinator advises. You should thank your client for the opportunity. There is no requirement to submit a printed final report to your client. Additionally, you might be asked by your client to deliver a separate presentation on your final report to their organisation. You should respond to this request positively. Your overall engagement with the client will be considered in the assessment marking.  </li>\n<li>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of the assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission, independent of AI and MT tools. The use of AI or MT must be referenced appropriately. Please see assessment guidelines in blackboard course site for specific instructions.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students must submit their group report using the Turnitin link in the course Blackboard site by the submission deadline. Only one report is required to be submitted for each group, and instructions will be in blackboard. Retain an electronic copy of every piece of assessment you submit. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Peer evaluation and reflection",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>10% (Peer evaluation 5% and reflection 5%) </dd>",
            "due_date": "<dd><p> 30/10/2025 3:00 pm</p>\n<p>\n</p><p>Turnitin submission via Blackboard</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Description</strong></p>\n<p>This assessment consists of <strong>two components</strong>: (i) Peer evaluation (5%); and (ii) Personal reflection (5%).</p>\n<p><strong>Specific requirements</strong></p>\n<ul>\n<li><strong>Peer evaluation</strong> - Complete \"the peer evaluation\" form (accessible from the Blackboard site). Note that while this component is to be submitted before or on the due date, you must keep records of weekly group activities throughout the semester, including each member's participation and discussion topics. The peer evaluation will influence the final mark awarded to each team member for the group's final report. If the peer assessment result indicates that a team member has not done their fair share of the work, their group final report’s marks may be adjusted downward based on peer assessment results. Your mark for this component will also be subject to your mentor’s assessment of your attendance and participation in group meetings, including those with the client throughout the semester.</li>\n<li><strong>Personal reflection</strong> – You should prepare 2-3 A4 pages of personal reflections. There is no specific template for this component. However, you must include the following aspects in your self-reflection:</li>\n<li>Your contribution to the group's final report by mentioning specific sections or topics you’re in charge of and tasks such as data analyses, editing, formatting, moderating meetings, etc.). Dot points are acceptable.</li>\n<li>The skills you applied during this project and the skills you began to develop during the project.</li>\n<li>Lessons learnt from a personal perspective, including identification of strengths and areas in need of improvement.</li>\n<li>Reflect on your overall experience and discuss how this might inform you when strategising your future professional development and career pathway.  </li>\n<li>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of the assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission, independent of AI and MT tools. The use of AI or MT must be referenced appropriately. Please see assessment guidelines in blackboard course site for specific instructions.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students must submit their assessment task in the Blackboard site via the Turnitin link by the submission deadline. You should also retain an electronic copy of every piece of assessment you submit. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(28 Jul - 03 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>W1: Course introduction (workshop)</strong><br><p>Workshop on the course plan, group allocation, assessments and available resources/support. </p></br></p></div></td>",
            "topic_title": "<strong>W1: Course introduction (workshop)</strong>",
            "topic_description": "W1: Course introduction (workshop) Workshop on the course plan, group allocation, assessments and available resources/support.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(04 Aug - 10 Aug)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Client meeting #1: Inception meeting</strong><br/><p>Introduction, clarify topics and methods, and nature of engagement</p></p></div></td>",
            "topic_title": "<strong>Client meeting #1: Inception meeting</strong>",
            "topic_description": "Client meeting #1: Inception meeting Introduction, clarify topics and methods, and nature of engagement",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(04 Aug - 10 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>W2: Working in a team (workshop)</strong><br/><p>Workshop on the group charter, working in a team effectively, peer evaluation, and engagement with the client</p></p></div></td>",
            "topic_title": "<strong>W2: Working in a team (workshop)</strong>",
            "topic_description": "W2: Working in a team (workshop) Workshop on the group charter, working in a team effectively, peer evaluation, and engagement with the client",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(11 Aug - 17 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>W3: The project plan (workshop)</strong><br/><p>Workshop on the project plan, ethics, literature review, collecting information and analytical methods</p></p></div></td>",
            "topic_title": "<strong>W3: The project plan (workshop)</strong>",
            "topic_description": "W3: The project plan (workshop) Workshop on the project plan, ethics, literature review, collecting information and analytical methods",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(18 Aug - 24 Aug)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Client Meeting #2: Feedback on the draft proposal</strong><br/><p>Feedback on the first draft proposal</p></p></div></td>",
            "topic_title": "<strong>Client Meeting #2: Feedback on the draft proposal</strong>",
            "topic_description": "Client Meeting #2: Feedback on the draft proposal Feedback on the first draft proposal",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(18 Aug - 24 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>W4: Finalising the project plan and responding to feedback (workshop)</strong><br/><p>Workshop on reviewing your draft proposal, how to present to your client, and how to respond to feedback and provide feedback to others </p></p></div></td>",
            "topic_title": "<strong>W4: Finalising the project plan and responding to feedback (workshop)</strong>",
            "topic_description": "W4: Finalising the project plan and responding to feedback (workshop) Workshop on reviewing your draft proposal, how to present to your client, and how to respond to feedback and provide feedback to others",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(25 Aug - 31 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>W5: Students work on the project</strong><br/><p>Students should allocate adequate time to work independently and in a group and meet with the teaching staff to discuss progress during the scheduled learning hours.</p></p></div></td>",
            "topic_title": "<strong>W5: Students work on the project</strong>",
            "topic_description": "W5: Students work on the project Students should allocate adequate time to work independently and in a group and meet with the teaching staff to discuss progress during the scheduled learning hours.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(01 Sep - 07 Sep)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Client Meeting #3: Group proposal presentation</strong><br/><p>Feedback on the group proposal presentation</p></p></div></td>",
            "topic_title": "<strong>Client Meeting #3: Group proposal presentation</strong>",
            "topic_description": "Client Meeting #3: Group proposal presentation Feedback on the group proposal presentation",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(01 Sep - 07 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>W6: Students work on the project</strong><br/><p>Students should allocate adequate time to work independently and in a group and meet with the teaching staff to discuss progress during the scheduled learning hours.</p></p></div></td>",
            "topic_title": "<strong>W6: Students work on the project</strong>",
            "topic_description": "W6: Students work on the project Students should allocate adequate time to work independently and in a group and meet with the teaching staff to discuss progress during the scheduled learning hours.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(08 Sep - 14 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>W7: Students work on the project</strong><br/><p>Students should allocate adequate time to work independently and in a group and meet with the teaching staff to discuss progress during the scheduled learning hours.</p></p></div></td>",
            "topic_title": "<strong>W7: Students work on the project</strong>",
            "topic_description": "W7: Students work on the project Students should allocate adequate time to work independently and in a group and meet with the teaching staff to discuss progress during the scheduled learning hours.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>W8: Students work on the project</strong><br/><p>Students should allocate adequate time to work independently and in a group and meet with the teaching staff and the client to discuss progress during the scheduled learning hours.</p></p></div></td>",
            "topic_title": "<strong>W8: Students work on the project</strong>",
            "topic_description": "W8: Students work on the project Students should allocate adequate time to work independently and in a group and meet with the teaching staff and the client to discuss progress during the scheduled learning hours.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Client Meeting #4: Progress update</strong><br/><p>Reporting progress and receiving feedback</p></p></div></td>",
            "topic_title": "<strong>Client Meeting #4: Progress update</strong>",
            "topic_description": "Client Meeting #4: Progress update Reporting progress and receiving feedback",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>W9: Students work on the project</strong><br/><p>Students should allocate adequate time to work independently and in a group and meet with the teaching staff and the client to discuss progress during the scheduled learning hours.</p></p></div></td>",
            "topic_title": "<strong>W9: Students work on the project</strong>",
            "topic_description": "W9: Students work on the project Students should allocate adequate time to work independently and in a group and meet with the teaching staff and the client to discuss progress during the scheduled learning hours.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(06 Oct - 12 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>W10: Preparing the report &amp; presentation (workshop)</strong><br/><p>Workshop on reviewing the group report and preparing for the group presentation</p></p></div></td>",
            "topic_title": "<strong>W10: Preparing the report &amp; presentation (workshop)</strong>",
            "topic_description": "W10: Preparing the report & presentation (workshop) Workshop on reviewing the group report and preparing for the group presentation",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(13 Oct - 19 Oct)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Client Meeting #5: Feedback on the draft report and the presentation </strong><br/><p>Receiving feedback on the draft report and final presentation</p></p></div></td>",
            "topic_title": "<strong>Client Meeting #5: Feedback on the draft report and the presentation </strong>",
            "topic_description": "Client Meeting #5: Feedback on the draft report and the presentation Receiving feedback on the draft report and final presentation",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(13 Oct - 19 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>W11: Students work on the project</strong><br/><p>Students should allocate adequate time to work independently and in a group and meet with the teaching staff and the client to discuss progress during the scheduled learning hours.</p></p></div></td>",
            "topic_title": "<strong>W11: Students work on the project</strong>",
            "topic_description": "W11: Students work on the project Students should allocate adequate time to work independently and in a group and meet with the teaching staff and the client to discuss progress during the scheduled learning hours.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(20 Oct - 26 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>W12: Final group presentations</strong><br/></p></div></td>",
            "topic_title": "<strong>W12: Final group presentations</strong>",
            "topic_description": "W12: Final group presentations",
            "learning_outcomes": []
        }
    ]
}