{
    "course_title": "Animal Environmental Physiology",
    "study_period": "Sem 2 2025",
    "location": "Gatton",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/ANIM2021-62272-7560",
    "full_course_code": "ANIM2021-62272-7560",
    "course_code": "ANIM2021",
    "class_code": "62272",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Explain what is meant by environmental physiology of animals."
        },
        {
            "number": "LO2.",
            "description": "Students will become comfortable using technologies (inc. data loggers) to measure climatic conditions, and animal responses to climate conditions."
        },
        {
            "number": "LO3.",
            "description": "Propose solutions to potential problems related to climate impacts on animals."
        },
        {
            "number": "LO4.",
            "description": "Illustrate the methods that can be used to modify both macro and micro climates to address their impact on animals."
        },
        {
            "number": "LO5.",
            "description": "Discuss the ethical issues associated with climate and animals."
        },
        {
            "number": "LO6.",
            "description": "Effectively communicate how the various environmental factors affect animal physiology."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Sequential Practical Assessment Items",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>35% Each sequential item contributes 5% towards the sequential practical (total 35%) and are exempt from supplementary. </dd>",
            "due_date": "<dd><p>1) Evaluating Microclimates 15/08/2025 5:00 pm</p>\n<p>2) Shade Influence on Goats 29/08/2025 5:00 pm</p>\n<p>3) Climates and Climate Models 5/09/2025 5:00 pm</p>\n<p>4) Thermal Preferences of Reptiles 12/09/2025 5:00 pm</p>\n<p>5) Exercise Induced Hyperthermia 26/09/2025 5:00 pm</p>\n<p>6) Life in a Different Light 17/10/2025 5:00 pm</p>\n<p>7) Seasonal Influences on Lactating Dairy Cows 31/10/2025 5:00 pm</p>\n<p>\n</p><p>Assessment tasks are due 7 days after the completion of the related practical.</p></dd>",
            "learning_objectives": "L01, L03, L06",
            "mode": "Activity/ Performance, Oral, Written",
            "category": "Paper/ Report/ Annotation, Practical/ Demonstration, Presentation, Poster",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Practical Sessions</strong></p>\n<p>Each of the practical sessions have been created with the learning objectives in mind. The objective of each practical has been summarised below.</p>\n<p><br/></p>\n<p><strong><em>Evaluating Microclimates. </em></strong></p>\n<p><strong>Aim. </strong>To investigate how natural and manmade features influence microclimates. By investigating the students will gain a greater appreciated about how natural and manmade features influence microclimates and how this may impact animals. </p>\n<p><strong>Learning Objectives. </strong>This practical is associated with the following course learning objectives</p>\n<p>LO2. Students will become comfortable using technologies (inc. data loggers) to measure climatic conditions, and animal responses to climate conditions.</p>\n<p>LO3.\tPropose solutions to potential problems related to climate impacts on animals. </p>\n<p>LO4.\tIllustrate the methods that can be used to modify both macro and microclimates to address their impact on animals.</p>\n<p>LO6.\tEffectively communicate how the various environmental factors affect animal physiology.</p>\n<p><strong>Assessment Structure.</strong> The structure of this sequential practical assessment is a structured practical report, a full guideline that can be used as a template will be provided on BlackBoard.</p>\n<p><br/></p>\n<p><strong><em>Shade Influences on Goats.</em></strong> </p>\n<p><strong>Aim. </strong>To investigate how manmade shade structures influence the microclimate animals inhabit and the impact that this has on physiological responses in goats. </p>\n<p><strong>Learning Objectives. </strong>This practical is associated with the following course learning objectives</p>\n<p>LO2. Students will become comfortable using technologies (inc. data loggers) to measure climatic conditions, and animal responses to climate conditions.</p>\n<p>LO3.\tPropose solutions to potential problems related to climate impacts on animals. </p>\n<p>LO4.\tIllustrate the methods that can be used to modify both macro and microclimates to address their impact on animals.</p>\n<p>LO6.\tEffectively communicate how the various environmental factors affect animal physiology.</p>\n<p><strong>Assessment Structure.</strong> The structure of this sequential practical assessment is a conference style poster, more information will be provided on BlackBoard.</p>\n<p><br/></p>\n<p><strong><em>Climates and Climate Models.</em></strong> </p>\n<p><strong>Aim.</strong> To investigate how location influences climatic conditions and how this may impact animals living in those environments. </p>\n<p><strong>Learning Objectives. </strong>This practical is associated with the following course learning objectives</p>\n<p>LO4.\tIllustrate the methods that can be used to modify both macro and microclimates to address their impact on animals.</p>\n<p>LO6.\tEffectively communicate how the various environmental factors affect animal physiology.</p>\n<p><strong>Assessment Structure.</strong> The structure of this sequential practical assessment is a structured practical report, a full guideline that can be used as a template will be provided on BlackBoard.</p>\n<p><br/></p>\n<p><strong><em>Thermal Preferences of Reptiles. </em></strong></p>\n<p><strong>Aim.</strong> to determine temperature preferences of reptiles, in this instance central bearded dragons (<em>Pogona vitticeps</em>) and blue tongue skinks (<em>Tiliqua scincoides</em>).</p>\n<p><strong>Learning Objectives. </strong>This practical is associated with the following course learning objectives</p>\n<p>LO1.\tExplain what is meant by environmental physiology of animals.</p>\n<p>LO2.\tStudents will become comfortable using technologies (inc. data loggers) to measure climatic conditions, and animal responses to climate conditions. </p>\n<p>LO4.\tIllustrate the methods that can be used to modify both macro and microclimates to address their impact on animals.</p>\n<p>LO6.\tEffectively communicate how the various environmental factors affect animal physiology.</p>\n<p><strong>Assessment Structure.</strong> The structure of this sequential practical assessment is 3MT presentation, you will be required to provide a 3 minute presentation with one slide to highlight the results of the practical, more information will be provided on BlackBoard.</p>\n<p><br/></p>\n<p><strong><em>Exercise Induced Hyperthermia.</em></strong> </p>\n<p>Aim. To investigate the impact of exercise on body temperature regulation and periods of recovery. </p>\n<p><strong>Learning Objectives. </strong>This practical is associated with the following course learning objectives</p>\n<p>LO2.\tStudents will become comfortable using technologies (inc. data loggers) to measure climatic conditions, and animal responses to climate conditions.</p>\n<p>LO5.\tDiscuss ethical issues associated with climate and animals.</p>\n<p>LO6.\tEffectively communicate how the various environmental factors affect animal physiology.</p>\n<p><strong>Assessment Structure.</strong> The structure of this sequential practical assessment is a conference style poster, more information will be provided on BlackBoard.</p>\n<p><br/></p>\n<p><strong><em>Life in a different light. </em></strong></p>\n<p><strong>Aim.</strong> The aim of this task is to be able to communicate scientific outcomes to a public audience. You will be given a choice of scientific articles on BlackBoard to choose from to develop your science communication.</p>\n<p><strong>Learning Objectives. </strong>This practical is associated with the following course learning objectives</p>\n<p>LO1.\tExplain what is meant by environmental physiology of animals.</p>\n<p>LO5. Discuss the ethical issues associated with climate and animals.</p>\n<p>LO6.\tEffectively communicate how the various environmental factors affect animal physiology.</p>\n<p><strong>Assessment Structure.</strong> In this task you are to select one of eight (8) original research articles (see BlackBoard) and prepare a 500 word science communication blog.</p>\n<p><br/></p>\n<p><strong><em>Seasonal Influences on Lactating Dairy Cows. </em></strong></p>\n<p>Aim. To understand how seasons can influence dairy cow behaviour</p>\n<p><strong>Learning Objectives. </strong>This practical is associated with the following course learning objectives</p>\n<p>LO1.\tExplain what is meant by environmental physiology of animals.</p>\n<p>LO2. Students will become comfortable using technologies (inc. data loggers) to measure climatic conditions, and animal responses to climate conditions.</p>\n<p>LO3.\tPropose solutions to potential problems related to climate impacts on animals. </p>\n<p><strong>Assessment Structure.</strong> The structure of this sequential practical assessment is 3MT presentation, you will be required to provide a 3 minute presentation with one slide to highlight the results of the practical, more information will be provided on BlackBoard.</p>\n<p><br/></p>\n<p><strong>PLEASE NOTE: </strong>We spend time in the animal units across campus and as such, you are expected to meet the entry requirements to these facilities. This means that you are required to wear appropriate clothing and footwear to these sessions. This includes enclosed footwear (preferably boots), a hat, and a collared sleeved shirt (preferably long sleeved). Failure to comply with these standards will result in your being unable to participate in the practical session and you will be asked to leave. If you have any questions regarding this, please contact the course coordinator.</p>\n<p><br/></p>\n<p><strong>Assessment Types</strong></p>\n<p>A brief summary of the assessment types has been provided here. More information will be provided with the relevant practical on BlackBoard. Feel free to discuss the assessment styles with course staff during classes. A more detailed Practical Description, Presentation Description and Presentation Rubric will be provided on Blackboard for each of these practical tasks and associated assessment items.</p>\n<p><br/></p>\n<p><strong>3MT Presentation. </strong>For your 3MT presentation you will use the information you generated during the<strong><em> </em></strong>practical session to prepare a conference style three (3) minute presentation. Your presentation will be delivered in a pre-recorded format via PowerPoint. You get one slide to do as you wish with. But you need to think about what the important information is, remember what we have been talking about in the excel workshops about data presentation. Your presentation will be 3 minutes in length. The time is not negotiable, time over this will not be considered for marking. This is an exercise is elevator pitches and streamlining communication. </p>\n<p><strong>Conference Poster. </strong>This assessment will be a scientific poster presentation. High level grading has been provided below, please refer to the rubric for a full breakdown. A couple of examples will be made available to you on Blackboard.</p>\n<p><strong>SciComm. </strong>Your task is to write a 500-word general communication focusing on the paper you selected from 8 options provided. You have a lot of free choice with the presentation here (be wary of active procrastination and making this look super fancy). This task is about communicating science to the general public. Some examples of what this style of communication something that you might find in The Conversation (<a href=\"https://theconversation.com/au\">https://theconversation.com/au</a>). A high-level marking breakdown consists of the items below and a full breakdown is available in the grading rubric.</p>\n<p><strong>Practical Report. </strong> Will provide a brief 200-word introduction relevant for the practical (x 2). The report will include the presentation of data collected, in a series of tables and/or figures as needed to answer the discussion questions. You will also need to provide a brief 200 word conclusion summarising your findings., i.e. were seasonal differences observed. You will need to utilise scientific journal articles to support your findings. Referencing style expected is Journal of Animal Science</p>\n<p><br/></p>\n<p><strong>Artificial Intelligence </strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use Artificial Intelligence (AI) and/or Machine Translation (MT) tools, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which AI or MT will provide only limited support and guidance. The use of AI or MT must be acknowledged appropriately. For your submission you will need to provide an AI Declaration statement. Sample text for you to complete has been provided on each task sheet.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written MT submission independent of AI and MT tools.</p>\n<p><br/></p>\n<p><strong><em>Absence from a Practical Session</em></strong></p>\n<p><em>If you are unable to complete your timetabled practical session because of circumstances beyond your control (e.g., illness) you must submit a practical absence request immediately accompanied by acceptable supporting documentation. </em></p>\n<p><em>A list of acceptable reasons and required supporting documentation is found at </em><a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension?p=1\"><em>https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension?p=1#1</em></a><em>  </em></p>\n<p><em>Your request must be submitted </em><strong><em>prior to or on the day of</em></strong><em> the missed practical. The submission link can be found in the Learning Resources (Blackboard Original) or Course Resources (Blackboard Ultra) folder in your course Blackboard site. </em></p>\n<p><em>Requests without the correct supporting documentation may not be approved. If the reason for your absence is not approved, you will be considered as absent from that practical session. </em></p>\n<p><em>It is your responsibility to submit an application and provide correct documentation. </em></p>\n<ul>\n<li><em>This course is unable to provide alternative practical sessions to attend. If you do not complete the relevant practical session, you will be unable to complete the associated assessment item.</em></li>\n</ul>\n<p><em>If you require further assistance, please do not hesitate to contact the School - </em><a href=\"mailto:agriculture@enquire.uq.edu.au\"><em>agriculture@enquire.uq.edu.au</em></a><em>.  </em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assessment tasks are to be submitted via the links available on Blackboard, 7 days after completion of the practical or as directed and noted in the semester plan for ANIM2021. You must retain a copy of any submitted work.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Experiment Design",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 7/10/2025 5:00 pm</p></dd>",
            "learning_objectives": "L01, L03, L06",
            "mode": "Written",
            "category": "Product/ Design",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Background. </strong></p>\n<p>Experimental design is critical to developing knowledge. A well-designed experiment helps ensure that the results are accurate and repeatable. Strong experimental design reduces errors and negates potential biases, ensuring that conclusions drawn are valid and representative of the question you are trying to answer.</p>\n<p><strong>Task Description. </strong></p>\n<p>For this task you are to design an experiment to evaluate the impact of the thermal environment on the species of your choice. Your experiment can investigate all aspects of the thermal environment and could cover the following aspects:</p>\n<p>·      Thermal preferences</p>\n<p>·      Environmental/housing/engineering solutions</p>\n<p>·      Feed additives</p>\n<p>·      Testing for tolerance (heat or cold)</p>\n<p>If you are not sure about topics, please contact the course coordinator (Dr Angela Lees <a href=\"mailto:a.lees@uq.edu.au\">a.lees@uq.edu.au</a>) or use the Ed Discussion pages.</p>\n<p>A more detailed Description and Rubric will be provided on Blackboard.</p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use Artificial Intelligence (AI) and/or Machine Translation (MT) tools, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which AI or MT will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<p>The use of AI or MT must be acknowledged appropriately. Please see assessment guidelines in blackboard course site for specific instructions.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your Assessment task, in Blackboard, via the Turnitin link by the submission deadline. You should also retain an electronic copy of every piece of assessment you submit.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "End of Semester Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>8/11/2025 - 22/11/2025</p></dd>",
            "learning_objectives": "L01, L03, L05, L06",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The exam will cover all aspects of the course: Lectures, tutorials, assignment and set readings. The exam will be a two-hour written examination with short answer and essay based questions, and will be similar in format to previous years.</p>\n<p>Permitted materials for this exam include <strong>an unmarked bilingual dictionary</strong>. No additional materials beyond this will be permitted, please refer to examination guidelines for additional information.</p>\n<p>The exam will be an on-campus exam. Have your UQ student ID card available for all your exams. Students enrolled in In Person delivery must attend the exam in person. </p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": []
}