{
    "course_title": "Being Human: Cultural Diversity and Experience",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/ANTH1008-61606-7560",
    "full_course_code": "ANTH1008-61606-7560",
    "course_code": "ANTH1008",
    "class_code": "61606",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "A well-founded understanding of anthropology, in particular how it relates to and differs from other disciplines and contributes to understanding the diversity of human worlds."
        },
        {
            "number": "LO2.",
            "description": "The ability to apply ethically informed and critical analysis in responses to contemporary problems and in the interests of fairness, equality and inclusivity."
        },
        {
            "number": "LO3.",
            "description": "The skills to collect, organise and analyse sociocultural research including that drawing from the anthropological literature and that resulting from original research."
        },
        {
            "number": "LO4.",
            "description": "Proficiency and fluency in oral and written communication that conveys knowledge, ideas and complex questions about social relationships and human culture."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Reading Anthropology",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p> 15/08/2025 2:00 pm</p>\n<p> 22/08/2025 2:00 pm</p>\n<p> 29/08/2025 2:00 pm</p></dd>",
            "learning_objectives": "L02, L03, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment is made up of 3 smaller components worth 5% each, and is focused on helping you develop your academic reading comprehension and writing skills, including how to summarise research. During the tutorials and via Blackboard, you will be provided with detailed instructions and guidance on how to complete them. The components include 3 article summaries, to be submitted via TurnitIn:</p>\n<p>Reading Anthropology article summary 1 of Martin (Martin, Richard. 2024. Compensation for Cultural Loss in Indigenous Australia. <em>Anthropology Today </em>40(3): 3-6. Available at: <a href=\"https://rai.onlinelibrary.wiley.com/doi/epdf/10.1111/1467-8322.12890\">https://rai.onlinelibrary.wiley.com/doi/epdf/10.1111/1467-8322.12890</a>, due 15/8 at 2 p.m.</p>\n<p>Reading Anthropology article summary 2 of Sutton (Sutton, D. 2018. Arrival: Anthropology in Hollywood. <em>Anthropology Today</em> 34(1): 7–10), due 22/8 at 2 p.m.</p>\n<p>Reading Anthropology article summary 3 of Andersen (Andersen, Barbara. 2015. Style and self-making: String bag production in the Papua New Guinea Highlands. <em>Anthropology Today </em>31(5): 16-20. Available at: <a href=\"https://rai.onlinelibrary.wiley.com/doi/epdf/10.1111/1467-8322.12200\">https://rai.onlinelibrary.wiley.com/doi/epdf/10.1111/1467-8322.12200</a>, due 29/8 at 2 p.m.</p>\n<p>Summaries should be 200 words maximum and must discuss the following:</p>\n<p>* What is the key question, aim, or argument of the article? (You can use a quote from the article for this.)</p>\n<p>* What kind of research did the author do to answer the question/aim?</p>\n<p>* How does the author engage with anthropological concepts or debates? </p>\n<p>Make sure you correctly reference the article in your summary using APA 7 style (<a href=\"https://guides.library.uq.edu.au/referencing/apa7\">UQ Library Guide</a> ; <a href=\"https://apastyle.apa.org/instructional-aids/reference-guide.pdf\">APA 7 Quick Reference Guide</a>).</p>\n<p>All written assessment pieces must include a title, your full name, student number, page numbers, Times New Roman 12pt font, and double-line spacing. </p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course.</p>\n<p>Please note that, if using AI, you should include a fulsome statement of the extent to which you have drawn on it. Please further note that fabrication or misrepresentation of sources will result in an automatic fail grade for this assessment, regardless of performance in other criteria. This includes but is not limited to: citing non-existent sources or attributing false quotes to real sources. Such issues demonstrate failure to meet the core learning outcomes for the course and may also be referred for academic misconduct. <strong>Additional resources are available through </strong><a href=\"https://web.library.uq.edu.au/study-and-learning-support/ai-student-hub\">UQ AI Student Hub</a>.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Writing Anthropology",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p> 19/09/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Written Observation Description (max 750 words) to be submitted via Turnitin.</p>\n<p>This assessment asks you to spend an hour-and-a-half undertaking observation as a research method. This observation will be in a public place of your own choosing. Possible public places include: Botanic Gardens, food courts, South Bank, a Café, town square, or a bus stop. </p>\n<p>During the observation you must use your senses to take notes about visual, audio and olfactory (i.e. smell) aspects of your chosen fieldsite in order to describe the place in a way which transports your reader into the setting, in as few words as possible.</p>\n<p>Secondly, you must also practice 'seeing' like an ethnographer and providing a narrative description based on your observations of human behaviour which makes reference to 1 relevant article of your choosing in anthropology. What are people doing in your setting? Spend your time writing as well as watching, trying to capture details such as snippets of conversation, details about people's dress or behaviour, and anything else that strikes you as interesting. You may wish to take a photograph of the general setting as well if you can, but make sure this is not a close-up or easily identifiable photo of any individual person. </p>\n<p>The 750 word Observation Description will not be your actual observation notes made during the observation. Rather, what you submit as a description will be an organised form of your notes, written up for a reader in a way which relates your observation to one article of your choosing from your reading in anthropology. It could be categorised under headings such as visual, audio, olfactory, or you can find another structure that works for your data. You must try to be as detailed and succinct as possible, asking yourself - what is the significant of social behaviour in this public place, and how does the article you have chosen help you make sense of what is happening?</p>\n<p>We will prepare for the observation exercise during the tutorials, but potential questions to consider include:</p>\n<p> i.     Visual: How are people dressed? Do people with the same dress sit/walk/stand together? How many people form a group? For how long are they together? What are people doing? Do people interact? In what ways? Are groups composed of different genders? What does the physical environment look like? Does this influence social interaction?</p>\n<p>ii.     Audio: What do you hear? What do these sounds do to the ‘feel’ of the place? Do these sounds impact the way people behave?</p>\n<p>iii.     Olfactory (smell): What do you smell? Where do these smells come from? Do they impact the ‘feel’ of the place?</p>\n<p>Your observation should include a title. You may also wish to include a photograph of the setting to illustrate your prose.</p>\n<p>All written assessment pieces must include a title, your full name, student number.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Doing Anthropology",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 31/10/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment is focused on 'doing' anthropology. The assessment asks you to interview a friend or family member, take notes, analyse the notes by 'coding' them, engage in literature research, and write an essay.</p>\n<p>Your essay should be a maximum of 1500 words (+/- 10%, excluding references) and is worth 40%</p>\n<p>All essays must include a title, your name, student number, page numbers, and be in Times New Roman 12 pt font. Essays must be properly referenced in APA 7 style (<a href=\"https://guides.library.uq.edu.au/referencing/apa7\">UQ Library Guide</a> ; <a href=\"https://apastyle.apa.org/instructional-aids/reference-guide.pdf\">APA 7 Quick Reference Guide</a>), with at least 4 <strong>anthropology sources</strong> (they can be found on recognised electronic academic journals, but not news websites or crowd-sourced encyclopaedias such as Wikipedia).</p>\n<p>Choose one of the two topics, or the alternative assessment below.</p>\n<p><strong>Topic 1: Religion</strong></p>\n<p>Interview a close friend or relative about religion, spirituality, everyday rituals and practices, important holy days or rites of passage, or any other aspect of religious life. Consider how this may reflect broader sociocultural and/or historical conditions or realities. Re-consider the lecture and reading material from <strong>week 10</strong> to help you think of a line of questioning. Your essay must include a kinship diagram in which you ‘map’ any connections between members of the family to which your interviewee refers (for example, if you were interested how your interviewee got into the religious tradition they are part of, or an rite of passage like a weddings ceremony or a religious feast, where family members are involved). Your essay must also reference at least <strong>four academic anthropological sources</strong> such as journal articles, book chapters, or books. The essay must conclude with a question for further research and/or a tentative finding about the religious matters you investigated.</p>\n<p><strong>Topic 2: Economics</strong></p>\n<p>Interview a close friend or relative about trade, money, value, labour, or some other aspect of economic life and consider how this may reflect broader sociocultural and/or historical conditions or realities. Re-consider the lecture and reading material from <strong>week 7</strong> to help you think of a line of questioning. Your essay must include a kinship diagram in which you 'map' any connections between members of the family to which your interviewee refers (for example, if you were interested in the lines of inheritance of material wealth, the values in a family business, or the labour choices among family members). Your essay must also reference at least <strong>four academic anthropological sources</strong> such as journal articles, book chapters, or books. The essay must conclude with a question or tentative finding about the economic matters you investigated. </p>\n<p>Essay structure</p>\n<p>Your essay <strong>must</strong> <strong>include</strong> all of the following (although not necessarily in this order):  </p>\n<p>1. Essay title (be creative!)</p>\n<p>2. Introduction</p>\n<p>3. A description of the key findings from the interview. You may use literature here, but the emphasis should be on the description of main themes that arose from your conversation/interview.</p>\n<p>4. Kinship diagram (however small or brief) of persons mentioned in the interview. Remember to give it a caption.</p>\n<p>5. A literature review of anthropological material relevant to the topic – this will be anthropology of religion, economy, or political anthropology depending on the themes of the interview.</p>\n<p>6. Discussion and Conclusion. Drawing together the previous sections, a discussion will outline how your data may be understood in relation to the anthropological literature. Take care to pose this <em>as a question</em>, or at least be careful of generalisations and causation (given the range of your research).</p>\n<p>7. Reference list. Your essay needs to cite at least <strong>4 academic anthropology</strong> <strong>sources</strong> using APA style. These need to be listed under a heading 'References Cited' at the end of your essay. Sources must be from (preferably peer-reviewed) academic publications.</p>\n<p>8. <strong>APPENDIX</strong>: Coded notes (max 2 pages).The sample of Coded notes must be submitted at the same time as the essay and in the same document. Students receive training on how to code their notes (see online workshop 5) and guidance in tutorials. Coded notes MUST include references to relevant (anthropological) pieces of literature . Coded notes will be submitted via TurnitIn as an appendix to the essay in the same document.</p>\n<p>Diagram Instructions</p>\n<p>As noted, your essay must include a kinship diagram where you depict all members of the family you discuss mentioned in the essay. The names can be psuedonyms or first names only. Any individuals referred to within the essay should be clearly identifiable in the diagram, but this is not a 'family tree', rather you are using the diagram as an illustration of a key point in the essay. Using Microsoft Word (or other) drawing tools (or drawing by hand and photographing) Use standard anthropological symbols in the diagram as discussed in lectures and practiced the tutorials.</p>\n<p>Identify EGO (your interviewee) in the diagram.</p>\n<p>Use standard anthropological symbols as outlined in lectures and tutorials, these include:</p>\n<p>-        triangle for male</p>\n<p>-        circle for females</p>\n<p>-        Square for third or unknown gender</p>\n<p>- = (equal sign) for marriage/union</p>\n<p>-        ≠ to represent divorce or separation.</p>\n<p>-        \\\\ or X through a deceased person dotted vertical line to represent adoption</p>\n<p>Identify relatives with kinship terms from EGO’s perspective in whatever language is used within the family. E.g. ‘nan’, ‘pop’. Add these terms underneath the triangle/circle in the diagram.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course.</p>\n<p>Please note that, if using AI, you should include a fulsome statement of the extent to which you have drawn on it. Please further note that fabrication or misrepresentation of sources will result in an automatic fail grade for this assessment, regardless of performance in other criteria. This includes but is not limited to: citing non-existent sources or attributing false quotes to real sources. Such issues demonstrate failure to meet the core learning outcomes for the course and may also be referred for academic misconduct. <strong>Additional resources are available through </strong><a href=\"https://web.library.uq.edu.au/study-and-learning-support/ai-student-hub\">UQ AI Student Hub</a>.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>8/11/2025 - 22/11/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The exam will focus on content you have learnt across the course. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(28 Jul - 03 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction to anthropology</strong><br/><p>Welcome to anthropology! This week we will ask, what is anthropology? What do anthropologists do? And what do we mean when we talk about the 'culture' of a people?</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Introduction to anthropology</strong>",
            "topic_description": "Introduction to anthropology Welcome to anthropology! This week we will ask, what is anthropology? What do anthropologists do? And what do we mean when we talk about the 'culture' of a people?",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(04 Aug - 10 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The concept of culture and human diversity</strong><br/><p>This lecture focuses on the concept of culture. What does it mean to have a culture? How do cultures change? How have anthropologists helped to describe human diversity through the concept of culture?</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>The concept of culture and human diversity</strong>",
            "topic_description": "The concept of culture and human diversity This lecture focuses on the concept of culture. What does it mean to have a culture? How do cultures change? How have anthropologists helped to describe human diversity through the concept of culture?",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(04 Aug - 10 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial discussion and writing exercises</strong><br/><p>Introduction tutorial. Get to know your fellow students. The key elements of a good article summary will be discussed and the tutorial will provide further instruction on writing summaries to prepare for the first assessment (starting from Week 3), during the tutorial you will practice with writing a summary of Graeber &amp; Wengrow's book excerpt (weekly reading). </p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Tutorial discussion and writing exercises</strong>",
            "topic_description": "Tutorial discussion and writing exercises Introduction tutorial. Get to know your fellow students. The key elements of a good article summary will be discussed and the tutorial will provide further instruction on writing summaries to prepare for the first assessment (starting from Week 3), during the tutorial you will practice with writing a summary of Graeber & Wengrow's book excerpt (weekly reading).",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3(11 Aug - 17 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Culture, Change, and Colonialism</strong><br/><p>This week we think about the challenge of understanding change. If everyone has a culture, and cultures change constantly in interaction with each other, then how can they be differentiated from each other, and how can we conceptualise their influence on each other? </p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Culture, Change, and Colonialism</strong>",
            "topic_description": "Culture, Change, and Colonialism This week we think about the challenge of understanding change. If everyone has a culture, and cultures change constantly in interaction with each other, then how can they be differentiated from each other, and how can we conceptualise their influence on each other?",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3(11 Aug - 17 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial discussion and writing exercises</strong><br/><p>Students should come to the tutorial having read the set readings. The tutorial will focus on discussion of cultural change, globalisation, colonialism, and de-colonisation. We will also discuss the first of our Reading Anthropology articles which you are required to critically summarise for your first assessment.</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Tutorial discussion and writing exercises</strong>",
            "topic_description": "Tutorial discussion and writing exercises Students should come to the tutorial having read the set readings. The tutorial will focus on discussion of cultural change, globalisation, colonialism, and de-colonisation. We will also discuss the first of our Reading Anthropology articles which you are required to critically summarise for your first assessment.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4(18 Aug - 24 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Culture, language, and interpretation</strong><br/><p>This week we start to think about language and its role in culture via a discussion of a Hollywood film, <em>Arrival</em>, and associated readings. Please watch the film in preparation for the lecture.</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Culture, language, and interpretation</strong>",
            "topic_description": "Culture, language, and interpretation This week we start to think about language and its role in culture via a discussion of a Hollywood film, Arrival , and associated readings. Please watch the film in preparation for the lecture.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4(18 Aug - 24 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial discussion and research exercises</strong><br/><p>This tutorial will include a discussion of the material from the lecture, including the article by David Sutton about Arrival, which is the second of your critical summaries for the Reading Anthropology Assessment. The tutorial will also include a short workshop on how to find, evaluate and reference academic literature.</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Tutorial discussion and research exercises</strong>",
            "topic_description": "Tutorial discussion and research exercises This tutorial will include a discussion of the material from the lecture, including the article by David Sutton about Arrival, which is the second of your critical summaries for the Reading Anthropology Assessment. The tutorial will also include a short workshop on how to find, evaluate and reference academic literature.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5(25 Aug - 31 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Gender and the body</strong><br/><p>This lecture delves into the history of women anthropologists and the influence of feminism on anthropological method and theory. We ask how diversity of bodies, sexualities, and genders matter to our understanding of culture.</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Gender and the body</strong>",
            "topic_description": "Gender and the body This lecture delves into the history of women anthropologists and the influence of feminism on anthropological method and theory. We ask how diversity of bodies, sexualities, and genders matter to our understanding of culture.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5(25 Aug - 31 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial discussion</strong><br/><p>Please come to the tutorials prepared to discuss the readings. We will also discuss the article by Andersen which is the subject of your third and final critical summary for the Reading Anthropology assessment.</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Tutorial discussion</strong>",
            "topic_description": "Tutorial discussion Please come to the tutorials prepared to discuss the readings. We will also discuss the article by Andersen which is the subject of your third and final critical summary for the Reading Anthropology assessment.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(01 Sep - 07 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Writing anthropology and ethnographic methods</strong><br/><p>This week we look at how anthropologists create 'field notes' and how to capture a sense of place in writing. This lecture contains tips for the Writing Anthropology assessment.</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Writing anthropology and ethnographic methods</strong>",
            "topic_description": "Writing anthropology and ethnographic methods This week we look at how anthropologists create 'field notes' and how to capture a sense of place in writing. This lecture contains tips for the Writing Anthropology assessment.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(01 Sep - 07 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial discussion and observation exercises</strong><br/><p>Students should come to the tutorial having read the set reading by Lassiter. The tutorial will include some observation activities to help you prepare for the Writing Anthropology assessment. You are also encouraged to find pieces of descriptive writing that convey a strong sense of place for discussion in class.</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Tutorial discussion and observation exercises</strong>",
            "topic_description": "Tutorial discussion and observation exercises Students should come to the tutorial having read the set reading by Lassiter. The tutorial will include some observation activities to help you prepare for the Writing Anthropology assessment. You are also encouraged to find pieces of descriptive writing that convey a strong sense of place for discussion in class.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7(08 Sep - 14 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The Anthropology of Money and Value</strong><br/><p>This lecture asks what anthropologists mean when they talk about economics. We examine economic systems and the study of value, labour, gift-giving, and money.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>The Anthropology of Money and Value</strong>",
            "topic_description": "The Anthropology of Money and Value This lecture asks what anthropologists mean when they talk about economics. We examine economic systems and the study of value, labour, gift-giving, and money.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7(08 Sep - 14 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial discussion</strong><br/><p>Please come to the tutorial prepared to discuss the the readings.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Tutorial discussion</strong>",
            "topic_description": "Tutorial discussion Please come to the tutorial prepared to discuss the the readings.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The Anthropology of Power and Politics</strong><br/><p>This week looks at how anthropologists understand power in different settings around the world. We ask: are there commonalities in political systems across cultures? How do anthropologists understand resistance and other responses to the exercise of power? </p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>The Anthropology of Power and Politics</strong>",
            "topic_description": "The Anthropology of Power and Politics This week looks at how anthropologists understand power in different settings around the world. We ask: are there commonalities in political systems across cultures? How do anthropologists understand resistance and other responses to the exercise of power?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial discussion</strong><br/><p>In tutorials this week we will discuss the topic of power and politics from an anthropological perspective.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Tutorial discussion</strong>",
            "topic_description": "Tutorial discussion In tutorials this week we will discuss the topic of power and politics from an anthropological perspective.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Kinship and Doing Research</strong><br/><p>We ask how anthropologists have sought to understand relationships across (and beyond) human societies. The second half of the lecture will describe anthropological approaches to interviewing for the Doing Anthropology assessment.</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Kinship and Doing Research</strong>",
            "topic_description": "Kinship and Doing Research We ask how anthropologists have sought to understand relationships across (and beyond) human societies. The second half of the lecture will describe anthropological approaches to interviewing for the Doing Anthropology assessment.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial discussion and interview workshop</strong><br/><p>The tutorial discussions focus on the question 'what makes us kin?'. We will also workshop interview questions and approaches for the Doing Anthropology assessment.</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Tutorial discussion and interview workshop</strong>",
            "topic_description": "Tutorial discussion and interview workshop The tutorial discussions focus on the question 'what makes us kin?'. We will also workshop interview questions and approaches for the Doing Anthropology assessment.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10(06 Oct - 12 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Anthropologies of Religion and Magic</strong><br/><p>Anthropologists have long studied rituals, magic, myths and beliefs. In this lecture we consider how these categories can help us to understand everyday rituals and beliefs, and we ask if we can study science as cultural practice.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Anthropologies of Religion and Magic</strong>",
            "topic_description": "Anthropologies of Religion and Magic Anthropologists have long studied rituals, magic, myths and beliefs. In this lecture we consider how these categories can help us to understand everyday rituals and beliefs, and we ask if we can study science as cultural practice.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10(06 Oct - 12 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial discussion and kinship diagram exercises</strong><br/><p>Tutorials will discuss anthropological approaches to religion, magic, and science.  We also undertake exercises focused on developing anthropological skills to construct a kinship diagram.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Tutorial discussion and kinship diagram exercises</strong>",
            "topic_description": "Tutorial discussion and kinship diagram exercises Tutorials will discuss anthropological approaches to religion, magic, and science.  We also undertake exercises focused on developing anthropological skills to construct a kinship diagram.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(13 Oct - 19 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Coding fieldnotes and doing anthropology</strong><br/><p>To make sense of their data, anthropologists 'code' their fieldnotes. Coding can be as simple as using different coloured highlighters to underline relevant quotations in a fieldbook, or transferring references into a table. This week's lecture will discuss different approaches to coding, and provide guidance for the Doing Anthropology assessment.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Coding fieldnotes and doing anthropology</strong>",
            "topic_description": "Coding fieldnotes and doing anthropology To make sense of their data, anthropologists 'code' their fieldnotes. Coding can be as simple as using different coloured highlighters to underline relevant quotations in a fieldbook, or transferring references into a table. This week's lecture will discuss different approaches to coding, and provide guidance for the Doing Anthropology assessment.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(13 Oct - 19 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial discussion and coding exercises</strong><br/><p>Students should complete their fieldnotes for the doing anthropology assessment prior to this tutorial and bring their notes to class for a coding exercise.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Tutorial discussion and coding exercises</strong>",
            "topic_description": "Tutorial discussion and coding exercises Students should complete their fieldnotes for the doing anthropology assessment prior to this tutorial and bring their notes to class for a coding exercise.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12(20 Oct - 26 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Things and Technologies</strong><br/><p>This week we look at what anthropologists contribute to industry and corporations. We will focus on the material culture of technology and how people adopt, adapt, and co-opt technologies for their own cultural purposes. What can anthropologists contribute to understanding 'culture' in business?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Things and Technologies</strong>",
            "topic_description": "Things and Technologies This week we look at what anthropologists contribute to industry and corporations. We will focus on the material culture of technology and how people adopt, adapt, and co-opt technologies for their own cultural purposes. What can anthropologists contribute to understanding 'culture' in business?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12(20 Oct - 26 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial workshop on technology</strong><br/><p>This week - weather permitting! - we will venture out of the classroom to undertake a practical exercise in applied anthropology to understand the culture of technology.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Tutorial workshop on technology</strong>",
            "topic_description": "Tutorial workshop on technology This week - weather permitting! - we will venture out of the classroom to undertake a practical exercise in applied anthropology to understand the culture of technology.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13(27 Oct - 02 Nov)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Where do we take anthropology?</strong><br/><p>In this wrap-up lecture, we consider what anthropologists contribute to contemporary society  by examining the different context in which anthropologists work. We also explore opportunities for further study in anthropology at UQ. </p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Where do we take anthropology?</strong>",
            "topic_description": "Where do we take anthropology? In this wrap-up lecture, we consider what anthropologists contribute to contemporary society  by examining the different context in which anthropologists work. We also explore opportunities for further study in anthropology at UQ.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13(27 Oct - 02 Nov)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial discussion</strong><br/><p>In our final tutorial, we will discuss some of the questions raised in the course, including: what is culture? how is culture relevant in everyday life today? what does anthropology offer in thinking through some of the big questions in society today? There will also be opportunity do discuss your drafted final essay with your peers and tutor.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Tutorial discussion</strong>",
            "topic_description": "Tutorial discussion In our final tutorial, we will discuss some of the questions raised in the course, including: what is culture? how is culture relevant in everyday life today? what does anthropology offer in thinking through some of the big questions in society today? There will also be opportunity do discuss your drafted final essay with your peers and tutor.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}