{
    "course_title": "Predicting the Past",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/ARCA3000-61582-7560",
    "full_course_code": "ARCA3000-61582-7560",
    "course_code": "ARCA3000",
    "class_code": "61582",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Have a general understanding and familiarity with most of the major theoretical approaches to the archaeological record."
        },
        {
            "number": "LO2.",
            "description": "Understand the social and scientific contexts for the development of archaeological theory."
        },
        {
            "number": "LO3.",
            "description": "Critically evaluate archaeological literature."
        },
        {
            "number": "LO4.",
            "description": "Understand the relationship between archaeology and other social and physical sciences."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Presentation, Written Reflection and Engagement",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 21/08/2025 - 30/10/2025</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Oral, Written",
            "category": "Participation/ Student contribution, Presentation, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This Case Study assessment item consists of three components:</p>\n<p><strong>Component 1: Presentation (22%)</strong></p>\n<p>In the first hour of class time each week (starting in Week 4) students will present, <strong>individually or in pairs</strong>, PowerPoint presentations on a case study related to a theoretical component of the previous week's lecture. You are to select your own case study but it <strong>can not</strong> come from the set readings for that week (including the textbook). You must find and research a different case study that illustrates one or more of the theoretical aspects presented in the previous lecture. You do not have to cover all the content of the previous lecture. You do not have to wait until the lecture to decide on the theoretical approach or the case study. By studying the textbook and the readings you should start to get an idea of where to begin (you can't use a case study from the textbook or readings). The choices of theories for the presentations are (in order): processualism, behavioural archaeology, systems theory, post-processualism, contextual archaeologies, agency, gender, critical archaeology and indigenous archaeologies.</p>\n<p>If presenting individually the presentation will be 15 minutes long consisting of a 10 minute presentation and 5 minute question time. If presenting as a pair the presentation will be 20 minutes long consisting of a 15 minute presentation and 5 minute question time (both students must be actively involved in the presentation and in answering the questions). You must use PowerPoint (or equivalent) to illustrate your presentation. Check the assessment criteria closely - You will see that your ability to answer the questions is a substantial part of the mark for this component.</p>\n<p>Presentations will start in week 4 of the semester. A roster of presentation slots will be developed and by the end of week 2 every student will be expected to have nominated the slot in which they will present. If presenting in pairs then it is your responsibility to form the pair, agree on the theoretical aspect and nominate the slot as a pair providing me with both names. Given that there will be a limited number of presentations in any one week, slots for each week will be allocated on a first in basis.</p>\n<p><strong>NB. The presentations will be recorded as part of the standard Echo360 recording of the class. The presentations will be available on Blackboard for all students to see when they open the lecture recording.</strong></p>\n<p><strong>Use of AI and/or MT: </strong>This assessment component is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct. </p>\n<p><strong>Component 2: Written Reflection (10%)</strong></p>\n<p>Each student is expected to write a 900 (plus or minus 100) word critique of the process of preparing the presentation. This is done individually (even if you worked on the presentation as a pair) and is due by 2pm on the day immediately before your presentation (i.e. Wednesday). In this critique I need you to answer (based on the literature and the theoretical approach) the following questions:</p>\n<ol>\n<li>What background research did you do? (Don't just list the items that you read, tell me how they helped you to create your presentation)</li>\n<li>Why did you choose this case study?</li>\n<li>What other case studies did you consider and why did you reject them?</li>\n<li>What elements of the theory does the case study you chose illustrate?</li>\n<li>What is the source of your PowerPoint images?</li>\n<li>If you worked in pairs, how was the workload distributed?</li>\n</ol>\n<p><strong>Use of AI and/or MT: </strong>This component has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this component, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. <strong>Additional resources are available through </strong><a href=\"https://web.library.uq.edu.au/study-and-learning-support/ai-student-hub\">UQ AI Student Hub</a>.</p>\n<p><strong>Component 3: Critical Engagement/Participation (8%)</strong></p>\n<p>Each week you are expected to participate as an audience member during other students' presentations by asking questions or making comments based on the readings and your knowledge of the theory.</p>\n<p><strong>Use of AI and/or MT: </strong>This assessment component is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct. </p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Component 1 is assessed in class.</strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Culture History, Processualism and Post-Processualism In-Class Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 11/09/2025 9:00 am</p></dd>",
            "learning_objectives": "L01, L02, L04",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You will complete an in-class examination on your knowledge of culture history, processualism and post-processualism.</p>\n<p><strong>Use of AI and/or MT: </strong>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct. </p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Theory Poster",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 10/11/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Poster",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>To help you gain a deeper appreciation of various theoretical approaches and for you to demonstrate that understanding, you are required to produce a poster that answers the following question:</p>\n<p><strong>In archaeology, ‘scientific’ evidence has been consistently privileged over other ways of knowing, resulting in a colonial construction that the past is ‘lost’ and must be ‘found’. However, as noted by Schneider and Hayes (2020:131), several types of archaeology, “aim to mitigate this problematic hierarchy in the hopes that archaeology may serve instead in a narrative of survivance for, by, and with Native peoples.” How then can archaeological science be employed by communities with the support of researchers as a form of praxis that deconstructs colonial paradigms and contributes towards narratives of survivance.</strong></p>\n<p>There are many different perspectives that you could take to answer this question, including, but not limited to, Indigenous, feminist, gender, marxist, emancipatory, Blak sovereignty, class, ethnicity, the Anthropocene, or heritage. To make this assignment manageable for yourself, you should <strong>select one theoretical perspective</strong> (it doesn't have to be from this list) and use it to illustrate – with at least <strong>two archaeological science case studies </strong>–<strong> </strong>how the tenets of your chosen theoretical position promotes archaeological science to be employed as a form of praxis towards narratives of survivance. You cannot use the same case study/ies you included in your presentation assignment.</p>\n<p>The target audience for your poster is a conference of theoretical archaeologists.</p>\n<p>To answer the question, start with the set readings from the course and then you are expected to research beyond the set readings to create your answer. Find case studies in your additional research to illustrate your key points. Present your answered in a poster format.</p>\n<p>Your poster will be A2 in size and coloured. It also has to be accompanied by a single A4 page containing your information sources including references and image sources. Submit your poster as a pdf through Turnitin on Blackboard. Do not submit a hardcopy of the poster.</p>\n<p>We will spend time in week 7 of the course running through the requirements for this assignment and the basics of setting up PowerPoint to make a poster. We will also practice making a poster in class in Week 13.</p>\n<p>For additional information on creating a poster you can search \"creating a poster in PowerPoint\" online. There are many websites that provide helpful advice.</p>\n<p>Quote citation: Schneider, T.D., &amp; Hayes, K. (2020). Epistemic Colonialism: Is it Possible to Decolonize Archaeology? <em>The American Indian Quarterly</em> <em>44</em>(2), 127-148. <a href=\"https://dx.doi.org/10.1353/aiq.2020.a756930\">https://dx.doi.org/10.1353/aiq.2020.a756930</a>.</p>\n<p><strong>Use of AI and/or MT: </strong>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. <strong>Additional resources are available through </strong><a href=\"https://web.library.uq.edu.au/study-and-learning-support/ai-student-hub\">UQ AI Student Hub</a>.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Course introduction</strong><br><p>Introduction to the course, readings, assessment. Introduction to archaeological theory and some background ideas and terms that you will need to understand to do the course.</p>\n<p>Readings/Ref: Johnson (2019): Preface &amp; Chapter 1</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Course introduction</strong>",
            "topic_description": "Course introduction Introduction to the course, readings, assessment. Introduction to archaeological theory and some background ideas and terms that you will need to understand to do the course. Readings/Ref: Johnson (2019): Preface & Chapter 1",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 2(04 Aug - 10 Aug)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Origins of archaeological theory and culture history</strong><br><p>The first 300 years of archaeological theory up to the 1950s. We will discuss antiquarianism, diffusion, culture history and typology amongst other things. Includes a typology exercise.</p>\n<p>Readings/Ref: Johnson (2019): Chapter 2</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Origins of archaeological theory and culture history</strong>",
            "topic_description": "Origins of archaeological theory and culture history The first 300 years of archaeological theory up to the 1950s. We will discuss antiquarianism, diffusion, culture history and typology amongst other things. Includes a typology exercise. Readings/Ref: Johnson (2019): Chapter 2",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(04 Aug - 10 Aug)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Typology exercise</strong><br/><p>Creating your own typology of 'Roman' helmets to understand how to create typologies and their utility. Background readings on typologies will be provided on blackboard ahead of this session.</p></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Typology exercise</strong>",
            "topic_description": "Typology exercise Creating your own typology of 'Roman' helmets to understand how to create typologies and their utility. Background readings on typologies will be provided on blackboard ahead of this session.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 3(11 Aug - 17 Aug)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The new archaeology</strong><br/><p>We will examine the origins, development and major concepts of processual archaeology including ideas of objectivity, determinism, organisational frameworks, ambiguity and hypothesis testing.</p>\n<p>Readings/Ref: Johnson (2019): Chapters 3 &amp; 4; Binford (1983): Chapter 1; Binford (1987); Flannery (1967)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>The new archaeology</strong>",
            "topic_description": "The new archaeology We will examine the origins, development and major concepts of processual archaeology including ideas of objectivity, determinism, organisational frameworks, ambiguity and hypothesis testing. Readings/Ref: Johnson (2019): Chapters 3 & 4; Binford (1983): Chapter 1; Binford (1987); Flannery (1967)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4(18 Aug - 24 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Student presentations on the new archaeology</strong><br/><p>Student presentations on the new archaeology.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Student presentations on the new archaeology</strong>",
            "topic_description": "Student presentations on the new archaeology Student presentations on the new archaeology.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 4(18 Aug - 24 Aug)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Behavioural archaeology</strong><br/><p>We address the origins and major concepts of behavioural archaeology and examine the similarities and differences with mainstream processualism.</p>\n<p>Readings/Ref: Johnson (2019): Chapter 4; Schiffer (1972); Schiffer (1977); Schiffer (1988)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Behavioural archaeology</strong>",
            "topic_description": "Behavioural archaeology We address the origins and major concepts of behavioural archaeology and examine the similarities and differences with mainstream processualism. Readings/Ref: Johnson (2019): Chapter 4; Schiffer (1972); Schiffer (1977); Schiffer (1988)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 5(25 Aug - 31 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Student presentations on behavioural archaeology</strong><br/><p>Student presentations on behavioural archaeology.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Student presentations on behavioural archaeology</strong>",
            "topic_description": "Student presentations on behavioural archaeology Student presentations on behavioural archaeology.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 5(25 Aug - 31 Aug)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Systems theories</strong><br/><p>This week we investigate the development of General Systems Theory, its role in the development of processualism and the characteristics of major processual theories derived from GST including optimal foraging theories.</p>\n<p>Readings/Ref: Johnson (2019): Chapter 5; Lyman &amp; (1998); Steward (1968); Winter (2000)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Systems theories</strong>",
            "topic_description": "Systems theories This week we investigate the development of General Systems Theory, its role in the development of processualism and the characteristics of major processual theories derived from GST including optimal foraging theories. Readings/Ref: Johnson (2019): Chapter 5; Lyman & (1998); Steward (1968); Winter (2000)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 6(01 Sep - 07 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Student presentations on systems theories</strong><br/><p>Student presentations on systems theories.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Student presentations on systems theories</strong>",
            "topic_description": "Student presentations on systems theories Student presentations on systems theories.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 6(01 Sep - 07 Sep)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Post-processual archaeologies</strong><br/><p>Today we introduce post-processual archaeologies by examining the origins of their diverse approaches, their similarities and differences.</p>\n<p>Readings/Ref: Johnson (2019): Chapter 7; Hodder (2008); Lampeter (1997)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Post-processual archaeologies</strong>",
            "topic_description": "Post-processual archaeologies Today we introduce post-processual archaeologies by examining the origins of their diverse approaches, their similarities and differences. Readings/Ref: Johnson (2019): Chapter 7; Hodder (2008); Lampeter (1997)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 7(08 Sep - 14 Sep)",
            "activity_type": "Applied Class",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In class exam</strong><br/><p>An examination of your knowledge of culture history, processualism and post-processual archaeologies.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>In class exam</strong>",
            "topic_description": "In class exam An examination of your knowledge of culture history, processualism and post-processual archaeologies.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 7(08 Sep - 14 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Poster design workshop and discussion</strong><br/><p>After the exam we will take some time to look at what makes an effective academic poster and compare several examples.</p></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Poster design workshop and discussion</strong>",
            "topic_description": "Poster design workshop and discussion After the exam we will take some time to look at what makes an effective academic poster and compare several examples.",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Student presentations on post-processual archaeologies</strong><br/><p>Student presentations on post-processual archaeologies.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Student presentations on post-processual archaeologies</strong>",
            "topic_description": "Student presentations on post-processual archaeologies Student presentations on post-processual archaeologies.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Contextual archaeologies</strong><br/><p>An examination of interpretive and contextual archaeologies - two foundational post-processual approaches.</p>\n<p>Readings/Ref: Johnson (2019): Chapter 6 &amp; 7; Hodder (1991); Johnsen (1992); Liebmann (2002)</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Contextual archaeologies</strong>",
            "topic_description": "Contextual archaeologies An examination of interpretive and contextual archaeologies - two foundational post-processual approaches. Readings/Ref: Johnson (2019): Chapter 6 & 7; Hodder (1991); Johnsen (1992); Liebmann (2002)",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Student presentations on contextual archaeologies</strong><br/><p>Student presentations on contextual archaeologies.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Student presentations on contextual archaeologies</strong>",
            "topic_description": "Student presentations on contextual archaeologies Student presentations on contextual archaeologies.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Agency, practice and praxis</strong><br/><p>Background to concepts of agency, structure, practice theory, doxa and praxis and their application in post-processual theory.</p>\n<p>Readings/Ref: Johnson (2019): Chapter 8; Dellino (2005); Dobres (1995); Joyce &amp; (2005); Pauketat (2001)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Agency, practice and praxis</strong>",
            "topic_description": "Agency, practice and praxis Background to concepts of agency, structure, practice theory, doxa and praxis and their application in post-processual theory. Readings/Ref: Johnson (2019): Chapter 8; Dellino (2005); Dobres (1995); Joyce & (2005); Pauketat (2001)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Mid Sem break(29 Sep - 05 Oct)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-semester break</strong><br/><p>No class.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Mid-semester break</strong>",
            "topic_description": "Mid-semester break No class.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 10(06 Oct - 12 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Student presentations on agency, practice and praxis</strong><br/><p>Student presentations on agency, practice and praxis.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Student presentations on agency, practice and praxis</strong>",
            "topic_description": "Student presentations on agency, practice and praxis Student presentations on agency, practice and praxis.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 10(06 Oct - 12 Oct)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Post-modern approaches to gender</strong><br/><p>We look at the three waves of feminism and their impact on archaeological theory. Particular attention is paid to the third wave and its role in post-processual archaeology.</p>\n<p>Readings/Ref: Johnson (2019): Chapter 9; Conkey (2003); Conkey &amp; (1997); Wylie (1997)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Post-modern approaches to gender</strong>",
            "topic_description": "Post-modern approaches to gender We look at the three waves of feminism and their impact on archaeological theory. Particular attention is paid to the third wave and its role in post-processual archaeology. Readings/Ref: Johnson (2019): Chapter 9; Conkey (2003); Conkey & (1997); Wylie (1997)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(13 Oct - 19 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Student presentations on gender archaeology</strong><br/><p>Student presentations on gender archaeology.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Student presentations on gender archaeology</strong>",
            "topic_description": "Student presentations on gender archaeology Student presentations on gender archaeology.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 11(13 Oct - 19 Oct)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Archaeology as political activity</strong><br/><p>An examination of critical archaeology and the role of archaeology as a 'form of socio-political activity in the present'. We pay particular attention to archaeology as a praxic activity.</p>\n<p>Readings/Ref: Johnson (2019): Chapter 13; Leone (1995); Leone (1987); Wurst (1999)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Archaeology as political activity</strong>",
            "topic_description": "Archaeology as political activity An examination of critical archaeology and the role of archaeology as a 'form of socio-political activity in the present'. We pay particular attention to archaeology as a praxic activity. Readings/Ref: Johnson (2019): Chapter 13; Leone (1995); Leone (1987); Wurst (1999)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12(20 Oct - 26 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Student presentations on critical archaeology</strong><br/><p>Student presentations on critical archaeology.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Student presentations on critical archaeology</strong>",
            "topic_description": "Student presentations on critical archaeology Student presentations on critical archaeology.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 12(20 Oct - 26 Oct)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Indigenous archaeologies</strong><br/><p>An examination of indigenous archaeologies and how their practices are currently shaping the field in Australia and beyond.</p>\n<p>Readings/Ref: Johnson (2019): Chapter 8, 13; Atalay (2006); McNiven (2017): Schneider &amp; Hayes (2020)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Indigenous archaeologies</strong>",
            "topic_description": "Indigenous archaeologies An examination of indigenous archaeologies and how their practices are currently shaping the field in Australia and beyond. Readings/Ref: Johnson (2019): Chapter 8, 13; Atalay (2006); McNiven (2017): Schneider & Hayes (2020)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13(27 Oct - 02 Nov)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Student presentation on indigenous archaeologies</strong><br/><p>Student presentations on indigenous archaeologies.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Student presentation on indigenous archaeologies</strong>",
            "topic_description": "Student presentation on indigenous archaeologies Student presentations on indigenous archaeologies.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 13(27 Oct - 02 Nov)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Fitting it all together</strong><br/><p>Today we look at various approaches that try to combine processual and post-processual archaeologies. We investigate different forms of cognitive archaeology, and the work of Peter Kosso, a philosopher of science. This week includes a review of the entire semester.</p>\n<p>Readings/Ref: Johnson (2019): Chapter 14; Chipp (2003); Huffman (1986); Kosso (1991)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Fitting it all together</strong>",
            "topic_description": "Fitting it all together Today we look at various approaches that try to combine processual and post-processual archaeologies. We investigate different forms of cognitive archaeology, and the work of Peter Kosso, a philosopher of science. This week includes a review of the entire semester. Readings/Ref: Johnson (2019): Chapter 14; Chipp (2003); Huffman (1986); Kosso (1991)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}