{
    "course_title": "Public Relations Writing",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/COMU1152-60972-7560",
    "full_course_code": "COMU1152-60972-7560",
    "course_code": "COMU1152",
    "class_code": "60972",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Analyse the rapidly changing context for the composition and dissemination of PR material, and how this shapes organisational reputation."
        },
        {
            "number": "LO2.",
            "description": "Become familiar with using different forms of PR writing, the range of PR writing tools used in practice, and the adaptation of tools for cross-platform use."
        },
        {
            "number": "LO3.",
            "description": "Understand the significance of the different audiences to which PR writing is addressed."
        },
        {
            "number": "LO4.",
            "description": "Critically assess the effectiveness of PR writing."
        },
        {
            "number": "LO5.",
            "description": "Undertake effective reviewing, revising and editing of PR writing."
        },
        {
            "number": "LO6.",
            "description": "Apply the principles of effective writing that adhere to guiding principles of clarity, conciseness, consistency, coherence and use of plain language."
        },
        {
            "number": "LO7.",
            "description": "Demonstrate an ability for connecting with target audiences using strong professional writing skills for various forms of public relations writing."
        },
        {
            "number": "LO8.",
            "description": "Learn to design and produce a range of PR collaterals to suit an organisation's needs."
        },
        {
            "number": "LO9.",
            "description": "Understand the ethical and legal standards of practice in the composition of PR material, including through the use of AI tools."
        },
        {
            "number": "LO10.",
            "description": "Create public relations tools to align with the expectations of employers/client organisations."
        }
    ],
    "assessments": [],
    "learning_activities": []
}