{
    "course_title": "Conservation in Context",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/CONS7029-61013-7560",
    "full_course_code": "CONS7029-61013-7560",
    "course_code": "CONS7029",
    "class_code": "61013",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (30/06/2025 - 23/08/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Analytically review conservation literature."
        },
        {
            "number": "LO2.",
            "description": "Identify, interpret and apply methods for data capture and analysis"
        },
        {
            "number": "LO3.",
            "description": "Appreciate competing demands between different land users and their affect on the environment"
        },
        {
            "number": "LO4.",
            "description": "Develop conservation strategies while considering local and indigenous communities."
        },
        {
            "number": "LO5.",
            "description": "Obtain essential skills to raise funds and write successful grant proposals"
        },
        {
            "number": "LO6.",
            "description": "Being able to communicate a comprehensive grant budget"
        },
        {
            "number": "LO7.",
            "description": "Understand the process once funds have been received and follow up to donors"
        },
        {
            "number": "LO8.",
            "description": "Understand stakeholder views and how to successfully communicate and collaborate with a range of stakeholders for grant submissions and in conservation programmes"
        },
        {
            "number": "LO9.",
            "description": "Contribute in a professional manner to a team to achieve successful outcomes"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Assessment 1: Group presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p> 11/07/2025</p>\n<p>\n</p><p>10am - 5pm</p>\n<p>Group presentations in class</p></dd>",
            "learning_objectives": "L05, L06, L07, L08",
            "mode": "Activity/ Performance, Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Assessment: Group presentation in-class: Conservation planning for communities at grassroot level</p>\n<p>A group of 4-5 students will work on a community conflict case study, which will be provided to them in class. The students are presented with a case study, located in a developing country with natural resources that are part of the community’s livelihood. You will need to collaborate to generate project activities that would have community support based on the data provided. This will be presented to your class as a suggested community strategy for conservation. </p>\n<p>Purpose:To provide real life scenario practice in finding patterns in quantitative data and developing a strategy for conservation in a local community to benefit a natural resource or biodiversity. </p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>In class oral assessment. No submission needed.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Assessment 2: Writing a winning conservation grant",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>35%</dd>",
            "due_date": "<dd><p> 24/07/2025 2:00 pm</p></dd>",
            "learning_objectives": "L05, L06, L07, L08",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Each student will receive a grant application form to complete for an NGO or Not-for-Profit and species/conservation issue of their choice, providing they are eligible to apply for this selected grant. Students will be assessed on the quality of their “submitted” grant proposal according to the marking grid.</p>\n<p>Purpose: To re-enforce learning following the lectures and provide practical experience in writing grant proposals.</p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Online submission by Turnitin only by the due date and time. No hard copy or assignment cover sheets required. Submission via email is not accepted.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Assessment 3: Oral exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 31/07/2025 - 1/08/2025</p>\n<p>\n</p><p>10:00am-5pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Activity/ Performance, Oral",
            "category": "Role play/ Simulation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Spoken Examination - Arguing a Case with Data, and Thinking Critically About Both Sides of a Complex Conservation Issue</p>\n<p>In the real world, conservation issues are never simple, and there are always arguments either for or against any given perspective in the conservation debate. One of the most important reasons for taking you to Stradbroke Island was for you to experience this for yourself in the context of the arguments for and against sand mining. This assessment has been designed to develop your ability to think critically about both sides of a complex conservation issue and to construct a fair and well-reasoned response to a challenging debate. Such a response is based on evidence and argument, rather than an emotional or intuitive reaction to the controversy.</p>\n<p>The exercise will take the form of a brief, small-group discussion involving yourself, Berndt, John and one other student. This discussion will take place on campus in the days after our return from Stradbroke Island, and each student will need to make their own appointment to see Berndt and John during this time. The exact dates and times for these interviews, and instructions on how to reserve your appointment, will be explained during class. </p>\n<p>This assessment will take the form of a role-playing scenario…</p>\n<p>From the end of 2019, the long history of sand mining on Stradbroke Island officially came to an end. But for the purposes of this assessment, imagine that there has been a change in the Government of Queensland, and that the mining company has lodged a formal request to the new government to recommence sand-mining on Stradbroke Island. This request will be considered by the new minister for conservation and sustainable development. In the role-playing discussion that you will be participating in, the part of this minister will be played by Berndt, and John will take the role of his (long-suffering?) ministerial aide! </p>\n<p>Your role in this scenario will be as an expert advisor, who has been invited to a meeting with the minister to offer your advice on the government's Stradbroke Island policy. Specifically, you have been asked to offer your informed opinion on this question \"should sand-mining be allowed to continue on Stradbroke island?\"</p>\n<p>You were asked to provide your input because the minister knows that you have conducted extensive fieldwork on Stradbroke island, investigating post-mining rehabilitation success (using ants as bioindicators, and surveys of vegetation diversity and structure). He is also aware that you have earned a reputation among the Stradbroke Island community as a fair and unbiased observer who has developed a strong understanding of the broader ecological, socio-economic and indigenous issues surrounding the sand-mining debate. </p>\n<p>Choose your position…</p>\n<p>Half the class will be arguing in favour of the proposition that sand mining should be allowed to return to Stradbroke Island, and the other half against.  Hence, you must identify whether you will be arguing either for or against the proposal at the outset of assessment task (we will do our best to give everyone their first preference of position in the debate, but because the class does need to be split half-half on this, please appreciate that some flexibility may be required). You may argue for your broad position in any way that you wish, as long as your conclusions are backed by evidence based argument.</p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>In class oral assessment. The assessment will be recorded.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": []
}