{
    "course_title": "Introduction to Criminology",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/CRIM7000-61595-7560",
    "full_course_code": "CRIM7000-61595-7560",
    "course_code": "CRIM7000",
    "class_code": "61595",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand the measurement and distribution of crime"
        },
        {
            "number": "LO2.",
            "description": "Understand major theories and concepts that relate to the causes of criminal behaviour"
        },
        {
            "number": "LO3.",
            "description": "Have an appreciation for the evolution of criminological thought"
        },
        {
            "number": "LO4.",
            "description": "Undertake independent library research utilising academically relevant sources"
        },
        {
            "number": "LO5.",
            "description": "Manage information from a wide range of media, including academic sources"
        },
        {
            "number": "LO6.",
            "description": "Understand and identify ethical issues and limitations in criminological research"
        },
        {
            "number": "LO7.",
            "description": "Review, assess and synthesise theory and policy"
        },
        {
            "number": "LO8.",
            "description": "Develop a reasoned, academically informed argument"
        },
        {
            "number": "LO9.",
            "description": "Produce assessment that is clear and structured"
        },
        {
            "number": "LO10.",
            "description": "Demonstrate an understanding of the sociological nature of crime and criminal justice practices"
        },
        {
            "number": "LO11.",
            "description": "Appreciate social diversity and inequality and understand their impact on the behavior and the treatment of individuals and groups."
        },
        {
            "number": "LO12.",
            "description": "Work collegially alongside fellow students"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "AI Generated Annotated Bibliography Critique",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 29/08/2025 4:00 pm</p></dd>",
            "learning_objectives": "L03, L04, L05, L06, L07, L09, L11",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Your annotated bibliography has three goals: (1) to help develop critical thinking about the use of AI-generated texts; (2) to help you identify effective source material (scientific references); (3) and to get you to think about whose voices are represented in your references and how your own perspective shapes your research choices. Good source material leads to effective writing! Information will be provided in your tutorial on what each of these elements mean, how you can go about it, as well as how to evaluate AI-Generated texts.</p>\n<p>Two AI-Generated Annotated Bibliographies have been provided on Blackboard in the Assessment folder. Choose ONE of these to critique for this assessment and download it to your computer to work on. Then complete steps 1-3 below. The word count applies cumulatively to steps 2 &amp; 3 only. <em>Please note that</em> <em>your tutorial in Week 3 will include a walk-through on how to do this assessment.</em></p>\n<p><strong>STEP 1:</strong> Reply to the comments in the AI Generated Annotated Bibliography Word document regarding the content provided by ChatGPT. <strong>See exemplar from the Week 3 for how to do this.</strong></p>\n<p><strong>STEP 2: </strong>Write a statement that critiques your selected AI Generated Annotated Bibliography and answers the following three questions:</p>\n<p>-      What are the strengths of the AI-generated Annotated bibliography?</p>\n<p>-      What are the weaknesses of the AI-generated bibliography?</p>\n<p>-      What is one risk or ethical question raised about using AI generated articles?</p>\n<p><strong>STEP 3:</strong></p>\n<p>Think about what crime type or criminological topic you're drawn to for your upcoming crime story analysis (e.g., youth crime, domestic violence, white-collar crime, cybercrime, gang violence, etc.).</p>\n<p>On your own -- without Gen Ai to help you, find a research article on a criminological topic that genuinely interests you and that you feel would be useful for understanding crime stories in this area. Include the following components in the annotation:</p>\n<p><strong>Citation in APA 7th</strong></p>\n<p><strong>Summary of the article</strong> (key findings, methodology, theoretical framework)</p>\n<p><strong>Reflection on relevance:</strong> How this article could help you understand crime stories in this area and what insights it provides</p>\n<p><strong>Positionality reflection:</strong> A brief statement about why this particular topic or type of crime interests you and how your own background, experiences, or perspective might influence how you approach studying this area. Consider questions like:</p>\n<ul>\n<li>What draws you to this particular crime type or criminological issue?</li>\n<li>How might your age, background, experiences, or identity shape your interest in this topic?</li>\n<li>What assumptions or biases might you bring to studying this area?</li>\n<li>How might your perspective be different from someone with a different background?</li>\n</ul>\n<p>This positionality reflection will help prepare you for the more detailed positionality statement required in your crime story analysis assessment.</p>\n<p>An exemplar is available on Blackboard for you to view the suggested style and format for your annotation.</p>\n<p><strong>Why am I assigning this task?</strong></p>\n<p>The annotated bibliography aims to provide you with critical skills around finding good quality, respectable, and legitimate resources to help build your arguments. Secondly, to draw attention to what kind of research, and which voices you might want to include from the scholarly literature to help inform your argument for your major assessment. Finally, it introduces you to the concept of positionality—understanding how your own background and perspective shapes your research interests and analytical approach, which is essential for thoughtful criminological analysis.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Cybercrime Story Analysis",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 10/11/2025 4:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L07, L08, L09",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Over the course of the semester each lecture begins with a true crime story. These stories are designed to connect you to the core theoretical questions addressed in each lecture, build empathy and curiosity by bridging the gap between studying crime and lived experience.</p>\n<p>You will choose a cybercrime incident or technology-enabled crime case that interests you and use ONE criminological theory to help make sense of it. Your task is to tell this story in a compelling way, then demonstrate how criminological theory can deepen our understanding of why this cyber-related crime occurred. Think of theory as a lens that reveals patterns, connections, and explanations that might not be obvious from the surface details of the story.</p>\n<p><strong>Task Description:</strong></p>\n<p><strong>Part A: Tell Your Cybercrime Story (approx. 600-800 words)</strong></p>\n<p>Choose a real cybercrime story, event, or incident that interests you. This could be:</p>\n<ul>\n<li>A major data breach or ransomware attack</li>\n<li>Corporate cyber espionage or insider threats</li>\n<li>Online fraud, identity theft or financial crime</li>\n<li>Cyberstalking, harassment or digital domestic violence</li>\n<li>Dark web marketplace operations</li>\n</ul>\n<p><strong>Tell this story as a narrative that includes:</strong></p>\n<ul>\n<li>The key people involved (offender, victims, key figures)</li>\n<li>The sequence of events leading up to, during, and after the crime</li>\n<li>The social, economic, and environmental context</li>\n<li>The aftermath and consequences</li>\n<li>What makes this story compelling or significant to you</li>\n</ul>\n<p><em>Write this as an engaging story that would capture a reader's interest, not just a dry recitation of facts.</em></p>\n<p><strong>Part B: Unpack Your Story Using Criminological Theory (approx 1000- 1200 words)</strong></p>\n<p>Choose ONE criminological theory from our course readings and lectures to analyse your story. Your goal is to show how this theory helps us understand the crime in ways that wouldn't be obvious from just hearing the story.</p>\n<p><strong>Your analysis should:</strong></p>\n<ul>\n<li>Clearly explain your chosen theory and its key principles and how they work together to explain the crime</li>\n<li>Apply the theory systematically to your story, showing how it illuminates different aspects of the crime</li>\n<li>Demonstrate what the theory helps us see that we might have missed</li>\n<li>Acknowledge what the theory cannot explain or where it falls short</li>\n</ul>\n<p><strong>Part C: Positionality Statement (approximately 200 words)</strong></p>\n<p>Reflect on why you chose this particular story and how your background might influence your analysis. Consider your relationship to the case and any potential biases or insights this creates. See the information on Blackboard on how to write a positionality statement.</p>\n<p><strong>Suggested Structure:</strong></p>\n<ol>\n<li><strong>Introduction</strong> (including why this story matters and a preview of your argument)</li>\n<li><strong>The Cybercrime Story</strong> (your compelling narrative)</li>\n<li><strong>Theoretical Lens</strong> (explanation of your chosen theory)</li>\n<li><strong>Making Sense of the Story</strong> (applying theory to understand the crime)</li>\n<li><strong>Limitations and Reflections</strong> (what the theory can't explain, your positionality)</li>\n<li><strong>Conclusion</strong> (what we gain from this theoretical understanding)</li>\n<li><strong>References</strong> (APA 7th style)</li>\n<li><strong>AI Usage Statement</strong></li>\n</ol>\n<p><strong>Ethical Guidelines:</strong></p>\n<ul>\n<li>Treat all people in your story with dignity and respect</li>\n<li>Be sensitive to victims and their families</li>\n<li>If discussing people you know personally, protect their privacy</li>\n<li>Consider the ongoing impact of sharing this story</li>\n</ul>\n<p><strong>Source Requirements:</strong></p>\n<ul>\n<li><strong>A minimum of 8 scholarly, peer-reviewed references</strong> (see options above)</li>\n<li>Reliable sources about your chosen case (news reports, court documents, official reports)</li>\n<li>Ensure you can access sufficient information about your case</li>\n</ul>\n<p><strong>Technical Requirements:</strong></p>\n<p><strong>You may use AI to SUPPORT your writing, but you must include an AI usage statement as an appendix. Failure to include this statement will result in a grade of 0. </strong>Tutorials will include a discussion of what appropriate AI usage looks like for this assessment. <strong>Additional resources are available through </strong><a href=\"https://web.library.uq.edu.au/study-and-learning-support/ai-student-hub\">UQ AI Student Hub</a>.</p>\n<p>The reference list and AI statement are not included in the word count.</p>\n<p><strong>Why This Assignment Matters:</strong></p>\n<p>Crime stories surround us in media, conversations, and community experiences, but we often accept surface-level explanations for why crimes occur. This assignment develops your ability to look deeper—to use criminological theory as a tool for understanding complex human behaviour and social problems. By choosing your own story, you'll engage more meaningfully with both the human reality of crime and the analytical power of criminological thinking. This skill of applying theoretical frameworks to real-world problems is essential for anyone working in criminal justice, policy, research, or community safety.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Tutorial Exercises",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 21/08/2025 - 22/08/2025</p>\n<p> 4/09/2025 - 5/09/2025</p>\n<p> 18/09/2025 - 19/09/2025</p>\n<p> 25/09/2025 - 26/09/2025</p>\n<p> 9/10/2025 - 10/10/2025</p>\n<p> 16/10/2025 - 17/10/2025</p>\n<p>\n</p><p>To be completed within the designated tutorial. </p></dd>",
            "learning_objectives": "L01, L02, L03, L08, L09, L10, L12",
            "mode": "Written",
            "category": "Quiz, Tutorial/ Problem Set",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Tutorials in CRIM7000 are designed to do two things: First, give you important information and direction in completing your assessments. Second, to help you practice and develop your theory application skills learned in the lecture and reading material each week.</p>\n<p>During tutorials in weeks 4, 6, 8, 9, 10, and 11, you will complete an interactive exercise, each worth 10 points. These exercises are based on analysing and responding to real-world crime scenarios presented through videos, case studies, artifacts, or news reports shown in class. You will work through these scenarios by applying criminological theories and concepts to explain criminal behaviour, identify contributing factors, and develop analytical responses.</p>\n<p>These exercises are designed to help you practice critical thinking skills, engage with real-world crime scenarios, and demonstrate your understanding of lecture content and reading material through practical application. Explicit instructions on how each exercise works will be provided at the beginning of each tutorial.</p>\n<p><strong>Assessment Security Requirements:</strong></p>\n<p>These are secure, identity-verified assessments with the following requirements:</p>\n<p>·        In-person attendance mandatory - Exercises can only be completed during your assigned tutorial</p>\n<p>·        No digital devices permitted - Computers, phones, tablets, or other digital devices cannot be used during the exercise</p>\n<p>·        Paper-based responses only - You must complete responses on the paper materials provided by your tutor</p>\n<p>·        No external materials - Textbooks, notes, or outside materials are not permitted during the exercise</p>\n<p>·        No AI assistance - Artificial intelligence tools cannot be used to assist or complete these exercises</p>\n<p>·        Translation exception - If you require translation software due to language needs, you must notify your tutor BEFORE the tutorial begins</p>\n<p><strong>Grading Structure:</strong></p>\n<p>There are 6 exercises offered over the course of the semester. You may attempt all of them; however, your best 3 exercise scores will contribute to 30% of your final grade. Each exercise is worth 10 points (total possible: 30 points toward final grade).</p>\n<p>Since you have multiple opportunities to complete exercises throughout the semester, no make-ups, extensions, or alternative arrangements are available. This is not a formal examination, so deferred assessment options do not apply.</p>\n<p><strong>Why does this assessment matter?</strong></p>\n<p>These interactive exercises are designed to help you apply theoretical knowledge to real-world crime scenarios in a supervised setting. They are designed to ensure that you are meeting the learning outcomes of this course and develop skills including critical thinking, give you an opportunity to demonstrate what you have learned, and build your confidence in theory application before your major assessment. In addition, these exercises help you to practice your exam-style thinking in a low-stakes environment and ensure the academic integrity of your learning. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Exercises would be completed on the worksheet provided in the tutorial and handed in to the tutor at the end of the tutorial. </p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(28 Jul - 03 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1 Lecture: What makes something criminal? Understanding Crime and Criminology</strong><br><p>Introduction to course and basic concepts.</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L10</p></div></td>",
            "topic_title": "<strong>Week 1 Lecture: What makes something criminal? Understanding Crime and Criminology</strong>",
            "topic_description": "Week 1 Lecture: What makes something criminal? Understanding Crime and Criminology Introduction to course and basic concepts.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L10"
            ]
        },
        {
            "learning_period": "Week 2(04 Aug - 10 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2 Lecture: How do we really know about crime? Measuring the Unmeasurable</strong><br><p>What are the major ways that criminologists learn about crime and criminality?</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L05, L06, L10, L11</p></div></td>",
            "topic_title": "<strong>Week 2 Lecture: How do we really know about crime? Measuring the Unmeasurable</strong>",
            "topic_description": "Week 2 Lecture: How do we really know about crime? Measuring the Unmeasurable What are the major ways that criminologists learn about crime and criminality?",
            "learning_outcomes": [
                "L01",
                "L03",
                "L05",
                "L06",
                "L10",
                "L11"
            ]
        },
        {
            "learning_period": "Week 2(04 Aug - 10 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 1</strong><br><p>Introduction to Assessments and the Semester 2 Tutorial Program.</p></br></p><p><strong>Learning outcomes:</strong> L02, L04, L07, L09</p></div></td>",
            "topic_title": "<strong>Tutorial 1</strong>",
            "topic_description": "Tutorial 1 Introduction to Assessments and the Semester 2 Tutorial Program.",
            "learning_outcomes": [
                "L02",
                "L04",
                "L07",
                "L09"
            ]
        },
        {
            "learning_period": "Week 3(11 Aug - 17 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3 Lecture: Who commits crime? Patterns and Stereotypes</strong><br><p>The correlates of age, sex, race and class and crime.</p></br></p><p><strong>Learning outcomes:</strong> L01, L05, L06, L10, L11</p></div></td>",
            "topic_title": "<strong>Week 3 Lecture: Who commits crime? Patterns and Stereotypes</strong>",
            "topic_description": "Week 3 Lecture: Who commits crime? Patterns and Stereotypes The correlates of age, sex, race and class and crime.",
            "learning_outcomes": [
                "L01",
                "L05",
                "L06",
                "L10",
                "L11"
            ]
        },
        {
            "learning_period": "Week 3(11 Aug - 17 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 2</strong><br><p>Critical thinking and Using AI in your Assessments.</p></br></p><p><strong>Learning outcomes:</strong> L02, L07, L09, L12</p></div></td>",
            "topic_title": "<strong>Tutorial 2</strong>",
            "topic_description": "Tutorial 2 Critical thinking and Using AI in your Assessments.",
            "learning_outcomes": [
                "L02",
                "L07",
                "L09",
                "L12"
            ]
        },
        {
            "learning_period": "Week 4(18 Aug - 24 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4 Lecture: Does Location Matter? Neighbourhoods and Crime</strong><br/><p>How are our communities organised to prevent or promote crime?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L08</p></div></td>",
            "topic_title": "<strong>Week 4 Lecture: Does Location Matter? Neighbourhoods and Crime</strong>",
            "topic_description": "Week 4 Lecture: Does Location Matter? Neighbourhoods and Crime How are our communities organised to prevent or promote crime?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L08"
            ]
        },
        {
            "learning_period": "Week 4(18 Aug - 24 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 3</strong><br/><p>Introduction to Case Study</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L09, L12</p></div></td>",
            "topic_title": "<strong>Tutorial 3</strong>",
            "topic_description": "Tutorial 3 Introduction to Case Study",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L09",
                "L12"
            ]
        },
        {
            "learning_period": "Week 5(25 Aug - 31 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5 Lecture: How do we learn criminal behaviour? The Role of Associations</strong><br/><p>How are we influenced by our peers and other associations?</p></p><p><strong>Learning outcomes:</strong> L02, L03, L07, L10</p></div></td>",
            "topic_title": "<strong>Week 5 Lecture: How do we learn criminal behaviour? The Role of Associations</strong>",
            "topic_description": "Week 5 Lecture: How do we learn criminal behaviour? The Role of Associations How are we influenced by our peers and other associations?",
            "learning_outcomes": [
                "L02",
                "L03",
                "L07",
                "L10"
            ]
        },
        {
            "learning_period": "Week 5(25 Aug - 31 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 4</strong><br/><p>Tutorial Case Study Activities</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L09, L12</p></div></td>",
            "topic_title": "<strong>Tutorial 4</strong>",
            "topic_description": "Tutorial 4 Tutorial Case Study Activities",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L09",
                "L12"
            ]
        },
        {
            "learning_period": "Week 6(01 Sep - 07 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6 Lecture: Can Criminal Behaviour be taught? Social Learning and Crime</strong><br/><p>How do the principles of \"learning\" help us understand how criminal behaviour is learned or unlearned?</p></p><p><strong>Learning outcomes:</strong> L02, L03, L07, L10</p></div></td>",
            "topic_title": "<strong>Week 6 Lecture: Can Criminal Behaviour be taught? Social Learning and Crime</strong>",
            "topic_description": "Week 6 Lecture: Can Criminal Behaviour be taught? Social Learning and Crime How do the principles of \"learning\" help us understand how criminal behaviour is learned or unlearned?",
            "learning_outcomes": [
                "L02",
                "L03",
                "L07",
                "L10"
            ]
        },
        {
            "learning_period": "Week 6(01 Sep - 07 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 5</strong><br/><p>Referencing and talking about Ethical AI</p></p><p><strong>Learning outcomes:</strong> L04, L05, L06, L09, L12</p></div></td>",
            "topic_title": "<strong>Tutorial 5</strong>",
            "topic_description": "Tutorial 5 Referencing and talking about Ethical AI",
            "learning_outcomes": [
                "L04",
                "L05",
                "L06",
                "L09",
                "L12"
            ]
        },
        {
            "learning_period": "Week 7(08 Sep - 14 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7 Lecture: Does inequality drive crime? Social Structure and Deviance</strong><br/><p>How does inequality in our society help us understand crime?</p></p><p><strong>Learning outcomes:</strong> L02, L03, L06, L07, L10, L11</p></div></td>",
            "topic_title": "<strong>Week 7 Lecture: Does inequality drive crime? Social Structure and Deviance</strong>",
            "topic_description": "Week 7 Lecture: Does inequality drive crime? Social Structure and Deviance How does inequality in our society help us understand crime?",
            "learning_outcomes": [
                "L02",
                "L03",
                "L06",
                "L07",
                "L10",
                "L11"
            ]
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8 Lecture: How does stress lead to crime? Understanding Social Strain</strong><br/><p>Can the strains/stressors that we experience as individuals help us understand why people offend?</p></p><p><strong>Learning outcomes:</strong> L02, L03, L06, L07, L10, L11</p></div></td>",
            "topic_title": "<strong>Week 8 Lecture: How does stress lead to crime? Understanding Social Strain</strong>",
            "topic_description": "Week 8 Lecture: How does stress lead to crime? Understanding Social Strain Can the strains/stressors that we experience as individuals help us understand why people offend?",
            "learning_outcomes": [
                "L02",
                "L03",
                "L06",
                "L07",
                "L10",
                "L11"
            ]
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 6</strong><br/><p>Tutorial Case Study Activities.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L09, L12</p></div></td>",
            "topic_title": "<strong>Tutorial 6</strong>",
            "topic_description": "Tutorial 6 Tutorial Case Study Activities.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L09",
                "L12"
            ]
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9: What prevents crime? The power of social control</strong><br/><p>How do our parents and teachers influence behavior?</p></p><p><strong>Learning outcomes:</strong> L02, L03, L06, L07, L08, L10</p></div></td>",
            "topic_title": "<strong>Week 9: What prevents crime? The power of social control</strong>",
            "topic_description": "Week 9: What prevents crime? The power of social control How do our parents and teachers influence behavior?",
            "learning_outcomes": [
                "L02",
                "L03",
                "L06",
                "L07",
                "L08",
                "L10"
            ]
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 7</strong><br/><p>Tutorial Case Study Activities</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L09, L12</p></div></td>",
            "topic_title": "<strong>Tutorial 7</strong>",
            "topic_description": "Tutorial 7 Tutorial Case Study Activities",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L09",
                "L12"
            ]
        },
        {
            "learning_period": "Mid Sem break(29 Sep - 05 Oct)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-semester break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-semester break</strong>",
            "topic_description": "Mid-semester break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(06 Oct - 12 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10 Lecture: How does offending change over time? Social Institutions and Crime  </strong><br/><p>How are we socialised to behave in different ways?</p></p><p><strong>Learning outcomes:</strong> L02, L03, L07, L10, L11</p></div></td>",
            "topic_title": "<strong>Week 10 Lecture: How does offending change over time? Social Institutions and Crime  </strong>",
            "topic_description": "Week 10 Lecture: How does offending change over time? Social Institutions and Crime How are we socialised to behave in different ways?",
            "learning_outcomes": [
                "L02",
                "L03",
                "L07",
                "L10",
                "L11"
            ]
        },
        {
            "learning_period": "Week 10(06 Oct - 12 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 8</strong><br/><p>Writing Basics and Academic Writing Style.</p></p><p><strong>Learning outcomes:</strong> L05, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Tutorial 8</strong>",
            "topic_description": "Tutorial 8 Writing Basics and Academic Writing Style.",
            "learning_outcomes": [
                "L05",
                "L07",
                "L08",
                "L09"
            ]
        },
        {
            "learning_period": "Week 11(13 Oct - 19 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11 Lecture: Do Labels Create Criminals? The Impact of Social Reactions</strong><br/><p>Does how we are labeled make a difference to criminality?</p></p><p><strong>Learning outcomes:</strong> L02, L03, L07, L10, L11</p></div></td>",
            "topic_title": "<strong>Week 11 Lecture: Do Labels Create Criminals? The Impact of Social Reactions</strong>",
            "topic_description": "Week 11 Lecture: Do Labels Create Criminals? The Impact of Social Reactions Does how we are labeled make a difference to criminality?",
            "learning_outcomes": [
                "L02",
                "L03",
                "L07",
                "L10",
                "L11"
            ]
        },
        {
            "learning_period": "Week 11(13 Oct - 19 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 9</strong><br/><p>Tutorial Case Study Activities</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L09, L12</p></div></td>",
            "topic_title": "<strong>Tutorial 9</strong>",
            "topic_description": "Tutorial 9 Tutorial Case Study Activities",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L09",
                "L12"
            ]
        },
        {
            "learning_period": "Week 12(20 Oct - 26 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12 Lecture: Who Makes the Rules? Power, Conflict, and Criminal Law</strong><br/><p>Who gets to decide who and what is criminal?</p></p><p><strong>Learning outcomes:</strong> L02, L03, L07, L10, L11</p></div></td>",
            "topic_title": "<strong>Week 12 Lecture: Who Makes the Rules? Power, Conflict, and Criminal Law</strong>",
            "topic_description": "Week 12 Lecture: Who Makes the Rules? Power, Conflict, and Criminal Law Who gets to decide who and what is criminal?",
            "learning_outcomes": [
                "L02",
                "L03",
                "L07",
                "L10",
                "L11"
            ]
        },
        {
            "learning_period": "Week 12(20 Oct - 26 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 10</strong><br/><p>Assessment Consults</p></p><p><strong>Learning outcomes:</strong> L04, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Tutorial 10</strong>",
            "topic_description": "Tutorial 10 Assessment Consults",
            "learning_outcomes": [
                "L04",
                "L07",
                "L08",
                "L09"
            ]
        },
        {
            "learning_period": "Week 13(27 Oct - 02 Nov)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13 Lecture: Where Can Criminology Take You? Career Paths and Applications</strong><br/><p>Course summary and conversations about the utility of criminological education and skills and where you might go next.</p></p><p><strong>Learning outcomes:</strong> L05, L06, L10, L11</p></div></td>",
            "topic_title": "<strong>Week 13 Lecture: Where Can Criminology Take You? Career Paths and Applications</strong>",
            "topic_description": "Week 13 Lecture: Where Can Criminology Take You? Career Paths and Applications Course summary and conversations about the utility of criminological education and skills and where you might go next.",
            "learning_outcomes": [
                "L05",
                "L06",
                "L10",
                "L11"
            ]
        }
    ]
}