{
    "course_title": "Advanced Human-Computer Interaction",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/DECO6500-62507-7560",
    "full_course_code": "DECO6500-62507-7560",
    "course_code": "DECO6500",
    "class_code": "62507",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Analyse and interpret comprehensive data on people's needs, values, and behaviours within different contexts of use, applying advanced qualitative and quantitative research methods to effectively inform design decisions."
        },
        {
            "number": "LO2.",
            "description": "Integrate research findings and HCI theories and principles to support the design and creation of effective technology solutions, synthesising complex information to address real-world problems effectively."
        },
        {
            "number": "LO3.",
            "description": "Critically apply and evaluate HCI theories and methodologies in designing and evaluating technologies throughout an iterative design process, demonstrating a deep understanding of how theoretical concepts are applied in practical scenarios."
        },
        {
            "number": "LO4.",
            "description": "Critically examine new and emerging technologies to identify opportunities and challenges for HCI, analysing the implications of these technologies on human experience, needs and values."
        },
        {
            "number": "LO5.",
            "description": "Critically evaluate the broader impacts of technologies on society, considering them as complex systems with interconnected elements, including ethics, accessibility, and cultural sensitivity, demonstrating an understanding of the social responsibilities of HCI practitioners."
        },
        {
            "number": "LO6.",
            "description": "Collaborate effectively in a multidisciplinary team, applying advanced methods and techniques for teamwork, including the use of digital tools and platforms, and critically evaluate and resolve conflicts to enhance team performance."
        },
        {
            "number": "LO7.",
            "description": "Critically apply principles of responsible GenAI and Machine Translation (MT) use in academic and design workflows, demonstrating ethical engagement, transparency, and clear evidence of personal intellectual agency in all outputs."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "A1 Systems Map (Individual)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd> 1 </dd>",
            "due_date": "<dd><p> 20/08/2025 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment requires you to analyse a complex technological system by mapping its interconnected elements, which include technical components, human actors, organisational structures, and social or environmental contexts. The output will be an interactive online systems map, visually representing these diverse components and their relationships. Your responsible use of GenAI throughout the process of creating this map, including transparent acknowledgment and critical evaluation of AI-generated content, will be an integral part of this submission.</p>\n<p><strong>Use of GenAI/MT</strong></p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference and/or acknowledge any use of AI or MT in each instance.</p>\n<p>A failure to reference and/or acknowledge generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>This course has specific requirements for acknowledging generative AI or MT use in this course.  Please refer to the task sheet for this assessment item for more details on these requirements.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The Systems Map will be created as a website using HTML, CSS and JavaScript along with some pre-defined libraries and frameworks. To submit this you will need to:</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "A2 Project (Group)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd> 3 </dd>",
            "due_date": "<dd><p> 8/10/2025 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This core collaborative project involves multidisciplinary teams undertaking a comprehensive design and evaluation of a technology solution for a complex HCI problem. You will apply systems thinking throughout the process to understand interconnected elements and broader societal impacts. Your work will involve analysing provided user research data (using both qualitative and quantitative methods), designing a system and producing a prototype, evaluating the system using a range of methods, and analysing the evaluation outcomes. Your responsible use of GenAI throughout the project, and reflection process, including transparent acknowledgment and critical evaluation of AI-generated content, will be an integral part of this submission.</p>\n<p><strong>Use of GenAI/MT</strong></p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference and/or acknowledge any use of AI or MT in each instance.</p>\n<p>A failure to reference and/or acknowledge generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>This course has specific requirements for acknowledging generative AI or MT use in this course.  Please refer to the task sheet for this assessment item for more details on these requirements.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The Project outputs will be submitted to Blackboard.  Further information about submission will be available in the task sheet for this assessment item (also available in Blackboard).</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "A3 Design Fiction/Speculative Design (Individual)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                }
            ],
            "weighting": "<dd> 3 </dd>",
            "due_date": "<dd><p>A3.1 Critical Discussion will take place in your allocated applied class in Week 12. 20/10/2025</p>\n<p>A3.2 Design Fiction/Speculative Design is due on 12/11/2025 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance, Written",
            "category": "Essay/ Critique, Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment challenges you to envision future Human-Computer Interaction (HCI) scenarios through the creation of a design fiction. It is designed in two sequential elements:</p>\n<p><strong>A3.1: Critical Discussion (Individual &amp; Secure)</strong> This element requires you to engage in a critical discussion about the topic you intend to explore in your final design fiction. This secure assessment will serve as a foundational check of your understanding and initial critical insights into your chosen future HCI domain, drawing directly upon findings and insights from your A2 Project to provide rationale for the need for change or critique of existing HCI conceptualisations. It provides an opportunity for you to articulate your initial thoughts, justify your topic selection, and receive formative feedback to guide the development of your subsequent design fiction. This discussion is crucial for demonstrating your personal intellectual agency and critical engagement, particularly in relation to the responsible use of GenAI.</p>\n<p><strong>Use of GenAI/MT in A3.1</strong></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<p><strong>A3.2: Design Fiction (Individual)</strong></p>\n<p>Building on the insights and feedback from your critical discussion, you will create a comprehensive Design Fiction Report. This report will present a speculative design artifact or system within a vividly described future world, using findings and insights from your A2 Project as key rationale for both critiquing existing HCI theories, principles, or methods, and for proposing pathways to a more desirable future. Through this narrative, you will implicitly and explicitly critique existing HCI theories, principles, or methods that might lead to undesirable futures, and then propose what HCI should be doing to foster a more desirable one. Your responsible use of GenAI throughout the ideation, narrative development, and reflection process, including transparent acknowledgment and critical evaluation of AI-generated content, will be an integral part of this submission.</p>\n<p><strong>Use of GenAI/MT in A3.2</strong></p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference and/or acknowledge any use of AI or MT in each instance.</p>\n<p>A failure to reference and/or acknowledge generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>This course has specific requirements for acknowledging generative AI or MT use in this course.  Please refer to the task sheet for this assessment item for more details on these requirements.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>A3.1 Critical Discussion</strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p><strong>A3.1 Critical Discussion</strong></p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(28 Jul - 02 Nov)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Weekly Lecture</strong><br><p>Weekly lectures that will include explanation of key concepts and methods as well as presenters from outside of the teaching team</p></br></p></div></td>",
            "topic_title": "<strong>Weekly Lecture</strong>",
            "topic_description": "Weekly Lecture Weekly lectures that will include explanation of key concepts and methods as well as presenters from outside of the teaching team",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(28 Jul - 02 Nov)",
            "activity_type": "Applied Class",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Weekly Applied Class</strong><br><p>Each week there is one applied class (3 hours).</p>\n<p>These hands-on sessions are designed to bridge theoretical Human-Computer Interaction (HCI) concepts with practical application. They serve as <strong>multidisciplinary and cross-disciplinary spaces for collaboration</strong>, allowing you to work on your assessment tasks with peers from diverse academic backgrounds. You will engage in collaborative activities, conduct user research, develop prototypes, and receive training in digital tools such as NVIVO and Google Colab, directly applying HCI concepts to real-world scenarios and developing practical skills.</p></br></p></div></td>",
            "topic_title": "<strong>Weekly Applied Class</strong>",
            "topic_description": "Weekly Applied Class Each week there is one applied class (3 hours). These hands-on sessions are designed to bridge theoretical Human-Computer Interaction (HCI) concepts with practical application. They serve as multidisciplinary and cross-disciplinary spaces for collaboration , allowing you to work on your assessment tasks with peers from diverse academic backgrounds. You will engage in collaborative activities, conduct user research, develop prototypes, and receive training in digital tools such as NVIVO and Google Colab, directly applying HCI concepts to real-world scenarios and developing practical skills.",
            "learning_outcomes": []
        }
    ]
}