{
    "course_title": "Design Computing Studio I - Interactive Technology",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/DECO1800-60820-7560",
    "full_course_code": "DECO1800-60820-7560",
    "course_code": "DECO1800",
    "class_code": "60820",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Analyse and propose design computing solutions that aligns with the objectives and constraints of a project brief."
        },
        {
            "number": "LO2.",
            "description": "Understand key course concepts and studio workflow and apply those principles in an iterative development process."
        },
        {
            "number": "LO3.",
            "description": "Apply design and technical skills within a multidisciplinary team to build a proof-of-concept prototype."
        },
        {
            "number": "LO4.",
            "description": "Apply critical thinking to reflect on and analyse the development and outcome of a project, considering how well they align with user needs and the project brief."
        },
        {
            "number": "LO5.",
            "description": "Recognise ethical implications of design decisions and describe their potential impact on users, communities, and stakeholders."
        },
        {
            "number": "LO6.",
            "description": "Apply teamwork and communication strategies to collaborate effectively, resolve conflict, and contribute to shared project goals."
        },
        {
            "number": "LO7.",
            "description": "Present design decisions, design process and outcomes clearly through visual, oral and written communication."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Studio Design Journal",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> 2 </dd>",
            "due_date": "<dd><p> Week 1 - Week 13</p>\n<p>Final updates before 5pm. 31/10/2025</p>\n<p>\n</p><p><strong>Regular updates are essential:</strong> You are required to post consistently from <strong>Week 1 to Week 13</strong>. Topics &amp; activities to be included in the journal will be signposted in class. It is expected that posts will incorporate evidence such as photographs to document work completed.</p>\n<p><strong>Weekly deadline:</strong> Each week's entry must be completed and submitted by <strong>midday the day before your next scheduled studio class</strong>. This allows teaching staff sufficient time to review your submissions.</p>\n<p><strong>Final deadline for updates</strong>: to the Studio Design Journal is <strong>5pm Friday Week 13.</strong></p></dd>",
            "learning_objectives": "L01, L02, L04, L05, L07",
            "mode": "Activity/ Performance, Written",
            "category": "Notebook/ Logbook, Participation/ Student contribution, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will maintain a record of learning in the course, documenting and reflecting on in-class activities, team process, and design project work. During the studio and practical sessions, students will undertake design, theory and technical exercises that apply to the team project. Students will document the outcomes of these exercises in their design journal. The primary aim of this journal is to help students develop good design and research practice. By regularly documenting design activity and thinking, students cultivate the ability to critically analyse design decisions, learn from experiences, and refine design approaches. Journals are not meant to be polished, final works rather they should capture in-the-moment thinking, documenting work as it happens and as such, it is appropriate for them to be messy in presentation.</p>\n<p>These journal pages will be reviewed by the teaching team on a regular basis as part of weekly report-back in class to make sure that all students are making regular updates. If you are not updating your page regularly, this will trigger a closer engagement with the teaching team to make sure that you are not putting yourself at risk of failing the associated hurdle.</p>\n<p>Journal entries will be viewable only by the student posting them and members of the teaching team.</p>\n<p>To pass the hurdle for the Studio Design Journal, students must ensure they have posted a design opportunity to their journal by the end of week 3. The requirements for this post will be discussed in studio. The purpose of this post is to demonstrate your early engagement with the broad topic of the course and to provide you discussion points around project direction with teammates.</p>\n<p>Machine Translation (MT) may support students in completing this assessment task. Students may appropriately use MT in completing this assessment task. Students must clearly reference any use of MT in each instance. A failure to reference MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>Generative AI may be used to assist in post structure, or for improving language / grammar but should not be used to generate the text or content for journal posts. Students are asked to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. Students must clearly reference any use of AI in each instance. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>A guide to appropriate MT/AI usage and acknowledgement is available on Blackboard.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Online submission via OneNote Class Notebook accessible through Microsoft Teams or directly in OneNote. All entries are time-stamped. For accurate time-keeping, please enter a new note each time you have an update for the journal rather than editing one single entry for the whole semester. </p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Design Computing Project (Team)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> 5 </dd>",
            "due_date": "<dd><p>Proposal - Presentation in studio class 26/08/2025 8:00 am</p>\n<p>Proposal - slides, including response to feedback due to Blackboard 29/08/2025 5:00 pm</p>\n<p>Work-in-Progress - Demonstration in studio class 23/09/2025 8:00 am</p>\n<p>Work-in-Progress - Response to feedback &amp; plan for completion document, including link to work-in-progress due to Blackboard. 26/09/2025 5:00 pm</p>\n<p>Final Tradeshow - Demonstration of project in studio class 21/10/2025 8:00 am</p>\n<p>Final Tradeshow - Project Debrief Report, including link to prototype due to Blackboard. 31/10/2025 5:00 pm</p>\n<p>\n</p><p>Presentations for milestones 1 &amp; 2 take place during the timetabled studio session, with documentation due at the end of the week.</p>\n<p>Tradeshow takes place during the timetabled studio session in week 12, with final documentation submission at the end of Week 13.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07",
            "mode": "Activity/ Performance, Oral, Product/ Artefact/ Multimedia, Written",
            "category": "Computer Code, Creative Production/ Exhibition, Essay/ Critique, Practical/ Demonstration, Presentation, Product/ Design, Project, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will work in small teams to design and prototype a design computing solution to a given brief over the semester.</p>\n<p>To support team and project progress, there will be 3 key milestones for the project:</p>\n<ol>\n<li>Proposal Presentation</li>\n<li>Presentation of proposed project direction in studio class in Week 5</li>\n<li>Submission of slides + response to feedback Friday Week 5</li>\n<li>Work-in-Progress Demonstration</li>\n<li>Demonstration of work-in-progress in studio class in Week 9</li>\n<li>Submission of link to work, response to feedback and plan for completion Friday Week 9</li>\n<li>Final Tradeshow</li>\n<li>Tradeshow demonstration of proof-of-concept prototype in studio class Week 12</li>\n<li>Project Debrief Report due Week 13</li>\n</ol>\n<p><br/></p>\n<p>Grading and feedback on milestones 1 &amp; 2 will be formative, intended to provide students with an understanding of the quality of their work against the criteria, and to inform and support their subsequent work to refine and improve their project based on the feedback. The overall grade for the project will be considered holistically, examining work across the whole lifetime of the project, but with an emphasis in particular on the endpoint and on the quality of the process followed to get there.</p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<p><strong>Second assessment sequence approved by the Associate Dean (Academic)</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Project documents will be submitted via Blackboard. Presentations and demonstrations will take place during the scheduled studio session.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Portfolio (Individual)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> 3 </dd>",
            "due_date": "<dd><p> 10/11/2025 1:00 pm</p>\n<p>\n</p><p><strong>Final deadline for updates</strong> to the Portfolio is <strong>1:00pm Monday Exam Week 1</strong></p>\n<p>See Portfolio Presentation &amp; Interview item for information on when the critique sessions will occur.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L07",
            "mode": "Oral, Product/ Artefact/ Multimedia",
            "category": "Presentation, Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will generate a portfolio presenting key learning insights from the semester, and specific work the student completed for the team project. Using their design journal to evidence their claims, students will present their portfolio to teaching staff in Exam Week 1.</p>\n<p>Students will have 3-5 minutes to present the highlights from the portfolio as a precursor to a 5 -7 minute Q&amp;A session with teaching staff. Questions will focus on understanding the contributions the student made to the team project and their learning in the course. Students will focus reflections on the work they have completed through course activities, through self-directed learning and through the project - reflecting on their role in the success (or failure) of the team project. The portfolio artefact will be used to evidence the work they have done. Students will select key evidence from their Studio Design journal and team project submissions to present individual work in the broader context of the team project.</p>\n<p>The audience for the portfolio will be diverse. The portfolio itself is a design artefact. It is important that appropriate thought is given to it’s appearance, functionality, and usability. It is recommended that students capture key reflections &amp; contributions following each project milestone.</p>\n<p><strong>Use of MT/AI Tools for producing the Portfolio document</strong></p>\n<p>Machine Translation (MT) may support students in producing the portfolio document itself. Students may appropriately use MT in producing the portfolio document. Students must clearly reference any use of MT in each instance. A failure to reference MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>Generative AI may be used to assist in portfolio structure, or for improving language / grammar but should not be used to generate the text or content for the portfolio. Students must clearly reference any use of AI in each instance. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>A guide to appropriate MT/AI usage and acknowledgement is available on Blackboard.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Online submission via OneNote Class Notebook via the Portfolio section accessible through Microsoft Teams or directly in OneNote. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Portfolio Presentation & Interview (Individual)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 10/11/2025 -</p>\n<p>\n</p><p>Portfolio Presentation &amp; Interview sessions will take place Monday to Wednesday in Exam Week 1. Sign-up for sessions will be available from Week 12 to assist student planning around exams. Students will need to produce valid UQ identification before commencing their presentation.</p></dd>",
            "learning_objectives": "L01, L02, L04, L05, L07",
            "mode": "Oral",
            "category": "Presentation, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This item forms the secure element of the Portfolio task. </p>\n<p><strong>Use of MT/AI Tools for the Portfolio  presentation &amp; interview</strong></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13",
            "activity_type": "Studio",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Studio</strong><br><p>Students will work in teams with teaching staff on their team projects and on activities related to their projects. Studios will introduce theory related to design theory and practice to be applied through in-class activities to project work. </p>\n<p>The final Tradeshow will take place in the studio session in Week 13, where teams will demonstrate their projects to a broader audience.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Studio</strong>",
            "topic_description": "Studio Students will work in teams with teaching staff on their team projects and on activities related to their projects. Studios will introduce theory related to design theory and practice to be applied through in-class activities to project work. The final Tradeshow will take place in the studio session in Week 13, where teams will demonstrate their projects to a broader audience.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Practical</strong><br><p>Practical sessions will support individual work towards the team project through technical and design exercises. Students will also have the opportunity to receive feedback &amp; guidance from their demonstrator on their work.</p></br></p><p><strong>Learning outcomes:</strong> L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Practical</strong>",
            "topic_description": "Practical Practical sessions will support individual work towards the team project through technical and design exercises. Students will also have the opportunity to receive feedback & guidance from their demonstrator on their work.",
            "learning_outcomes": [
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        }
    ]
}