{
    "course_title": "Thesis",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/ECON7934-60625-7560",
    "full_course_code": "ECON7934-60625-7560",
    "course_code": "ECON7934",
    "class_code": "60625",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - )",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate that you can conduct independent research work."
        },
        {
            "number": "LO2.",
            "description": "Write up your research undertaken at a high academic standard."
        },
        {
            "number": "LO3.",
            "description": "Think critically and make informed judgement."
        },
        {
            "number": "LO4.",
            "description": "Communicate what you do in the written form."
        },
        {
            "number": "LO5.",
            "description": "Achieve a comprehensive and in-depth knowledge in your field."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "20,000 words via turnitin ONLY",
            "special_indicators": [],
            "weighting": "<dd>100%</dd>",
            "due_date": "<dd><p> 29/05/2026 1:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Thesis",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>Research work may be empirical or conceptual, although you should bear in mind that the latter is often the more difficult.</p>\n<p>You should strive for a thematic development of the thesis. The objectives of the thesis and techniques to be employed should be made clear to the reader in the introduction. It may be desirable to follow with a brief review of those aspects of the literature that are directly relevant to the thesis. The arguments should then be systematically developed in a logical and coherent way. The relevance of a new chapter should be made apparent to the reader with a statement of what is to follow and its role in the thesis. It should be apparent to the reader that the thesis is progressing as directly as possible to its logical end. Assessment is based not only on the discussion and conclusions from a thesis but also on the way research is undertaken, the quality of argument and the general standard of presentation.</p>\n<p>While it is generally recognised that there are various constraints to the scale and scope of the research undertaken by postgraduate students, there are nevertheless minimum standards which must be met in the thesis construction. Emphasis is on \"minimum\", i.e. essential characteristics. Since a particular thesis will concentrate on a particular area of economics, it is not possible to prescribe the exact structure each thesis must have. However, every thesis must include, in addition to the exposition of the central issue researched:</p>\n<p>1.     An introductory chapter which includes some background about the issue or topic to be researched, a statement of the objectives of the research and why your research is important, research questions and/or hypothesis, and an outline of the contents of the remaining chapters.</p>\n<p>2.    A chapter on the relevant economic theory underpinning your issue or research topic. If you consider that no field of current economic theory is relevant, then this chapter should explain why this is so, and why under such circumstances the research required economic expertise and why it is relevant to the work of economists.</p>\n<p>3.    A chapter containing a critical review of recent economic (and any other relevant) literature in the area of research for your thesis. This chapter is likely to be a subset of the literature review of the Research Methods report, but narrower in focus, and directed to the specific issue you will be addressing in your thesis.</p>\n<p>4.    Where data analysis is an important part of the work, at least one chapter examining the data sources and any deficiencies; and also a discussion about the technique/s adopted for analysis of data.</p>\n<p>5.    A short chapter presenting results from any analysis undertaken.</p>\n<p>6.  A chapter discussing the implications, shortcomings etc of the analysis is very important. This is followed by the conclusion (<em>which is NOT a summary of everything you have done in the previous chapters</em>). The conclusion includes, if possible, policy recommendations and consider the shortcomings of your research and suggestions for on-going or further research.</p>\n<p>A good standard of English is expected in the thesis. You may wish to consult those references listed in the Central Library Subject Catalogue under the heading \"Style, Literary\". The advisor may be able to offer guidance and help in your intellectual and academic development. The writing of a thesis is ultimately your task and you must not expect your advisor to convert careless or poor prose into good English. For non-native English speakers, it is a good idea to seek assistance from friends to proof read your writing.</p>\n<p>You should aim to submit a draft of your thesis to your advisor at least two weeks before the due date to enable him/her to offer some constructive feedback. It is important to submit chapters of your draft progressively to your advisor throughout the semester so that there is ample time for advisor’s comments and advice, and you have ample time to revise your work. Submission of a large amount of new material shortly before the deadline will not give your advisor sufficient time to read carefully, and will leave you with little time to carry out the necessary corrections. Experience shows that theses completed in a last-minute rush often suffer from avoidable errors (grammatical, spelling and typographical) as well as obvious errors in argument, and accordingly, the loss of marks.</p>\n<p><strong>A template for the thesis is available on blackboard.</strong></p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p><strong>The thesis will be examined using the criteria below:</strong></p>\n<p>Referencing (5%)</p>\n<p>Clarity and quality of written expression (10%)</p>\n<p>Justification of the research topic and statement of objectives of research (15%)</p>\n<p>Data/Theoretical Analysis (10%)</p>\n<p>Research methods (10%)</p>\n<p>Use of literature and theory (20%)</p>\n<p>Presentation of results (10%)</p>\n<p>Discussion and Conclusion (20%)</p>\n<p><strong>Examination of the Thesis:</strong></p>\n<p>The Thesis will be examined by two independent examiners and their marks will be averaged to yield a final mark and grade.</p>\n<p>In order for the School of Economics to appoint suitable examiners for your thesis you will be prompted (by email) to submit an early abstract of your Thesis around the middle of the semester. At this point the abstract may be quite short, and we acknowledge that the final abstract may be different. (you will have advised the name of your advisor and title of your thesis by the end of week 2)</p>\n<p>The marking process is confidential. The names of examiners will not be divulged to students.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission of Thesis</strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>Submission after the due date <em>will </em>delay the finalisation of the grade for this course. Students wishing to graduate in the Graduation Ceremony immediately following the exam period will NOT be guaranteed that their results will be processed in time for graduation.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(28 Jul - 03 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Meeting with Coordinator</strong><br/><p>Discussion re: requirements of thesis, guidelines for the presentation of thesis, choice of supervisor, milestones due, contact details for assistance. For assistance with the various datasets available at UQ or for an introduction to Endnote, please contact Economics' Librarian Debbie Martin (d.martin@library.uq.edu.au).</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Meeting with Coordinator</strong>",
            "topic_description": "Meeting with Coordinator Discussion re: requirements of thesis, guidelines for the presentation of thesis, choice of supervisor, milestones due, contact details for assistance. For assistance with the various datasets available at UQ or for an introduction to Endnote, please contact Economics' Librarian Debbie Martin (d.martin@library.uq.edu.au).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Research and Write thesis</strong><br/><p>Conduct research, undertake analysis and write thesis.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Research and Write thesis</strong>",
            "topic_description": "Research and Write thesis Conduct research, undertake analysis and write thesis.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}