{
    "course_title": "Practicum in Guidance, Counselling and Careers II",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC7074-61391-7560",
    "full_course_code": "EDUC7074-61391-7560",
    "course_code": "EDUC7074",
    "class_code": "61391",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand the role of a guidance and counselling professional"
        },
        {
            "number": "LO2.",
            "description": "Demonstrate the specialised skills of a guidance and counselling professional including counselling, consultancy, group work, and program development and delivery"
        },
        {
            "number": "LO3.",
            "description": "Demonstrate the specialised interpersonal skills that enable effective communication and teamwork with a range of individuals within and beyond the work setting e.g., students, parents, other professionals"
        },
        {
            "number": "LO4.",
            "description": "Demonstrate ethical practice and professional conduct in guidance and counselling work"
        },
        {
            "number": "LO5.",
            "description": "Articulate a personal practice framework"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Practice Reflections",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>50% 500 words approx </dd>",
            "due_date": "<dd><p>First reflection 18/08/2025 2:00 pm</p>\n<p>All other reflections 27/10/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Each reflection is based on the SEAL framework: Situation, Effect, Action, Learning</p>\n<p><strong>Due:</strong> Practice Reflections are usually completed weekly. The first Practice Reflection is due on/before Monday of Week 4 at 2pm. The remaining reflections can be submitted anytime on/before Monday of Week 13 at 2pm.</p>\n<p>This assignment aims to develop self-reflective practice as part of training in guidance, counselling and careers. While on placement, students are required to complete a minimum of five (5) reflection tasks. Each reflection is related to a different practicum activity or experience. Students are encouraged to complete weekly reflections and can submit a maximum of six (6), however only the top five scores will be used in the final grade for the course (see also under Assessment: Other Requirements and Comments).</p>\n<p>Details and submission links are available on the course Blackboard site.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via Blackboard. Use the Guide Questions to scaffold the structure of your Practice Reflection in accord with the SEAL framework. Prepare a single word document for each Practice Reflection; a maximum of 500 words. The <strong>title of your document should be the number and name of the reflection activity </strong>e.g., <em>01. Challenges in a new workplace</em></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Project",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>50% 3000 words </dd>",
            "due_date": "<dd><p> 22/09/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L05",
            "mode": "Written",
            "category": "Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Choice of Project</strong></p>\n<p>This assignment requires students to select a project from three options: Project A (Literature Review), Project B (Develop or Design), or Project C (Deliver and Evaluate). Students taking EDUC7074 are required to select a different project for each of EDUC7073 and EDUC7074. For example, in their first practicum course a student might undertake a comprehensive review of the literature (Project A) and in their second practicum course they might design a resource or develop an intervention (Project B); OR, in their first course a student might develop an intervention (Project B) and in their second course they might deliver or assist in the delivery, and evaluate an intervention (Project C).</p>\n<p><strong>Project A: Literature Review</strong></p>\n<p>This project requires you to conduct a comprehensive literature review about a topic relevant to working with children or adolescents that interests you. Suitable topics might include, but are not limited to, a thorough exploration of the literature related to prevalence, symptoms, associated problems and interventions for exam anxiety, loneliness, eating disorders, school refusal, gender identity, mobile phone use, and cyberbullying. Refine your topic to a manageable size (i.e., not too much literature so that your review becomes too broad) e.g., eating disorders in teenage males or loneliness in primary school children in China. Your literature review should include the following sections (further sub-headings are optional):</p>\n<p>Introduction</p>\n<ul>\n<li>Detail background information including definition/s, prevalence of the issue (<em>prompts:</em> set the scene, describe the importance of this issue for school guidance and counselling)</li>\n<li>Describe any associated problems (<em>prompt:</em> is the problem more pronounced in certain populations or contexts?)</li>\n</ul>\n<p>Interventions: A Review of the Literature</p>\n<ul>\n<li>Conduct a critical review of studies that have examined the efficacy of interventions for your chosen topic (<em>prompts</em>: for each study describe what they did, analyse their methods, and evaluate what they found)</li>\n<li>You may wish to separate your review of interventions into those that were school-based, community-based, individual treatments, group therapy etc.</li>\n</ul>\n<p>Implications for School Guidance Officers/Counsellors</p>\n<ul>\n<li>Propose recommendations based on your literature review (<em>prompts</em>: are there specific approaches to use that are better than others? when and what sort of referrals are appropriate?)</li>\n<li>Provide a review of 2 or 3 useful resources that could be used by a school guidance officer/counsellor e.g., a website, handout, local service provider/organisation/charity or avenue for you to gain professional development in the area you have chosen. (<em>prompt:</em> who the resource might be helpful for? How it might be used?)</li>\n</ul>\n<p>References</p>\n<ul>\n<li>List your reference in APA 7th Edition format</li>\n</ul>\n<p>Appendices</p>\n<ul>\n<li>Include a screenshot or copy of the resources you discussed in your review</li>\n</ul>\n<p><strong>Project B: Design or Develop</strong></p>\n<p>This project requires you to design or develop an original guidance resource or intervention. The resource or intervention must be based on relevant theory and empirical literature and may be aligned to your placement, although this is not necessary. Your resource or intervention must address a specific problem or need within your school/organisation or more broadly within a local/national context. Suitable topics might include, but are not limited to, social anxiety, depression, attention difficulties, social media and low self-esteem. Your design should adhere to the following structure:</p>\n<p>Problem or Need</p>\n<ul>\n<li>Identify, define and describe the problem (<em>prompts:</em> set the scene, describe the problem, describe the population and context requiring the resource or intervention e.g., age, sex, setting etc)</li>\n</ul>\n<p>Theoretical and Empirical Justification</p>\n<p>·        Describe the theoretical basis for your resource or intervention (<em>prompt</em>: justify the approach you have taken)</p>\n<p>·        Provide an empirical argument for the design elements of your resource or intervention (<em>prompts</em>: what aspects of other interventions have been successful? where have other interventions fallen short? why is your resource or intervention needed?)</p>\n<p>Resource or Intervention</p>\n<ul>\n<li><em>Resource</em>: A series of handouts on a topic (e.g., one for child/adolescent, one for teacher, one for parent), OR a workbook, OR a Professional Development session on a topic for teachers or parents. If you have alternative ideas, please consult with the Course Coordinator for approval</li>\n<li><em>Intervention</em>: 4-6 sessions with an individual or group on a selected topic</li>\n<li>Provide clear aim/s for the resource or intervention (<em>prompt:</em> what problem is it addressing?)</li>\n<li>Provide a detailed description of the resource or intervention i.e., include all key elements (<em>prompts:</em> who is it for, how is it used; if an intervention, number of sessions, session format and duration, content of each session, how will the sessions address the needs of the participant/s)</li>\n<li>Describe how you would determine the participants’ suitability for the resource/intervention</li>\n<li>Describe how you would measure the effectiveness of resource/intervention</li>\n</ul>\n<p>Discussion</p>\n<ul>\n<li>Reflect on the challenges and limitations of your resource/intervention (<em>prompts:</em> what challenges might occur with using the resource or delivering the intervention? how might you overcome these difficulties?)</li>\n<li>Reflect on your capability as the person implementing the resource/intervention (<em>prompts</em>: skills needed, link to personal practice framework)</li>\n<li>Conclusion</li>\n</ul>\n<p>References </p>\n<ul>\n<li>List your reference in APA 7th Edition format</li>\n</ul>\n<p>Appendices </p>\n<p>Include a screenshot or copy of the resources you discussed in your design, including all original and sourced.</p>\n<p><strong>Project C: Deliver and Evaluate</strong></p>\n<p>This project requires you to report on the delivery and evaluation of an individual or group intervention. Your report should adhere to the following structure:</p>\n<p>Background</p>\n<ul>\n<li>Describe the participant/s e.g., age, sex, setting, reason for intervention, how participant/s were selected</li>\n<li>Provide clear aim/s of the intervention (<em>prompt:</em> what factor/s are you hoping to change?)</li>\n<li>Briefly describe the intervention e.g., number of sessions, how long each session was, format of session, what was covered in each session, how did the sessions address the needs of the participant/s</li>\n</ul>\n<p>Method</p>\n<ul>\n<li>Describe and justify your choice of pre-(baseline) and post-intervention assessments i.e., name and description of each assessment, reason for your choice (<em>prompt</em>: mention reliability, validity, utility)</li>\n<li>Describe other assessments used (e.g., observations, participant satisfaction, qualitative evaluation)</li>\n</ul>\n<p>Results</p>\n<ul>\n<li>Report on the efficacy of the intervention (<em>prompts</em>: compare pre- to post- measurements, report qualitative findings)</li>\n</ul>\n<p>Discussion</p>\n<ul>\n<li>Discuss your findings (<em>prompts:</em> what changes occurred, what worked well, report any unexpected outcomes)</li>\n<li>Reflect on the limitations of your intervention (<em>prompts:</em> discuss lessons learned, what would you do differently next time, recommendations)</li>\n<li>Reflect on your capability as the person delivering or co-delivering the intervention (<em>prompts</em>: skills needed, areas for development, overall effectiveness, link to personal practice framework)</li>\n<li>Conclusion</li>\n</ul>\n<p>References</p>\n<ul>\n<li>List your reference in APA 7th Edition format</li>\n</ul>\n<p>Appendices</p>\n<ul>\n<li>Include copies of questionnaires/assessments used</li>\n<li>Include a copy of participant assent and/or parent consent (where appropriate)</li>\n</ul>\n<p><strong>A marking rubric is provided on the course Blackboard site.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students must upload their project by 2pm on the due date. Submit via Turnitin.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Log of Practicum Experience",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p>Practicum 24/07/2025 - 31/10/2025</p>\n<p>Final Log Practicum Experiences - Due 2pm 31/10/2025</p></dd>",
            "learning_objectives": "L02, L03, L04",
            "mode": "Activity/ Performance",
            "category": "Notebook/ Logbook, Participation/ Student contribution, Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students are required to complete 50 hours of practicum experience while on placement. Placements are organised by the School of Education Placements Team. Students must contact the Placements Team regarding their preferences and availability. E: <a href=\"mailto:education@uq.edu.au\">education@uq.edu.au</a>.</p>\n<p>Students must familiarise themselves with the Queensland Guidance and Counselling (QGCA) Code of Ethics and the Placement Handbook prior to commencing their placement. Both documents are available on the course Blackboard site.</p>\n<p><strong>Students are not to commence Practicum experience placements prior to attending the Orientation session in O-Week.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Logs will be submitted to an ePortfolio. Submission links are available on the course Blackboard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "O-week(21 Jul - 27 Jul)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Course Orientation Session</strong><br><p>Students join an orientation session that includes all the information they need for their placement e.g., introduction to the ePortfolio, course materials, what to expect on placement. Compulsory attendance.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Course Orientation Session</strong>",
            "topic_description": "Course Orientation Session Students join an orientation session that includes all the information they need for their placement e.g., introduction to the ePortfolio, course materials, what to expect on placement. Compulsory attendance.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(28 Jul - 02 Nov)",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Practicum Experience</strong><br><p>In order to develop the skills, knowledge and experience relevant to guidance and counselling work, students undertake 50 hours of practicum experience in settings such as schools and community agencies.</p></br></p><p><strong>Learning outcomes:</strong> L01, L05</p></div></td>",
            "topic_title": "<strong>Practicum Experience</strong>",
            "topic_description": "Practicum Experience In order to develop the skills, knowledge and experience relevant to guidance and counselling work, students undertake 50 hours of practicum experience in settings such as schools and community agencies.",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(28 Jul - 02 Nov)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Weekly sessions</strong><br/><p>Weekly Zoom sessions to support students' practical placement.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Weekly sessions</strong>",
            "topic_description": "Weekly sessions Weekly Zoom sessions to support students' practical placement.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 9(28 Jul - 28 Sep)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Project</strong><br><p>Student work on a project of their choice; either (A) conducting a review of literature in a selected topic, (B) designing or developing a resource or intervention, or (C) delivering and evaluating an individual or group intervention.</p></br></p><p><strong>Learning outcomes:</strong> L01, L05</p></div></td>",
            "topic_title": "<strong>Project</strong>",
            "topic_description": "Project Student work on a project of their choice; either (A) conducting a review of literature in a selected topic, (B) designing or developing a resource or intervention, or (C) delivering and evaluating an individual or group intervention.",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 4 To Week 13(18 Aug - 02 Nov)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Practice Reflection Tasks</strong><br><p>Students undertake 5 reflections of tasks completed while on practicum. These are undertaken within the ePortfolio.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Practice Reflection Tasks</strong>",
            "topic_description": "Practice Reflection Tasks Students undertake 5 reflections of tasks completed while on practicum. These are undertaken within the ePortfolio.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Mid Sem break(29 Sep - 05 Oct)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-semester Break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-semester Break</strong>",
            "topic_description": "Mid-semester Break",
            "learning_outcomes": []
        }
    ]
}