{
    "course_title": "Teachers as Professionals",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC4703-60940-7560",
    "full_course_code": "EDUC4703-60940-7560",
    "course_code": "EDUC4703",
    "class_code": "60940",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (21/07/2025 - 21/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate knowledge and understanding of research principles, methods and ethics, legislative policies and processes, sources of professional learning and the Australian Professional Standards for Teachers and apply this knowledge through the design and implementation of a research based project relevant to professional learning needs. (APSTs 6.1, 6.2, 7.1, 7.2)"
        },
        {
            "number": "LO2.",
            "description": "Demonstrate critical analysis and synthesis of complex information and apply these skills through the design and implementation of a research based project."
        },
        {
            "number": "LO3.",
            "description": "Demonstrate skills in spoken and/or written communication through analyses that are clear, logical, convincing, concise, free of textual errors and within required word limits."
        },
        {
            "number": "LO4.",
            "description": "Work effectively and collaboratively in teams to make informed team decisions, demonstrate interpersonal, leadership and communication skills, and critically evaluate personal and peer contributions to team processes."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Task 1a - Group research proposal presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 28/07/2025 - 1/08/2025</p>\n<p>\n</p><p>Presentations will take place during the final tutorial in the second teaching week for this course.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>In your collaborative research groups, you are to deliver an 8 minute (max) oral presentation based on the proposal for the research-based project your group has developed. Your research proposal should cover all of the components set out under Assessment Task 1b and your presentation should incorporate each of these aspects. Appropriate and relevant audio-visual aids may be used during your presentation. After your presentation, you will be expected to respond to questions from your peers and tutor. You will also be provided with oral feedback on your proposal from both your tutor and peers during this time.</p>\n<p>Your group must also submit a task planner or work log (in a graph or table) for planning and progress monitoring for the entire group. The planner should detail the contributions made by each group member to the preparation and presentation of the entire assessment task – 1a and 1b – which should be equally shared (see 'Important information about group work' below).</p>\n<p><strong>Important information about group work</strong></p>\n<p>You will receive a single group mark for this task, as all group members should contribute equally to the design and delivery of the assessment task. However, exceptions can be made in the event of one or more group members engaging in ‘social loafing’ (also known as ‘free-riding’):</p>\n<p>Free riding is a form of social loafing seen in a group when one or more members slacks off and ‘rides’ on the extra efforts of their co-workers (Walker &amp; Angelo, 1998).</p>\n<p>If your small group is experiencing dysfunction, including ‘social loafing’ by one or more members, it is your responsibility to bring this promptly to the attention of your tutor / course coordinator, who will then support the group to resolve the problems in a respectful way. If no resolution can be found, the tutor / course coordinator can take steps including removal of the non-contributing student/s from the group and require student/s to complete the task either individually or in another small group with other ‘social loafers’.</p>\n<p><strong>A grade of pass/fail will be awarded for this task. The implications of this pass/fail task should be taken extremely seriously: should your group fail this piece of assessment, you will fail the course, regardless of the grades you are awarded for your other assessment tasks. </strong></p>\n<p><strong>(APST: 6.1, 6.2, 7.1, 7.2)</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>Late submission of assessment without approved extension request via myUQ system will result in a failing grade.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Task 1b - Group research proposal",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>40% 2000 words + reference list + appendices </dd>",
            "due_date": "<dd><p> 4/08/2025 2:00 pm</p>\n<p>\n</p><p>The research proposal is due by 2pm on Monday of the third teaching week for this course. Sunday submission is recommended as Monday is the first day of placement.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>In your collaborative research groups, you are to develop a proposal for a small-scale research project relevant to your professional learning needs. Prior to your professional experience placement you should consult closely with your tutor to design an appropriate project to ensure that it addresses an issue of relevance within schools. This project will be implemented during your final professional experience placement. It should be closely linked to your everyday work as a teacher with a broad connection to improving students’ educational outcomes in some small way.</p>\n<p>To choose a topic, your group should draw on the Australian Professional Standards for Teachers and identify a particular professional learning need to improve your practice. You might relate this professional learning need to a learning area, or a topic that you are really interested in. As you may not know your professional experience placement until just prior to commencement, remember to ensure that your research based project, as one source of professional learning, could be conducted in any school type.</p>\n<p><strong>Your proposal should include:</strong></p>\n<ul>\n<li><strong>Introduction.</strong> Outline the background to your problem. Include a <strong>clear</strong> statement of the issue to be investigated, and let the reader know why this issue is important and how it connects with a particular professional learning need your group has identified from the Australian Professional Standards for Teachers to improve your practice.</li>\n<li><strong>Review of relevant literature</strong> on research findings in the area of your proposed project. Demonstrate your group’s analysis of the research others have done: what were the findings, when and where was the research conducted, who were the research participants, what were the research methods and data collection tools? Analyse and synthesise the literature in a way that provides an integrated argument in relation to the topic. Conclude by establishing the need for the research your group plans to conduct by explaining how your project extends from or fills small gaps in the current literature.</li>\n<li>The<strong> research question/s</strong> to be addressed. State them clearly as questions. You will have a main research question and possibly some sub-questions (no more than 2) that will help you answer your main research question.</li>\n<li>The <strong>research method and analysis</strong>. Identify your proposed research design (case study, action research, experimental research, ethnography, other?). What can you tell the reader about the context of your study? Who/what do you propose will be the object(s) of or the participants in your study? How will you select your research participants, if applicable? What instruments will you use to collect your data? <strong>You must include your data collection tool/s in an appendix</strong>. What steps will you take to collect and record your data? What steps will you take to analyse your data? That is, how will you collate your data and make sense of your findings? <strong>Throughout this section you must justify your research method choices with academic references and demonstrate understanding of principles of ethical conduct of research as well as any relevant legislative policies and processes</strong>. Ask yourself: With the information provided, could your study be replicated?</li>\n<li><strong>Conclude </strong>by articulating how you believe the research will help fill a professional learning need and prepare you as beginning teachers.</li>\n<li><strong>References</strong>. Use APA style referencing both within the proposal and the reference list. The reference list should contain only references directly mentioned in the proposal rather than a bibliography of other relevant but non-cited references. It is expected that <strong>at least 15 </strong>relevant academic references (from 2010 onwards) are included. Your reference list <strong>is not </strong>included in the total word count for the assignment.</li>\n<li><strong>Appendix</strong>. You need to include your data collection tool/s (for example, survey, interview questions, observation template). Your small-scale research project <strong>should only have one or two </strong>data collection tools. Do not include the contents of your appendix in the total word count for the assignment.</li>\n</ul>\n<p>Your group must also submit a task planner or work log (in a graph or table) for planning and progress monitoring for the entire group. The planner should detail the contributions made by each group member to the preparation and presentation of the entire assessment task – 1a and 1b – which should be equally shared (see 'Important information about group work' below).</p>\n<p><strong>Important information about group work</strong></p>\n<p>You will receive a single group mark for this task, as all group members should contribute equally to the design and delivery of the assessment task. However, exceptions can be made in the event of one or more group members engaging in ‘social loafing’ (also known as ‘free-riding’):</p>\n<p>Free riding is a form of social loafing seen in a group when one or more members slacks off and ‘rides’ on the extra efforts of their co-workers (Walker &amp; Angelo, 1998).</p>\n<p>If your small group is experiencing dysfunction, including ‘social loafing’ by one or more members, it is your responsibility to bring this promptly to the attention of your tutor / course coordinator, who will then support the group to resolve the problems in a respectful way. If no resolution can be found, the tutor / course coordinator can take steps including:</p>\n<ul>\n<li>Removal of the non-contributing student/s from the group and require student/s to complete the task either individually or in another small group with other ‘social loafers’</li>\n<li>Deducting one grade from the overall group score for non-contributing student/s, as evidenced in the task planner or work log (see criteria sheet).</li>\n</ul>\n<p><strong>One member of the collaborative research group will submit the research proposal on behalf of the group. The proposal will be submitted electronically as a word document via the Assignment link on Blackboard in the Assessment folder.</strong></p>\n<p>If you use <strong>AI and/or machine translation (MT)</strong> technologies in any way in your assessment task, you must provide specific details about how it was used. You must provide a response to this task that significantly advances or otherwise is predominantly generated by you and not by AI and/or MT. A failure to reference generative AI or MT use may constitute academic misconduct under the Student Code of Conduct. Guidelines about conventions for appropriate referencing and acknowledgement, including an example coversheet to provide details of use, are available here: <a href=\"https://guides.library.uq.edu.au/referencing/ai-tools-assignments#s-lg-box-22362889\">Overview - AI tools for assignments - Library Guides at University of Queensland Library</a></p>\n<p><strong>(APST: 6.1, 6.2, 7.1, 7.2)</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>One member of the collaborative research group should submit the research proposal on behalf of the group. The proposal should be submitted electronically as a word document via the Assignment link on Blackboard in the Assessment folder.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Task 2 - Group research report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>60% 3500 words + reference list + appendices </dd>",
            "due_date": "<dd><p> 24/10/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You are to apply your knowledge and skills by implementing and reporting on the conduct of your group’s small-scale research based project relevant to your professional learning needs based on the proposal submitted and presented in Assessment Task 1a and 1b. While it would normally be the case that your research reflects your proposal, changed circumstances may necessitate an alteration to the proposed project. Remember that your project should be closely linked to your everyday work as a teacher with a broad connection to improving students' educational outcomes in some small way. Your research, as one source of professional learning, should provide you with valuable information for responding to a particular professional learning need you identified from the Australian Professional Standards for Teachers to improve your practice as a beginning teacher.</p>\n<p>You are encouraged to draw on aspects of your research proposal in writing up your research report.</p>\n<p><strong>Your report should include:</strong></p>\n<ul>\n<li><strong>Introduction. </strong>Outline the background to your problem. Include a <strong>clear</strong> statement of the issue investigated, and let the reader know why this issue is important and how it connects with a particular professional learning need your group have identified from the Australian Professional Standards for Teachers to improve your practice.</li>\n<li><strong>Review of relevant literature</strong> on research findings in the area of your project. Demonstrate your group’s analysis of the research others have conducted: what were the findings, when and where was the research conducted, who were the research participants, what were the research methods and data collection tools? Analyse and synthesise the literature in a way that provides an integrated argument in relation to the topic. Conclude by establishing the need for the research you conducted by explaining how your project extends from or fills small gaps in the current literature.</li>\n<li>The <strong>research question/s</strong> addressed. State them clearly as questions. You will have a main research question and possibly some sub-questions (no more than 2) that will help you answer your main research question.</li>\n<li>The <strong>research method</strong>. Identify your group’s research design (case study, action research, experimental research, ethnography, other?). What can you tell the reader about the context of your study? Who/what were the object(s) of or the participants in your study? How did you select your research participants, if applicable? What instruments did you use to collect your data? What steps did you take to collect and record your data? <strong>You must include your data collection tool/s in an appendix</strong>. What steps did you take to analyse your data? That is, how did you collate your data and make sense of your findings? <strong>Throughout this section you must justify your research method choices with academic references and demonstrate understanding of principles of ethical conduct of research as well as any relevant legislative policies and processes. </strong>Ask yourself: With the information provided, could your study be replicated?</li>\n<li><strong>Analysis of data and discussion of findings and implications.</strong> Make sense of the data your group has collected. Discuss common themes or patterns in your qualitative data, or share basic calculations in relation to aspects of your quantitative data that help you to answer your research question. Include data excerpts/examples in your report. Ensure that within your analysis section that you compare and contrast your findings to those of some of the literature you reviewed, or other (additional) literature, and that you include references to this literature. Do your research findings support similar/related research in the area, or does your data shed new light on an issue? Conclude with a discussion of implications of the research for teachers (that is, what do you think other teachers would want to know about your research findings and the implications for their practice?).</li>\n<li><strong>Conclusion</strong>, including a statement about the limitations of the study and recommendations for further research. Articulate how the research has helped to fill a professional learning need and will assist you to improve your practice as beginning teachers.</li>\n<li><strong>References.</strong> Use <strong>APA style</strong> referencing both within the report and the reference list. The reference list should contain only references directly mentioned in the report rather than a bibliography of other relevant but non-cited references. It is expected that <strong>at least 20 </strong>relevant academic references (from 2010 onwards) are included. Your reference list <strong>is not</strong> included in the total word count for the assignment.</li>\n<li><strong>Appendix.</strong> Include your data collection tool/s. Do <strong>not</strong> include the contents of your appendix in the total word count for the assignment.</li>\n<li>Your<strong> raw data</strong> (the data you have collected) must be submitted to your tutor. This should be submitted separately to the research report, in hard copy or as an electronic file.</li>\n</ul>\n<p>Your group must also submit a task planner or work log (in a graph or table) for planning and progress monitoring for the entire group. The planner should detail the contributions made by each group member to the preparation and presentation of the assessment task, which should be equally shared (see 'Important information about group work' below).</p>\n<p><strong>Important information about group work</strong></p>\n<p>You will receive a single group mark for this task, as all group members should contribute equally to the design and delivery of the assessment task. However, exceptions can be made in the event of one or more group members engaging in ‘social loafing’ (also known as ‘free-riding’):</p>\n<p>Free riding is a form of social loafing seen in a group when one or more members slacks off and ‘rides’ on the extra efforts of their co-workers (Walker &amp; Angelo, 1998).</p>\n<p>If your small group is experiencing dysfunction, including ‘social loafing’ by one or more members, it is your responsibility to bring this promptly to the attention of your tutor / course coordinator, who will then support the group to resolve the problems in a respectful way. If no resolution can be found, the tutor / course coordinator can take steps including:</p>\n<ul>\n<li>Removal of the non-contributing student/s from the group and require student/s to complete the task either individually or in another small group with other ‘social loafers’</li>\n<li>Deducting one grade from the overall group score for non-contributing student/s, as evidenced in the task planner or work log (see criteria sheet).</li>\n</ul>\n<p><strong>One member of the collaborative research group will submit the research report on behalf of the group. The report will be submitted electronically as a word document via the Assignment link on Blackboard in the Assessment folder.</strong></p>\n<p>If you use <strong>AI and/or machine translation (MT)</strong> technologies in any way in your assessment task, you must provide specific details about how it was used. You must provide a response to this task that significantly advances or otherwise is predominantly generated by you and not by AI and/or MT. A failure to reference generative AI or MT use may constitute academic misconduct under the Student Code of Conduct. Guidelines about conventions for appropriate referencing and acknowledgement, including an example coversheet to provide details of use, are available here: <a href=\"https://guides.library.uq.edu.au/referencing/ai-tools-assignments#s-lg-box-22362889\">Overview - AI tools for assignments - Library Guides at University of Queensland Library</a></p>\n<p><strong>(APST: 6.1, 6.2, 7.1, 7.2)</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>One member of the collaborative research group should submit the research report on behalf of the group. The report should be submitted electronically as a word document via the Assignment link on Blackboard in the Assessment folder.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(21 Jul - 27 Jul)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Teachers as researchers</strong><br><p>APST - 6.1, 6.2, 7.1, 7.2</p>\n<p>Tuesday 16th July, 2024</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Teachers as researchers</strong>",
            "topic_description": "Teachers as researchers APST - 6.1, 6.2, 7.1, 7.2 Tuesday 16th July, 2024",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 1(21 Jul - 27 Jul)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Formulating questions and reviewing the literature</strong><br><p>APST - 6.1, 6.2</p>\n<p>Thursday 18th July, 2024</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Formulating questions and reviewing the literature</strong>",
            "topic_description": "Formulating questions and reviewing the literature APST - 6.1, 6.2 Thursday 18th July, 2024",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 1(21 Jul - 27 Jul)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Research methods and techniques</strong><br><p>APST - 6.2, 7.1, 7.2</p>\n<p>Friday 19th July, 2024</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Research methods and techniques</strong>",
            "topic_description": "Research methods and techniques APST - 6.2, 7.1, 7.2 Friday 19th July, 2024",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(28 Jul - 03 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Research design and ethics</strong><br/><p>APST - 6.2, 7.1, 7.2</p>\n<p>Tuesday 23rd July, 2024</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Research design and ethics</strong>",
            "topic_description": "Research design and ethics APST - 6.2, 7.1, 7.2 Tuesday 23rd July, 2024",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(28 Jul - 03 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Writing up: The research proposal</strong><br/><p>APST - 6.1, 6.2, 7.1, 7.2</p>\n<p>Thursday 25th July, 2024</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Writing up: The research proposal</strong>",
            "topic_description": "Writing up: The research proposal APST - 6.1, 6.2, 7.1, 7.2 Thursday 25th July, 2024",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(28 Jul - 03 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Research proposal presentations</strong><br/><p>APST - 6.1, 6.2, 7.1, 7.2</p>\n<p>Friday 26th July, 2024</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Research proposal presentations</strong>",
            "topic_description": "Research proposal presentations APST - 6.1, 6.2, 7.1, 7.2 Friday 26th July, 2024",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 3 To Week 9(04 Aug - 21 Sep)",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Professional experience placement</strong><br><p>No classes scheduled while undertaking professional experience (placement) in an accompanying course.</p></br></p></div></td>",
            "topic_title": "<strong>Professional experience placement</strong>",
            "topic_description": "Professional experience placement No classes scheduled while undertaking professional experience (placement) in an accompanying course.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(22 Sep - 28 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Analysing your data</strong><br/><p>APST - 6.1, 6.2, 7.1, 7.2</p>\n<p>Friday 20th September, 2024</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Analysing your data</strong>",
            "topic_description": "Analysing your data APST - 6.1, 6.2, 7.1, 7.2 Friday 20th September, 2024",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Mid Sem break(29 Sep - 05 Oct)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-semester break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-semester break</strong>",
            "topic_description": "Mid-semester break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(06 Oct - 12 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Writing up: The research report</strong><br/><p>APST - 6.1, 6.2, 7.1, 7.2</p>\n<p>Friday 4th October, 2024</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Writing up: The research report</strong>",
            "topic_description": "Writing up: The research report APST - 6.1, 6.2, 7.1, 7.2 Friday 4th October, 2024",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}