{
    "course_title": "Building Inclusive Primary Classrooms",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC3760-60581-7560",
    "full_course_code": "EDUC3760-60581-7560",
    "course_code": "EDUC3760",
    "class_code": "60581",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate an awareness of recent developments in research into effectively teaching in inclusive primary classroom environments and the differentiation of teaching in ways that are responsive to the learning strengths and needs of students across the full range of abilities and that take account of the impact on learning of diverse backgrounds (e.g. linguistic, Indigenous, cultural, religious and socio-economic)."
        },
        {
            "number": "LO2.",
            "description": "Critically reflect on legislative requirements, system policies and processes, positive behaviour supports and teaching strategies that promote student wellbeing and safety, and support participation and learning of all students with a focus on those with disabilities."
        },
        {
            "number": "LO3.",
            "description": "Plan challenging learning goals and effectively organise classroom activities for all students using age-appropriate curriculum and evidence-based approaches to differentiated teaching."
        },
        {
            "number": "LO4.",
            "description": "Explain approaches for interpreting student data and strategies for working effectively, sensitively and confidentially with others, including parents/carers and draw on external professionals and community representatives expertise to action a personalised learning plan and modify teaching practices."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate clear, fluent, and coherent communication skills consistent with personal, professional and academic conventions."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Assessment Task 1: Annotated Bibliography",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>30% 2,000 words (± 10% leeway) </dd>",
            "due_date": "<dd><p> 15/08/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L03, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Please ensure you carefully read the task description and marking criteria on the course Blackboard.</strong></p>\n<p>For this task, you will undertake a study on some of the available literature to investigate <strong>a learning support need</strong>, selected from the four options as specified by the Nationally Consistent Collection of Data categories (Physical, Sensory, Cognitive or Social/Emotional).</p>\n<p>You are to prepare an annotated bibliography of <strong>five</strong> key references and draw implications for teaching. In selecting your references, you are to include:</p>\n<ul>\n<li>One relevant chapter from the set textbook for this course (Ashman &amp; Poed, 2025, 7th ed.)</li>\n<li>One chapter from another book of your choice (within the last five years)</li>\n<li>One journal article from the reference list of one of the above chapters (within the last ten years)</li>\n<li>Two other relevant research articles published within the last five years.</li>\n</ul>\n<p><strong>Required components: </strong></p>\n<p>In approximately 2,000 words, include:</p>\n<ol>\n<li>An introduction specifying your selected learning support need and your specialisation teaching area</li>\n<li>For each of the five references, include the following contents:</li>\n</ol>\n<ul>\n<li>Full bibliographic citation in APA 7th format</li>\n<li>Specify the content or scope of the reference and the intended audience</li>\n<li>Summarise the main points</li>\n<li>Identify any conclusions or implications made by the author/s</li>\n<li>Discuss the relevance to your primary specialisation (e.g., Mathematics; English; Science; HASS), connections to the most relevant APSTs, strengths and limitations of the work, and other applicable issues.</li>\n</ul>\n<p>3.Conclude with implications and recommendations of adjustments for the chosen need from your analysis of the five references as a set for your teaching and accommodation. </p>\n<p><strong>Formatting</strong></p>\n<p>The assignment is formatted in a Word document (2cm margins, 11-point font, 1.5 line spacing). Include <strong>a cover page</strong> that states (1) <strong>the word count</strong> (excluding the bibliographic citations of sources) and (2) <strong>if you have or not used any form of AI</strong>. You must properly acknowledge any use of AI in detail (see below: Use of AI).   </p>\n<p><strong>Use of inclusive language</strong></p>\n<p>Strict adherence to the UQ Guide to Using Inclusive Language is required. See detail on <a href=\"https://staff.uq.edu.au/files/242/using-inclusive-language-guide.pdf\">https://staff.uq.edu.au/files/242/using-inclusive-language-guide.pdf</a></p>\n<p><strong>Use of APA conventions (7th ed.)</strong></p>\n<p>A guide for APA referencing is available on the following UQ library website: <a href=\"https://guides.library.uq.edu.au/referencing/apa7\">https://guides.library.uq.edu.au/referencing/apa7</a></p>\n<p><strong>Use of AI</strong></p>\n<p>If you use any form of AI or machine learning, you MUST properly acknowledge it by following the APA conventions per UQ policy. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The assignment is to be submitted as a Word document<strong> </strong>and uploaded to a <em>Turnitin</em> link on the eLearn site. Aim to submit at least a day prior to the due date so you can check the originality report and revise your work if necessary. The percentage value is not always indicative of incorrect citation. Check the match and re-edit or revise where needed. You are allowed to have unlimited attempts of submission until the due day and time. Only the last attempt will be marked. Allow yourself plenty of time to submit your final version by the due date and time.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Assessment Task 2: Adjusted Lesson Plan Development",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>30% 2,000 words (4 pages max.) </dd>",
            "due_date": "<dd><p> 8/10/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L03, L04, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Product/ Design",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Please ensure you carefully read the task description and marking criteria on the course Blackboard.</strong></p>\n<p>In this task, you will <strong>plan a 40-minute lesson with a major learning activity</strong> to meet the needs of a range of students such as those with disability, from diverse linguistic, cultural, religious, and socio-economic backgrounds, Indigenous learners, and with a range of abilities.</p>\n<p>The lesson plan and activity must be applicable to a year level of your choice based on the Australian Curriculum and within your area of specialisation (e.g., Mathematics/Numeracy; English/Literacy; Science; Humanities and Social Sciences).</p>\n<p>Using the principles of Universal Design for Learning (UDL), you will plan <strong>40-minute lesson including teaching strategies </strong>that supports student participation, as well as strategies for <strong>assessing</strong> what students know or are able to do as a result of the lesson. In addition to the general planning for all, you will plan adjustments based on the chosen learning support need as you investigated for Task 1, indicating appropriate adjustments for teaching and assessing students with that need.</p>\n<p>Include:</p>\n<ul>\n<li><strong>A brief overview</strong> (about half A4 page) explaining the context for the lesson such as: teaching area, year level, topic, and the chosen learning support need you have addressed and a discussion of relevant APST standards. This is to provide background for the lesson.</li>\n<li><strong>A lesson plan</strong>, in a format of your choice (in a table template, maximum two and half A4 pages). First establish learning intention or firm goal based on a content description that provides achievable challenges for students of varying abilities and characteristics. This table format should include the lesson topic, positioned phrase of the lesson, learning intention/firm goal (and the content description), sequences of the activity, resources, “differentiation for all” and “adjustments for the focused need”, with a clear indication of the relevant UDL features applied (checkpoint and descriptor, e.g., 3.1 Connect prior knowledge to new knowledge). (All resources should include enabling and extending prompts[1].)</li>\n<li><strong>Explanation and justifications of adjustments</strong> designed to meet the learning need you have investigated based on evidence from academic and/or research literature, and a brief explicit linkage to the legislative requirements. (maximum one A4 page)</li>\n<li><strong>References</strong> (This section is not counted in the four pages requirement)</li>\n<li><strong>Acknowledgement of use (or not) of AI</strong>.</li>\n</ul>\n<p>[1] Enabling and extending prompts represent a technique developed to support learners across a range of abilities. See: Sullivan, P., Mousley, J., &amp; Zevenbergen, R. (2006). Teacher actions to maximize mathematics learning opportunities in heterogeneous classrooms. <em>International Journal of Science and Mathematics Education, 4</em>, 117-143.</p>\n<p>The assignment is formatted in a Word document or PDF (2cm margins, 11-point font, 1.5 line spacing). The table of the lesson plan can be formatted in minimum line spacing. </p>\n<p><strong>Use of APA conventions (7th ed.)</strong></p>\n<p>A guide for APA referencing is available on the following UQ library website: <a href=\"https://guides.library.uq.edu.au/referencing/apa7\">https://guides.library.uq.edu.au/referencing/apa7</a></p>\n<p><strong>Use of Inclusive language </strong></p>\n<p>Strict adherence to the UQ Guide to Using Inclusive Language is required. See detail on <a href=\"https://staff.uq.edu.au/files/242/using-inclusive-language-guide.pdf\">https://staff.uq.edu.au/files/242/using-inclusive-language-guide.pdf</a></p>\n<p><strong>Use of AI</strong></p>\n<p>If you use any form of AI or machine learning, you MUST properly acknowledge it by following the APA conventions per UQ policy.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The assignment is to be submitted to a <em>Turnitin</em> link on the eLearn site. Aim to submit at least a day prior to the due date so you can check the originality report and revise your referencing if necessary. The percentage value is not always indicative of incorrect citation. Check the similarities and re-edit or revise them where necessary. You are allowed to have unlimited attempts until the due date and time. Only the last submission will be marked. Allow yourself plenty of time to submit your final copy by the due date and time. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Assessment Task 3: Case Study Report: Response to Scenario",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>40% 3,000 words (6 pages max.) </dd>",
            "due_date": "<dd><p> 31/10/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Please ensure you carefully read the task description and marking criteria on the course Blackboard.</strong></p>\n<p>This is a culminating task where you will build on your understandings of building inclusive classrooms by documenting preparations for a meeting with parents.</p>\n<p><strong>Scenario:</strong></p>\n<p><strong>The parents of a student in your year 2 class have asked to meet with you to discuss how you will accommodate their child’s learning needs as specified in the Personalised Learning Plan (PLP) (or Individual Education Plan, IEP)*. Please see the PLP on the course eLearn site.  </strong></p>\n<p>In this task, you will document your preparation for the meeting, including the following:</p>\n<p><strong>Background</strong></p>\n<ol>\n<li>A brief discussion of the relevant legislation and policy documents. (Three levels of legislation including choosing a jurisdiction where you plan to teach). Legislative and academic references should be included. </li>\n<li>An indication of the assessment data you would study prior to the meeting to provide background on the student’s progress. Acknowledge the sources where appropriate. </li>\n<li>An overview of your study of the PLP provided, including a plan for the teaching and assessment adjustments and behaviour support you would make in your program and to the classroom environment (as appropriate) to ensure effective learning and support inclusive student engagement in the classroom.<strong> </strong>Use evidence from literature to support your justifications on adjustments made. </li>\n<li>An overview of your investigation of applicable external professionals and community representatives including professional support networks, such as disability associations, and other community groups for extending your personal professional knowledge and practice. (In a table including the title, URL, key features, utility and how to use)</li>\n</ol>\n<p><strong>A plan for the meeting </strong></p>\n<p>5. A plan for the meeting including: </p>\n<ul>\n<li>Location, timing, seating arrangement, refreshments etc.</li>\n<li>Introductions – opportunity for parents to indicate what they wish to gain from the meeting</li>\n<li>How you will indicate to parents that you seek their input and advice and how you intend to collaborate with them strategically through the year</li>\n<li>Explanation of learning adjustments applicable to subject areas (including your specialisation) in response to the student’s PLP</li>\n<li>Explanation of reasonable adjustments planned for assessment</li>\n<li>Explanation of your plan for the student’s wellbeing and safety, including positive behaviour support processes (practical approaches to managing challenging behaviours).</li>\n</ul>\n<p>6. Follow up</p>\n<ul>\n<li>Keep a record of the conversation</li>\n<li>Further meetings</li>\n<li>References and acknowledge of use or not use of AI (This section is not counted in the word count)  </li>\n</ul>\n<p><em>* Individual Learning Plan (IEP) is a generic term used internationally. Different school systems may use other terms. Education Queensland uses the term of Personalised Learning Plan (PLP). Each year, a new PLP would be generated for students with additional educational needs using the current model required by Education Queensland.  </em></p>\n<p><strong>Use headings to guide the reader. </strong> In Sections 1-3, use formatting: 2 cm margins, 11-point font, 1.5 line spacing. Organise Sections 4-6 in table format and use formatting that suits the table format.  </p>\n<p><strong>Use of APA conventions (7th ed.)</strong></p>\n<p>A guide for APA referencing is available on the following UQ library website: <a href=\"https://guides.library.uq.edu.au/referencing/apa7\">https://guides.library.uq.edu.au/referencing/apa7</a></p>\n<p><strong>Use of inclusive language </strong></p>\n<p>Strict adherence to the UQ Guide to Using Inclusive Language is required. See detail on <a href=\"https://staff.uq.edu.au/files/242/using-inclusive-language-guide.pdf\">https://staff.uq.edu.au/files/242/using-inclusive-language-guide.pdf</a></p>\n<p><strong>Use of AI</strong></p>\n<p>If you use any form of AI or machine learning, you MUST properly acknowledge it by following the APA conventions per UQ policy.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The assignment is to be submitted to <em>Turnitin</em> link on the eLearn site. Aim to submit at least a day prior to the due date so you can check the originality report and revise your referencing if necessary. The percentage value is not always indicative of incorrect citation. Check the similarities and re-edit or revise them where necessary. You are allowed to have unlimited attempts until the due date and time. Only the last submission will be marked. Allow yourself plenty of time to submit your final copy by the due date and time. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(28 Jul - 03 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture and Tutorial  1 - Module 1: Building an evidence base</strong><br/><p>Course overview and embracing inclusion and challenges (APST 1.1, 1.2, 1.3, 1.4, 1.6, 3.7, 4.1, 4.2)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Lecture and Tutorial  1 - Module 1: Building an evidence base</strong>",
            "topic_description": "Lecture and Tutorial  1 - Module 1: Building an evidence base Course overview and embracing inclusion and challenges (APST 1.1, 1.2, 1.3, 1.4, 1.6, 3.7, 4.1, 4.2)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 2(04 Aug - 10 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture and Tutorial  2 - Module 2: Understanding the legislative context and positive behaviour support </strong><br/><p>(APST 1.2, 1.3, 1.4, 1.5, 1.6, 2.1, 2.2, 2.3, 2.4, 3.1, 3.2, 3.3, 3.4, 3.5, 3.6, 3.7, 4.1, 4.2, 4.3, 5.1, 7.2)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Lecture and Tutorial  2 - Module 2: Understanding the legislative context and positive behaviour support </strong>",
            "topic_description": "Lecture and Tutorial  2 - Module 2: Understanding the legislative context and positive behaviour support (APST 1.2, 1.3, 1.4, 1.5, 1.6, 2.1, 2.2, 2.3, 2.4, 3.1, 3.2, 3.3, 3.4, 3.5, 3.6, 3.7, 4.1, 4.2, 4.3, 5.1, 7.2)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 3(11 Aug - 17 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture and Tutorial  3 - Module 3(1): Building a teaching program</strong><br/><p>Curriculum adjustments through differentiated instruction and UDL and inclusive teaching approaches (APST 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 2.1, 2.2, 2.3, 3.1, 3.2, 3.3, 3.4, 4.1, 4.2, 5.1)</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Lecture and Tutorial  3 - Module 3(1): Building a teaching program</strong>",
            "topic_description": "Lecture and Tutorial  3 - Module 3(1): Building a teaching program Curriculum adjustments through differentiated instruction and UDL and inclusive teaching approaches (APST 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 2.1, 2.2, 2.3, 3.1, 3.2, 3.3, 3.4, 4.1, 4.2, 5.1)",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 4 To Week 7(18 Aug - 14 Sep)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Break for Professional Experience </strong><br/></p></div></td>",
            "topic_title": "<strong>Break for Professional Experience </strong>",
            "topic_description": "Break for Professional Experience",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture and Tutorial  4 - Module 3(2): Building a teaching program</strong><br/><p>Supporting personal and social capabilities and development (and students with ASD and ADHD) (APST 1.1, 1.2, 1.5, 1.6, 2.1, 2.2, 3.1, 3.2, 3.3, 3.4, 3.5, 4.1, 4.2, 4.3)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Lecture and Tutorial  4 - Module 3(2): Building a teaching program</strong>",
            "topic_description": "Lecture and Tutorial  4 - Module 3(2): Building a teaching program Supporting personal and social capabilities and development (and students with ASD and ADHD) (APST 1.1, 1.2, 1.5, 1.6, 2.1, 2.2, 3.1, 3.2, 3.3, 3.4, 3.5, 4.1, 4.2, 4.3)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture and Tutorial  5 - Module 3(3): Building a teaching program </strong><br/><p>Technologies for inclusion and supporting outstanding learners and students with intellectual disabilities (APST 1.2, 1.3, 1.5, 1.6, 2.1, 2.2, 2.3, 2.5, 2.6, 3.1, 3.2, 3.3, 3.4, 5.1)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Lecture and Tutorial  5 - Module 3(3): Building a teaching program </strong>",
            "topic_description": "Lecture and Tutorial  5 - Module 3(3): Building a teaching program Technologies for inclusion and supporting outstanding learners and students with intellectual disabilities (APST 1.2, 1.3, 1.5, 1.6, 2.1, 2.2, 2.3, 2.5, 2.6, 3.1, 3.2, 3.3, 3.4, 5.1)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Mid Sem break(29 Sep - 05 Oct)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-Semester Break </strong><br/><p>No Class</p></p></div></td>",
            "topic_title": "<strong>Mid-Semester Break </strong>",
            "topic_description": "Mid-Semester Break No Class",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(06 Oct - 12 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture and Tutorial  6 - Module 3(4): Building a teaching program </strong><br/><p>Supporting diverse needs of literacy (APST 1.3, 1.4, 1.5, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 3.2, 3.3, 3.4, 3.5, 4.1, 5.1, 5.2, 5.4, 5.5)</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Lecture and Tutorial  6 - Module 3(4): Building a teaching program </strong>",
            "topic_description": "Lecture and Tutorial  6 - Module 3(4): Building a teaching program Supporting diverse needs of literacy (APST 1.3, 1.4, 1.5, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 3.2, 3.3, 3.4, 3.5, 4.1, 5.1, 5.2, 5.4, 5.5)",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 11(13 Oct - 19 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture and Tutorial 7 - Module 3(5): Building a teaching program</strong><br/><p>Supporting diverse needs of numeracy and assignment support for Assessment Task 3 (APST 1.3, 1.4, 1.5, 2.1, 2.2, 2.3, 2.5, 2.6, 3.2, 3.3, 3.4, 3.5, 4.1, 5.1, 5.2, 5.4, 5.5)</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Lecture and Tutorial 7 - Module 3(5): Building a teaching program</strong>",
            "topic_description": "Lecture and Tutorial 7 - Module 3(5): Building a teaching program Supporting diverse needs of numeracy and assignment support for Assessment Task 3 (APST 1.3, 1.4, 1.5, 2.1, 2.2, 2.3, 2.5, 2.6, 3.2, 3.3, 3.4, 3.5, 4.1, 5.1, 5.2, 5.4, 5.5)",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 12(20 Oct - 26 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture and Tutorial 8 - Module 4: Building a community of practice and class review </strong><br/><p>Working with parents/carers, specialist teachers and other professionals; using student data; community resources; class review (APST 3.7, 4.3, 5.4, 5.5, 7.3, 7.4)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Lecture and Tutorial 8 - Module 4: Building a community of practice and class review </strong>",
            "topic_description": "Lecture and Tutorial 8 - Module 4: Building a community of practice and class review Working with parents/carers, specialist teachers and other professionals; using student data; community resources; class review (APST 3.7, 4.3, 5.4, 5.5, 7.3, 7.4)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13(27 Oct - 02 Nov)",
            "activity_type": "Consultation",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Review and assistance with Assessment Task 3 </strong><br/><p>This week is dedicated to you working on Task 3. Assignment support will be available. (APST: 1.3; 1.4; 2.4)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Review and assistance with Assessment Task 3 </strong>",
            "topic_description": "Review and assistance with Assessment Task 3 This week is dedicated to you working on Task 3. Assignment support will be available. (APST: 1.3; 1.4; 2.4)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}