{
    "course_title": "Building Inclusive Secondary Classrooms",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC7606-61313-7560",
    "full_course_code": "EDUC7606-61313-7560",
    "course_code": "EDUC7606",
    "class_code": "61313",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate an awareness of recent developments in research into effective teaching in inclusive classroom environments and the differentiation of teaching in ways that are responsive to the learning strengths and needs of students across the full range of abilities and that take account of the impact on learning of diverse backgrounds (e.g. linguistic, Indigenous, cultural, religious and socio-economic)."
        },
        {
            "number": "LO2.",
            "description": "Reflect on legislative requirements, system policies and processes, positive behaviour supports, and teaching strategies that promote student wellbeing and safety, and support participation and learning of all students with a focus on those with disabilities."
        },
        {
            "number": "LO3.",
            "description": "Plan challenging learning goals and effectively organise classroom activities for students of diverse backgrounds and across the full range of abilities using age-appropriate curriculum and approaches to differentiated teaching strategies."
        },
        {
            "number": "LO4.",
            "description": "Explain approaches for interpreting student data and strategies for working appropriately with others, including parents/carers, external professionals and community groups to action a personal learning plan and modify teaching practices."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate clear, fluent, and coherent communication skills consistent with personal, professional and academic conventions."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Task 1 - Learning need in a discipline area",
            "special_indicators": [],
            "weighting": "<dd>30% Approx. 2000 words ~ 4 pages </dd>",
            "due_date": "<dd><p> 29/08/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>For the literature review, you will undertake a review of the available literature to investigate a learning need with respect to your discipline area, where possible, selected from <strong>one</strong> of the following options:</p>\n<ol>\n<li><strong>Language – e.g., dyslexia, low literacy level, developmental language disorder</strong></li>\n<li><strong>Social / emotional – e.g., Autism Spectrum Disorder, mental health impacts</strong></li>\n<li><strong>Learning attainment – e.g., low attainment, intellectual disability, gifted learners</strong></li>\n<li><strong>Physical and sensory – e.g., hearing impairment, sensory sensitivity, paraplegia</strong></li>\n<li><strong>Culture – e.g. religion, sexuality, socioeconomic status</strong></li>\n</ol>\n<p>You will present your work in an academic style. In preparation for submission of this task, you should undertake a literature search of the UQ library catalogue, and the listed course outline references.</p>\n<p>In approximately 2000 words:</p>\n<ul>\n<li>You should include a brief summary of the salient research findings in the area.</li>\n<li>Critically analyse the literature with respect to Standards One and Four of the Australian Professional Standards for Teachers. A literature review is more than a summary and discusses the quality of the studies, the findings of the research, and identifies conflicts or gaps in the literature.</li>\n<li>Conclude with implications and considerations from your analysis of the literature for your teaching.</li>\n</ul>\n<p>Reference list:</p>\n<p>In addition to the word count, include all references you have cited in the text. Use APA 7th format.</p>\n<p>Acknowledgement: Please ensure you acknowledge where and how you have used AI including the AI tool used for example ChatGPT, Bing Chat, Grammarly GO. Also include:</p>\n<ul>\n<li>Questions used to generate the response.</li>\n<li>Refining questions used.</li>\n<li>Instructional questions used.</li>\n<li>How you have synthesised the products of AI into your assessment.</li>\n</ul>\n<p>The Acknowledgement is not included within the word count.</p>\n<p>Please be mindful of the policy outlined under assessment within the ECP.</p>\n<p><strong>Suggestions to assist the preparation of your literature review</strong></p>\n<ol>\n<li>Choose your learning need option. This task leads to Task 2, so read that task to help you choose.</li>\n<li>Read the section in your text that are relevant.</li>\n<li>Write down keywords/phrases.</li>\n</ol>\n<p>e.g. if your teaching area is geography and you are interested in challenging/extending learners, you might begin with the following keywords: Geography; Secondary education (if you don’t get much, you could broaden this to school education); gifted; enrichment; intellectual disability, learning difficulty … you can find other keywords once you start to search.</p>\n<p>The UQ librarians are happy to assist you with searching for literature on your chosen topic. You may find the library’s help page on search strategies to be helpful <a href=\"https://guides.library.uq.edu.au/research-techniques/literature-reviews\">https://guides.library.uq.edu.au/research-techniques/literature-reviews</a>. The style required for this task is a narrative review.</p>\n<p>Research articles include a review of relevant literature as part of the background or introductory sections. Your review for this assignment could follow the same style.</p>\n<p>It is not a requirement of this task to access literature beyond the UQ library catalogue or readily accessible websites. It is important to judge the quality of the literature and for academic writing, the usual minimum standard is literature that has been peer reviewed. Journals will specify their review processes. Webpages need caution. Ask your librarian or tutor if you are unsure of the quality of the literature you have found.</p>\n<p>Referencing your work is an essential aspect of academic writing. The School of Education (and many education journals) specifies the use of APA 7th style for referencing. You can find more information about referencing here: <a href=\"https://guides.library.uq.edu.au/referencing/apa7\">https://guides.library.uq.edu.au/referencing/apa7</a>.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission is via Blackboard in the Assessment folder.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Task 2 - Adjusted learning activity development",
            "special_indicators": [],
            "weighting": "<dd>30% ~ 4 pages </dd>",
            "due_date": "<dd><p> 26/09/2025 2:00 pm</p></dd>",
            "learning_objectives": "L03, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>In this task, you will plan a lesson plan to meet the learning needs of a range of students such as those with disability, from diverse backgrounds, including Indigenous learners, and with a range of abilities. The lesson plan will be applicable to your teaching area and based on the Australian Curriculum.</p>\n<p>Using the principles of Universal Design for Learning (UDL), you will plan a lesson demonstrating teaching strategies that support student participation (including strategies for Aboriginal and Torres Strait Islander students), as well as strategies for assessing what students know or are able to do as a result of the lesson. In addition to the general planning for all, you will plan learning adjustments based on a learning need such as you investigated for Task 1, indicating appropriate adjustments for teaching and assessing a student with that need.</p>\n<p>Format:</p>\n<p>In a maximum of four A4 pages, include:</p>\n<ul>\n<li>A brief overview explaining the context for the lesson such as teaching area, year level, the specific learning need you have addressed and a discussion of relevant APST standards. This is to provide background for the lesson.</li>\n<li>Planning for the lesson, in a format of your choice. Establish learning goals that provide achievable challenges for all students.</li>\n<li>Indications of UDL design features [1] for:</li>\n<li>Engagement (stimulate interest and motivation for learning)</li>\n<li>Representation (present information and content in different ways)</li>\n<li>Access and Expression (differentiate ways that students show what they know or can do).</li>\n<li>Explanation of adjustments designed to meet the learning need you have investigated.</li>\n<li>An explanation of teaching strategies you have chosen and how they are responsive to the learning strengths and needs of students from diverse linguistic, cultural, religious and socioeconomic backgrounds.</li>\n<li>In an appendix (not counted in the page limit) include all resources for the lesson including enabling and extending prompts; [2]</li>\n<li>Include references for resources (where appropriate) on the resource itself and not in a reference list at the end. This is to be useful for your future work so that you will have the reference with the resource. Other references may be included in a reference list in the appendix.</li>\n<li>Acknowledge if and how you have used AI for this task. Please ensure you acknowledge where and how you have used AI including the AI tool used for example ChatGPT, Bing Chat, Grammarly GO. Also include:</li>\n<li>Questions used to generate the response.</li>\n<li>Refining questions used.</li>\n<li>Instructional questions used.</li>\n<li>How you have synthesised the products of AI into your assessment.</li>\n</ul>\n<p>The Acknowledgement is not included within the word count.</p>\n<p>Please be mindful of the policy outlined under assessment within the ECP.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission is via Blackboard in the Assessment folder.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Task 3 - Case study report: Response to scenario",
            "special_indicators": [],
            "weighting": "<dd>40% ~ 5 pages </dd>",
            "due_date": "<dd><p> 10/11/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This is a culminating task where you will build on your understandings of building inclusive classrooms by documenting preparations for a meeting with parents.</p>\n<p>Scenario:</p>\n<p>Two weeks into the new school year, the parents of a student in your year 9 class have asked to meet with you to discuss how you will accommodate their child’s learning needs as specified in the Individual Education Plan (IEP). Note: IEP is internationally recognised terminology. Local education systems may use different terminology.</p>\n<p>You will be provided with a de-identified current IEP. In this task, you will document your preparation for the meeting, including the following:</p>\n<p><strong>1. Background</strong> (suggested two A4 pages)</p>\n<ul>\n<li>A summary of the relevant legislation and policy documents. (Choose a jurisdiction where you plan to teach).</li>\n<li>An indication of the assessment data (both formative and summative) you would study prior to the meeting to provide background on the student’s progress.</li>\n<li>An overview of your investigation of applicable external professional and community representatives including professional support networks, such as disability associations, and other community groups for extending your personal professional knowledge and practice.</li>\n</ul>\n<p><strong>2. A plan for the meeting</strong> (suggested two A4 pages)</p>\n<ul>\n<li>Location, timing, seating arrangement, refreshments etc.</li>\n<li>Introductions – opportunity for parents to indicate what they wish to gain from the meeting.</li>\n<li>How you will work with parents/carers over the year, including considerations of sensitivity, confidentiality, seeking their input and advice, and how you intend to collaborate with them throughout the year.</li>\n<li>Explanation of learning adjustments applicable to your subject area in response to the student’s IEP.</li>\n<li>Explanation of reasonable adjustments planned for assessment, responding to the IEP.</li>\n<li>Explanation of your plan for the student’s wellbeing and safety, including positive behaviour support processes (Tier 1, 2 or 3, as applicable).</li>\n</ul>\n<p><strong>3. Follow up</strong> (suggested up to one A4 page)</p>\n<ul>\n<li>Recording of the conversation</li>\n<li>Further meetings</li>\n<li>Reporting to others.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission is via Blackboard in the Assessment folder.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(28 Jul - 03 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1 - Embracing inclusive practice</strong><br><p>This first week's activities set the context for this course. It introduces students to the concept of inclusion and begins the work of developing an evidence base for practice.<br/>\nIntroduction to UDL</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 1 - Embracing inclusive practice</strong>",
            "topic_description": "Week 1 - Embracing inclusive practice This first week's activities set the context for this course. It introduces students to the concept of inclusion and begins the work of developing an evidence base for practice. Introduction to UDL",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 2(04 Aug - 10 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2 - Understanding the legislative context - Evidence for Inclusive Education</strong><br/></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 2 - Understanding the legislative context - Evidence for Inclusive Education</strong>",
            "topic_description": "Week 2 - Understanding the legislative context - Evidence for Inclusive Education",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 3(11 Aug - 17 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3 - Understanding the legislative context - The right to a quality inclusive education.</strong><br/><p>This module focuses on the legislation and policy context that underpins students' rights to quality education.</p></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Week 3 - Understanding the legislative context - The right to a quality inclusive education.</strong>",
            "topic_description": "Week 3 - Understanding the legislative context - The right to a quality inclusive education. This module focuses on the legislation and policy context that underpins students' rights to quality education.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 4(18 Aug - 24 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4 - Understanding the legislative context - Student wellbeing and quality of life. </strong><br/><p>This week the focus is on student wellbeing and quality of life. </p></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Week 4 - Understanding the legislative context - Student wellbeing and quality of life. </strong>",
            "topic_description": "Week 4 - Understanding the legislative context - Student wellbeing and quality of life. This week the focus is on student wellbeing and quality of life.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 5(25 Aug - 31 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5 - Planning for Learning - Universal Design for Learning; Use of Technology</strong><br/><p>Advances in ICT have had a dramatic effect on accessibility of learning. Many features are now built in to devices. Bring along your favourite piece of learning technology to demonstrate.</p></p><p><strong>Learning outcomes:</strong> L03, L05</p></div></td>",
            "topic_title": "<strong>Week 5 - Planning for Learning - Universal Design for Learning; Use of Technology</strong>",
            "topic_description": "Week 5 - Planning for Learning - Universal Design for Learning; Use of Technology Advances in ICT have had a dramatic effect on accessibility of learning. Many features are now built in to devices. Bring along your favourite piece of learning technology to demonstrate.",
            "learning_outcomes": [
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6(01 Sep - 07 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6 - Planning for Learning -  Year level adjusted curriculum</strong><br/><p>The Australian Curriculum is a year-level curriculum. The implications for planning, particularly with respect to gifted learners and learners with intellectual disabilities will be explored.</p></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Week 6 - Planning for Learning -  Year level adjusted curriculum</strong>",
            "topic_description": "Week 6 - Planning for Learning -  Year level adjusted curriculum The Australian Curriculum is a year-level curriculum. The implications for planning, particularly with respect to gifted learners and learners with intellectual disabilities will be explored.",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 7(08 Sep - 14 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7 - Planning for learning - Assessment</strong><br/><p>Assessment has a range of purposes, sometimes referred to as:<br/>\nAssessment for learning - so teachers and their students can make learning progress<br/>\nAssessment of learning - finding out what students know and can do as a result of teaching<br/>\nAssessment as learning - undertaking tasks can lead to learning.</p>\n<p>Designing and interpreting assessment in the context of inclusive practice is the focus of this module.</p></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Week 7 - Planning for learning - Assessment</strong>",
            "topic_description": "Week 7 - Planning for learning - Assessment Assessment has a range of purposes, sometimes referred to as: Assessment for learning - so teachers and their students can make learning progress Assessment of learning - finding out what students know and can do as a result of teaching Assessment as learning - undertaking tasks can lead to learning. Designing and interpreting assessment in the context of inclusive practice is the focus of this module.",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8 - Planning for Learning - Language and Literacy support</strong><br><p>Language support is the work of all teachers.<br/>\nSome students will have specific language difficulties and disabilities.<br/>\nSome will have learning strengths.<br/>\nGuest presenter from Speech Therapy will discuss language disorders and how speech language pathologists work with teachers.</p></br></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Week 8 - Planning for Learning - Language and Literacy support</strong>",
            "topic_description": "Week 8 - Planning for Learning - Language and Literacy support Language support is the work of all teachers. Some students will have specific language difficulties and disabilities. Some will have learning strengths. Guest presenter from Speech Therapy will discuss language disorders and how speech language pathologists work with teachers.",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9 - Planning for Learning - Positive Behaviour Support</strong><br><p>Establishing and maintaining a classroom for learning relies on supporting students to exhibit productive learning behaviours. Behaviour is communication so responding to the need being expressed is more effective than responding to the behaviour itself. This module focuses on an approach known as 'Positive Behaviour Supports'.</p></br></p><p><strong>Learning outcomes:</strong> L03, L05</p></div></td>",
            "topic_title": "<strong>Week 9 - Planning for Learning - Positive Behaviour Support</strong>",
            "topic_description": "Week 9 - Planning for Learning - Positive Behaviour Support Establishing and maintaining a classroom for learning relies on supporting students to exhibit productive learning behaviours. Behaviour is communication so responding to the need being expressed is more effective than responding to the behaviour itself. This module focuses on an approach known as 'Positive Behaviour Supports'.",
            "learning_outcomes": [
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Mid Sem break(29 Sep - 05 Oct)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid semester break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid semester break</strong>",
            "topic_description": "Mid semester break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 10 To Week 11(06 Oct - 19 Oct)",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Weeks 10 &amp; 11 - Professional Experience Placement</strong><br><p>There are no classes scheduled while you are on placement for an accompanying course.</p></br></p></div></td>",
            "topic_title": "<strong>Weeks 10 &amp; 11 - Professional Experience Placement</strong>",
            "topic_description": "Weeks 10 & 11 - Professional Experience Placement There are no classes scheduled while you are on placement for an accompanying course.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(20 Oct - 26 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12 - Building a community of practice - Working with others</strong><br><p>Teachers work in teams, often as the leader. When a student with a personalised learning plan is in the class, many people may be involved in the community of practice. These could be teacher aides, specialist teachers, therapists, parents and learning support teams. This module will explore ways of building positive relationships, including running meetings.</p></br></p><p><strong>Learning outcomes:</strong> L04</p></div></td>",
            "topic_title": "<strong>Week 12 - Building a community of practice - Working with others</strong>",
            "topic_description": "Week 12 - Building a community of practice - Working with others Teachers work in teams, often as the leader. When a student with a personalised learning plan is in the class, many people may be involved in the community of practice. These could be teacher aides, specialist teachers, therapists, parents and learning support teams. This module will explore ways of building positive relationships, including running meetings.",
            "learning_outcomes": [
                "L04"
            ]
        },
        {
            "learning_period": "Week 13(27 Oct - 02 Nov)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13 - Building a community of practice - community resources</strong><br><p>This week the lecture slot will be a panel discussion with invited guests.</p></br></p><p><strong>Learning outcomes:</strong> L04, L05</p></div></td>",
            "topic_title": "<strong>Week 13 - Building a community of practice - community resources</strong>",
            "topic_description": "Week 13 - Building a community of practice - community resources This week the lecture slot will be a panel discussion with invited guests.",
            "learning_outcomes": [
                "L04",
                "L05"
            ]
        }
    ]
}