{
    "course_title": "Teaching Early Reading",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC7620-60510-7560",
    "full_course_code": "EDUC7620-60510-7560",
    "course_code": "EDUC7620",
    "class_code": "60510",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate critical analysis and synthesis of contemporary early reading theories and apply these skills through the creation of a reading instruction resource portfolio and the writing of theoretical rationales. (1.2, 2.1, 2.5, 3.3, 3.4, 5.4)"
        },
        {
            "number": "LO2.",
            "description": "Demonstrate knowledge and understanding of early reading development and assessment through the design of reading lesson and assessment plans that include achievable yet challenging learning goals for students of varying abilities and characteristics. (1.2, 2.1, 2.3, 2.5, 3.1, 3.3, 4.2, 5.1)"
        },
        {
            "number": "LO3.",
            "description": "Demonstrate clear, logical, and coherent communication skills consistent with personal, professional, and academic conventions."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Reading instruction resource portfolio",
            "special_indicators": [],
            "weighting": "<dd>50% This assignment is considered the equivalent of a 3,000-word essay </dd>",
            "due_date": "<dd><p>AT1 Part 1 22/08/2025 2:00 pm</p>\n<p>AT1 Part 2 19/09/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L03",
            "mode": "Activity/ Performance, Product/ Artefact/ Multimedia, Written",
            "category": "Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This task requires you to create a multifaceted reading instruction resource portfolio that draws on your developing understanding of the essential elements of reading instruction. You will complete the assignment in two parts. Part 1 will include resources related to phonological awareness, while Part 2 will include resources related to vocabulary and fluency.</p>\n<p>Your portfolio will demonstrate your ability to critically analyse and synthesise aspects of contemporary early reading theories. You will also use a repertoire of pedagogical strategies to teach, assess, and evaluate reading experiences, including:</p>\n<ol>\n<li>A quiz that requires you to identify syllables, onset and rime, and phonemes and associated graphemes in words and sentences</li>\n<li>Creating resources to support phonological awareness and vocabulary instruction</li>\n<li>Assessing and supporting children's reading fluency</li>\n</ol>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit the assessment electronically via the assignment link on the course website.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Planning early and upper primary reading lessons",
            "special_indicators": [],
            "weighting": "<dd>50% This assignment is considered the equivalent of a 2,500-word essay </dd>",
            "due_date": "<dd><p> 31/10/2025 2:00 pm</p></dd>",
            "learning_objectives": "L02, L03",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Product/ Design, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment task will develop your knowledge of how to teach and assess reading, with a focus on early and upper primary reading. It is split into two parts.</p>\n<p><strong>Part 1: Lesson and assessment plans</strong></p>\n<p>You are required to plan two standalone reading lessons, with a phonics lesson designed for an early primary context (i.e., Prep, Year 1, or Year 2) and a comprehension lesson designed for an upper primary context (i.e., Year 5 or 6). Each lesson will be supported by your use of an appropriate mentor text.</p>\n<p>Select ONE reading-related Content Description per lesson from a set of options that could be taught using your selected mentor texts. Each Content Description will be linked to a given year level in the <em>Australian Curriculum: English</em>. The Content Description you select will determine the year levels for your planning.</p>\n<p>Each lesson must include:</p>\n<ol>\n<li>Achievable yet challenging learning goals for students, communicated in student-friendly language through learning intention(s) and success criteria.</li>\n<li>A description of how you would teach the essential element of reading in the genre of a procedural text that could be picked up and used by other teachers.</li>\n<li>Examples of teacher talk, think-alouds, and modelling with one or several mentor texts.</li>\n<li>An indication of how student learning would be assessed (please detail how you would meaningfully integrate assessment opportunities into your learning experiences).</li>\n</ol>\n<p><strong>Part 2: Theoretical rationale</strong></p>\n<p>Write a theoretical rationale to justify the choices made in your lesson and assessment plans. Your theoretical rationale should explain:</p>\n<ul>\n<li>How you drew on relevant curriculum documents and scholarly literature when planning each part of your lessons.</li>\n<li>How and why you incorporated differentiated teaching strategies to cater for students with varying abilities and characteristics.</li>\n<li>Your use of appropriate resources to teach and assess reading (e.g., mentor texts, effective use of Information and Communication Technology).</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit the assessment electronically via the assignment link on the course website. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(28 Jul - 03 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1</strong><br/><p>Overview and history of reading instruction; Contemporary theories of early reading</p>\n<p>This lecture and tutorial explore the history of reading instruction, from the ABC method, to phonics, the look-say approach, whole language, balanced literacy, and landing in the present day with a science of reading-informed approach. Preservice teachers also learn about key reading theories that underpin the course, including the simple view of reading, Scarborough's reading rope, and the dual route model.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Week 1</strong>",
            "topic_description": "Week 1 Overview and history of reading instruction; Contemporary theories of early reading This lecture and tutorial explore the history of reading instruction, from the ABC method, to phonics, the look-say approach, whole language, balanced literacy, and landing in the present day with a science of reading-informed approach. Preservice teachers also learn about key reading theories that underpin the course, including the simple view of reading, Scarborough's reading rope, and the dual route model.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 2(04 Aug - 10 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2</strong><br/><p>Phonological awareness; Concepts of print; Alphabet knowledge</p>\n<p>This lecture and tutorial introduces about three important aspects of early reading: phonological awareness, alphabet knowledge, and concepts about print. This will lay much of the groundwork needed for the next lecture and tutorial on phonics.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Week 2</strong>",
            "topic_description": "Week 2 Phonological awareness; Concepts of print; Alphabet knowledge This lecture and tutorial introduces about three important aspects of early reading: phonological awareness, alphabet knowledge, and concepts about print. This will lay much of the groundwork needed for the next lecture and tutorial on phonics.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 3(11 Aug - 17 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3</strong><br/><p>Phonics</p>\n<p>This week focuses on phonics. Preservice teachers learn how to help children develop their word recognition skills, bringing together their knowledge of decoding and reading high-frequency words. They learn to teach phonics systematically, explicitly, and synthetically.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Week 3</strong>",
            "topic_description": "Week 3 Phonics This week focuses on phonics. Preservice teachers learn how to help children develop their word recognition skills, bringing together their knowledge of decoding and reading high-frequency words. They learn to teach phonics systematically, explicitly, and synthetically.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 4(18 Aug - 24 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4</strong><br/><p>Comprehending language structures</p>\n<p>Comprehending (or understanding) is the reason people read. This week, preservice teachers learn about several components of comprehension, including inference, background knowledge, knowledge of grammar structures, knowledge of text structures, and comprehension monitoring, which all come together to allow readers to build a strong mental model of whatever text they are reading. This lecture explains the research that shows student understanding, engagement, and academic performance are improved by the explicit comprehension instruction in the context of discipline-specific content (e.g., Cervetti &amp; Wright, 2020; Elbro &amp; Buch-Iverson, 2013; Cabell &amp; Hwang, 2020; Hattan &amp; Lupo, 2020; Recht &amp; Leslie, 1988). During the lecture, preservice teachers work with a partner to select from a range of ‘Core Knowledge’ Year 4-6 readers on History and Geography or Science topics, familiarise themselves with the content noting any points that were not already part of their background knowledge, and consider how they might draw on the Core Knowledge materials to explicitly teach students to comprehend and write their own texts in these disciplines.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Week 4</strong>",
            "topic_description": "Week 4 Comprehending language structures Comprehending (or understanding) is the reason people read. This week, preservice teachers learn about several components of comprehension, including inference, background knowledge, knowledge of grammar structures, knowledge of text structures, and comprehension monitoring, which all come together to allow readers to build a strong mental model of whatever text they are reading. This lecture explains the research that shows student understanding, engagement, and academic performance are improved by the explicit comprehension instruction in the context of discipline-specific content (e.g., Cervetti & Wright, 2020; Elbro & Buch-Iverson, 2013; Cabell & Hwang, 2020; Hattan & Lupo, 2020; Recht & Leslie, 1988). During the lecture, preservice teachers work with a partner to select from a range of ‘Core Knowledge’ Year 4-6 readers on History and Geography or Science topics, familiarise themselves with the content noting any points that were not already part of their background knowledge, and consider how they might draw on the Core Knowledge materials to explicitly teach students to comprehend and write their own texts in these disciplines.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 5(25 Aug - 31 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5</strong><br/><p>Language comprehension and reading comprehension; Comprehension strategies</p>\n<p>This week focuses on comprehension once more, with particular emphasis paid to several comprehension strategies teachers can teach to enhance the mental models their students build when they are reading. This helps preservice teachers to understand the aspects that make up the language and reading comprehension aspects of the simple view of reading and Scarborough's reading rope. This content once again highlights the complexity of reading instruction in contemporary primary school classrooms.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Week 5</strong>",
            "topic_description": "Week 5 Language comprehension and reading comprehension; Comprehension strategies This week focuses on comprehension once more, with particular emphasis paid to several comprehension strategies teachers can teach to enhance the mental models their students build when they are reading. This helps preservice teachers to understand the aspects that make up the language and reading comprehension aspects of the simple view of reading and Scarborough's reading rope. This content once again highlights the complexity of reading instruction in contemporary primary school classrooms.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 6(01 Sep - 07 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6</strong><br/><p>Vocabulary</p>\n<p>This week focuses on vocabulary, with particular emphasis paid to vocabulary depth, breadth, and access. The lecture and tutorial explore three tiers of words and explain why focusing on Tier 2 words is particularly important in the direct teaching of vocabulary.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Week 6</strong>",
            "topic_description": "Week 6 Vocabulary This week focuses on vocabulary, with particular emphasis paid to vocabulary depth, breadth, and access. The lecture and tutorial explore three tiers of words and explain why focusing on Tier 2 words is particularly important in the direct teaching of vocabulary.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 7(08 Sep - 14 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7</strong><br/><p>Fluency</p>\n<p>This week focuses on fluency, which acts as a critical bridge between word recognition processes and comprehension processes. Preservice teachers learn about the aspects of fluency that allow readers to read accurately, quickly, and with great expression, clarity, and phrasing. In the lecture, preservice teachers are taught about the components of reading fluency, the <em>Australian Curriculum: English</em> content descriptions and achievement standards related to fluency, and are introduced to the multidimensional fluency rubric (Rasinski &amp; Young, 2022) as one of several strategies that can be used to summatively assess reading fluency. In the tutorial, preservice teachers listen to a recording of a child reading and summatively assess their reading fluency using the multidimensional fluency rubric (Rasinski &amp; Young, 2022), considering the child’s expression and volume, phrasing, smoothness, and pace.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Week 7</strong>",
            "topic_description": "Week 7 Fluency This week focuses on fluency, which acts as a critical bridge between word recognition processes and comprehension processes. Preservice teachers learn about the aspects of fluency that allow readers to read accurately, quickly, and with great expression, clarity, and phrasing. In the lecture, preservice teachers are taught about the components of reading fluency, the Australian Curriculum: English content descriptions and achievement standards related to fluency, and are introduced to the multidimensional fluency rubric (Rasinski & Young, 2022) as one of several strategies that can be used to summatively assess reading fluency. In the tutorial, preservice teachers listen to a recording of a child reading and summatively assess their reading fluency using the multidimensional fluency rubric (Rasinski & Young, 2022), considering the child’s expression and volume, phrasing, smoothness, and pace.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8</strong><br/><p>Oral language and reading</p>\n<p>This week focuses on oral language and its relationship with the essential elements of reading. Preservice teachers learn about how oral language skills develop, the importance of speaking and listening, and what a primary teacher needs to do to foster these skills in classroom contexts.</p></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Week 8</strong>",
            "topic_description": "Week 8 Oral language and reading This week focuses on oral language and its relationship with the essential elements of reading. Preservice teachers learn about how oral language skills develop, the importance of speaking and listening, and what a primary teacher needs to do to foster these skills in classroom contexts.",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9</strong><br/><p>Explicit reading instruction; Supporting all readers</p>\n<p>This week focuses on how teachers can teach and assess reading using an explicit approach named the gradual release of responsibility. Video clips are shared of several assessment methods mentioned in previous weeks. Following this, the lecture explores different ways to support students who struggle with the elements of reading.</p></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Week 9</strong>",
            "topic_description": "Week 9 Explicit reading instruction; Supporting all readers This week focuses on how teachers can teach and assess reading using an explicit approach named the gradual release of responsibility. Video clips are shared of several assessment methods mentioned in previous weeks. Following this, the lecture explores different ways to support students who struggle with the elements of reading.",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Mid Sem break(29 Sep - 05 Oct)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid Sem Break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid Sem Break</strong>",
            "topic_description": "Mid Sem Break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 10 To Week 11(06 Oct - 19 Oct)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Weeks 10 and 11</strong><br><p>'Mainstream' EDUC7620 preservice teachers are on school professional experience placements in Weeks 10 and 11.</p>\n<p>'Turn to Teaching' EDUC7620 preservice teachers are not on school professional experience placements in Weeks 10 and 11.</p>\n<p><strong>No lectures or tutorials</strong> will be held for EDUC7620 in Weeks 10 or 11.</p></br></p></div></td>",
            "topic_title": "<strong>Weeks 10 and 11</strong>",
            "topic_description": "Weeks 10 and 11 'Mainstream' EDUC7620 preservice teachers are on school professional experience placements in Weeks 10 and 11. 'Turn to Teaching' EDUC7620 preservice teachers are not on school professional experience placements in Weeks 10 and 11. No lectures or tutorials will be held for EDUC7620 in Weeks 10 or 11.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(20 Oct - 26 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12</strong><br/><p>Links between reading and spelling</p>\n<p>This week focuses on how teachers can teach and assess spelling. Preservice teachers learn about the four spelling competencies and various methods of teaching and assessing spelling in classrooms, as well as connections with how teachers teach phonics and decoding (spelling involves encoding).</p></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Week 12</strong>",
            "topic_description": "Week 12 Links between reading and spelling This week focuses on how teachers can teach and assess spelling. Preservice teachers learn about the four spelling competencies and various methods of teaching and assessing spelling in classrooms, as well as connections with how teachers teach phonics and decoding (spelling involves encoding).",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 13(27 Oct - 02 Nov)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13</strong><br/><p>Bringing together the essential elements of reading; Course reflection</p>\n<p>This last week teaches preservice teachers how the strategies and topics of reading come together in primary classrooms.</p></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Week 13</strong>",
            "topic_description": "Week 13 Bringing together the essential elements of reading; Course reflection This last week teaches preservice teachers how the strategies and topics of reading come together in primary classrooms.",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        }
    ]
}