{
    "course_title": "Foundation of the Science of Learning",
    "study_period": "Sem 2 2025",
    "location": "External",
    "attendance": "Online",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC7059-60668-7560",
    "full_course_code": "EDUC7059-60668-7560",
    "course_code": "EDUC7059",
    "class_code": "60668",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Access, interpret, and critically evaluate scientific articles relevant to science of learning practices and/or research."
        },
        {
            "number": "LO2.",
            "description": "Explicate key ideas about the brain and mind, and how function is determined."
        },
        {
            "number": "LO3.",
            "description": "Consider, critically evaluate, and implement psychological theories relevant to education and learning."
        },
        {
            "number": "LO4.",
            "description": "Describe processes leading to the development of self-regulated learning."
        },
        {
            "number": "LO5.",
            "description": "Identify the many factors that affect the dynamic process of development and learning across the lifespan."
        },
        {
            "number": "LO6.",
            "description": "Translate key teachings and learnings into each students own personal and professional practice through the development of a personal theory."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Assessment 1 - Personal Learning Philosophy Blog",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40% 1500-2000 equivalent </dd>",
            "due_date": "<dd><p>Blog 1 (Formative) - Due 2pm 8/08/2025</p>\n<p>Blog 2 (Formative) - Due 2pm 19/09/2025</p>\n<p>Final Blog Written (Summative) - Due 2pm 31/10/2025</p>\n<p>Final Blog Viva Voce 27/10/2025 - 31/10/2025</p></dd>",
            "learning_objectives": "L01, L03, L04, L05, L06",
            "mode": "Oral, Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Topic: Development of personal philosophy of learning</strong></p>\n<p><strong>The Aim of the Activity: </strong>To develop a personal theory / philosophy of learning that is informed by the course content, readings and additional literature pertaining to the Science of Learning.</p>\n<p><strong>The Activity: </strong>Your personal philosophy of learning reflects your beliefs about learning. It also shapes the way you may engage in your own learning experiences or how you might design and deliver learning experiences for others such as your students or colleagues. So, what is your personal philosophy of learning? To begin, you will write a blog entry summarising your current personal philosophy of learning, reflecting on the metaphor of ‘weaving a colourful cloth’ as explored in the Week 2 reading, Immordino-Yang, et al (2023) and on the Learning Ecosystem activity undertaken in class in Weeks 1 and 2.</p>\n<p>At the conclusion of Week 8 you will write a second blog entry demonstrating how your personal philosophy of learning has evolved. In this post you will reflect on how your evolving philosophy has been informed by the focus, readings, activities, and discussions of the course so far, and use supporting literature from the science of learning.</p>\n<p>At the conclusion of the course, you will complete a final Blog (Week 13), reflecting on how your personal philosophy of learning has been informed by your learning across the semester. You will also complete a Viva voce with the course coordinator, outlining the key dimensions of your learning philosophy. You may choose to your Learning Ecosystem artefact or other resources to support your discussion.</p>\n<p><strong>Guidelines:</strong> The blog entries will need to attend to the criteria as described in the EDUC7059 criteria sheet. The following questions serve as a guide for your blog entry responses.</p>\n<p><strong>Entry 1 – Formative assessment (500 words max)</strong></p>\n<p><strong>The first of your blog entries needs to respond to the question:</strong></p>\n<ol>\n<li>What is your current personal philosophy of learning?</li>\n<li>What experiences/ ideas/ beliefs/ existing theories underpin your current philosophy? Refer to your Learning Ecosystem task in this response.</li>\n</ol>\n<p><strong>Entry 2 - Formative Assessment (500 words max)</strong></p>\n<ol>\n<li>How does information from the recent Science of Learning lectures, readings and discussions inform, challenge, or support your personal philosophy of learning, i.e. how is your personal philosophy evolving?</li>\n<li>What might be some practical ways you could apply these insights from the Science of Learning into your practice as a learner or teacher/ leader of learning?</li>\n</ol>\n<p><strong>Final Entry</strong> <strong>SUMMATIVE ASSESSMENT</strong> (Written component <strong>500 - 1000 words; Viva Voce to be completed Week 13)</strong> (Your final grade will be based on this response and the Viva Voce)</p>\n<ol>\n<li>Reflect on your initial blog post. How has your developing understanding of the Science of Learning supported or challenged your initial philosophy or theory of learning?</li>\n<li>What insights from the Science of Learning findings have had the greatest influence on your personal philosophy of learning? Explain, drawing on relevant literature to support your discussion. How is this reflected in your Learning Ecology?</li>\n<li>In reflecting across the course, how might you action your personal philosophy of learning into practice?</li>\n</ol>\n<p>The assignment length guidelines are 1500-2000 words total for all 3 posts + 10-minute Viva Voce (live interview with Course Coordinator to be undertaken on Zoom or Teams). This is approximately equivalent to <strong>500 words maximum for Blogs 1 &amp; 2</strong> and <strong>500-1000 for the final summative post.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Blog 1 and 2 to be submitted via Journal Link on Blackboard</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Assessment 2 - Online Quizzes",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30% 2000 words </dd>",
            "due_date": "<dd><p>Online Quiz 1 18/08/2025 - 22/08/2025</p>\n<p>Online Quiz 2 15/09/2025 - 19/09/2025</p>\n<p>Online Quiz 3 20/10/2025 - 24/10/2025</p>\n<p>\n</p><p>All quizzes will open on their indicated week from 6pm Monday and will close at 4pm Friday of their indicated week.</p>\n<p><br/></p></dd>",
            "learning_objectives": "L01, L02, L03, L05",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Topic: Mobilising knowledge across disciplinary lines</strong></p>\n<p>The Science of Learning is underpinned by three disciplines: neuroscience, psychology, and education. The Science of Learning takes a multidisciplinary approach to understanding how people learn, the factors that affect learning, and what the implications of these findings are for teaching, learning design and learning technologies (Hayes, 2006). However, research across these disciplines varies greatly in scope, specificity, and applicability to the real-world. Neuroscientific and psychological research often focuses on understanding cognitive, emotional, and behavioural processes in highly controlled laboratory conditions. While this research is incredibly valuable for understanding the mechanisms underlying learning, the direct relevance and applicability of such research to educational practice has been questioned for over 20 years (Bruer, 1997; Bowers, 2016). The prevalence of neuromyths (inaccurate conclusions drawn from neuroscientific evidence), oversimplification of psychological theories propagated through social media, and a general lack of consensus on <em>how</em> to effectively translate research into practice are primary examples of the challenges and pitfalls facing multidisciplinary research translation. Despite the ongoing debate and the noticeable challenges, the inclusion of insights from neuroscience and cognitive psychology is increasingly popular in education and workplace training, with recent reviews of Initial Teacher Education in Australia calling for an understanding of ‘the brain and learning’ to be included as core knowledge (Australian Government, 2023).</p>\n<p>Your task is to demonstrate an understanding of the complexities and possibilities surrounding the critiquing, interpretation, and use of multi-disciplinary research in practice. You are to complete three separate online open book quizzes via Blackboard:</p>\n<p><strong>1.     Quiz 1 – Multiple Choice:</strong></p>\n<p>You will be asked multiple choice questions assessing your understanding of how related disciplines contribute to and differ from the Science of Learning.</p>\n<p>Format: 10 Multiple Choice Questions</p>\n<p>Time: 30 mins</p>\n<p><strong>2.     Quiz 2 – Multiple Choice</strong>:</p>\n<p>You will be asked multiple choice questions assessing your understanding of the challenges of inter-disciplinary translation</p>\n<p>Format: 10 Multiple Choice Questions</p>\n<p>Time: 30 mins</p>\n<p><strong>3.     Quiz 3 – Short Answer:</strong></p>\n<p>You will be provided with a vignette describing evidence, findings, and arguments from neuroscience, psychology, and education on a specific topic relevant to learning. You will be asked to provide short-answer responses demonstrating your ability to critically evaluate empirical evidence and theoretical arguments to provide a clear and justified position on issues of research translation.</p>\n<p>Format: 3 Short Answer Questions</p>\n<ul>\n<li>Time: 45 mins</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Quizzes are to be completed online via Blackboard. Only ONE attempt is allowed for each quiz. Deferred or supplementary quizzes are NOT available. </p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Assessment 3 - Translation Presentation",
            "special_indicators": [],
            "weighting": "<dd>30% 1500 words equivalent </dd>",
            "due_date": "<dd><p> 10/11/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Topic: Mobilising the Science of Learning into practice: a professional learning presentation in your context</p>\n<p>The multi-disciplinary nature of the science of learning makes the process of mobilising or translating this knowledge into authentic teaching, learning, and training environments a complex and challenging one (see Daniel, 2012; Fischer, 2009; Joram, Gabriele, &amp; Walton, 2020; Lysenko, Abrami, Bernard, Dagenais, &amp; Janosz, 2014; Macmahon, Leggett &amp; Carroll, 2022; van Atteveldt, Tijsma, Janssen, &amp; Kupper, 2019). However, seeking ways to overcome these complexities and challenges has immense value for the field and reciprocal benefits for both educators and researchers (Hobbis et al., 2018). Levin (2013) conceptualised the process of knowledge mobilisation as involving three domains: knowledge production, knowledge use, and knowledge mediation. Knowledge brokers – individuals who can act as a conduit between research and practice – are fundamental to effective knowledge mediation, supporting educators and other users of Science of Learning research to effectively engage with and apply research in contextually relevant ways (Brown, 2020; Cooper et al., 2020; Farley-Ripple, 2017; Gorard et al., 2020; Hobbis et al., 2019; Neal et al., 2015).</p>\n<p>You can play an important role in your context as a mediator of the science of learning by communicating clearly the relevant Science of Learning findings and principles and illustrating how these can be applied and evaluated in your own context.</p>\n<p><strong>Your final assessment task is to prepare a professional presentation that explains and illustrates ways to mobilise a Science of Learning Principle into your teaching/ learning/ training context. The presentation is to be suitable for educators in your context and must feature some key practical applications.</strong></p>\n<p><strong>Use the prompts below to guide your presentation.</strong></p>\n<ul>\n<li><em>Clearly set the context for your presentation, i.e.: who the audience is.</em></li>\n<li><em>Clearly articulate and explain your chosen principle.</em></li>\n<li><em>Explain the role of the chosen principle in the learning process relevant to your identified audience, synthesising and clearly communicating the key research supporting this principle.</em></li>\n<li><em>Provide clear illustrations of how this principle can be applied into practice in your audience’s context, demonstrating an understanding of common translational barriers and strategies for overcoming or reducing these in your context.</em></li>\n<li><em>Demonstrate an understanding of the design principles informed by the Science of Learning through the layout, activities, and presentation of the task (your aim is to engage and inspire your colleagues!).</em></li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Your presentation may be presented as either a PowerPoint presentation, a keynote presentation, or a video.  Regardless of mode, the translation presentation must:</strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(28 Jul - 03 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1 - Introduction to the Science of Learning</strong><br><p>The first week of this course will provide an overview of the science of learning. Key questions are explored, such as: What is Learning? What is the Science of Learning? A range of learning theories will be explored and considered. The structure of the course will be outlined and assessment explained.</p></br></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Week 1 - Introduction to the Science of Learning</strong>",
            "topic_description": "Week 1 - Introduction to the Science of Learning The first week of this course will provide an overview of the science of learning. Key questions are explored, such as: What is Learning? What is the Science of Learning? A range of learning theories will be explored and considered. The structure of the course will be outlined and assessment explained.",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 2(04 Aug - 10 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2 - The Brain, The Mind, The Body</strong><br><p>This week we will be looking at some foundational ideas from psychology and neuroscience that inform the Science of Learning. We will explore the varying philosophical foundations of the key disciplines and consider the challenges when merging them together.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 2 - The Brain, The Mind, The Body</strong>",
            "topic_description": "Week 2 - The Brain, The Mind, The Body This week we will be looking at some foundational ideas from psychology and neuroscience that inform the Science of Learning. We will explore the varying philosophical foundations of the key disciplines and consider the challenges when merging them together.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 3(11 Aug - 17 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3 - Mobilising the SoL into Practice</strong><br/><p>As a multi-disciplinary field, the science of learning presents complex challenges when we want to mobilise this research into applied settings. In Week 3 we will be taking a critical lens to the Science of Learning and considering some of the challenges and hurdles when translating multidisciplinary research into real-world practice. We will be discussing different models of research translation and reflecting on contextual and methodological challenges when using research to inform practice.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05, L06</p></div></td>",
            "topic_title": "<strong>Week 3 - Mobilising the SoL into Practice</strong>",
            "topic_description": "Week 3 - Mobilising the SoL into Practice As a multi-disciplinary field, the science of learning presents complex challenges when we want to mobilise this research into applied settings. In Week 3 we will be taking a critical lens to the Science of Learning and considering some of the challenges and hurdles when translating multidisciplinary research into real-world practice. We will be discussing different models of research translation and reflecting on contextual and methodological challenges when using research to inform practice.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 4(18 Aug - 24 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4 - Synapse to Society 1</strong><br/><p>This week we will venture into the adolescent brain and explore some of the contemporary research providing insight into adolescent brain and cognitive development. The period of adolescence is a sensitive period of brain development influenced by both biological and environmental factors. We will consider what this important phase of brain and cognitive development means for learning and for teaching.</p>\n<p><br/></p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 4 - Synapse to Society 1</strong>",
            "topic_description": "Week 4 - Synapse to Society 1 This week we will venture into the adolescent brain and explore some of the contemporary research providing insight into adolescent brain and cognitive development. The period of adolescence is a sensitive period of brain development influenced by both biological and environmental factors. We will consider what this important phase of brain and cognitive development means for learning and for teaching.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 5(25 Aug - 31 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5 - Synapse to Society 2</strong><br><p>This week we will start looking more deeply into some important learning constructs, including attention, memory and executive functions, including theories such as Cognitive Load Theory. We will explore some guiding principles and some evidence-based strategies that have been shown to promote attention, memory and/ or executive functioning skills and will consider how we can apply these into our own learning contexts.</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 5 - Synapse to Society 2</strong>",
            "topic_description": "Week 5 - Synapse to Society 2 This week we will start looking more deeply into some important learning constructs, including attention, memory and executive functions, including theories such as Cognitive Load Theory. We will explore some guiding principles and some evidence-based strategies that have been shown to promote attention, memory and/ or executive functioning skills and will consider how we can apply these into our own learning contexts.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(01 Sep - 07 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6 - Synapse to Society 3</strong><br/><p>Neurodiversity. The science of learning and related fields are providing important insight into how differences in learner attributes can be better understood and supported. This week we will explore how we might reframe some common developmental differences to promote more positive experiences for neurodiverse learners.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L05, L06</p></div></td>",
            "topic_title": "<strong>Week 6 - Synapse to Society 3</strong>",
            "topic_description": "Week 6 - Synapse to Society 3 Neurodiversity. The science of learning and related fields are providing important insight into how differences in learner attributes can be better understood and supported. This week we will explore how we might reframe some common developmental differences to promote more positive experiences for neurodiverse learners.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 7(08 Sep - 14 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7 - Synapse to Society 4</strong><br/><p>The development of language. Language is a socio-cultural tool for learning, regulation, and instruction. Well-developed language capabilities are important for learning and regulation throughout the lifespan. This week we will explore some of the multidisciplinary literature on language development and its role in learning and instruction.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 7 - Synapse to Society 4</strong>",
            "topic_description": "Week 7 - Synapse to Society 4 The development of language. Language is a socio-cultural tool for learning, regulation, and instruction. Well-developed language capabilities are important for learning and regulation throughout the lifespan. This week we will explore some of the multidisciplinary literature on language development and its role in learning and instruction.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8 - The Science of Learning and Wellbeing 1</strong><br/><p>Science of Learning &amp; Wellbeing: This week we will begin our look at the Science of Learning and Wellbeing, starting with an overview of the different definitions of wellbeing. We will then consider the role that emotions play in learning and wellbeing across the lifespan.</p>\n<p><br/></p></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 8 - The Science of Learning and Wellbeing 1</strong>",
            "topic_description": "Week 8 - The Science of Learning and Wellbeing 1 Science of Learning & Wellbeing: This week we will begin our look at the Science of Learning and Wellbeing, starting with an overview of the different definitions of wellbeing. We will then consider the role that emotions play in learning and wellbeing across the lifespan.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9 - The Science of Learning and Wellbeing 2</strong><br><p>Science of Learning &amp; Wellbeing: We are social beings who exist in a social world, and who learn, teach, lead, and work in social contexts. This week we will explore how the science of learning is informing our understanding of social connection and the importance of relationships to learning and thriving. We will consider ways we can utilise this knowledge to design more effective learning and teaching experiences across the lifespan.</p></br></p><p><strong>Learning outcomes:</strong> L01, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Week 9 - The Science of Learning and Wellbeing 2</strong>",
            "topic_description": "Week 9 - The Science of Learning and Wellbeing 2 Science of Learning & Wellbeing: We are social beings who exist in a social world, and who learn, teach, lead, and work in social contexts. This week we will explore how the science of learning is informing our understanding of social connection and the importance of relationships to learning and thriving. We will consider ways we can utilise this knowledge to design more effective learning and teaching experiences across the lifespan.",
            "learning_outcomes": [
                "L01",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Mid Sem break(29 Sep - 05 Oct)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-semester break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-semester break</strong>",
            "topic_description": "Mid-semester break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(06 Oct - 12 Oct)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10 -  Public Holiday</strong><br/><p>Public Holiday - no class this week - Independent Study</p></p></div></td>",
            "topic_title": "<strong>Week 10 -  Public Holiday</strong>",
            "topic_description": "Week 10 -  Public Holiday Public Holiday - no class this week - Independent Study",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(13 Oct - 19 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11 - Self Regulated Learning and Metacognition</strong><br/><p>Self-Regulated Learning and Effective learning Strategies. The capacity and efficacy to be able to understand, manage, and reflect on one's own thinking, learning, emotions, motivations, and capabilities is a powerful tool for supporting learning, agency, wellbeing and success across the lifespan. However, we often overlook teaching our learners HOW to learn. This week we will explore some theories of self-regulated learning and metacognition, and a range of effective learning strategies to promote SRL.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Week 11 - Self Regulated Learning and Metacognition</strong>",
            "topic_description": "Week 11 - Self Regulated Learning and Metacognition Self-Regulated Learning and Effective learning Strategies. The capacity and efficacy to be able to understand, manage, and reflect on one's own thinking, learning, emotions, motivations, and capabilities is a powerful tool for supporting learning, agency, wellbeing and success across the lifespan. However, we often overlook teaching our learners HOW to learn. This week we will explore some theories of self-regulated learning and metacognition, and a range of effective learning strategies to promote SRL.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 12(20 Oct - 26 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12 - Deep Learning</strong><br/><p>Being comfortable with uncertainty – groundwork for deep learning. This week we will delve into what the science says about some important epistemic emotions and higher order thinking processes including curiosity, creativity, interest &amp; confusion. These deep learning constructs are frequently discussed but often misunderstood and underutilised in learning.</p>\n<p><br/></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Week 12 - Deep Learning</strong>",
            "topic_description": "Week 12 - Deep Learning Being comfortable with uncertainty – groundwork for deep learning. This week we will delve into what the science says about some important epistemic emotions and higher order thinking processes including curiosity, creativity, interest & confusion. These deep learning constructs are frequently discussed but often misunderstood and underutilised in learning.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 13(27 Oct - 02 Nov)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13 - Guiding Principles</strong><br><p>Making sense of the science of learning in our contexts: this final week will be a revisiting of key principles and ideas from across the course and how we can be using these in our diverse contexts and settings to promote learning. The workshop will also be an opportunity to engage in some collaborative peer feedback processes in relation to the final assessment.</p>\n<p><br/></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Week 13 - Guiding Principles</strong>",
            "topic_description": "Week 13 - Guiding Principles Making sense of the science of learning in our contexts: this final week will be a revisiting of key principles and ideas from across the course and how we can be using these in our diverse contexts and settings to promote learning. The workshop will also be an opportunity to engage in some collaborative peer feedback processes in relation to the final assessment.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        }
    ]
}