{
    "course_title": "Team Project II",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/ENGG3800-60717-7560",
    "full_course_code": "ENGG3800-60717-7560",
    "course_code": "ENGG3800",
    "class_code": "60717",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "work effectively as a member of a team to design and build an electronic product on-budget and on-time"
        },
        {
            "number": "LO2.",
            "description": "apply a code of ethics to your team behaviour"
        },
        {
            "number": "LO3.",
            "description": "demonstrate specific electronic and/or software design skills required to produce a moderately complex analog and digital system fit-for-purpose"
        },
        {
            "number": "LO4.",
            "description": "effectively use software tools to aid project management, product design, version control and communication tasks."
        },
        {
            "number": "LO5.",
            "description": "summarise relevant aspects of the product design and design process to defined audiences via seminars and reports"
        },
        {
            "number": "LO6.",
            "description": "analyze issues that should be considered regarding sustainability of the product design"
        },
        {
            "number": "LO7.",
            "description": "apply the legal requirements of respect for intellectual property (IP) to your design"
        },
        {
            "number": "LO8.",
            "description": "reflect on your learning practices or development process to identify areas for personal improvement."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Team Code of Ethics and Code of Conduct",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 15/08/2025 4:00 pm</p>\n<p>\n</p><p>As long as the task is submitted on time, resubmission will be possible once if a passing mark is not awarded. Details of the resubmission time will be made available to teams individually.</p></dd>",
            "learning_objectives": "L01, L02",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Each team is to create and submit a team code of ethics and code of conduct outlining how team members will conduct themselves over the course of the semester.</p>\n<p>The code of ethics must outline the principles that the team will adhere to during the semester. It is recommended that this is informed by the codes of ethics for relevant professional societies (e.g. Engineers Australia and IEEE).</p>\n<p>The code of conduct must outline the expected (and/or prohibited) behaviour of team members, and must include statements on expected communication modes / frequencies and attendance expectations.</p>\n<p>You may appropriately use generative AI tools in completing this task but you must reference every instance of any such use of AI. A failure to reference generative AI use may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission via Blackboard</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>100% late penalty after a one hour grace period. The one-hour grace period is recorded from the time the submission is due.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Seminar presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p> 15/09/2025 - 19/09/2025</p>\n<p>\n</p><p>Presentations will be scheduled based on the availability of participants and suitable presentation spaces.</p></dd>",
            "learning_objectives": "L01, L03, L04, L05",
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Each team will give a brief presentation (e.g., using PowerPoint) to showcase their progress. This may include physical artefacts such as breadboards, PCBs, and components, as well as software demonstrations. Every team member is expected to demonstrate individual progress and must present for approximately 2.5 minutes. It is expected that you will identify problems and propose solutions. Presentations will be open to all students and a schedule will be determined in the week prior to seminars.</p>\n<p>You may appropriately use generative AI tools in completing this task but you must reference every instance of any such use of AI. A failure to reference generative AI use may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Product Demonstration Sequence",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>85%</dd>",
            "due_date": "<dd><p>Week 5 - Demo 1 (Preliminary)</p>\n<p>Week 9 - Demo 2 (Intermediate)</p>\n<p>[Any PCBs must be submitted to pinecone before the beginning of week 11 - see pinecone and Blackboard for further details and exact times. Manufacturing of PCBs will not be possible after this date]</p>\n<p>Week 13 - Final Demo. ALL projects are due at 10am on Monday.</p>\n<p>Signup polls will be distributed in the weeks before demonstrations.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L07",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Computer Code, Practical/ Demonstration, Product/ Design, Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Over the duration of the semester, teams are to implement a hardware and software product that meets the published specification and associated TP-STD standards available on Blackboard. </p>\n<p>You will demonstrate your product at three separate points during semester. You will be assessed for participation as well as your progress (hardware, firmware or software) based on the evidence presented using a marksheet available on the course Blackboard site. The demonstrations will occur at the following points in semester:</p>\n<ul>\n<li>Preliminary demonstration 1 (weighting: 10%)</li>\n<li>Intermediate demonstration 2 (weighting: 10%)</li>\n<li>Final demo (weighting: 65%)</li>\n</ul>\n<p><br/></p>\n<p>For all three demonstrations, a poll will be sent to all teams in the weeks before the due date in order to allow them to sign up for a time slot. Further details about the process will be available on Blackboard.</p>\n<p>The <strong>final</strong> submission requires the team to submit the following in an Australia Post BX1, BX2, Small (SKU: 44862) or Medium (SKU: 44863) box (or equivalent) to staff in 47-209 by 10 AM on Monday of week 13:</p>\n<ul>\n<li>your product, including any cables, batteries (which should be uninstalled) etc. as required for the product to be tested. All of these parts must be budgeted for (any exceptions will be explicitly noted in the specification).</li>\n<li>printed copy of all schematic files documenting all electrical components (resistors, capacitors, integrated circuits, connectors etc).</li>\n<li>any other required documentation (details will be provided in the marksheet via Blackboard) </li>\n<li>a USB drive containing a software installer and any required files/documents (details will be provided in the marksheet via Blackboard). The USB drive will be returned to you after your demonstration.</li>\n<li>a declaration signed by all team members validating all submitted contents (provided as a label to stick on your submission box)</li>\n</ul>\n<p><br/></p>\n<p>Submissions will <strong>not be accepted</strong> unless they meet the following requirements (note that this has no relation to the marking/marks awarded for the submission, other than that no valid submission will result in zero marks awarded):</p>\n<ul>\n<li>The submission box must be less than or equal to the dimensions of an Australia Post Large (390x280x140mm) box</li>\n<li>The submission box must contain a USB drive</li>\n<li>The submission box must contain a printed schematic</li>\n<li>The submission box must have the submission label affixed with at least one signature</li>\n<li>The submission box must contain a maximum of 3 breadboards</li>\n</ul>\n<p><br/></p>\n<p>More details on the submission process will be provided via Blackboard.</p>\n<p>In general, all members of the team are expected to attend the marking sessions. If you are not able to attend, your product will be marked in your absence and you will not be able to provide critical clarifications to the marker about the functionality implemented in your product. Given that the circumstances of any absence may be considered as part of the moderation process, it is important to let your team and the teaching staff know if you are unable to attend the demonstration. </p>\n<p>While marks will be given for working subsystems, the assessment scheme is biased towards completeness. To get a good grade the product must be sufficiently implemented for the customer to be able to use it in its operational environment, even if it might not quite meet the specifications. If your final product does not work you will be better off submitting working prototypes. Anything not submitted at submission time cannot be assessed.</p>\n<p>The system must be delivered in a testable form by the due date. Penalties will apply for missing or inaccurate files/documentation submitted with the product (and for inconsistencies between printed and electronic documentation). These penalties will be outlined in the marksheet on blackboard. Penalties apply for not meeting the TP-STD standards - your final product mark will be limited to a maximum of 50%. Your team's printed circuit board(s) (PCBs) <strong>must be manufactured via pinecone</strong> or your final product mark will be limited to a maximum of 50%.</p>\n<p>You will need to submit these PCBs for manufacturing well before the demonstration date (weekly manufacturing runs will occur throughout the semester, and the last possible manufacturing run is at the beginning of week 11 - see pinecone and Blackboard for further details and exact times, and please ensure you plan ahead) in order to receive them in time for submission.</p>\n<p>The product mark will be based mainly on the performance of the product during evaluation. It is very important that your product is functioning correctly during the demonstration session, and that clear instructions are provided as to how the product is operated. However, you may not use operating instructions as a way to require the user to perform more complex/onerous actions than those that are required by the specification.</p>\n<p><strong><em>Consideration of past performance or re-evaluation of the product at a later date will not be available.</em></strong></p>\n<p>Based on staff observation and/or team request and/or the team’s performance in an interim demonstration and/or responses to a peer assessment, the teaching staff may require your team to attend regular meetings with a teaching staff member. This is intended to support teams that are perceived to be struggling in some way. Failure to participate in such meetings will be taken into account during the moderation process and may therefore result in a lower product mark.</p>\n<p>You may appropriately use generative AI tools in completing this task but you must reference every instance of any such use of AI. A failure to reference generative AI use may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The preliminary and intermediate demonstrations will occur during prac sessions in the the allocated lab.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>No late submissions are possible for any manufacturing runs.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Final Report and Reflection",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>5%</dd>",
            "due_date": "<dd><p> 10/11/2025 4:00 pm</p></dd>",
            "learning_objectives": "L05, L06, L08",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The final report will consist of a brief re-statement of the team's roles and an individual summary of the background, methods and results of your work. The report must also address sustainability issues around your design. The report is an individual item of assessment - all parts must be completed individually. You may appropriately use generative AI tools in completing this task but you must reference every instance of any such use of AI. A failure to reference generative AI use may constitute student misconduct under the Student Code of Conduct. </p>\n<p> In addition, a reflection describing your group work experience over the duration of the semester is required. The goal of this part of the assignment is to prompt reflective thoughts about the interactive aspects of the engineering project you have participated in. The reflection is an opportunity for you to consider the inter-personal mechanics of group work, and your experiences working as part of a team, and to document particular challenges you may have faced which did not form part of any technical reports or presentations. </p>\n<ul>\n<li>Discuss what you have learned about how to work in a group.</li>\n<li>Describe what worked well within your group, what did not work well, and why. </li>\n<li>How might you organise team work differently to improve performance? </li>\n<li>If your group had conflicts or problems in working as a team, describe them and give insights into how such problems were resolved, or could be avoided in the future.</li>\n</ul>\n<p> </p>\n<p>This report is not assessed solely on the basis of technical outcomes of the team, but also on the identification of interactions, personality types and organisational tools which formed part of the successes (or failures!) of your team.  </p>\n<p> The document will be submitted through Turnitin on the Blackboard site.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via Blackboard (Turnitin).</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-4",
            "assessment_title": "Assessment of Individual Performance (Formative/incorporated into product mark)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> Formative/incorporated into product mark </dd>",
            "due_date": "<dd><p>Peer assessment 1 25/08/2025 4:00 pm</p>\n<p>Peer assessment 2 22/09/2025 4:00 pm</p>\n<p>Peer assessment 3 27/10/2025 4:00 pm</p></dd>",
            "learning_objectives": "L01, L08",
            "mode": "Activity/ Performance",
            "category": "Participation/ Student contribution, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You will undertake three evaluations of each member of your team through the semester. They, of course, will be evaluating you. The purpose of the first two evaluations is to give formative feedback to all team members on their performance to that point. Results from the third evaluation will be used if moderation takes place (see below).</p>\n<p>The peer assessment scores will not directly moderate the product mark, but may serve as a prompt to teams to request a moderation meeting. The absolute values and trends across the three evaluations may be used as evidence of the team performance of individuals in a moderation meeting.</p>\n<p>The default Peer Assessment Factor (PAF) which will moderate the product mark will be 1.0. If any members of the team wish to change this distribution, a moderation meeting will be required with teaching staff. Students must indicate this intention by email to the course coordinator by 4pm, Friday Week 13. It is recommended that you wait until after your final demonstration to apply for moderation, as moderation meetings cannot be cancelled once requested.</p>\n<p>A moderation meeting will require in-person attendance of all members - once a meeting is scheduled, all members are expected to attend, and if any member does not, all decisions will be made in their absence without their input. Every opportunity will be given to the team to derive an acceptable distribution of PAFs. If no resolution within the meeting is possible, teaching staff will allocate PAFs on the basis of responses to questions, history of performance, demonstrator feedback and marked product. A document describing the moderation process can be found on Blackboard.</p>\n<p>A PAF of 1.0 indicates that you are making a satisfactory/expected contribution to the team. A PAF less than 1.0 indicates your contribution is less than expected. A PAF greater than 1.0 indicates you are contributing more than expected. Failure to complete a formative peer assessment will result in you receiving a PAF of 0.5 for that evaluation, i.e. it will be assumed that your contribution to the team up to that point has been much less than expected.</p>\n<p>Your overall PAF will determine a Product Scaling Factor (PSF) as follows:</p>\n<ul>\n<li>for a team of 4 or 5, PSF = PAF if your PAF is &lt;= 1 and PSF = (1+PAF)/2 if your PAF is &gt; 1</li>\n<li>for a team of 3, PSF = 1.1 * PAF if your PAF is &lt;= 1 and PSF = 1.1*(1+PAF)/2 if your PAF is &gt; 1</li>\n<li>for a team of 2, PSF = 1.25 * PAF if your PAF is &lt;= 1 and PSF = 1.25*(1+PAF)/2 if your PAF is &gt; 1</li>\n</ul>\n<p>All three demo marks will be scaled (multiplied) by this PSF (and then capped at the maximum possible mark where applicable).</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submitted online via the provided tool (Blackboard link will be provided)</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>Submission of formative PAFs at each timepoint is your responsibility. Submission after the due date is not possible, and a lack of submission may be considered negatively toward you in a moderation meeting.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lectures and self-study series</strong><br><p>The lecture series will cover the course structure and organisation, product specifications, project planning, practical electronics and software design relevant to the product in the first few weeks of semester. Lecture notes will be posted on Blackboard and lectures will be recorded. Pre-recorded lectures are available on various topics. Further reading materials are available through tp-info.</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L06, L07</p></div></td>",
            "topic_title": "<strong>Lectures and self-study series</strong>",
            "topic_description": "Lectures and self-study series The lecture series will cover the course structure and organisation, product specifications, project planning, practical electronics and software design relevant to the product in the first few weeks of semester. Lecture notes will be posted on Blackboard and lectures will be recorded. Pre-recorded lectures are available on various topics. Further reading materials are available through tp-info.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Teaching staff consultations</strong><br><p>Online help and feedback provided by teaching staff.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Teaching staff consultations</strong>",
            "topic_description": "Teaching staff consultations Online help and feedback provided by teaching staff.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        }
    ]
}