{
    "course_title": "Introductory French 2",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/FREN1020-60753-7560",
    "full_course_code": "FREN1020-60753-7560",
    "course_code": "FREN1020",
    "class_code": "60753",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "understand and extract the essential information from short recorded passages dealing with [topics covered in the course] that are delivered slowly and clearly (CEFR scale for Listening to Radio, Audio and Recordings, A2)."
        },
        {
            "number": "LO2.",
            "description": "understand short simple texts on familiar matters of a concrete type (CEFR scale for Overall Reading Comprehension, A2)."
        },
        {
            "number": "LO3.",
            "description": "interact with reasonable ease in structured situations and short conversations, provided the other person helps if necessary. [...] manage simple, routine exchanges without undue effort; [...] ask and answer questions and exchange ideas and information on familiar topics in predictable everyday situations (CEFR scale for Overall Spoken Interaction, A2)."
        },
        {
            "number": "LO4.",
            "description": "describe [your] family, living conditions, educational background, present or most recent job. [...] describe people, places and possessions in simple terms (CEFR scale for Sustained Monologue (Spoken Production), A2)."
        },
        {
            "number": "LO5.",
            "description": "write about everyday aspects of [your] environment e.g. people, places, a job or study experience in linked sentences; [...] write very short, basic descriptions of events, past activities and personal experiences (CEFR scale for Creative Writing (Written Production), A2)."
        },
        {
            "number": "LO6.",
            "description": "show some awareness of the culture and cultural practices of French-speaking countries (including terms of address and generic conventions)"
        },
        {
            "number": "LO7.",
            "description": "demonstrate ability to use communication technologies, in French."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Placement Hurdle",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> Hurdle </dd>",
            "due_date": "<dd><p> Week 2, Fri</p></dd>",
            "learning_objectives": "L04, L06, L07",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students must be enrolled in a course appropriate for their level in French.</p>\n<p>If you do not pass this placement hurdle, i.e. your eligiblity for this course has not been confirmed or has been refused, your grade for the course is capped at a 3.</p>\n<p>To pass the hurdle requirement for FREN1020, you have either obtained a grade of at least 4 in the prerequisite FREN1010 or been placed in the course by a member of the French team. (Please note, if you have yet to complete supplementary assessment in FREN1010 at the start of semester, you should still attend class in FREN1020, in order not to fall behind.)</p>\n<ul>\n<li>If you successfully completed FREN1010 in the last two years and have had no extensive additional exposure to French: you do not need to do anything.</li>\n<li>If you have NOT successfully completed FREN1010 in the last two years, or if you have had extensive additional exposure to French since passing FREN1010, please complete the online placement questionnaire. The link at the time of writing is supplied here, however we expect that this platform will be replaced before the start of semester 2. In the first instance, try the following link, if it doesn't work, contact the course co-ordinator for advice. <a href=\"https://courseplacements.languages-cultures.uq.edu.au/\">https://courseplacements.languages-cultures.uq.edu.au/</a></li>\n</ul>\n<p>The result of the placement test will be displayed in Gradebook on the course website.</p>\n<p><strong>Statement on use of Generative AI and Machine Translation</strong></p>\n<p>Completion of this Language Placement Advisor questionnaire is a compliance hurdle requirement in many courses. This requirement aims to ensure that you are placed in the most appropriate language course based on your current level of linguistic proficiency. Your responses, along with the possible submission of a short writing or speaking sample, help us match you to a course that aligns with your previous (formal or informal) language learning experiences and your current level. While this is an unsupervised, individual online task, it is not in your best interest to use generative AI tools or Machine Translation. If the work you submit does not reflect your actual language ability, you may be placed in a course that is not appropriate for your level, which could negatively affect your learning and performance. This may also be considered an act of student misconduct under the UQ Student Code of Conduct due to the misrepresentation of your capabilities.</p>\n<p>Finally, please note that all language courses include at least one assessment task where the use of generative AI or MT tools is either not allowed or of limited value. These assessments are designed to be authentic, challenging, and based on real-time interaction. You will be expected to demonstrate a clear understanding of your own work without the assistance of AI or MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Placement questionnaire, if required. Students who have completed FREN1010 recently do not need to resit the questionnaire.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Video guide",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 12/09/2025 5:00 pm</p>\n<p>\n</p><p>WEEK 7 </p></dd>",
            "learning_objectives": "L04, L06, L07",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Product/ Design",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Task: </strong>Students produce a short informative video on an exact topic to be announced in Week 3, which will relate to giving directions to newcomers to Brisbane. A transcription of the video must also be submitted by the due date. This task covers material from units 5 and 7 of<em> Défi 1 </em>and allows students to demonstrate competence at low A2 level on the <a href=\"https://rm.coe.int/168045bb52\">CEFR scales for Spoken Production</a>. </p>\n<p><strong>Length</strong> : 90 seconds - 120 seconds. (These are the minimum and maximum acceptable lengths: the mark for anything shorter will be penalised proportionally and the marker will not listen beyond the maximum length). </p>\n<p><strong>Format: </strong>There is no need for special effects or captions, just you speaking to the camera, and, by extension, to your audience. The task asks you to speak to camera, not to read a script. </p>\n<ul>\n<li>You submit both your video and a transcription of what you said. If the video and the transcription are not both submitted by the due date/time, the work will be subject to a late penalty.</li>\n</ul>\n<p><strong>Video</strong>: Will be marked according to the criteria sheet, on uptake of the task; delivery; linguistic quality and pronunciation. Instructions for recording and uploading the video will be provided on the course website.</p>\n<p><strong>Transcription</strong>: Will not be marked, but will be used to provide you with detailed feedback on your writing. Please note, a transcription is NOT a script: a transcription is written after you have made the video and notes what you said, with the errors, hesitations and restarts. Instructions for uploading the transcription will be provided on the course website. The document containing the transcription should include, if necessary, a statement as to how Generative AI or Machine Translation have been used in planning the recording.</p>\n<p><strong>Use of Generative AI and Machine Translation</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Both parts of the assignment (video and transcription) should be submitted via links provided on the course website.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "In-class exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 7/10/2025 - 9/10/2025</p>\n<p>\n</p><p>Last hour of class for each group in WEEK 10</p></dd>",
            "learning_objectives": "L01, L02, L05, L06, L07",
            "mode": "Written",
            "category": "Examination, Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This progress exam allows you to demonstrate knowledge of the course content so far (Unités 5, 7 and 8 of <em>Défi 1</em>) and the feedback will help you prepare for the final assessment items in the course, with respect to reading and writing (final exam) and listening comprehension (necessary for the final oral interaction exam). There are two parts: you will manage your own time, but we suggest spending about 15 minutes on part (A) and 40 minutes on part (B), with 5 minutes for checking your work. </p>\n<p>The exam will be undertaken <strong>in class</strong>, using the Inspera platform (see notes below). </p>\n<p><em>Part (A) : Application of knowledge of written French (15%)</em></p>\n<p>Here you demonstrate your competency in relation to structures, verb forms and vocabulary through completing questions such as multiple choice items; gap fills; short answers; matching exercises. Items in the exam will be randomly selected, for each individual student, from a bank of possible questions. This assessment allows you to demonstrate competency at A2 level on the CEFR Language Proficiency Scale for Writing (<a href=\"http://rm.coe.int/CoERMPublicCommonSearchServices/DisplayDCTMContent?documentId=090000168045bb52\">CEFR self assessment grid</a>).</p>\n<p><em>Part (B) : Listening Exam (15%)</em></p>\n<p>You watch a video and answer questions about it (questions include Multiple choice, True/ False, short answer in French).This activity allows you to demonstrate competence at low <a href=\"https://rm.coe.int/168045b15e\">A2 level on the CEFR scale for Listening to Radio, Audio and Recordings</a>. Each sitting of the exam uses a different video. You play the video from your own device and so can control how many times you watch it.</p>\n<p><strong>Exam adjustments</strong>: If the University has recognised your right to exam adjustments, you still need to apply for them to be put in place for this assessment item (see information on Alternative exam arrangements on the UQ website). </p>\n<p><strong>Inspera</strong>: Inspera Assessment is a secure e-assessment platform which you can access from a desktop, laptop or tablet. A phone is unlikely to be large enough to allow you to complete this task. Further details, including an introduction to Inspera functionality, practice opportunities, and where to go for support, are available on the course website.</p>\n<p><strong>Use of Generative AI and Machine Translation</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p><strong>Other permitted materials: </strong>Students may use all course materials, reference texts and online or paper dictionaries. No other person may be consulted during the examination: this should be students' own work.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission occurs during exam time</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>Access to the examination will automatically close.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Exam: Reading comprehension; written production",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>8/11/2025 - 22/11/2025</p></dd>",
            "learning_objectives": "L02, L05, L06, L07",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>This online examination is completed as a scheduled, timed, examination hosted on the Inspera platform and linked to Blackboard. </strong>You can sit the exam wherever you like (please contact the Course Co-ordinator if you cannot organise a quiet space to do the examination and would like to use a classroom, and she will book a room for you and others in the same situation).</p>\n<p>There are two parts:</p>\n<ul>\n<li><strong>Part One:</strong> Reading comprehension. (15 %). Students read a text in French and answer a set of questions in French (including, but not limited to: multiple choice, true / false, short answer in French, copy information from the text). This allows students to demonstrate competence at low A2 level on the CEFR scale for Reading Comprehension. </li>\n<li><strong>Part Two:</strong> Written production. (15%). Students write a short text in French (110 words plus/ minus 10%, i.e. 100 - 120). The mark for a text which is too short will be reduced proportionally and the marker will not read beyond the maximum length.  This allows students to demonstrate competence at low A2 level on the CEFR scale for Written Production.</li>\n<li>The text will be marked according to the assessment criteria available on Blackboard and embedded in the exam itself, on: meeting task requirements; reuse and variety of language studied in the course; linguistic accuracy.</li>\n</ul>\n<p><strong>Working time</strong>: <em>In addition to the two hours working time, there are 10 minutes additional time for planning, settling and submitting. You may also use these 10 minutes to work on the exam. After 2 hours and 10 minutes, access to the exam will close.</em></p>\n<p><strong>Sitting at an alternative time</strong>: To see how to apply to sit this exam at a different time, please see <em>'Deferral' </em>section below.</p>\n<p><strong>Exam adjustments:</strong> Please note, if you have an approved set of exam adjustments (<a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/alternative-exam-arrangements\">Alternative Exam Arrangements</a>), you still need to submit a request that they be applied for this exam.</p>\n<p><strong>Inspera:</strong> This examination will be delivered via Inspera. Further details, including an introduction to Inspera functionality, practice opportunities, and where to go for support, will be provided on the Blackboard site for this course in Week 1 of the semester.</p>\n<p><strong>Use of Generative AI</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students may be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<p><strong>Other permitted materials: </strong>Students may use all course materials, reference texts and online or paper dictionaries. No other person may be consulted during the examination: this should be students' own work.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>On Inspera.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>Access to the examination will automatically close.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-4",
            "assessment_title": "Oral interaction (Conversation)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>20% Hurdle </dd>",
            "due_date": "<dd><p> 10/11/2025 - 21/11/2025</p>\n<p>\n</p><p>End of Semester Exam Period. Students will sign up in pairs for their timeslot. The student's assigned timeslot will be considered the due date and time for this assessment. Interview sessions will be scheduled during the final exam period.</p></dd>",
            "learning_objectives": "L03, L06",
            "mode": "Activity/ Performance, Oral",
            "category": "Practical/ Demonstration",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>This assessment item takes the form of a partially improvised conversation between two students and two members of staff, on a specified topic. The topic will be published at the end of Week 10. This task allows you to demonstrate competence at low A2 level on the </strong><a href=\"https://rm.coe.int/168045bb52\"><strong>CEFR scale for Spoken Interaction</strong></a><strong>. </strong></p>\n<ul>\n<li>The discussion lasts 4 minutes per student, i.e. <strong>8 minutes per group of two; (or, if you need to work in a group of three, 12 minutes)</strong>. The mark for a contribution which is too short will be reduced proportionally. </li>\n<li><strong>This is a group discussion, but students are marked individually.</strong> <em>We understand that group work may be challenging. If you have concerns, please talk to your lecturer or the course co-ordinator who will try to help you find a solution fair to all parties. </em>The only students that can carry out this task as individuals are:</li>\n<li>those have an agreement with Diversity, Disability and Inclusion Services exempting them from group work;</li>\n<li>those have attended less than 50% of classes up to the end of Week 10: in this case the exemption is for the benefit of other students in the cohort, so that they do not have to work with an under-prepared team member. </li>\n<li>The speaking task will be scheduled during the final exam period, after the publication of the exam timetable (when students know what their exams will be). </li>\n<li>The orals will be video-recorded so that there is a record of your performance. <em>The recordings will be retained for 12 months on a secure UQ system in accordance with UQ policy specifically </em><a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\"><em>Assessment procedure (86)</em></a><em> Access to recordings will be limited to the relevant School, Faculty and Student &amp; Academic Services staff, and only accessed for the purpose of reviewing recordings in the event of issues or concerns raised regarding the task.</em></li>\n</ul>\n<p><strong>Use of Generative AI and Machine Translation: </strong> </p>\n<ul>\n<li>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted in the oral venue. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct. <em>You may however find it useful to use these tools to plan and practice for your oral, for example, looking up vocabulary, checking pronunciation, generating possible questions which you might be asked. Remember that this assessment item is about participation in a conversation, NOT about performing a script. </em></li>\n<li><strong><em>The ability to participate in a conversation in French on a familiar topic is arguably one of the most important outcomes of the course. This importance is reflected in the fact that this is an Identity Verified Assessment Hurdle. You need to undertake this task and get at least 40% on it (i.e. at least 8/20) in order to pass this course. Without a mark of at least 8 for this oral interaction task, you cannot get a grade higher than a 3.</em></strong></li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>This is an in-person conversation with staff and peers.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 3(28 Jul - 17 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semaines 1 - 3 Défi 1 Unité 5 : Weeks 1 - 3 Défi 1 Unit 5 </strong><br><p> <em>Défi 1 Unité 5 </em>and related activities. The Blackboard site provides a guide to the exact work, to preparation and to homework.</p>\n<p>Ces premières semaines après les vacances, qu'est-ce que nous allons faire ?</p>\n<ul>\n<li>Vous allez réveiller le français que vous connaissez déjà.</li>\n<li>Vous allez apprendre à parler du temps et de l'heure : de votre routine ; des jours, des mois, des saisons; des activités typiques.</li>\n<li>Vous allez apprendre de nouveaux verbes et une nouvelle <strong>forme</strong> verbale.</li>\n</ul>\n<p><em>In these first weeks after the break, in addition to reactivating the French you already know, you’ll be learning how to talk about time: how you organise your schedule; vocabulary for days, months and seasons; and vocabulary for the kinds of activities that happen at different times of the day.</em></p>\n<p><em>You will also learn some new verbs — and a new verb </em><strong><em>form</em></strong><em>.</em></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Semaines 1 - 3 Défi 1 Unité 5 : Weeks 1 - 3 Défi 1 Unit 5 </strong>",
            "topic_description": "Semaines 1 - 3 Défi 1 Unité 5 : Weeks 1 - 3 Défi 1 Unit 5 Défi 1 Unité 5 and related activities. The Blackboard site provides a guide to the exact work, to preparation and to homework. Ces premières semaines après les vacances, qu'est-ce que nous allons faire ? Vous allez réveiller le français que vous connaissez déjà. Vous allez apprendre à parler du temps et de l'heure : de votre routine ; des jours, des mois, des saisons; des activités typiques. Vous allez apprendre de nouveaux verbes et une nouvelle forme verbale. In these first weeks after the break, in addition to reactivating the French you already know, you’ll be learning how to talk about time: how you organise your schedule; vocabulary for days, months and seasons; and vocabulary for the kinds of activities that happen at different times of the day. You will also learn some new verbs — and a new verb form .",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 4 To Week 6(18 Aug - 07 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semaines 4 - 6 Défi 1 Unité 7 / Weeks 4 - 6 Défi 1 Unit 7</strong><br><p>Défi 1 Unit 7 and related activities. The Blackboard site provides a guide to the exact work, to preparation and to homework.</p>\n<p>Dans l'Unité 7, vous allez apprendre à décrire une ville :</p>\n<ul>\n<li>ce qu'on peut y trouver</li>\n<li>comment s'y déplacer</li>\n<li>où y faire des achats</li>\n</ul>\n<p>En plus, vous allez apprendre de nouveaux points linguistiques :</p>\n<ul>\n<li>comment donner des consignes</li>\n<li>comment parler du futur</li>\n<li>comment utiliser des pronoms pour se répéter moins</li>\n</ul>\n<p><em>In chapter 7 you will be learning how to describe a city:</em></p>\n<ul>\n<li><em>what you will find there</em></li>\n<li><em>how to get around it</em></li>\n<li><em>where you might go shopping</em></li>\n</ul>\n<p><em>as well as some important new grammar points: </em></p>\n<ul>\n<li><em>how to give instructions</em></li>\n<li><em>how to talk about the future</em></li>\n<li><em>how to use a new set of pronouns to be less repetitive </em></li>\n</ul>\n<p><br/></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Semaines 4 - 6 Défi 1 Unité 7 / Weeks 4 - 6 Défi 1 Unit 7</strong>",
            "topic_description": "Semaines 4 - 6 Défi 1 Unité 7 / Weeks 4 - 6 Défi 1 Unit 7 Défi 1 Unit 7 and related activities. The Blackboard site provides a guide to the exact work, to preparation and to homework. Dans l'Unité 7, vous allez apprendre à décrire une ville : ce qu'on peut y trouver comment s'y déplacer où y faire des achats En plus, vous allez apprendre de nouveaux points linguistiques : comment donner des consignes comment parler du futur comment utiliser des pronoms pour se répéter moins In chapter 7 you will be learning how to describe a city: what you will find there how to get around it where you might go shopping as well as some important new grammar points: how to give instructions how to talk about the future how to use a new set of pronouns to be less repetitive",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 7 To Week 10(08 Sep - 12 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semaines 7 - 10 Défi 1 Unité 8/ Weeks 7 - 10 Défi 1 Unit 8</strong><br><p>Défi 1 Unit 8 and related activities. The Blackboard site provides a guide to the exact work to preparation and to homework.</p>\n<p>Vous êtes déjà au milieu du semestre !</p>\n<p>Dans cette unité</p>\n<ul>\n<li>vous allez apprendre à parler de la nourriture et de la cuisine</li>\n<li>vous allez apprendre votre premier temps du passé en français- soudainement vous allez pouvoir faire beaucoup plus !</li>\n</ul>\n<p><em>In this unit you will learn to talk about food and cooking, and you will learn some very important new grammar: your first past tense in French. Suddenly you are going to be able to do so much more!</em></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Semaines 7 - 10 Défi 1 Unité 8/ Weeks 7 - 10 Défi 1 Unit 8</strong>",
            "topic_description": "Semaines 7 - 10 Défi 1 Unité 8/ Weeks 7 - 10 Défi 1 Unit 8 Défi 1 Unit 8 and related activities. The Blackboard site provides a guide to the exact work to preparation and to homework. Vous êtes déjà au milieu du semestre ! Dans cette unité vous allez apprendre à parler de la nourriture et de la cuisine vous allez apprendre votre premier temps du passé en français- soudainement vous allez pouvoir faire beaucoup plus ! In this unit you will learn to talk about food and cooking, and you will learn some very important new grammar: your first past tense in French. Suddenly you are going to be able to do so much more!",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 11 To Week 12(13 Oct - 26 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semaines 11 - 12 Défi 1 Unité 6/ Weeks 11 - 12 Défi Unit 6</strong><br><p>Défi 1 Unit 8 and related activities. The Blackboard site provides a guide to the exact work, to preparation and to homework.</p>\n<p>Nous allons parler </p>\n<ul>\n<li>des loisirs</li>\n<li>de l'amitié</li>\n<li>des traits de caractère</li>\n</ul>\n<p>Nous allons travailler les structures nécessaires pour justifier une conclusion ou un raisonnement.</p>\n<p><em>We will talk about </em></p>\n<ul>\n<li><em>leisure activities</em></li>\n<li><em>friendship</em></li>\n<li><em>character traits</em></li>\n</ul>\n<p><em>We will work on structures needed to justify a conclusion or an argument. </em></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Semaines 11 - 12 Défi 1 Unité 6/ Weeks 11 - 12 Défi Unit 6</strong>",
            "topic_description": "Semaines 11 - 12 Défi 1 Unité 6/ Weeks 11 - 12 Défi Unit 6 Défi 1 Unit 8 and related activities. The Blackboard site provides a guide to the exact work, to preparation and to homework. Nous allons parler des loisirs de l'amitié des traits de caractère Nous allons travailler les structures nécessaires pour justifier une conclusion ou un raisonnement. We will talk about leisure activities friendship character traits We will work on structures needed to justify a conclusion or an argument.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 13(27 Oct - 02 Nov)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semaine 13 Révision et regard vers l'avenir / Week 13 and looking forward </strong><br><p>The Blackboard site provides a guide to the exact work, to preparation and to homework.</p>\n<p>Cette semaine : </p>\n<ul>\n<li>Nous allons réviser le travail du semestre pour vous préparer aux examens. </li>\n<li>Nous allons aussi lire des offres d'emploi et parler de la façon dont vous pouvez utiliser votre français maintenant et à l'avenir.</li>\n</ul>\n<p><em>We will revise the semester's work to prepare you for the exams.</em></p>\n<p><em>We will also read job advertisements and talk about how you can use your French now and in the future. </em></p>\n<p><br/></p>\n<p><br/></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Semaine 13 Révision et regard vers l'avenir / Week 13 and looking forward </strong>",
            "topic_description": "Semaine 13 Révision et regard vers l'avenir / Week 13 and looking forward The Blackboard site provides a guide to the exact work, to preparation and to homework. Cette semaine : Nous allons réviser le travail du semestre pour vous préparer aux examens. Nous allons aussi lire des offres d'emploi et parler de la façon dont vous pouvez utiliser votre français maintenant et à l'avenir. We will revise the semester's work to prepare you for the exams. We will also read job advertisements and talk about how you can use your French now and in the future.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        }
    ]
}