{
    "course_title": "First Nations Studies",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/HMST3191-60585-7560",
    "full_course_code": "HMST3191-60585-7560",
    "course_code": "HMST3191",
    "class_code": "60585",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Express an awareness and understanding of Aboriginal and Torres Strait Islander identities, histories and cultures."
        },
        {
            "number": "LO2.",
            "description": "Understand the challenges facing Aboriginal and Torres Strait Islander peoples in the health and/or education sector."
        },
        {
            "number": "LO3.",
            "description": "Work responsively and effectively with Aboriginal and Torres Strait Islander peoples in the health and/or education sectors."
        },
        {
            "number": "LO4.",
            "description": "Work effectively within a student team to develop communication and process management skills, and facilitate peer-assisted collaborative learning"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Online Quiz",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p> 15/08/2025 2:00 pm</p>\n<p>\n</p><p>Completed online during timetabled exam 1 activity. </p></dd>",
            "learning_objectives": "L01",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The <strong>Week 3 Quiz</strong> is your chance to check in, test your knowledge, and show how well you're engaging with the course so far! Covering content from lectures, readings, and workshops, the quiz will help you stay on track and build confidence early in the semester.</p>\n<p>You’ll complete <strong>10 questions</strong> in <strong>10 minutes</strong>, so be ready to think fast and apply what you’ve learned. </p>\n<p>Please note that it is relatively common for computer problems to occur on personal systems or with the online system. It can be very difficult to document some problems, which makes it impossible for the us to take these into account. You must complete your quiz during the allocated time - so that you have time to successfully resolve any problems that might occur.</p>\n<p>The quiz will consist of Multiple Choice Questions on the content covered in weeks 1 and 2. </p>\n<p><strong>Use of generative Artificial Intelligence (AI) or Machine Translation (MT) </strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>To be completed as an online quiz via the course Blackboard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>Exams submitted after the end of the submission time will incur a <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/requesting-late-penalty-exemption-online-exam\">late penalty</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "In-Semester Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 23/09/2025</p>\n<p>\n</p><p>Completed in-person during timetabled exam 2 activity. </p></dd>",
            "learning_objectives": "L01, L02",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The <strong>In-Semester Examination</strong> is your opportunity to demonstrate what you’ve learned so far — and to build momentum for the rest of the course!</p>\n<p>You’ll have <strong>60 minutes</strong> to tackle <strong>60 multiple-choice questions,</strong> all designed to challenge your understanding and sharpen your ability to apply course concepts.</p>\n<p>Covering content and readings from <strong>Weeks 1 to 8</strong>, as well as material explored in workshops, this assessment is a great chance to reflect on your progress, reinforce your learning, and show what you know.</p>\n<p><strong>Use of generative Artificial Intelligence (AI) or Machine Translation (MT) </strong></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Oral Presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 7/10/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will have the opportunity to powerfully articulate their own professional standpoint and reflect on how their values, experiences, and identities shape their approach to working in partnership with Aboriginal and Torres Strait Islander peoples. Drawing on the rich learning from previous weeks—including readings, discussions, and culturally responsive content—students will explore how their chosen profession can contribute to culturally safe and responsive practice. This reflection will be grounded in key theoretical frameworks such as Indigenous Standpoint Theory, Critical Race Theory, and Insider/Outsider Theory, with space to integrate other relevant lenses. This is a chance for students to deepen their critical thinking, connect theory to practice, and strengthen their capability to lead with integrity, respect, and cultural humility in diverse professional settings.</p>\n<p>Students will complete this assessment working in small collaborative groups of no more than three people. This dynamic setting will support peer learning and create a safe, reflective space to explore and articulate individual and shared professional standpoints. Each group will engage in critical discussion around their positionality, professional identity, and the application of key theories, including Indigenous Standpoint Theory, Critical Race Theory, and Insider/Outsider Theory, applying these to their future practice. The group format encourages respectful dialogue, collective insight, and diverse perspectives, enriching each student’s understanding of how to work in partnership with Aboriginal and Torres Strait Islander peoples. Students will present their culturally responsive insights within the group context, ensuring personal voice and agency are central to the task.</p>\n<p>Students must present in their groups for between 10 to 12 minutes. Any content that extends beyond 12 minutes will not be assessed.</p>\n<p>Student are required to submit their presentation recorded on video with their faces and slides clearly visible, such as through Zoom or Microsoft Teams. Audio must be high quality with no distortion. Lighting must be appropriate for presentation to allow easy identification. Videos will be submitted through the link provided in the Assessment tab on Learn.UQ.</p>\n<p>Students can use a slide show to aid their presentation. Student are discouraged from relying on notes during their presentation.</p>\n<p><strong>Use of generative Artificial Intelligence (AI) or Machine Translation (MT) </strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>To be submitted via the relevant submission portal on the course Blackboard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Final Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>8/11/2025 - 22/11/2025</p></dd>",
            "learning_objectives": "L02, L03",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The <strong>Final Examination</strong> will give you the chance to showcase everything you’ve learned across the semester.</p>\n<p>You’ll have <strong>60 minutes</strong> to complete <strong>60 multiple-choice questions</strong> all designed to assess your understanding of key concepts, critical thinking, and application of theory to practice.</p>\n<p>The exam will draw on material covered from <strong>Weeks 1 to 13</strong>, including lectures, readings, and workshop activities available through Learn.UQ. This is your opportunity to demonstrate your growth, insight, and readiness to apply your knowledge in real-world professional contexts.</p>\n<p><strong>Use of generative Artificial Intelligence (AI) or Machine Translation (MT) </strong></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(28 Jul - 03 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Constructing Identity</strong><br/><p>In <strong>Week 1</strong>, there will be <strong>no scheduled face-to-face workshop</strong> giving students the opportunity to fully immerse themselves in the <strong>online content</strong> provided through <strong>Learn.UQ</strong>. This content introduces key themes such as identity, sovereignty, and social identity theory, which lay the foundation for culturally responsive practice. Students are expected to engage actively with the online lectures, readings, and learning materials during this week to prepare for future in-class discussions and assessments. Starting strong in Week 1 will help you build a deeper understanding of the course and give you a solid base for the semester ahead—so dive in, reflect critically, and come prepared to connect your learning to practice!</p></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Constructing Identity</strong>",
            "topic_description": "Constructing Identity In Week 1 , there will be no scheduled face-to-face workshop giving students the opportunity to fully immerse themselves in the online content provided through Learn.UQ . This content introduces key themes such as identity, sovereignty, and social identity theory, which lay the foundation for culturally responsive practice. Students are expected to engage actively with the online lectures, readings, and learning materials during this week to prepare for future in-class discussions and assessments. Starting strong in Week 1 will help you build a deeper understanding of the course and give you a solid base for the semester ahead—so dive in, reflect critically, and come prepared to connect your learning to practice!",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Historical Perspectives 1</strong><br/><p><strong>Week 2: Historical Perspectives and the Impact of Colonisation</strong></p>\n<p>This week explores the historical foundations that continue to shape the lived experiences of Aboriginal and Torres Strait Islander peoples today. Key lecture topics include <strong>invasion, protection, assimilation</strong>, and the ongoing <strong>impacts of colonisation</strong> on health, identity, and education. Through engaging with these themes, students will begin to unpack how history informs contemporary practice and professional responsibilities.</p>\n<p><strong>Workshop Focus:</strong></p>\n<p>In the workshop, students will critically examine the legacies of colonial policies and systems, and how these intersect with their future roles in sport, health, education, and nutrition. The session will include reflective activities that encourage students to locate themselves in relation to this history, build awareness of structural inequities, and consider how to approach their professional practice with cultural humility and historical consciousness. This workshop is a foundational step toward developing culturally safe and responsive approaches in partnership with Aboriginal and Torres Strait Islander communities.</p></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Historical Perspectives 1</strong>",
            "topic_description": "Historical Perspectives 1 Week 2: Historical Perspectives and the Impact of Colonisation This week explores the historical foundations that continue to shape the lived experiences of Aboriginal and Torres Strait Islander peoples today. Key lecture topics include invasion, protection, assimilation , and the ongoing impacts of colonisation on health, identity, and education. Through engaging with these themes, students will begin to unpack how history informs contemporary practice and professional responsibilities. Workshop Focus: In the workshop, students will critically examine the legacies of colonial policies and systems, and how these intersect with their future roles in sport, health, education, and nutrition. The session will include reflective activities that encourage students to locate themselves in relation to this history, build awareness of structural inequities, and consider how to approach their professional practice with cultural humility and historical consciousness. This workshop is a foundational step toward developing culturally safe and responsive approaches in partnership with Aboriginal and Torres Strait Islander communities.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Behaviour Change and Locating Self </strong><br/><p><strong>Week 3: Behaviour Change and Locating Self in Practice</strong></p>\n<p>This week introduces key frameworks for understanding <strong>behaviour change</strong> in the context of working with Aboriginal and Torres Strait Islander peoples. Students will explore models such as <strong>Bronfenbrenner’s ecological systems theory</strong>, <strong>Ring Theory of Personhood</strong>, and culturally grounded approaches to <strong>First Nations behaviour change</strong>. The concept of <strong>locating oneself</strong>—understanding one’s own values, cultural background, and position—is central to the week's learning and sets the foundation for reflexive and relational practice.</p>\n<p>Students will begin the process of <strong>self-location</strong>, exploring how their personal and professional identities influence their interactions with others. Through guided reflection and group discussion, students will connect theoretical models of behaviour change to real-world examples and start to identify how they can approach their profession in culturally responsive ways. This session also includes the <strong>in-class Quiz (Assessment Item 1)</strong>, which allows students to test their understanding of the course content and readings covered so fa</p></p><p><strong>Learning outcomes:</strong> L02</p></div></td>",
            "topic_title": "<strong>Behaviour Change and Locating Self </strong>",
            "topic_description": "Behaviour Change and Locating Self Week 3: Behaviour Change and Locating Self in Practice This week introduces key frameworks for understanding behaviour change in the context of working with Aboriginal and Torres Strait Islander peoples. Students will explore models such as Bronfenbrenner’s ecological systems theory , Ring Theory of Personhood , and culturally grounded approaches to First Nations behaviour change . The concept of locating oneself —understanding one’s own values, cultural background, and position—is central to the week's learning and sets the foundation for reflexive and relational practice. Students will begin the process of self-location , exploring how their personal and professional identities influence their interactions with others. Through guided reflection and group discussion, students will connect theoretical models of behaviour change to real-world examples and start to identify how they can approach their profession in culturally responsive ways. This session also includes the in-class Quiz (Assessment Item 1) , which allows students to test their understanding of the course content and readings covered so fa",
            "learning_outcomes": [
                "L02"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Writing Reflexivity </strong><br/><p><strong>Week 4: Writing Reflexivity and Values-Based Partnerships</strong></p>\n<p> This week centres on the critical skill of <strong>reflexivity</strong>—the ability to examine your own beliefs, values, and assumptions in the context of your professional practice. Students will be introduced to <strong>reflexivity theory</strong>, the <strong>role of self</strong> in culturally responsive work, and the importance of forming <strong>values-based partnerships</strong> with Aboriginal and Torres Strait Islander peoples. The concept of <strong>deep looking</strong> is introduced as a way of developing greater self-awareness and relational accountability.</p>\n<p><strong>Workshop Focus:</strong></p>\n<p> In this week’s workshop, students will engage in practical strategies to begin writing about their own reflexivity and cultural standpoint. Activities will guide students through identifying how their experiences and values shape the way they interact in professional settings. Through discussion and peer feedback, students will develop confidence in articulating their positionality and reflect on what it means to work in respectful, strengths-based partnership with First Nations communities. This workshop prepares students for upcoming assessments where reflexive writing is a key component.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Writing Reflexivity </strong>",
            "topic_description": "Writing Reflexivity Week 4: Writing Reflexivity and Values-Based Partnerships This week centres on the critical skill of reflexivity —the ability to examine your own beliefs, values, and assumptions in the context of your professional practice. Students will be introduced to reflexivity theory , the role of self in culturally responsive work, and the importance of forming values-based partnerships with Aboriginal and Torres Strait Islander peoples. The concept of deep looking is introduced as a way of developing greater self-awareness and relational accountability. Workshop Focus: In this week’s workshop, students will engage in practical strategies to begin writing about their own reflexivity and cultural standpoint. Activities will guide students through identifying how their experiences and values shape the way they interact in professional settings. Through discussion and peer feedback, students will develop confidence in articulating their positionality and reflect on what it means to work in respectful, strengths-based partnership with First Nations communities. This workshop prepares students for upcoming assessments where reflexive writing is a key component.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 5(25 Aug - 31 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Trauma-Informed Practice </strong><br/><p><strong>Week 5: Trauma-Informed and Neuro-Informed Practice</strong></p>\n<p>This week introduces students to <strong>trauma-informed</strong> and <strong>neuro-informed</strong> approaches when working with Aboriginal and Torres Strait Islander peoples. Drawing on national and international frameworks—including <strong>SAMHSA</strong> and Indigenous-led models—students will explore the theories that underpin culturally safe engagement in contexts where intergenerational trauma, systemic disadvantage, and resilience intersect. Emphasis is placed on understanding trauma not as an individual deficit, but within broader social, cultural, and historical contexts.</p>\n<p>Students will focus on applying trauma-informed principles to real-world professional scenarios in sport, health, education, and nutrition. Students will explore how safety, trust, empowerment, and cultural connection form the foundation of effective practice. Through group work and guided reflection, students will critically examine how their professional behaviours and environments can either support or undermine healing and wellbeing. This session deepens students’ understanding of relational practice and prepares them to implement more responsive and respectful approaches in future roles.</p></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Trauma-Informed Practice </strong>",
            "topic_description": "Trauma-Informed Practice Week 5: Trauma-Informed and Neuro-Informed Practice This week introduces students to trauma-informed and neuro-informed approaches when working with Aboriginal and Torres Strait Islander peoples. Drawing on national and international frameworks—including SAMHSA and Indigenous-led models—students will explore the theories that underpin culturally safe engagement in contexts where intergenerational trauma, systemic disadvantage, and resilience intersect. Emphasis is placed on understanding trauma not as an individual deficit, but within broader social, cultural, and historical contexts. Students will focus on applying trauma-informed principles to real-world professional scenarios in sport, health, education, and nutrition. Students will explore how safety, trust, empowerment, and cultural connection form the foundation of effective practice. Through group work and guided reflection, students will critically examine how their professional behaviours and environments can either support or undermine healing and wellbeing. This session deepens students’ understanding of relational practice and prepares them to implement more responsive and respectful approaches in future roles.",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 6(01 Sep - 07 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Culturally Responsive Practice </strong><br/><p><strong>Week 6: Culturally Responsive Practice and Deep Listening</strong></p>\n<p> This week focuses on developing a strong foundation in <strong>culturally responsive practice</strong>, exploring the principles of <strong>cultural safety</strong>, <strong>models of engagement</strong>, and the transformative power of <strong>Deep Listening (Dadirri)</strong>. Students will examine how culturally responsive approaches are co-created with communities, and how respectful, relational practice can foster trust, collaboration, and meaningful outcomes for Aboriginal and Torres Strait Islander peoples.</p>\n<p><strong>Workshop Focus:</strong></p>\n<p> In the workshop, students will engage in experiential learning activities that encourage the practice of <strong>deep listening</strong>—listening with the heart and without interruption or judgement. Students will reflect on how cultural responsiveness can be embedded into their everyday professional roles and consider the barriers and enablers to culturally safe engagement. Group discussions and case studies will support students in identifying practical strategies for working in partnership with First Nations communities, and further develop the critical reflexivity required for culturally grounded practice.</p></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Culturally Responsive Practice </strong>",
            "topic_description": "Culturally Responsive Practice Week 6: Culturally Responsive Practice and Deep Listening This week focuses on developing a strong foundation in culturally responsive practice , exploring the principles of cultural safety , models of engagement , and the transformative power of Deep Listening (Dadirri) . Students will examine how culturally responsive approaches are co-created with communities, and how respectful, relational practice can foster trust, collaboration, and meaningful outcomes for Aboriginal and Torres Strait Islander peoples. Workshop Focus: In the workshop, students will engage in experiential learning activities that encourage the practice of deep listening —listening with the heart and without interruption or judgement. Students will reflect on how cultural responsiveness can be embedded into their everyday professional roles and consider the barriers and enablers to culturally safe engagement. Group discussions and case studies will support students in identifying practical strategies for working in partnership with First Nations communities, and further develop the critical reflexivity required for culturally grounded practice.",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 7(08 Sep - 14 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Rights-based Health </strong><br/><p><strong>Week 7: Rights-Based Approaches to Health and Wellbeing</strong></p>\n<p>This week explores the significance of <strong>rights-based frameworks</strong> in advancing health equity for Aboriginal and Torres Strait Islander peoples. Students will examine concepts of <strong>self-determination</strong>, <strong>human rights</strong>, and <strong>community-controlled health</strong>, alongside key instruments such as the <strong>United Nations Declaration on the Rights of Indigenous Peoples (UNDRIP)</strong>. The week highlights how embedding rights into practice supports justice, empowerment, and long-term wellbeing.</p>\n<p>Students will apply rights-based thinking to professional scenarios across health, sport, education, and nutrition. They will explore how acknowledging and upholding the rights of Aboriginal and Torres Strait Islander peoples transforms service delivery and strengthens community partnerships. Through collaborative discussion and critical reflection, students will consider how their own discipline can contribute to systemic change, and how aligning their practice with self-determination and equity can lead to more ethical and impactful outcomes.</p></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Rights-based Health </strong>",
            "topic_description": "Rights-based Health Week 7: Rights-Based Approaches to Health and Wellbeing This week explores the significance of rights-based frameworks in advancing health equity for Aboriginal and Torres Strait Islander peoples. Students will examine concepts of self-determination , human rights , and community-controlled health , alongside key instruments such as the United Nations Declaration on the Rights of Indigenous Peoples (UNDRIP) . The week highlights how embedding rights into practice supports justice, empowerment, and long-term wellbeing. Students will apply rights-based thinking to professional scenarios across health, sport, education, and nutrition. They will explore how acknowledging and upholding the rights of Aboriginal and Torres Strait Islander peoples transforms service delivery and strengthens community partnerships. Through collaborative discussion and critical reflection, students will consider how their own discipline can contribute to systemic change, and how aligning their practice with self-determination and equity can lead to more ethical and impactful outcomes.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ethics of Engagement </strong><br/><p><strong>Week 8: Ethics Behind Engagement</strong></p>\n<p> This week focuses on the ethical foundations of working with Aboriginal and Torres Strait Islander peoples and communities. Students will explore the <strong>AIATSIS Code of Ethics</strong>, the <strong>NHMRC Ethical Guidelines</strong>, and principles of <strong>culturally responsive ethics in practice</strong>. The week highlights the importance of ethical engagement that is grounded in respect, reciprocity, accountability, and Indigenous leadership in research, health, and education settings.</p>\n<p><strong>Workshop Focus:</strong></p>\n<p> In the workshop, students will critically engage with real-world ethical dilemmas and case studies that challenge them to think deeply about power, consent, and community benefit. Through group activities, students will explore what it means to uphold ethical standards that centre Indigenous voices and values, and consider how to navigate the complexities of working in culturally diverse and historically impacted contexts. This session reinforces the importance of ethical integrity as a cornerstone of culturally safe and responsive professional practice.</p></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Ethics of Engagement </strong>",
            "topic_description": "Ethics of Engagement Week 8: Ethics Behind Engagement This week focuses on the ethical foundations of working with Aboriginal and Torres Strait Islander peoples and communities. Students will explore the AIATSIS Code of Ethics , the NHMRC Ethical Guidelines , and principles of culturally responsive ethics in practice . The week highlights the importance of ethical engagement that is grounded in respect, reciprocity, accountability, and Indigenous leadership in research, health, and education settings. Workshop Focus: In the workshop, students will critically engage with real-world ethical dilemmas and case studies that challenge them to think deeply about power, consent, and community benefit. Through group activities, students will explore what it means to uphold ethical standards that centre Indigenous voices and values, and consider how to navigate the complexities of working in culturally diverse and historically impacted contexts. This session reinforces the importance of ethical integrity as a cornerstone of culturally safe and responsive professional practice.",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Reconciliation Agenda </strong><br/><p><strong>Week 9: Reconciliation and Social Justice</strong></p>\n<p>This week delves into the national <strong>Reconciliation agenda</strong>, exploring its relationship to <strong>social justice</strong>, <strong>truth-telling</strong>, and the role of <strong>Reconciliation Action Plans (RAPs)</strong> across institutions and sectors. Students will engage with the importance of historical truth, acknowledgment, and reparative action in creating a more equitable future. The concept of <strong>yarning</strong> is also introduced as a culturally grounded method of communication that supports relationship-building and shared understanding.</p>\n<p>Students will reflect on their role in advancing reconciliation within their chosen profession. Through yarning circles and collaborative dialogue, they will explore how social justice principles can be translated into everyday practice, and how to engage meaningfully with RAPs and community-led reconciliation initiatives. The session encourages students to think critically about institutional responsibility, personal accountability, and how they can contribute to a more just and inclusive Australia through culturally responsive and relational practice.</p></p><p><strong>Learning outcomes:</strong> L02</p></div></td>",
            "topic_title": "<strong>Reconciliation Agenda </strong>",
            "topic_description": "Reconciliation Agenda Week 9: Reconciliation and Social Justice This week delves into the national Reconciliation agenda , exploring its relationship to social justice , truth-telling , and the role of Reconciliation Action Plans (RAPs) across institutions and sectors. Students will engage with the importance of historical truth, acknowledgment, and reparative action in creating a more equitable future. The concept of yarning is also introduced as a culturally grounded method of communication that supports relationship-building and shared understanding. Students will reflect on their role in advancing reconciliation within their chosen profession. Through yarning circles and collaborative dialogue, they will explore how social justice principles can be translated into everyday practice, and how to engage meaningfully with RAPs and community-led reconciliation initiatives. The session encourages students to think critically about institutional responsibility, personal accountability, and how they can contribute to a more just and inclusive Australia through culturally responsive and relational practice.",
            "learning_outcomes": [
                "L02"
            ]
        },
        {
            "learning_period": "Week 10(06 Oct - 12 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>First Nations Policy </strong><br/><p><strong>Week 10: First Nations Policy and Professional Practice</strong></p>\n<p>This week explores the role of <strong>policy</strong> in shaping outcomes for Aboriginal and Torres Strait Islander peoples, with a particular focus on <strong>Closing the Gap targets</strong>, the intersection of <strong>sport and policy</strong>, and how national strategies influence professional practice. Students will critically examine the effectiveness of current approaches and reflect on how policy frameworks can support self-determination and culturally safe service delivery.</p></p><p><strong>Learning outcomes:</strong> L02</p></div></td>",
            "topic_title": "<strong>First Nations Policy </strong>",
            "topic_description": "First Nations Policy Week 10: First Nations Policy and Professional Practice This week explores the role of policy in shaping outcomes for Aboriginal and Torres Strait Islander peoples, with a particular focus on Closing the Gap targets , the intersection of sport and policy , and how national strategies influence professional practice. Students will critically examine the effectiveness of current approaches and reflect on how policy frameworks can support self-determination and culturally safe service delivery.",
            "learning_outcomes": [
                "L02"
            ]
        },
        {
            "learning_period": "Week 11(13 Oct - 19 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Determinants of Health </strong><br/><p><strong>Week 11: Determinants of Health – Social, Cultural, and Structural</strong></p>\n<p>This week focuses on the <strong>social</strong>, <strong>cultural</strong>, and <strong>structural determinants of health</strong> that shape the wellbeing of Aboriginal and Torres Strait Islander peoples. Students will explore how factors such as housing, education, cultural identity, racism, and connection to Country influence health outcomes. The week highlights the need for strengths-based, culturally grounded approaches that address systemic inequities while recognising the resilience and knowledge within communities.</p></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Determinants of Health </strong>",
            "topic_description": "Determinants of Health Week 11: Determinants of Health – Social, Cultural, and Structural This week focuses on the social , cultural , and structural determinants of health that shape the wellbeing of Aboriginal and Torres Strait Islander peoples. Students will explore how factors such as housing, education, cultural identity, racism, and connection to Country influence health outcomes. The week highlights the need for strengths-based, culturally grounded approaches that address systemic inequities while recognising the resilience and knowledge within communities.",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 12(20 Oct - 26 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Social and Emotional Well-being </strong><br/><p><strong>Week 12: Social and Emotional Wellbeing (SEWB) in Context</strong></p>\n<p>This week explores the concept of <strong>Social and Emotional Wellbeing (SEWB)</strong>, a holistic framework grounded in Aboriginal and Torres Strait Islander worldviews. Students will examine the <strong>principles of SEWB</strong>, its cultural and community foundations, and how it differs from Western models of mental health. Emphasis will be placed on how SEWB influences professional practice across health, education, sport, and community sectors, and how it can be supported through culturally informed strategies and environments.</p></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Social and Emotional Well-being </strong>",
            "topic_description": "Social and Emotional Well-being Week 12: Social and Emotional Wellbeing (SEWB) in Context This week explores the concept of Social and Emotional Wellbeing (SEWB) , a holistic framework grounded in Aboriginal and Torres Strait Islander worldviews. Students will examine the principles of SEWB , its cultural and community foundations, and how it differs from Western models of mental health. Emphasis will be placed on how SEWB influences professional practice across health, education, sport, and community sectors, and how it can be supported through culturally informed strategies and environments.",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 13(27 Oct - 02 Nov)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Indigenous Data Sovereignty </strong><br/><p><strong>Week 13: Data Sovereignty and Indigenous Governance</strong></p>\n<p>In the final week of the course, students will explore the critical importance of <strong>Indigenous data sovereignty</strong> and the governance of data relating to Aboriginal and Torres Strait Islander peoples. Topics include the <strong>Mayi Kuwayu Study</strong>, the <strong>CARE Principles for Indigenous Data Governance</strong>, and how ethical, strengths-based approaches to data collection and use support self-determination, community control, and cultural integrity. Students will reflect on how data practices can uphold or undermine equity and justice in their professional fields.</p></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Indigenous Data Sovereignty </strong>",
            "topic_description": "Indigenous Data Sovereignty Week 13: Data Sovereignty and Indigenous Governance In the final week of the course, students will explore the critical importance of Indigenous data sovereignty and the governance of data relating to Aboriginal and Torres Strait Islander peoples. Topics include the Mayi Kuwayu Study , the CARE Principles for Indigenous Data Governance , and how ethical, strengths-based approaches to data collection and use support self-determination, community control, and cultural integrity. Students will reflect on how data practices can uphold or undermine equity and justice in their professional fields.",
            "learning_outcomes": [
                "L03"
            ]
        }
    ]
}