{
    "course_title": "Theories in Dispute Resolution",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/LAWS7841-60157-7560",
    "full_course_code": "LAWS7841-60157-7560",
    "course_code": "LAWS7841",
    "class_code": "60157",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate knowledge of dispute resolution theory from different disciplinary and cultural perspectives."
        },
        {
            "number": "LO2.",
            "description": "Explain the nature, advantages and disadvantages of various dispute resolution processes, from both a theoretical and a practical perspective."
        },
        {
            "number": "LO3.",
            "description": "Select an appropriate type of process according to the circumstances of a particular case."
        },
        {
            "number": "LO4.",
            "description": "Demonstrate an understanding of practical, legal and ethical issues in dispute resolution."
        },
        {
            "number": "LO5.",
            "description": "Develop a theoretical foundation for skills training in negotiation, mediation and arbitration (and other forms of alternative dispute resolution)."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Dispute Resolution Proposal Presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 15/09/2025 9:00 am</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Activity/ Performance, Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This is a group-based team assignment and will be discussed in the first seminar. You will form teams of 4-5 participants to develop a proposal and present it orally to a conflict stakeholder.</p>\n<p>Your task is to develop a proposal for a dispute resolution process to facilitate resolution of a conflict scenario. Three different conflict scenarios will be posted on Learn.UQ (Blackboard) at the start of the semester. Your team has to choose one of the three scenarios and develop a proposal for how to facilitate dispute resolution. Please note that not all possible DR processes that you may choose will have been discussed when this assignment is due. This means that you have to engage in independent reading and you may need to watch some of the lecture videos for subsequent modules to be able to choose the appropriate DR process. You are welcome to contact the lecturers with any questions you have and to discuss your approach.</p>\n<p>You need to prepare a 10-minute team presentation to convince the stakeholder that your approach is appropriate and will assist in constructive engagement with the conflict. You are welcome to prepare a PowerPoint presentation, you can develop a short video or any other way of presenting your approach. Innovation and engaging interactive presentations are encouraged. Presentations will either be held in person or via Zoom. This will be discussed in class. The proposed presentation day is 15 September 2025.</p>\n<p>Explain why the suggested process is suitable for the particular conflict, what its advantages and disadvantages are and how you are going to deal with potential challenges and impasses. Base your recommendation on relevant theory and practice . Ensure that you present a balanced proposal which acknowledges weaknesses and challenges but also makes a persuasive argument based on the merits of the process chosen and its underlying theories.</p>\n<p>If you recommend a third party process then explain how the third party will be selected and address issues such as neutrality or power imbalances.</p>\n<p><strong>For marking criteria please refer to the LAWS7841 Oral Presentation Marking Criteria Sheet available on the Blackboard Site for the course.</strong></p>\n<p><br/></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Research Essay",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>60%</dd>",
            "due_date": "<dd><p> 10/11/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L04, L05",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Your task is to write a 3,000 word academic research essay on a current issue in dispute resolution. You may choose one of the four topics suggested below or you can choose your own topic. If you choose your own topic, you have to send a 200 word essay plan to the course co-ordinator and get approval before you can start on your topic.</p>\n<p><br/></p>\n<p>The paper must be based on current and relevant scholarly (and practitioner if appropriate) literature, include a clear hypothesis or research problem and present a balanced argument. This means that you are required to read and reference literature which supports and literature which criticises your hypothesis. You are also required to reference any thought which is not your own or is considered general knowledge. Research essays should be structured with an introduction, body and conclusion.</p>\n<p>Research essay topics:</p>\n<ol>\n<li>How can DR processes assist with cultural change in organisations or communities? What are the opportunities and dangers of using them for example in workplace disputes?</li>\n<li>Can dispute resolution and restorative practice create safer communities? Discuss empirical evidence, chances and risks. </li>\n<li>What is the best way to mediate social conflict - in person, online (video or voice conference) or through other technologies? Discuss pros and cons of using different communication methods to conduct mediation processes.</li>\n<li>How important are distributive and procedural justice in DR processes such as mediation and arbitration?</li>\n<li>Choose your own topic (you have to get approval from the course co-ordinator).</li>\n</ol>\n<p>For further information on writing research essays and referencing please refer to \"A Guide to Citation of Sources\" available from the TC Beirne School of Law website under 'Student Support\" in \"Student Resources\". Please copy and paste the marking criteria on the last page of your assignment.</p>\n<p><strong>Criteria for acceptance and marking:</strong></p>\n<ul>\n<li>The research essay must be written in a coherent fashion and within the word length specified. The total word length (excluding references) must be indicated on the first page of the assignment.</li>\n<li>Words in excess of the limit may not be taken into consideration when awarding a mark.</li>\n<li>The research essay must contain the assessment marking criteria sheet on the last page of the assignment.</li>\n<li>You have to submit the assignment via the Turnitin function on the Learn.UQ (Blackboard) site for the course. You do not have to submit a hardcopy of the assignment.</li>\n<li>Your assignment will be checked for signs of plagiarism by the Turnitin system and you will be able to view the Turnitin report.</li>\n<li>Your assignment will be marked using Turnitin and you will be able to view the comments, feedback and mark on the Learn.UQ (Blackboard) website when they are released. It is essential that you copy and paste the marking criteria sheet on the last page of your assignment for this.</li>\n</ul>\n<p><br/></p>\n<p><strong>For marking criteria please refer to the LAWS7841 Research Essay Marking Criteria Sheet available on the Blackboard Site for the course.</strong></p>\n<p><br/></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The assignment must be submitted electronically via the assessment submission link on the course Learn.UQ (Blackboard) site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 6 To Week 11",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Seminars</strong><br><p>Seminar topics are:</p>\n<p>Seminar 1</p>\n<ol>\n<li> Course overview; Understanding conflicts and disputes; Epistemologies of conflict resolution.</li>\n<li>The development of dispute resolution in Australia; Facilitative, advisory and determinative DR processes; The DR Matrix Values and goals of DR</li>\n</ol>\n<p><br/></p>\n<p>Seminar 2</p>\n<ol>\n<li>Negotiation as the basis for constructive conflict resolution; An analytical framework for negotiation; Distributive and integrative approaches to negotiation</li>\n<li>Conflict coaching; Mediation: concepts, definitions, approaches, values; Conciliation and other advisory processes</li>\n</ol>\n<p><br/></p>\n<p>Seminar 3</p>\n<ol>\n<li>Arbitration: history, domestic arbitration, international arbitration, critiques; Legal issues arising in DR: confidentiality, conduct, liability and enforceability of outcome; integration of DR into justice systems</li>\n<li>Practitioner panel discussion: \"Current challenges in DR and restorative practice\"; Cross-cutting issues in DR: neutrality, voluntariness, power, culture and gender, mental health and wellbeing</li>\n</ol>\n<p><br/></p>\n<p>Seminar 4</p>\n<ol>\n<li>Indigenous approaches to DR; Restorative Practice; Understanding the cultural underpinnings of DR and critique of Euro-centric approaches to DR; Case study: This is Our Story</li>\n<li>Value disputes, complex conflicts and public dialogue; Conviviality and human connection in dispute resolution; Technology/Artificial Intelligence and DR</li>\n</ol></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Seminars</strong>",
            "topic_description": "Seminars Seminar topics are: Seminar 1 Course overview; Understanding conflicts and disputes; Epistemologies of conflict resolution. The development of dispute resolution in Australia; Facilitative, advisory and determinative DR processes; The DR Matrix Values and goals of DR Seminar 2 Negotiation as the basis for constructive conflict resolution; An analytical framework for negotiation; Distributive and integrative approaches to negotiation Conflict coaching; Mediation: concepts, definitions, approaches, values; Conciliation and other advisory processes Seminar 3 Arbitration: history, domestic arbitration, international arbitration, critiques; Legal issues arising in DR: confidentiality, conduct, liability and enforceability of outcome; integration of DR into justice systems Practitioner panel discussion: \"Current challenges in DR and restorative practice\"; Cross-cutting issues in DR: neutrality, voluntariness, power, culture and gender, mental health and wellbeing Seminar 4 Indigenous approaches to DR; Restorative Practice; Understanding the cultural underpinnings of DR and critique of Euro-centric approaches to DR; Case study: This is Our Story Value disputes, complex conflicts and public dialogue; Conviviality and human connection in dispute resolution; Technology/Artificial Intelligence and DR",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}