{
    "course_title": "Modern Japanese Literature & Society",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/LTCS2030-61544-7560",
    "full_course_code": "LTCS2030-61544-7560",
    "course_code": "LTCS2030",
    "class_code": "61544",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate knowledge of contemporary Japanese society and modern Japanese literature."
        },
        {
            "number": "LO2.",
            "description": "Critically analyse literary, media and other texts within their sociohistorical contexts."
        },
        {
            "number": "LO3.",
            "description": "Organise, plan, and present the results of scholarly research in written and oral format."
        },
        {
            "number": "LO4.",
            "description": "Reflect on and respond to feedback to improve your work."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Weekly Contribution",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p>Week 2 Task. 4/08/2025 5:00 pm</p>\n<p>Week 3 Task. 11/08/2025 5:00 pm</p>\n<p>Week 4 Task 18/08/2025 5:00 pm</p>\n<p>Week 5 Task. 25/08/2025 5:00 pm</p>\n<p>Week 6 Task. 1/09/2025 5:00 pm</p>\n<p>Week 7 Task. 8/09/2025 5:00 pm</p>\n<p>Week 8 Task. 15/09/2025 5:00 pm</p>\n<p>Week 9 Task. 22/09/2025 5:00 pm</p>\n<p>Week 10 Task. 7/10/2025 1:00 pm</p>\n<p>Week 11 Task. 13/10/2025 5:00 pm</p>\n<p>Week 12 Task. 20/10/2025 5:00 pm</p>\n<p>Week 13 Task. 27/10/2025 5:00 pm</p>\n<p>\n</p><p>The tasks will open at 4pm on Wednesday afternoon in the week before the class, and are due to be submitted by <strong>5pm on Monday </strong>the day before class.</p>\n<p>As Monday in Week 10 is a public holiday, the task in that week is due at <strong>1pm on Tuesday</strong>.</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance, Written",
            "category": "Participation/ Student contribution, Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment is designed to encourage students' close engagement with the weekly content before, during, and after each class session. Through this engagement and feedback from both peers and instructors, students practise and build analysis and discussion skills, which in turn can enhance their work in all other course assessments.</p>\n<p>There is a total of 12 weekly assessment tasks x 2.5 marks each. The best 10 marks out of the 12 tasks will be counted towards the final mark, ie. possible 2.5 x 10 = 25 marks. </p>\n<p>The tasks are marked in the following way:</p>\n<ul>\n<li>Pre-class task mark out of 1.5: Blackboard test questions including multiple choice, true/false, matching, and short answer. These require students to demonstrate their preparation (i.e. whether they have read the required text/s and done any other assigned activities), and reflect on their learning from the previous class (powerpoints are released immediately after class so students who did not attend can complete the task).</li>\n<li>Participation mark out of 0.5: Actively contributes to class discussion and activities for the entire session.</li>\n<li>Peer-feedback mark out of 0.5: Engages respectfully with student presenters, and provides helpful feedback on the form submitted during class.</li>\n</ul>\n<p><strong>Use of AI / MT in this assessment</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use Artificial Intelligence (AI) and/or Machine Translation (MT) technologies in the pre-class task, it is not recommended as it will not adequately prepare them for the in-person components of this assessment. Successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>The use of generative AI or MT tools in the in-person participation and peer-feedback components of this assessment will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Blackboard test and in-class submission of handwritten peer feedback. </p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>Lack of adherence to the submission guidelines is assessed on the Presentation marking criteria (see Assessment section of Blackboard). </p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "In-class Presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p>Students sign up for a presentation week at the beginning of semester. The sign-up will be available on Blackboard and the student's assigned date is considered the due date for this assessment. </p></dd>",
            "learning_objectives": null,
            "mode": "Oral, Written",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students give a <strong>1-2 minute</strong> presentation during class, in the week they have signed up for. The topic and format options for each week are specified in the weekly schedule, and formats may include \"talk\", \"artwork\", \"poster\" and so on. The work must also be submitted, with a reference list, via Blackboard at 5pm on the day of the presentation. Each student's presentation will be followed by a Q&amp;A session. As per the marking criteria (see Blackboard), students are marked on how well they demonstrate their understanding of the required and recommended readings for their presentation topic.</p>\n<p>Students who wish to present their work in a different format from that of the assigned topic must gain approval from the Course Coordinator at least one week before the presentation is due.</p>\n<p><strong>Use of AI / MT in this assessment</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use Artificial Intelligence (AI) and/or Machine Translation (MT) technologies in preparation, it is not recommended as it will not adequately prepare them for the in-person component of this assessment. Successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>The use of generative AI or MT tools in the in-person component of this assessment will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit transcript via Turnitin, 5pm on the day of the presentation. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>Lack of adherence to the submission guidelines is assessed on the Presentation marking criteria (see Assessment section of Blackboard). </p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Research Presentation Proposal",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 31/10/2025 5:00 pm</p>\n<p>\n</p><p>Friday, WEEK 13</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>For this assessment, students submit a <strong>proposal</strong> for the Research Presentation assessment (which takes place during the exam period).</p>\n<p>The choice of presentation topics, a reference list, and a detailed template for the proposal (including length and format requirements) will be made available in Week 9. Students are strongly advised to select a novel and (begin to) read it earlier in the semester, before the topics are released. The topics will require students to choose a novel from the list below, and compare it with one of the required readings from the course. Students are not permitted to present on the course reading that was the topic of their In-class Presentation. Students may contact the Course Coordinator by the end of Week 10 for approval to present on a novel not in the list provided below.</p>\n<p>This Proposal assessment requires students to read and research about the chosen novel and the required reading, and to provide an overall argument, and an outline of the structure of their presentation, with supporting arguments and evidence for each supporting argument. Students will be provided with some references on the topic and required to locate more references on their own. A review of the relevance and reliability of the references is also required.</p>\n<p>Students will receive feedback on the proposal one week after submission, to be used towards their Research Presentation (see assessment details and marking criteria for the Research Presentation in the Assessment section of Blackboard).</p>\n<p>Novels (choose one):</p>\n<ul>\n<li>Li Kotomi. <em>Solo Dance</em>. Trans. Arthur Reiji Morris. La Vergne: World Editions, 2022. [Warning: this story includes sexual assault and suicide].</li>\n<li>Tanizaki Jun'ichiro.<em> Naomi</em>. Trans. Anthony H. Chambers. Knopf, 1985.</li>\n<li>Murata Sayaka. <em>Vanishing World</em>. Trans. Ginny Tapley Takemori. Granta, 2025.</li>\n<li>Ogawa Yoko. <em>The Memory Police</em>. Trans. Stephen Snyder. Pantheon, 2017.</li>\n<li>Pulvers, Roger. <em>The Dream of Lafcadio Hearn</em>. Balestier Press, 2019.</li>\n<li>Iwaki Kei. <em>Farewell, My Orange</em>. Trans. Meredith McKinney. Europa Editions, 2018.</li>\n</ul>\n<p><strong>Use of AI / MT in this assessment</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>In the Research Presentation based on this Proposal assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via Turnitin.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>Lack of adherence to the submission guidelines is assessed on the Presentation marking criteria (see Assessment section of Blackboard). </p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Research Presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>35%</dd>",
            "due_date": "<dd><p> 11/11/2025 - 20/11/2025</p>\n<p>\n</p><p>EXAM WEEK 1 - 2</p>\n<p>Sign up for a session. The student's assigned session will be considered the due date and time for this assessment.</p></dd>",
            "learning_objectives": null,
            "mode": "Oral, Written",
            "category": "Paper/ Report/ Annotation, Participation/ Student contribution, Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students are required to give a <strong>5-6 minute</strong> research-based presentation, in person, to a small group of their peers.</p>\n<p>Students sign up for a one-hour session, and are expected to attend the entire session and contribute to an evidence-based analytical discussion of their own and others' presentations (see marking criteria). The format of the discussion session is flexible; it may take place at the end of all presentations, or after each individual presentation.</p>\n<p>The research presentation responds to one of the topics released in WEEK 10, which uses the novels listed in the \"Research Presentation Proposal\" assessment description. The Presentation is based on the Proposal submitted in Week 13, and should respond to the feedback provided on this proposal (see marking criteria).</p>\n<p><strong>Students are required to submit an updated version of their Proposal, reflecting any changes made to the presentation since the Proposal was submitted </strong>(see submission guidelines).</p>\n<p><strong>Use of AI / MT in this assessment</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use Artificial Intelligence (AI) and/or Machine Translation (MT) technologies in the Proposal and preparation, it is not recommended as it will not adequately prepare them for the in-person components of this assessment. Successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>The use of generative AI or MT tools in the in-person component of this assessment will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>In addition to delivering the oral presentation and participating actively in the discussion, students are required to submit an updated version of their Proposal, reflecting any changes made to the presentation since the Proposal was submitted: in hard copy at the time of presentation, and in Word/PDF via Turnitin by 5pm on the day they present. The hard copy and Turnitin version must be exactly the same.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>Lack of adherence to the submission guidelines is assessed on the Presentation marking criteria (see Assessment section of Blackboard). </p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(28 Jul - 02 Nov)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1-13</strong><br><p>Students attend and participate in weekly seminar-style classes to study and discuss literary texts and other materials in relation to Japanese social issues.</p></br></p></div></td>",
            "topic_title": "<strong>Week 1-13</strong>",
            "topic_description": "Week 1-13 Students attend and participate in weekly seminar-style classes to study and discuss literary texts and other materials in relation to Japanese social issues.",
            "learning_outcomes": []
        }
    ]
}