{
    "course_title": "Critical Care",
    "study_period": "Sem 2 2025",
    "location": "Herston",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MEDI7415-60692-7560",
    "full_course_code": "MEDI7415-60692-7560",
    "course_code": "MEDI7415",
    "class_code": "60692",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (16/06/2025 - 15/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Critical Care Course - Module 1 Desired Learning Outcomes (DLO): - how can a critically ill patient be recognized - the approach to the patient - where do critically ill patients get treated - shock: oxygen consumption and delivery - the outcomes of critical illness and prediction of outcome - the ethics of the care of critically ill patients"
        },
        {
            "number": "LO2.",
            "description": "Critical Care Course - Module 2 DLO: - understand the anatomy of the airway - understand respiratory compromise (recognise the compromised patient) - know how to manage respiratory compromise (how to obtain an airway; recognise the devices used in obtaining an airway; how to intubate a patient; know devices used to deliver oxygen) - know the physiological measurement of respiration (know the principles of oximetry; understand how to interpret ABG)"
        },
        {
            "number": "LO3.",
            "description": "Critical Care Course - Module 3 DLO: - cardiovascular physiology - assess and manage the patient with chest pain and ischaemic heart disease - an approach to the emergency care of hypotension and hypertension - understand the management of peri-arrest arrhythmias"
        },
        {
            "number": "LO4.",
            "description": "Critical Care Course - Module 4 DLO: - revise basic physiology of cerebral function - formulate an approach to the comatose patient - principles of management of traumatic brain injury - emergency care of the patient presenting with signs of a stroke or subarachnoid haemorrhage - approach to the patient having a seizure - understand the management of CNS infections - understand the concept of \"brain death\""
        },
        {
            "number": "LO5.",
            "description": "Critical Care Course - Module 5 DLO: - understand the principles and application of triage in emergency medicine - understand the primary survey and secondary survey in major trauma - be capable of recognising and managing a patient with anaphylaxis - have an approach to the management of a patient following overdose"
        },
        {
            "number": "LO6.",
            "description": "Critical Care Course - Module 6 Objectives: - understand how to assess a patient prior to general anaesthesia - understand the principles of regional anaesthesia - understand the conduct of general anaesthesia - understand the process of intubation in an elective and an emergency situation - understand the principles of perioperative pain management"
        },
        {
            "number": "LO7.",
            "description": "Critical Care Course - Module 7 DLO: - know the current practice of basic life support - understand the techniques of advanced life support, including the use of drugs and defibrillation"
        },
        {
            "number": "LO8.",
            "description": "Critical Care Course - Module 8 DLO: - revise the indications, contraindications and technique applicable to the following procedures: arterial puncture, nasogastric tube insertion, indwelling catheter insertion, lumbar puncture"
        },
        {
            "number": "LO9.",
            "description": "Critical Care Course - Hospital Component: Students are expected to learn from clinical exposure the following: (i) recognition of the critically ill patient; (ii) principles of early management of the critically ill patient; (iii) recognition of how to call for appropriate help. Practical skills required to be learnt are: (i) recognition and management of airway problems; (ii) recognition and management of breathing difficulties; (iii) recognition and management of circulatory failure; (iv) recognition and management of neurological failure; (v) recognition and management of sepsis, and other medical problems resulting in critical states; (vi) management of cardiac arrest. These therefore include: (i) airway manoeuvres, insertion of airway devices, and intubation; (ii) manual and mechanical ventilation; (iii) oxygen therapy; (iv) cannulation; (v) use of intravenous therapy; (vi) basic haemorrhage control; (vii) use of monitoring."
        },
        {
            "number": "LO10.",
            "description": "Critical Care Course - Skills: The skills required to be learnt are: Must know: Intravenous cannulation; Indwelling urinary catheter; Basic airway manoeuvres; Bag valve mask ventilation; Laryngeal mask airway; Oxygen delivery device selection and application; Defibrillation using an automatic defibrillator. Highly desirable: Nasogastric tube insertion; Arterial blood gas puncture. Optional: Endotracheal intubation."
        },
        {
            "number": "LO11.",
            "description": "Critical Care Course - Recognise the varying roles of medical, nursing and allied health staff within an acute care ward, and demonstrate skills and attributes which allow for effective interactions and teamwork with those staff as part of a health care team."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "ED, ICU & Anaesthesia Workbook & Engagement Record",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": null,
            "due_date": "<dd><p>Due 3pm next business day following last day of each respective clinical placement (ICU, ED, Anaesthesia)</p></dd>",
            "learning_objectives": "L09, L10, L11",
            "mode": "Activity/ Performance",
            "category": "Notebook/ Logbook",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Performance Hurdle: A combined workbook grade of 18/30 is required to pass the course.</p>\n<p>Workbooks are provided at the commencement of the clinical placement. Students are required to complete tasks as per the descriptions in the workbook. The workbooks direct students to engage in meaningful ways in clinical duties, as well as prompting reflections on clinical cases and investigation profiles. Many activities within these workbooks mimic intern responsibilities/skills, or clinical scenarios likely to be encountered early in a medical career.</p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p>Your final workbook mark for each of the three disciplines will include any late penalty deductions. The final mark (inclusive of any deductions) will be applied to pass fail thresholds. Your supervisor, student coordinator, critical care course administrator, or critical care course coordinator can action these deductions based on late submissions.</p>\n<p>Each workbook contains a marking grid for your clinical supervisor, which clearly outlines the marking criteria. Please refer to this at the commencement of the clinical placement. Penalties apply for late submission.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Workbooks must be submitted for marking via the ePAD (MyProgress) by 3pm next business day following last day of each respective clinical placement (ICU, ED, Anaesthesia). </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>If you fail to meet the submission deadline for the ED/ICU/Anaesthesia Workbooks without an approved extension, it will be considered as a lapse in professional conduct. The penalty will be a deduction of 10% relative percentage per day. Late submission longer than 7 calendar days will be considered as not meeting the passing standard for this assessment, in addition to being considered a lapse in professional conduct. </p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Clinical Participation Assessment - ED",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": null,
            "due_date": "<dd><p>5pm on last day of your ED Clinical Placement</p></dd>",
            "learning_objectives": "L05, L09, L10, L11",
            "mode": "Activity/ Performance",
            "category": "Participation/ Student contribution, Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Medical School considers that participation and engagement at clinical placements are fundamental aspects of the MD program, consistent with the framework of self-directed and life-long learning and indicative of the need for clinical competence and professional conduct in addition to theoretical knowledge.</p>\n<p>In all courses during Years 3 and 4 of the MD program, you are assessed on your professional conduct and clinical skills and the extent to which you have contributed and engaged in your clinical placement and clinical learning activities. The nature of these activities will vary according to the placement, but may include admitting/clerking patients, assessing patients at outpatient clinics, presenting at ward rounds and demonstrating initiative in attending other activities such as grand rounds.</p>\n<p>Scoring in the Clinical Participation Assessment (CPA) is based on conduct and contribution during ward rounds and case discussions, initiative in seeking learning opportunities, behaviour towards peers and medical (and all other) colleagues, patient assessment, ability to succinctly present a patient case including differential diagnosis, and awareness of social and ethical issues including risk assessment.</p>\n<p>The CPA components are:</p>\n<ul>\n<li>Clinical Communication</li>\n<li>History Taking</li>\n<li>Examination Skills</li>\n<li>Clinical Reasoning</li>\n<li>Engagement in Practice</li>\n<li>Professional Practice</li>\n<li>Reflective Practice</li>\n<li>Social/Cultural Competence and Safety</li>\n</ul>\n<p>There is also a Student Flag component which allows a supervisor to report a student with concerning unprofessional or unsafe behaviour. The Student Flag component also provides a mechanism for notifying exemplary performance to the School.</p>\n<p>To maximise your learning, you are encouraged to actively seek feedback from your clinical teacher/s during your clinical placement. This will assist in identifying any areas requiring further improvement before your final Clinical Participation Assessment is completed. Active engagement in the clinical setting is a requirement to pass this assessment task.</p>\n<p>The CPA rubric can be found on Learn.UQ (Blackboard), and is provided for guidance so that you are familiar with marking criteria for each component.</p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p>The CPA is a global assessment of professional and clinical practice and contributes to your overall performance in the following ways:</p>\n<ol>\n<li>If you are enrolled concurrently in the WLP course, four components contribute to this MEDI7415 course (Clinical Communication, History Taking, Examination Skills, Clinical Reasoning) and the remaining components (Engagement in Practice, Professional Practice, Reflective Practice, Social/Cultural Competence and Safety and Student Flag) contribute to the WLP course.</li>\n<li>If you are not enrolled concurrently in the WLP course all components contribute to this MEDI7415 course.</li>\n</ol>\n<p>Additional information may be received by staff from clinical placement site/s where you completed this course. This will be reviewed by the Course Coordinator and ratings completed by your supervisor in the CPA may be revised. For example, if your supervisor rated you as satisfactory related to professional conduct but the Medical School has other information available, the supervisor’s ratings may be moderated based on this additional information.</p>\n<p>Your performance will also be reviewed at the End of Semester Examiner’s meeting and following discussion you may receive a non-graded fail for the course, if:</p>\n<ul>\n<li>There are any unsatisfactory results recorded in any of the CPA components contributing to this course (including moderations made by the Course Coordinator)</li>\n<li>There are four or more borderline results recorded in any of the CPA components contributing to this course (including moderations made by the Course Coordinator)</li>\n<li>The required number of CPAs have not been submitted to your supervisor for completion by the due date.</li>\n</ul>\n<p>Factors that will be taken into account during the review undertaken at the End of Semester Examiner’s meeting include:</p>\n<ul>\n<li>Evidence of temporal improvement in performance across the course (if applicable)</li>\n<li>Completion and content of the WLP Task Review in response to unsatisfactory or borderline ratings</li>\n<li>Relative opportunity available across the semester</li>\n<li>Other factors relevant to your performance</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>A function of the CPA discussion and form completion is to consider information from the whole placement. Therefore, you are expected to complete your CPA discussion and submit your CPA form during the final week of placement. Given clinician availability, there may be times when this is not always possible. If you complete your CPA discussion and submit your CPA form before the final week of placement for placements of 3 weeks or less, or before the penultimate week of placement for placements longer than 3 weeks, additional information obtained by your supervisor or Course Coordinator maybe considered to add to that discussed and submitted. Therefore, you are discouraged from completing the CPA discussion and form submission early.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>If you fail to meet the submission deadline for any Clinical Participation Assessment without an approved extension, it will not be accepted and may result in course failure regardless of whether the supervisor has rated your participation at a satisfactory or proficient level in the related course components.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Critical Care End of Semester MCQ Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": null,
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>8/11/2025 - 22/11/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The End of Semester Exam is a 90 minute multiple choice exam delivered through Examsoft. The majority of questions will be derived from material in the online learning modules and workbooks. The module content includes written, diagrammatic and audio-visual learning aids. All of these are assessable material.</p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p>This is a single Best Answer MCQ with 5 options from which to choose. The pass mark for the exam has historically been between 31-36 and is determined by a recognised standard setting method. You may be eligible for a supplementary assessment as outlined in Course Grading Section.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workbooks in ED, ICU, Anaesthesia</strong><br/></p></div></td>",
            "topic_title": "<strong>Workbooks in ED, ICU, Anaesthesia</strong>",
            "topic_description": "Workbooks in ED, ICU, Anaesthesia",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Simulation Based Tutorials</strong><br/></p><p><strong>Learning outcomes:</strong> L09, L10, L11</p></div></td>",
            "topic_title": "<strong>Simulation Based Tutorials</strong>",
            "topic_description": "Simulation Based Tutorials",
            "learning_outcomes": [
                "L09",
                "L10",
                "L11"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Problem-based learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>CCC Modules including online quizzes</strong><br/></p></div></td>",
            "topic_title": "<strong>CCC Modules including online quizzes</strong>",
            "topic_description": "CCC Modules including online quizzes",
            "learning_outcomes": []
        }
    ]
}