{
    "course_title": "General Practice",
    "study_period": "Sem 2 2025",
    "location": "Herston",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MEDI7313-60685-7560",
    "full_course_code": "MEDI7313-60685-7560",
    "course_code": "MEDI7313",
    "class_code": "60685",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (16/06/2025 - 15/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate knowledge of the epidemiology, pathophysiology, clinical features and management of (a) common, and (b) serious / important presentations in general practice."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate competency in the clinical skills required to diagnose and manage patient presentations in general practice (i.e. communication skills, history-taking, physical examination, ordering and interpreting relevant office and laboratory investigations, and performing minor office procedures)."
        },
        {
            "number": "LO3.",
            "description": "Demonstrate competency in clinical reasoning and the ability to formulate a diagnosis (and/or differential diagnosis) and problem list, for patients presenting in general practice."
        },
        {
            "number": "LO4.",
            "description": "Develop appropriate management plans with patients and carers presenting in general practice."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate an understanding of factors influencing a patients experience of illness and health (e.g. age, gender, socioeconomic status, physical, psychosocial, cultural, environmental, genetic)."
        },
        {
            "number": "LO6.",
            "description": "Recognise and appropriately negotiate relevant ethical and professional issues which arise in clinical and collegial/professional encounters."
        },
        {
            "number": "LO7.",
            "description": "Incorporate prevention and health promotion into clinical encounters where appropriate."
        },
        {
            "number": "LO8.",
            "description": "Incorporate evidence-based medicine into clinical encounters where appropriate (e.g. rapidly identify valid primary evidence on the core clinical questions of frequency, risk, diagnosis, treatment, prognosis - and apply this knowledge to relevant observed problems in general practice)."
        },
        {
            "number": "LO9.",
            "description": "Demonstrate a sound understanding of the role and responsibilities of general practitioners in the Australian health care system, including the importance of effective clinical handovers."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "MCQ Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> Equal weighting as Clinical case exam </dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>8/11/2025 - 22/11/2025</p></dd>",
            "learning_objectives": "L01, L03, L04, L05, L06, L07, L08",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The MCQ exam is held at the end of Semester. There will be 50 single best answer multiple choice questions.</p>\n<p>Examples of questions are shown in the sample MCQ paper provided electronically to students on Blackboard. Questions will be mapped to the \"Key Learning Issues\" documents provided to students in the course.</p>\n<p>Students will have 10 minutes perusal (reading or planning) time, followed by 60 minutes to complete the examination. Students may answer questions during perusal time.</p>\n<p>Criteria &amp; Marking:</p>\n<p>The pass mark for the MCQ exam is usually in the range of 58-66%. This may be moderated in accordance with standard setting methods.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>If you fail to meet the submission deadline for any Clinical Participation Assessment without an approved extension, it will not be accepted and may result in course failure regardless of whether the supervisor has rated your participation at a satisfactory or proficient level in the related course components. </p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "In-Tutorial Assessment - Clinical Cases",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> Equal weighting as MCQ </dd>",
            "due_date": "<dd><p>Each week of GP Placement</p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L09",
            "mode": "Activity/ Performance, Written",
            "category": "Participation/ Student contribution, Role play/ Simulation, Tutorial/ Problem Set",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment is conducted over the course of the 6 weekly tutorials while students are in the GP placement of the semester.</p>\n<p>The examiner will mark the student’s performance according to the Tutorial Assessment marking guide that will be made available to students during the course.</p>\n<p>The passing standard for this assessment task is set at 60% of the total available mark for the assessment task. The pass mark may be moderated in accordance with standard setting methods</p>\n<p>The Associate Dean (Academic), Faculty of Health, Medicine and Behavioural Sciences has waived the requirement for this assessment item to be recorded. The In-Tutorial Assessment – Clinical Cases marking rubric (available on the course Blackboard site) will be used to document student performance through the provision of comments.</p>\n<p>Criteria &amp; Marking:</p>\n<p>There are a total of 100 marks available for this assessment task.</p>\n<p>The total mark available for each criterion is as follows:</p>\n<ol>\n<li>Preparation and Role-play of patient cases (25%).</li>\n<li>Provision of feedback to peers on their consultation skills, communication and clinical reasoning (25%)</li>\n<li>Ethical reasoning (based on identification, thoughtful consideration and discussion of ethical issues arising in general practice AND feedback to their peers about the management of an ethical issue (25%)</li>\n<li>Global contribution to tutorials (25%)</li>\n</ol>\n<p>The passing standard for this assessment task is set at 60% of the total available mark for the assessment task. The pass mark may be moderated in accordance with standard setting methods.</p>\n<p>Student performance on each criterion is marked as one of:</p>\n<ul>\n<li>Below Standard (receives 0% of the total available mark for that criterion)</li>\n<li>Approaching Standard (receives 40% of the total available mark for that criterion)</li>\n<li>At or Above Standard (receives 100% of the total available mark for that criterion)</li>\n</ul>\n<p>The overall score for this assessment task is the sum of all the products of (percentage for relevant standard x total marks available for relevant criterion).</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>If you fail to meet the submission deadline for any Clinical Participation Assessment without an approved extension, it will not be accepted and may result in course failure regardless of whether the supervisor has rated your participation at a satisfactory or proficient level in the related course components. </p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Clinical case exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> Equal weighting as MCQ </dd>",
            "due_date": "<dd><p>In the last week of placement</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L09",
            "mode": "Oral",
            "category": "Examination, Role play/ Simulation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will need to complete one clinical case scenario presented by a trained role player 'patient' and marked by an experienced tutor (different to your weekly tutor) in the last week of the block. This will be either a diagnostic or a management interview, following a structured format and approximately 16 minutes duration.</p>\n<p>Students will be provided with four cases (two management and two diagnostic cases) approximately 48 hours prior to the exam, so that they are able to familiarise themselves with the content material. They will be randomly assigned to role play one of these cases as the doctor at the time of their clinical case exam. This clinical case exam will be held either face to face or via Zoom. Students will be provided with the marking rubric when 'take-home' cases are provided, 48 hours prior to the exam. The pass mark will be set at 55% in order to pass this assessment task. The pass mark may be moderated in accordance with standard setting methods</p>\n<p>The Associate Dean (Academic), Faculty of Health, Medicine and Behavioural Sciences has waived the requirement for this assessment item to be recorded. The Clinical Case Exam marking rubric (available on the course Blackboard site) will be used to document student performance through the provision of comments.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>If you fail to meet the submission deadline for any Clinical Participation Assessment without an approved extension, it will not be accepted and may result in course failure regardless of whether the supervisor has rated your participation at a satisfactory or proficient level in the related course components. </p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Clinical Participation Assessment - GP",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": null,
            "due_date": "<dd><p>CPA 1 Week 3, Fri 5:00 pm</p>\n<p>CPA 2 Week 6, Fri 5:00 pm</p>\n<p>\n</p><p>Two (2) CPAs to be completed and submitted.  </p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L09",
            "mode": "Activity/ Performance",
            "category": "Participation/ Student contribution, Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Medical School considers that participation and engagement at clinical placements fundamental aspects of the MD program, consistent with the framework of self-directed and life-long learning and indicative of the need for clinical competence and professional conduct in addition to theoretical knowledge. </p>\n<p>In all courses during Years 3 and 4 of the MD program, you are assessed on your professional conduct and clinical skills and the extent to which you have contributed and engaged in your clinical placement and clinical learning activities. The nature of these activities will vary according to the placement, but may include admitting/clerking patients, assessing patients at outpatient clinics, presenting at ward rounds and demonstrating initiative in attending other activities such as grand rounds. </p>\n<p>Scoring in the Clinical Participation Assessment (CPA) is based on conduct and contribution during ward rounds and case discussions, initiative in seeking learning opportunities, behaviour towards peers and medical (and all other) colleagues, patient assessment, ability to succinctly present a patient case including differential diagnosis, and awareness of social and ethical issues including risk assessment. </p>\n<p>The CPA components are: </p>\n<ul>\n<li>Clinical Communication </li>\n<li>History Taking </li>\n<li>Examination Skills </li>\n<li>Clinical Reasoning </li>\n<li>Engagement in Practice </li>\n<li>Professional Practice </li>\n<li>Reflective Practice </li>\n<li>Social/Cultural Competence and Safety </li>\n</ul>\n<p>There is also a Student Flag component which allows a supervisor to report a student with concerning unprofessional or unsafe behaviour. The Student Flag component also provides a mechanism for notifying exemplary performance to the School. </p>\n<p>To maximise your learning, you are encouraged to actively seek feedback from your clinical teacher/s during your clinical placement. This will assist in identifying any areas requiring further improvement before your final Clinical Participation Assessment is completed. Active engagement in the clinical setting is a requirement to pass this assessment task. </p>\n<p>The CPA rubric can be found in the Blackboard Course Site for guidance so that you are familiar with marking criteria for each component. </p>\n<p><strong>Criteria &amp; Marking:</strong> </p>\n<p>The CPA is a global assessment of professional and clinical practice and contribute to your overall performance in the following ways: </p>\n<ol>\n<li>If you are enrolled concurrently in the WLP course, four components contribute to this MEDI7313 course (Clinical Communication, History Taking, Examination Skills, Clinical Reasoning) and the remaining components (Engagement in Practice, Professional Practice, Reflective Practice, Social/Cultural Competence and Safety and Student Flag) contribute to the WLP course. </li>\n<li>If you are not enrolled concurrently in the WLP course all components contribute to this MEDI7313 course. </li>\n</ol>\n<p>Additional information may be received by staff from clinical placement site/s where you completed this course. This will be reviewed by the Course Coordinator and ratings completed by your supervisor in the CPA may be revised. For example, if your supervisor rated you as satisfactory related to professional conduct but the Medical School has other information available, the supervisor’s ratings may be moderated based on this additional information. </p>\n<p>Your performance will also be reviewed at the End of Semester Examiner’s meeting and following discussion you may receive a non-graded fail for the course, if: </p>\n<ul>\n<li>There are any unsatisfactory results recorded in any of the CPA components contributing to this course in your final CPA (including moderations made by the Course Coordinator) </li>\n<li>There are four or more borderline results recorded in any of the CPA components contributing to this course in your final CPA (including moderations made by the Course Coordinator) </li>\n<li>The required number of CPAs have not been submitted to your supervisor for completion by the due date. </li>\n</ul>\n<p>Factors that will be taken into account during the review undertaken at the End of Semester Examiner’s meeting include: </p>\n<ul>\n<li>Evidence of temporal improvement in performance across the course (if applicable) </li>\n<li>Completion and content of the WLP Task Review in response to unsatisfactory or borderline ratings </li>\n<li>Relative opportunity available across the semester </li>\n<li>Other factors relevant to your performance </li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>A function of the CPA discussion and form completion is to consider information from the whole placement. Therefore, you are expected to complete your CPA discussion and submit your CPA form during mid-placement and the final week of placement. Given clinician availability, there may be times when this is not always possible. If you complete your CPA discussion and submit your CPA form before the specified due dates, additional information obtained by your supervisor or Course Coordinator maybe considered to add to that discussed and submitted. Therefore, you are discouraged from completing the CPA discussion and form submission early.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>If you fail to meet the submission deadline for any Clinical Participation Assessment without an approved extension, it will not be accepted and may result in course failure regardless of whether the supervisor has rated your participation at a satisfactory or proficient level in the related course components. </p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Case-Based Tutorials (Tutorial Series)</strong><br><p>During weeks 1 to 6 of the block, tutorials involve clinical case presentations and discussion, diagnostic and management roleplays, discussion of clinical and professionalism topics, and review of learning materials. Tutorial times are advised at the commencement of each clinical placement.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Case-Based Tutorials (Tutorial Series)</strong>",
            "topic_description": "Case-Based Tutorials (Tutorial Series) During weeks 1 to 6 of the block, tutorials involve clinical case presentations and discussion, diagnostic and management roleplays, discussion of clinical and professionalism topics, and review of learning materials. Tutorial times are advised at the commencement of each clinical placement.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Clinical Hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>General Practice Clinical Attachment (Clinical Placement)</strong><br/><p>Takes place during week 1 to 6 of the block. Please refer to Section 1.4.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>General Practice Clinical Attachment (Clinical Placement)</strong>",
            "topic_description": "General Practice Clinical Attachment (Clinical Placement) Takes place during week 1 to 6 of the block. Please refer to Section 1.4.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        }
    ]
}