{
    "course_title": "Personalised Learning Course",
    "study_period": "Sem 2 2025",
    "location": "Herston",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MEDI7413-60690-7560",
    "full_course_code": "MEDI7413-60690-7560",
    "course_code": "MEDI7413",
    "class_code": "60690",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (16/06/2025 - 15/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Actively engage with activities that will assist in the development of skills and knowledge in an area relevant to future practice"
        },
        {
            "number": "LO2.",
            "description": "Demonstrate the organisational and negotiation skills required to successfully establish a collaborative activity in a relevant professional field"
        },
        {
            "number": "LO3.",
            "description": "Demonstrate a capacity to reflect on personal achievement against stated goals, to identify factors that have limited that achievement, and describe future approaches to improve performance"
        },
        {
            "number": "LO4.",
            "description": "Use digital media to communicate effectively with peers in an engaging, informative and professional manner"
        },
        {
            "number": "LO5.",
            "description": "Pursue opportunities to develop skills that facilitate the transition to internship"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Learning Plan",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": null,
            "due_date": "<dd><p>5pm, Friday (AEST): Week 1 of PLC Block</p></dd>",
            "learning_objectives": "L01, L02",
            "mode": "Written",
            "category": "Essay/ Critique, Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You must complete and submit a 350-550 word learning plan using the template proforma available on the course Blackboard course site.</p>\n<p><strong>The plan must describe:</strong></p>\n<ul>\n<li>The learning opportunity proposed for the elective (100-150 words)</li>\n<li>The specific expected learning outcomes (100-150 words)</li>\n<li>Learning methods or activities (100-150 words)</li>\n<li>Proposed method of appraisal (50-100 words)</li>\n</ul>\n<p>The Learning Plan must be agreed upon by the supervisor and approved by the Course Coordinator. If there is a need to improve or update the Learning Plan, the Course Coordinator will reach out to the student. A revised plan may need to be submitted if there are significant changes in the placement or planned work.</p>\n<p><strong>Additional requirement for non-UQ elective placements</strong></p>\n<p>To gain provisional approval for a non-UQ elective, you must supply the details of the intended elective, including dates, type of elective, supervisor details and a ~200 word statement around the elective goals. This should indicate what you are aiming to get out of the elective. Documentation that indicates supervisor approval (if available), or in the case of placements organised through an agency, correspondence from that agency confirming the placement needs to be uploaded at this time also. If the elective is to be split into several clinical attachments with different supervisors, then a separate application for each should be put into the portal. If the elective is to be mainly spent in one place but with the remainder of the time spent in a self-directed activity, then this can all be put into one application, but this should form a single cohesive proposal. Note that the student placement agreement (SPA) needs to be received by the placements team from the elective destination institution in order to finalise the approval. It is recommended that travel plans are not finalised until the SPA is received.</p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p>The Learning plan will be approved by the Course Coordinator. Where a Learning plan is considered to be unsatisfactory, you must make changes to the plan as suggested, and resubmit.</p>\n<p>Failure to submit the Learning Plan will result in a FAIL grade for the Personalised Learning Course. You will pass this assessment task if your Learning Plan has been submitted on time, and has been approved by the Course Coordinator.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Instructions and proformas for the submission of a Learning Plan are available on the course Blackboard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>If you fail to meet the submission deadline for the <strong>Learning Plan </strong>without an approved extension, it will be considered as a lapse in professional conduct. Late submission longer than 7 calendar days will be considered as not meeting the passing standard for this assessment, in addition to being considered a lapse in professional conduct. The penalty may be a grade of N (Fail) for the course, regardless of performance in each task.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Multimedia Presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": null,
            "due_date": "<dd><p><strong>Block 4 &amp; 5</strong>: 5pm (AEST), Friday of the week after PLC Block</p>\n<p><strong>Block 6</strong>: 1pm (AEST), Monday of Exam week</p></dd>",
            "learning_objectives": "L03, L04",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Presentation, Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Following completion of your elective placement, you are required to provide a fully viewable/readable, by an interested third party, and informative multimedia presentation. This should consist of around 3-5 MS PowerPoint slides or equivalent detailing the elective experience. You must provide your presentation along with metadata (Year of elective, location, type of elective etc.)</p>\n<ul>\n<li><strong>Audience:</strong> Other medical students considering available elective opportunities, or interested in learning about the experience of their colleagues.</li>\n<li><strong>Format: </strong>An electronic presentation in a form that is amenable to storage.</li>\n<li>The display tool used is at your discretion, but the presentation should include suitable graphic elements (photos, diagrams, multimedia) as well as text. File types may include but not be limited to PDF, PowerPoint, video formats etc - but must be able to be stored with Blackboard and made available to others.   </li>\n</ul>\n<p>Your presentation may be stored in a searchable repository, and is intended to be available to future students as a resource to help decide on elective options. </p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p>This is intended to be independent work and does not need review or approval by your elective supervisor or the course coordinator. At the same time, as a public artefact, the presentation must not be used to criticise any aspect of the elective experience other than valid self-reflection. Such criticisms (if any) should be reserved for the private reflective essay.</p>\n<p>This assessment will be marked and you will pass if you submit it as described under the Task Description by the due date.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Instructions for submission of the Multimedia Presentation will be provided on the course Blackboard site. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>If you fail to meet the submission deadline for the <strong>Multimedia Presentation</strong> without an approved extension, it will be considered as a lapse in professional conduct. Late submission longer than 7 calendar days will be considered as not meeting the passing standard for this assessment, in addition to being considered a lapse in professional conduct. The penalty may be a grade of N (Fail) for the course, regardless of performance in each task.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Reflective essay",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": null,
            "due_date": "<dd><p><strong>Block 4 &amp; 5</strong>: 5pm (AEST), Friday of the week after PLC Block</p>\n<p><strong>Block 6:</strong> 1pm (AEST), Monday of Exam week</p></dd>",
            "learning_objectives": "L03",
            "mode": "Written",
            "category": "Essay/ Critique, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You must submit a reflective essay that describes the extent to which the outcomes of their Elective placement reflect the original learning plans. You must describe the reasons for variation of outcome, with a focus on those variables under your control. You must also indicate changes to your practice behaviours or attitudes that are informed by that reflection, and that are relevant to your future medical practice.</p>\n<p><strong>Report Length: </strong>500-750 words. Penalties will apply for under- or over-length essays</p>\n<p><strong>Format:</strong> Microsoft Word document, 12 point font, 1.5 line spacing.</p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p>The essay will be graded (pass/fail) taking into account each of the following two criteria</p>\n<ol>\n<li>Reflects effectively on reasons for discrepancies between planned and actual outcomes, with a focus on factors that could be influenced by you.</li>\n<li>Identifies areas of change in skills, behaviours or attitudes that may have led to better outcomes, and proposes practical approaches to improvement in those areas. </li>\n</ol>\n<p>Where you fail either of the criteria in the Reflective essay, you may fail the Personalised Learning Course overall.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Instructions for submission of the Reflective Essay will be provided on the course Blackboard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>If you fail to meet the submission deadline for the<strong> Reflective Essay </strong>without an approved extension, it will be considered as a lapse in professional conduct. Late submission longer than 7 calendar days will be considered as not meeting the passing standard for this assessment, in addition to being considered a lapse in professional conduct. The penalty may be a grade of N (Fail) for the course, regardless of performance in each task.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Clinical Participation Assessment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": null,
            "due_date": "<dd><p>5pm, Friday (AEST): Last week of PLC Block</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Activity/ Performance",
            "category": "Participation/ Student contribution, Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Medical School considers that participation and engagement at clinical or research placements are fundamental aspects of the MD program, consistent with the framework of self-directed and life-long learning and indicative of the need for clinical or research competence and professional conduct in addition to theoretical knowledge.</p>\n<p>In all clinical or research courses during Years 3 and 4 of the MD program, you are assessed on your professional and clinical or research skills and the extent to which you have contributed and engaged in your clinical or research placement and related learning activities. The nature of these activities will vary according to the placement, but may include admitting/clerking patients, assessing patients at outpatient clinics, presenting at ward rounds, contributing to research projects, and demonstrating initiative in attending other activities such as grand rounds or research seminars.</p>\n<p>Scoring in the Clinical Participation Assessment (CPA) is based on conduct and contribution during research, ward rounds and case discussions, initiative in seeking learning opportunities, patient or research subject assessment, ability to succinctly present a patient case or research methods and findings, commitment to the research process, proactive engagement in research activities, behaviour towards peers and medical (and all other) colleagues, and awareness of social and ethical issues including risk assessment.</p>\n<p>The CPA for the PLC course has components which assess:</p>\n<ul>\n<li>Professional Practice</li>\n<li>Reflective Practice</li>\n<li>Social/Cultural Competence and Safety</li>\n</ul>\n<p>There is also a Student Flag component which allows a supervisor to report a student with concerning unprofessional or unsafe behaviour. The Student Flag component also provides a mechanism for notifying exemplary performance to the School.</p>\n<p>To maximise your learning, you are encouraged to actively seek feedback from your clinical teacher/s or research supervisor during your placement. This will assist in identifying any areas requiring further improvement before your Clinical Participation Assessment is completed. Active engagement in the clinical or research setting is a requirement to pass this assessment task.</p>\n<p>The CPA rubric can be found in the Blackboard Course Site for guidance so that you are familiar with marking criteria for each component.</p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p>The CPA is a global assessment of professional and clinical practice and contribute to your overall performance in the following ways:</p>\n<ol>\n<li>If you are enrolled concurrently in the WLP course, all components (Engagement in Practice, Professional Practice, Reflective Practice, Social/Cultural Competence and Safety and Student Flag) contribute to the WLP course.</li>\n<li>If you are not enrolled concurrently in the WLP course all components contribute to this PLC course.</li>\n</ol>\n<p>Additional information may be received by staff from clinical placement site/s or research staff where you completed this course. This will be reviewed by the Course Coordinator and ratings completed by your supervisor in the CPA may be revised. For example, if your supervisor rated you as satisfactory related to professional conduct but the Medical School has other information available, the supervisor’s ratings may be moderated based on this additional information.</p>\n<p>Your performance will be reviewed at the End of Semester Examiner’s meeting and following discussion may receive a fail in the WLP course (for condition 1 above) or the PLC course (for condition 2 above) if:</p>\n<ul>\n<li>There are any unsatisfactory results recorded in any of the CPA components </li>\n<li>There are four or more borderline results recorded in any of the CPA components </li>\n<li>The required number of CPAs have not been submitted to your supervisor for completion by the due date</li>\n</ul>\n<p>Factors that will be taken into account during the review undertaken at the End of Semester Examiner’s meeting include:</p>\n<ul>\n<li>Evidence of temporal improvement in performance across the course (if applicable)</li>\n<li>Completion and content of the WLP Task Review in response to unsatisfactory or borderline ratings</li>\n<li>Relative opportunity available across the semester</li>\n<li>Other factors relevant to your performance</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>A function of the CPA discussion and form completion is to consider information from the whole placement. Therefore, you are expected to complete your CPA discussion and submit your CPA form during the <strong>final</strong> week of placement. Given clinician availability, there may be times when this is not always possible. If you complete your CPA discussion and submit your CPA form before the <strong>final</strong><strong> </strong>week of placement for placements of 3 weeks or less, or before the <strong>penultimate</strong><strong> </strong>week of placement for placements longer than 3 weeks, additional information obtained by your supervisor or Course Coordinator maybe considered to add to that discussed and submitted. Therefore, you are discouraged from completing the CPA discussion and form submission early.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>If you fail to meet the submission deadline for any Clinical Participation Assessment without an approved extension, it will not be accepted and may result in course failure regardless of whether the supervisor has rated your participation at a satisfactory or proficient level in the related course components.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Development of Elective Learning Plan</strong><br><p>You will develop a learning plan for your elective. This is due on the first Friday of the block that you are doing the placement in.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Development of Elective Learning Plan</strong>",
            "topic_description": "Development of Elective Learning Plan You will develop a learning plan for your elective. This is due on the first Friday of the block that you are doing the placement in.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Reflective essay</strong><br><p>You will write a reflective essay to reflect on your elective. This is due on the Friday one week after the block in which the placement took place.</p></br></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Reflective essay</strong>",
            "topic_description": "Reflective essay You will write a reflective essay to reflect on your elective. This is due on the Friday one week after the block in which the placement took place.",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Multimedia presentation</strong><br><p>You are expected to create and share reports of your Elective experience with colleagues, and to review reports of others, as part of the activities of this course. Details are outlined in the assessment section.</p></br></p><p><strong>Learning outcomes:</strong> L03, L04</p></div></td>",
            "topic_title": "<strong>Multimedia presentation</strong>",
            "topic_description": "Multimedia presentation You are expected to create and share reports of your Elective experience with colleagues, and to review reports of others, as part of the activities of this course. Details are outlined in the assessment section.",
            "learning_outcomes": [
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Elective placement</strong><br><p>A period of 6 weeks in which you can pursue approved activities relevant to your future medical career.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Elective placement</strong>",
            "topic_description": "Elective placement A period of 6 weeks in which you can pursue approved activities relevant to your future medical career.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        }
    ]
}