{
    "course_title": "Maternal and Newborn Critical Illness",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MIDW2105-61326-7560",
    "full_course_code": "MIDW2105-61326-7560",
    "course_code": "MIDW2105",
    "class_code": "61326",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Critically examine the significance of consultation, referral and a multidisciplinary approach to the care of women and neonates with critical illness in pregnancy labour and the puerperium, including rural and remote settings."
        },
        {
            "number": "LO2.",
            "description": "Analyse the aetiology, management and apply skills including monitoring, assessment and care of the woman and baby for a range of emergency situations in pregnancy, labour, birth and the puerperium."
        },
        {
            "number": "LO3.",
            "description": "Using contemporary and appropriate evidence, critically review the pathophysiology of, diagnosis, and evidence for treatment of, and expected outcomes associated with critical illness and life-threatening emergencies of significance to midwifery practice."
        },
        {
            "number": "LO4.",
            "description": "Analyse and critically review the contemporary and relevant evidence used to inform midwifery care of women with a critical illness or life-threatening emergency, with a particular focus on the use of digital health technology to improve health outcomes."
        },
        {
            "number": "LO5.",
            "description": "Advocate culturally responsive strategies to support women and their families as they are challenged by and deal with the physical and psychological complications of a critical illness or a life-threatening emergency in pregnancy, labour, birth and the puerperium."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Oral Presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 14/08/2025 - 31/10/2025</p>\n<p>\n</p><p>Please submit your Oral Presentation via the link provided in the assessment folder of the Blackboard course on the day of your scheduled presentation. </p></dd>",
            "learning_objectives": null,
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Your individual<strong> </strong>oral presentation topic will be generated as a course identified learning outcome or directly as a critical issue from the prior IBL session. Presentations from the previous IBL session will take place BEFORE the next IBL session and presented in class. Your 15-minute oral presentation will compose up to 40 marks for the subject. </p>\n<p>Please note presentations will be recorded for marking purposes in alignment with UQ policies and procedures.</p>\n<p><em>Time length</em>:  Your presentation must be within +/- 10% of the allocated time. A time limit outside this 10% will result in 10% reduction of the total mark available. </p>\n<p><em>Reference system:</em><strong> </strong>Slides must be referenced throughout using APA 7th edition or Vancouver.</p>\n<p><em>Header</em><strong>: </strong>Student ID (eight digits), Course Code</p>\n<p><em>AI and Academic Integrity:</em><strong> </strong>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p><em>Please ensure that you complete and upload the AI assessment coversheet when you submit your assessment.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>This piece of assessment is to be submitted in the course Blackboard via the provided assessment link on the day of your scheduled presentation. By submitting your presentation, you are certifying that it is your original work and that where you have used the ideas or writing of other authors this has been acknowledged according to accepted academic guidelines. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Online invigilated on campus exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>60%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>8/11/2025 - 22/11/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment will examine the learning objectives of the MIDW2105 course content. Questions will be derived from lecture content, readings, and provided course content. The exam will be, online invigilated on campus in this course using the Inspera Assessment Platform. Inspera Assessment provides additional functionality to complement the existing suite of digital learning tools at UQ with a greater range of question types and accessibility provisions. Further details, including an Inspera demo test to familiarise yourself with the functionality, and where to go for support can be found in the course companion Blackboard site.</p>\n<p><em>Criteria &amp; Marking: </em>UQ Students: Please access the profile from <a href=\"https://learn.uq.edu.au/\">Learn.UQ</a> or <a href=\"https://www.sinet.uq.edu.au/\">mySI-net</a> to access the marking criteria for this assessment.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(28 Jul - 02 Nov)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Inquiry based learning workshops (IBL)</strong><br><p> Inquiry Based Learning is a mode of instruction which allows the students to take responsibility for their own learning. Students are required to attend tutorials and to participate in the discussion and generation of learning needs from a particular case based scenario. These sessions will be held on the same weeks as the lectures. Attendance is highly recommended.(See timetable for location).</p></br></p></div></td>",
            "topic_title": "<strong>Inquiry based learning workshops (IBL)</strong>",
            "topic_description": "Inquiry based learning workshops (IBL) Inquiry Based Learning is a mode of instruction which allows the students to take responsibility for their own learning. Students are required to attend tutorials and to participate in the discussion and generation of learning needs from a particular case based scenario. These sessions will be held on the same weeks as the lectures. Attendance is highly recommended.(See timetable for location).",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(28 Jul - 02 Nov)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>On-line learning self directed</strong><br/><p>Students are required to work through the on-line learning content of the course. Engaging in course readings, quizzes and learning activities</p></p></div></td>",
            "topic_title": "<strong>On-line learning self directed</strong>",
            "topic_description": "On-line learning self directed Students are required to work through the on-line learning content of the course. Engaging in course readings, quizzes and learning activities",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(28 Jul - 02 Nov)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture Series</strong><br/><p>In this course clinical experts in their respective fields ( Specialist Consultant Obstetricians, Clinical Specialist Midwives) will present the face to face lecture series, lectures will be recorded for review and study purposes however, attendance is highly recommended (See timetable for location). </p></p></div></td>",
            "topic_title": "<strong>Lecture Series</strong>",
            "topic_description": "Lecture Series In this course clinical experts in their respective fields ( Specialist Consultant Obstetricians, Clinical Specialist Midwives) will present the face to face lecture series, lectures will be recorded for review and study purposes however, attendance is highly recommended (See timetable for location).",
            "learning_outcomes": []
        }
    ]
}