{
    "course_title": "Teaching Music",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MUSC3780-60576-7560",
    "full_course_code": "MUSC3780-60576-7560",
    "course_code": "MUSC3780",
    "class_code": "60576",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Investigate recent theories and research on learning in music education"
        },
        {
            "number": "LO2.",
            "description": "Demonstrate an in-depth understanding of pedagogy and curriculum development specific to teaching music"
        },
        {
            "number": "LO3.",
            "description": "Design and implement meaningful, authentic and engaging music learning experiences using a range of approaches"
        },
        {
            "number": "LO4.",
            "description": "Demonstrate an ability to investigate the application of relevant theory to the practice of music education"
        },
        {
            "number": "LO5.",
            "description": "Work collaboratively with peers to identify problems, create solutions, innovate and improve teaching practices."
        },
        {
            "number": "LO6.",
            "description": "Develop a personal appreciation of the philosophical and social contexts of music education."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Team-teaching using innovative repertoire",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 13/10/2025 - 24/10/2025</p>\n<p>\n</p><p>This assessment will be conducted throughout during class in weeks 11 and 12. The written component is due (for all students) in Week 11, prior to class.</p></dd>",
            "learning_objectives": "L02, L03, L05",
            "mode": "Activity/ Performance",
            "category": "Practical/ Demonstration",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>In pairs, you are to teach a 15-minute learning sequence appropriate for students in Years 7 or 8.</p>\n<ol>\n<li>You should select one engaging piece of music or resource to form the basis of the lesson.</li>\n<li>Your teaching should investigate and build on this repertoire/resource to develop student musical understanding through 'making' and/or 'responding' learning experiences.</li>\n<li>Our class will be your students for this team-teaching exercise.</li>\n</ol>\n<p>You are required to supply your peers with the following documentation on the Blackboard Discussion Board prior to teaching:</p>\n<ol>\n<li>1 page (maximum) justification of your use of (i) the repertoire/resource and (ii) the teaching strategy employed. The justification should refer to at least four recent different academic sources and the relevant Australian Curriculum Syllabus. Full bibliographic details of sources and repertoire employed should be included in a short reference list (APA7).</li>\n<li>1 page lesson plan</li>\n</ol>\n<p><br/></p>\n<p>To enable both self and peer reflection, you are to organise a video recording of your teaching on the day, and also provide enough groupwork feedback sheets for your class to fill out after your presentation.</p>\n<p>Although feedback will be provided by peers (verbal and written), this assignment will be marked by the lecturer. Each student will be marked separately on their presentation, but the 1-page justification will be marked together. Any issues arising from working in pairs should be made known to the lecturer <em>in good time </em>before the scheduled presentation date.</p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission of written component via TurnItIn. Keep a copy of your video until the end of semester to be submitted if requested.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Critical Reflection",
            "special_indicators": [],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p>The oral exam will take place in Exam Week 1. Students will be able to nominate preferred times in Blacboard prior to the of the teaching period. </p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L06",
            "mode": "Oral",
            "category": "Examination, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>As a future teacher of music, you will benefit from understanding music learning and development in various educational contexts. You are required to critically reflect on your engagement in activities from each of the five categories below. <strong>Note: the activity in Category 5 </strong> takes place in the last week of lectures with real school children. Participation in this is paramount. Each activity should examine at least 3 course readings. A critical reflection discusses your personal experience and opinion by connecting to course readings, content and practical activities. While you are only required to refer to five activities in this assessment, you are strongly encouraged to complete all activities as this will benefit your development as a future music educator, and enhance your capacity to achieve the course outcomes. Complete the tasks throughout the semester to allow appropriate time for reflection. Some activities will take time to organise.</p>\n<p>Ensure you consult the assessment criteria in preparing your response to the oral exam. </p>\n<p><strong>Category 1: School Music Education Observation</strong></p>\n<ol>\n<li>Attend the field trip arranged by the course coordinator to observe classroom teaching, report on what you learned about a whole-school approach to music learning and development, and the importance of the classroom music teacher (refer to relevant sources, and link these to your experience).</li>\n</ol>\n<p><strong>Category 2: Observation of Music Learning In Ensembles</strong></p>\n<ol>\n<li>Attend at least two rehearsals of any of the ensembles from UQ Music. Observe, identify and analyse three music learning strategies employed within rehearsals. Detail how you could utilise them in your practice as a teacher. Suggest how these strategies could be adapted for appropriate age-level learning experiences and engaging repertoire (refer to relevant sources, and link these to your experience).</li>\n</ol>\n<p><strong>Category 3: Listening to Music Learners</strong></p>\n<ol>\n<li>Talk to three school-aged children whom you already know (eg. family). Find out about 1. What music they like 2. What they think about school music 3. What they would like to learn in relation to music. Reflect on how music education in schools could cater to these students’ musical aspirations (refer to relevant sources, and link these to your interviews). </li>\n<li>Engage some school-aged children that you already know (e.g. family) in informal learning of music. You could use an iPad, instruments, a music game, a recording. The options are endless, but you must NOT guide it – they need to guide themselves. Report on what you learned about their motivation for learning (refer to relevant sources, and link these to your experience).</li>\n</ol>\n<p><strong>Category 4: Designing Music Learning</strong></p>\n<ol>\n<li>Watch the series, <em>Don’t Stop the Music</em> and choose a child as a case study. Report on what you learned about children you could apply to your practice as a music teacher. Provide a brief outline of a learning experience you could implement for this child at the beginning of secondary school (i.e. Year 7), justifying your approach using relevant sources.</li>\n<li>Select or design a composition-based musical activity/game. Discuss how you would use it for 3-5-year-olds, 6-8-year-olds, 9-12-year-olds, and 13-14-year-olds, based on your knowledge of psychological and social development at these ages. Discuss how your adjustment of the game makes it appropriate for each age group (refer to relevant sources to justify your design).</li>\n<li>Investigate an online music learning course (e.g. <a href=\"https://learningmusic.ableton.com/\">https://learningmusic.ableton.com/</a>). Report on the principles of learning design that intersect with the theories/readings from this course.</li>\n</ol>\n<p><strong>Category 5: Applying your learning with children</strong></p>\n<p>1.    Building on the feedback from your peer teaching assessment, you will have the opportunity to run workshops with children in years 7-9. This will take place on the University Campus in the final week of classes, and further details will be made available to you through Blackboard. Use this opportunity to consider how you can motivate children in years 7-9 to better engage with repertoire.</p>\n<p> </p>\n<p><strong>Oral Exam:</strong> Your reflection will take place in a conversational oral exam. In critically reflecting aloud with your examiner, you will need to be able to draw on literature read and experiences had in the course to reinforce or justify opinions about music education in contemporary society. Questions will be asked to probe your demonstration of the objectives and understanding of the course content. You will be asked 1.what activities you chose and why; 2. To describe your observations and critically reflect about what you have learnt about music education against the course readings and content; and 3. What this means about your learning about teaching music, including implications for your future practice.</p>\n<p> Length of oral exam: 15 minutes.</p>\n<p>Allowable materials: You can bring in your notes from your engagements, and a reference list to refer to, if you would like.</p>\n<p>Date of presentation: In exam block. To be conducted in person, on campus. A Wiki site will be set up on Blackboard.</p>\n<p><br/></p>\n<p>If you have any concerns about completing a task in each category, please communicate this in a timely manner to your lecturers (prior to the suggested week in the Blackboard guide), who will help you to undertake an alternative suggested activity relevant to the course, which you will be able to reflect on in your oral examination.</p>\n<p><br/></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Not a submissible item. Students will complete the exam in person, with times to be confirmed before the end of the teaching period. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Music Education Philosophy",
            "special_indicators": [],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 19/09/2025 5:00 pm</p></dd>",
            "learning_objectives": "L01, L04, L06",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You are to develop a personalised and research-informed contemporary philosophy of music education. Your essay should:</p>\n<ol>\n<li>Articulate your beliefs and values about music learning and development with connection to at least 10 course readings, and discuss the implications for your future practice.</li>\n<li>Draw upon your own music education experiences to date, including activities from this course.</li>\n</ol>\n<p>In addition to 10 course readings in your reference list (APA7), you are also encouraged to read and cite beyond the course literature.</p>\n<p>It is anticipated your philosophy of music education may evolve throughout your studies and that this assignment will serve as a useful resource for you in the future.</p>\n<p>1750-2000 words</p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(28 Jul - 02 Nov)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshops</strong><br><p>Workshops will be conducted each week, and will cover topics such as: Developing your own understandings of music education. Constructivist music education Philosophies and approaches to music education Creativity in music education Musical development and abilities Planning for music learning. Students should consult the outline on Blackboard and the timetable for more details.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Workshops</strong>",
            "topic_description": "Workshops Workshops will be conducted each week, and will cover topics such as: Developing your own understandings of music education. Constructivist music education Philosophies and approaches to music education Creativity in music education Musical development and abilities Planning for music learning. Students should consult the outline on Blackboard and the timetable for more details.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 4(18 Aug - 24 Aug)",
            "activity_type": "Excursion",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Field Trips</strong><br><p>Students will have their lecture held at  Marist College Ashgrove during the lecture time in week 4.  Detailed risk assessment and further information about the school is available on Blackboard.</p>\n<p>Blue Cards are compulsory for this activity. Bring your Blue Cards with you to schools and always dress professionally.</p></br></p><p><strong>Learning outcomes:</strong> L04</p></div></td>",
            "topic_title": "<strong>Field Trips</strong>",
            "topic_description": "Field Trips Students will have their lecture held at  Marist College Ashgrove during the lecture time in week 4.  Detailed risk assessment and further information about the school is available on Blackboard. Blue Cards are compulsory for this activity. Bring your Blue Cards with you to schools and always dress professionally.",
            "learning_outcomes": [
                "L04"
            ]
        }
    ]
}