{
    "course_title": "Clinical Nursing Practice 7",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/NUMW3214-60008-7560",
    "full_course_code": "NUMW3214-60008-7560",
    "course_code": "NUMW3214",
    "class_code": "60008",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (21/07/2025 - 15/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Capably enact at the level of a graduate registered nurse the key requirements for professional nursing practice defined by Nursing and Midwifery Board of Australia’s Professional Standards."
        },
        {
            "number": "LO2.",
            "description": "Effectively plan, implement and evaluate nursing care for a full caseload that respects and acknowledges the values of individuals and their family while maintaining the principles of confidentiality and applies an evidence-based practice framework."
        },
        {
            "number": "LO3.",
            "description": "Demonstrate effective time management, clinical reasoning and professional judgement to deliver person centred nursing care that is responsive to alterations in the individual’s clinical condition and manages risk for adverse events."
        },
        {
            "number": "LO4.",
            "description": "Utilise effective written, verbal, non-verbal, and digital communication and beginning leadership skills to inform, educate and empower individuals, their family and colleagues towards safe and expected healthcare outcomes for the individual."
        },
        {
            "number": "LO5.",
            "description": "Apply knowledge of pharmacological principles including safe use of medicines, and monitoring of response under the direct supervision of the registered nurse."
        },
        {
            "number": "LO6.",
            "description": "Apply reflective practice to identify goals and self-evaluate progress in ongoing professional development, appropriately selecting and utilising healthcare evidence and feedback to ensure capability for practice."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Medication Calculation Assessment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> Non graded pass/fail </dd>",
            "due_date": "<dd><p> 28/07/2025 1:00 pm</p>\n<p>\n</p><p><br/></p>\n<p>Students are to upload the completed medication safety certificates via the Blackboard assessment link.</p></dd>",
            "learning_objectives": "L01, L04, L05",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment will examine your knowledge regarding medication safety which includes medication calculations and the “rights” of medication administration. The link to the required medication safety exams will be available via the course Blackboard site:</p>\n<p>·        Medication Rights and Medication Calculations: Milestone #4</p>\n<p>Students are required to achieve 100% accuracy for the nominated medication safety exams. While there is the opportunity for ongoing repeat attempts at the exams, 100% accuracy must be achieved.</p>\n<p>Any students unable to achieve 100% accuracy by the due date will not proceed to clinical placement. Students unsuccessful in the assessment attempt will be informed via their UQ email of the requirements and due date of the second attempt. Students are to refer to the course Blackboard site Assessment tab for additional details. </p>\n<p>Students must undertake and be successful in their medication safety exam. This must be completed prior to undertaking medication administration.</p>\n<p>Medication administration under direct RN supervision is an expected scope of practice for all undergraduate students.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students to upload the completed Medication Safety certificate via the Blackboard assessment link.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Clinical Placement",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> Non-graded pass/fail </dd>",
            "due_date": "<dd><p><br/></p>\n<p>Due dates are dependent on allocated placement.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Activity/ Performance, Written",
            "category": "Placement, Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>An expectation of this course is satisfactorily meeting the Nursing and Midwifery Board of Australia (NMBA) Registered Nurse Standards for Practice while practicing under the scope of a third year, second semester Bachelor of Nursing/Bachelor of Midwifery student. The course requires successful completion of 360 hours of clinical placement. The formative and summative assessment items need to be completed with successful Summative Australian Nursing Standards Assessment Tool (ANSAT). </p>\n<p><strong>Part A: Formative Assessment </strong></p>\n<p><strong>1. Placement Readiness Plan</strong></p>\n<p>Within the first two days of clinical placement students will develop a Placement Plan. The Placement Plan will be discussed with your clinical facilitator. The overall aim of the plan is to support you to develop agency in your learning and consider how to integrate learning and feedback between different contexts. Through completing placement plans iteratively, you demonstrate your ability to take initiative to prepare for placement and review previous assessments to identify gaps or challenges that need further work as you progress towards working as a Registered Nurse.</p>\n<p><strong> 2. Clinical Skills Assessment</strong></p>\n<p>Within the first half of your clinical placement (prior to your Formative ANSAT) you will select three clinical skills to demonstrate to your Buddy RN or Clinical Facilitator. You will choose one from the medication administration clinical skills list, one from the patient assessment clinical skills list, and one from the clinical procedures clinical skills list. You will demonstrate your ability to safely undertake these activities, and request written feedback on your performance. Information on how to complete your Clinical Skills Assessment will be provided to you prior to starting placement.</p>\n<p><strong>3. Self-evaluation of Nursing Standards of Practice</strong></p>\n<p>Immediately prior to undertaking your Formative ANSAT you will self-evaluate your performance against the NMBA Registered Nurse Standards for Practice. The aim of this task is to support your ability to evaluate your own performance through making comparisons of your work to that of your peers, supervisors and to the descriptions in the rubric. Through iterative engagement with the standards of practice, you will demonstrate your ability to actively seek and action feedback information and to persist despite the emotional challenges associated with engaging in constructive feedback.</p>\n<p><strong> 4. Formative ANSAT</strong></p>\n<p>Must be completed and submitted via ePAD at the mid-point of placement (after approx. 120 hours of placement):</p>\n<ul>\n<li>Must be signed by Buddy RN/Preceptor or PPE/Clinical Supervisor.</li>\n<li>All sections must be completed (scores and comments).</li>\n<li><em>Students must receive a score of 3 or above on every criterion to meet the expected level of performance.</em></li>\n</ul>\n<p>Please note: Submitting the Formative ANSAT mid-placement will ensure that students who have not yet met the expected level of performance (scores of 3 and above) can be assisted with a Learning Support Plan through to the end of placement. </p>\n<p><strong> 5. Feedback and Action Plan</strong></p>\n<p>Immediately following your Formative ANSAT you will reflect on the feedback you have received and identify areas for improvement which will be then discussed with your clinical facilitator. The purpose of this task is to assess capacity for self-reflection and ability to process feedback from various sources, to deeply engage with your level of knowledge and professional skills. Through reviewing your completed Formative ANSAT in ePAD, you will demonstrate your ability for accurate self-evaluation and showcase your proficiency in monitoring professional and clinical development over time, reflect on achievements, and identify areas for further growth.</p>\n<p><strong>Part B: Summative assessment:</strong></p>\n<p><strong> 1. Hand Hygiene Certificate:</strong></p>\n<p>Hand hygiene is a fundamental nursing skill and is essential to safe patient care. You are required to complete the Hand Hygiene for Clinical Healthcare Workers online module. Successful completion of this assessment is defined as achieving 100% in the quiz at the end of the module and uploading the certificate to Blackboard prior to your Formative ANSAT. You have unlimited attempts to achieve a pass grade prior to the submission due date.</p>\n<p><strong>2. Summative ANSAT</strong></p>\n<p>Must be completed on your last or second-to-last shift and submitted via ePAD by the end of placement:</p>\n<ul>\n<li>Must be signed by Buddy RN/Preceptor or PPE/Clinical Supervisor.</li>\n<li>All sections must be completed (scores and comments).</li>\n<li><em>Students must receive a score of 3 or above on every criterion to pass. </em>(Any scores of 2 or below at this final assessment means that a student has not achieved passing requirements for this course).</li>\n<li>The completed timesheet must demonstrate all required hours of clinical placement for this course, undertaken within the rostered timeframe as advised by the Clinical Placement Unit.</li>\n</ul>\n<p>Students are to refer to the \"Assessment\" tab located within the Course Blackboard site for further details and specifications of the assessment items.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>All items of assessment are submitted via MyProgress (ePAD) during placement via the tabs in the student ePAD portal.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Objective Clinical Skills Assessment/Exam (OSCA)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 21/07/2025 - 1/08/2025</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Activity/ Performance",
            "category": "Role play/ Simulation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Objective Structured Clinical Assessment (OSCA) will assess the application of foundational nursing skills:</p>\n<p>·        Effectively plan, implement, and evaluate responsive nursing interventions while managing time efficiently. •</p>\n<p>·        Exercise professional judgment in addressing patient needs, utilising interprofessional communication skills to collaborate effectively with team members. </p>\n<p>·        Engage in reflective practice to identify areas for professional growth, set development goals, and integrate feedback into strategies for maintaining competence in clinical practice.</p>\n<p>The OSCAs will be conducted in the CBL rooms at the Mater Whitty Building during the timetabled OSCA in orientation week and week 1 . The OSCA case scenario will be made available to students via the course Blackboard site prior to the OSCA date. </p>\n<p><br/></p>\n<p>Students are to refer to the course Blackboard site for additional details related to this assessment.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The OSCA is assessed within the simulation space. Students must attend their allocated OCSA and present in accordance with the UQ NMWS uniform policy to be permitted to undertake the OSCA.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Clinical Placement </strong><br><p>Students are expected to complete 100% of their allocated placement hours to meet the course learning outcomes and be eligible for a pass.</p>\n<p>Clinical placements must be completed within the rostered timeframe advised by the Practice Education Team. Clinical placements may occur during public holidays as well as during the Mid-Semester Break (please refer to your allocated roster from the Practice Education Team).</p>\n<p>Students will be required to participate in hospital/corporate mandatory credentialling and other relevant learning opportunities including online modules. Some clinical placement sites will also require student attendance at orientation sessions. Please refer to the Nursing &amp; Midwifery Practice Education (Clinical Placements) Blackboard site.</p>\n<p>It is an inherent requirement of the Bachelor of Nursing degree to complete supernumerary professional placements in a range of clinical areas over the duration of the degree. Inherent requirements are the essential components of a course that demonstrate the capabilities, knowledge and skills to achieve the core learning outcomes. The Inherent Requirements Student Placement Declaration form must be completed on enrolment to the course when preferencing or completing attendance placement documentation in InPlace. Should a student’s circumstances change throughout the course of the semester, students are advised to contact the course coordinator to discuss the implications of these changes for your clinical placement.</p>\n<p>Compliance Statement</p>\n<p>Students are responsible for meeting all pre-placement mandatory requirements before the due date, which will be communicated to you by the Practice Education Team. Failure to comply with these requirements will result in no clinical placement allocation. Students who receive written notification of failure to comply with pre-placement and mandatory requirements will be given a short timeframe to address these. If students do not meet the final compliance deadlines they will no longer be eligible to undertaken clinical placement and no further clinical placement allocation will occur. In these instances students are advised to withdraw from the course before the census date.</p>\n<p>Absenteeism from Clinical Placement</p>\n<p>Clinical placement shifts are compulsory components of the &lt;Master of Nursing Studies/ Nursing program&gt;. On the occasion that you are unable to attend clinical placements due to exceptional circumstances, you must follow the instructions outlined in the Attendance and Absence procedure and InPlace guide - please see the Nursing &amp; Midwifery Practice Education (Clinical Placements) Blackboard site. You must also ensure you notify your ward, Practice Educator and Clinical Course Coordinator of your absence.</p>\n<p>Please note:</p>\n<p>· Students are not authorised to arrange their own shifts</p>\n<p>· Deferred clinical placements may be scheduled out of semester. A deferred clinical placement, like a deferred examination, is the final offering for student to completed clinical placement requirements to meet the course outcomes and be eligible to pass.</p>\n<p>· Students are not able to defer, a deferred placement offering.</p>\n<p>· If there is a clash with a scheduled clinical placement shift and an exam, students are to contact the Practice Education Team and the relevant subject coordinator immediately to discuss arrangements.</p>\n<p>Scope of Practice</p>\n<p>Students must adhere to the course Scope of Practice at all times while on clinical placement. This requirement addresses patient safety and students will be removed from placement or risk failing the course if working outside their scope. Please refer to the guidelines in the Nursing &amp; Midwifery Practice Education (Clinical Placements) Blackboard site.</p>\n<p>Unsafe practice during clinical placement:</p>\n<p>A decision of unsafe clinical performance is made when a student's performance places a patient/client, a patient’s/client's family, staff members, themselves, or fellow students at risk. If students practice in a way that is deemed unsafe or breaches the relevant scope of practice during their clinical placement they will be asked to leave the placement and a fail grade will be awarded for the course.</p>\n<p>Professional manner during professional placement:</p>\n<p>Students must always conduct themselves professionally during professional placement. Unprofessional behaviour may lead to a Learning Support Plan, immediate removal from the clinical placement, or termination of the placement. This could result in a failing grade in the course.</p>\n<p>Social Media</p>\n<p>Students are prohibited from posting any images of patients, clinical venues, or clinical documentation on social media. Students should also refrain from making comments related to clinical placement, UQ, or clinical venues that may violate University or institutional policies or guidelines or bring UQ into disrepute. Failure to comply with this guideline will result in removal of the student(s) from placement, and a failing grade for this course.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Clinical Placement </strong>",
            "topic_description": "Clinical Placement Students are expected to complete 100% of their allocated placement hours to meet the course learning outcomes and be eligible for a pass. Clinical placements must be completed within the rostered timeframe advised by the Practice Education Team. Clinical placements may occur during public holidays as well as during the Mid-Semester Break (please refer to your allocated roster from the Practice Education Team). Students will be required to participate in hospital/corporate mandatory credentialling and other relevant learning opportunities including online modules. Some clinical placement sites will also require student attendance at orientation sessions. Please refer to the Nursing & Midwifery Practice Education (Clinical Placements) Blackboard site. It is an inherent requirement of the Bachelor of Nursing degree to complete supernumerary professional placements in a range of clinical areas over the duration of the degree. Inherent requirements are the essential components of a course that demonstrate the capabilities, knowledge and skills to achieve the core learning outcomes. The Inherent Requirements Student Placement Declaration form must be completed on enrolment to the course when preferencing or completing attendance placement documentation in InPlace. Should a student’s circumstances change throughout the course of the semester, students are advised to contact the course coordinator to discuss the implications of these changes for your clinical placement. Compliance Statement Students are responsible for meeting all pre-placement mandatory requirements before the due date, which will be communicated to you by the Practice Education Team. Failure to comply with these requirements will result in no clinical placement allocation. Students who receive written notification of failure to comply with pre-placement and mandatory requirements will be given a short timeframe to address these. If students do not meet the final compliance deadlines they will no longer be eligible to undertaken clinical placement and no further clinical placement allocation will occur. In these instances students are advised to withdraw from the course before the census date. Absenteeism from Clinical Placement Clinical placement shifts are compulsory components of the <Master of Nursing Studies/ Nursing program>. On the occasion that you are unable to attend clinical placements due to exceptional circumstances, you must follow the instructions outlined in the Attendance and Absence procedure and InPlace guide - please see the Nursing & Midwifery Practice Education (Clinical Placements) Blackboard site. You must also ensure you notify your ward, Practice Educator and Clinical Course Coordinator of your absence. Please note: · Students are not authorised to arrange their own shifts · Deferred clinical placements may be scheduled out of semester. A deferred clinical placement, like a deferred examination, is the final offering for student to completed clinical placement requirements to meet the course outcomes and be eligible to pass. · Students are not able to defer, a deferred placement offering. · If there is a clash with a scheduled clinical placement shift and an exam, students are to contact the Practice Education Team and the relevant subject coordinator immediately to discuss arrangements. Scope of Practice Students must adhere to the course Scope of Practice at all times while on clinical placement. This requirement addresses patient safety and students will be removed from placement or risk failing the course if working outside their scope. Please refer to the guidelines in the Nursing & Midwifery Practice Education (Clinical Placements) Blackboard site. Unsafe practice during clinical placement: A decision of unsafe clinical performance is made when a student's performance places a patient/client, a patient’s/client's family, staff members, themselves, or fellow students at risk. If students practice in a way that is deemed unsafe or breaches the relevant scope of practice during their clinical placement they will be asked to leave the placement and a fail grade will be awarded for the course. Professional manner during professional placement: Students must always conduct themselves professionally during professional placement. Unprofessional behaviour may lead to a Learning Support Plan, immediate removal from the clinical placement, or termination of the placement. This could result in a failing grade in the course. Social Media Students are prohibited from posting any images of patients, clinical venues, or clinical documentation on social media. Students should also refrain from making comments related to clinical placement, UQ, or clinical venues that may violate University or institutional policies or guidelines or bring UQ into disrepute. Failure to comply with this guideline will result in removal of the student(s) from placement, and a failing grade for this course.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Online Module Series of 4</strong><br><p>The primary objective the online modules is to supplement and enhance students' understanding of clinical concepts and practices. These modules offer flexible and accessible learning resources that reinforce classroom teaching and clinical experiences, ensuring a comprehensive educational experience. The online modules provide students with the flexibility to learn at their own pace and on their own schedule. This is particularly beneficial for students with varied commitments, allowing them to balance their studies with clinical placements, part-time work, and personal responsibilities. The online modules include interactive elements such as quizzes, videos, and case studies. These features engage students actively in their learning process, helping to reinforce knowledge and improve retention.</p></br></p><p><strong>Learning outcomes:</strong> L01, L05</p></div></td>",
            "topic_title": "<strong>Online Module Series of 4</strong>",
            "topic_description": "Online Module Series of 4 The primary objective the online modules is to supplement and enhance students' understanding of clinical concepts and practices. These modules offer flexible and accessible learning resources that reinforce classroom teaching and clinical experiences, ensuring a comprehensive educational experience. The online modules provide students with the flexibility to learn at their own pace and on their own schedule. This is particularly beneficial for students with varied commitments, allowing them to balance their studies with clinical placements, part-time work, and personal responsibilities. The online modules include interactive elements such as quizzes, videos, and case studies. These features engage students actively in their learning process, helping to reinforce knowledge and improve retention.",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        },
        {
            "learning_period": "Week 1(28 Jul - 03 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Orientation/Clinical Lecture</strong><br><p>It is an expectation of the course that students will attempt to attend all lecture sessions. However, when students are unable to attend lectures, they are recorded for student reference. Lecture sessions provide the opportunity for students to engage with fellow students and engage in the lecture series.</p></br></p><p><strong>Learning outcomes:</strong> L01, L05</p></div></td>",
            "topic_title": "<strong>Orientation/Clinical Lecture</strong>",
            "topic_description": "Orientation/Clinical Lecture It is an expectation of the course that students will attempt to attend all lecture sessions. However, when students are unable to attend lectures, they are recorded for student reference. Lecture sessions provide the opportunity for students to engage with fellow students and engage in the lecture series.",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Transition to Graduate Nursing Practice Workshop</strong><br><p>The primary objective of the clinical lecture is to enhance students' understanding of specific nursing topics through detailed presentations and discussions. This learning activity aims to deepen theoretical knowledge, clarify complex concepts, and relate them to practical clinical scenarios.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Transition to Graduate Nursing Practice Workshop</strong>",
            "topic_description": "Transition to Graduate Nursing Practice Workshop The primary objective of the clinical lecture is to enhance students' understanding of specific nursing topics through detailed presentations and discussions. This learning activity aims to deepen theoretical knowledge, clarify complex concepts, and relate them to practical clinical scenarios.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Transition to Graduate Nursing Practice Workshop</strong><br><p>This workshop will help you develop knowledge and skills to support self-care, and personal and professional wellbeing during the transition to graduate nursing practice.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Transition to Graduate Nursing Practice Workshop</strong>",
            "topic_description": "Transition to Graduate Nursing Practice Workshop This workshop will help you develop knowledge and skills to support self-care, and personal and professional wellbeing during the transition to graduate nursing practice.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}