{
    "course_title": "Clinical Nursing Practice 4",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/NURS7131-60545-7560",
    "full_course_code": "NURS7131-60545-7560",
    "course_code": "NURS7131",
    "class_code": "60545",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Utilise evidence-based information to develop clinical skills in simulated and clinical environments at a novice level."
        },
        {
            "number": "LO2.",
            "description": "Practice legal, ethical, cultural and professional principles within the scope of a student nurse when undertaking patient care and/or performing clinical responsibilities."
        },
        {
            "number": "LO3.",
            "description": "Demonstrate critical thinking and reasoning, commensurate with program level, when delivering, evaluating and reflecting on evidence-based care in accordance with the Nursing and Midwifery Board of Australia competency domains at a novicelevel."
        },
        {
            "number": "LO4.",
            "description": "Apply learned interpersonal, clinical assessment and clinical intervention skills in the planning and management of nursing care in accordance with the Nursing and Midwifery Board of Australia competency domains at a novice level."
        },
        {
            "number": "LO5.",
            "description": "Engage in effective verbal, non-verbal and written professional communication with patients and interdisciplinary team members."
        },
        {
            "number": "LO6.",
            "description": "Establish therapeutic relationships with patients that are goal-directed, patient-centred and care-focused within expected professional boundaries."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Medication Calculation Exam (Med+Safe)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 29/07/2025 4:00 pm</p></dd>",
            "learning_objectives": "L02, L04",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment consists of an online medication calculation invigilated exam conducted through the Med+Safe eLearning program. The exam will assess students’ ability perform medication calculations and apply the rights of medication administration to support the safe administration of medications in clinical settings.</p>\n<p>Students are required to bring their own internet enabled laptop or electronic device with access to the Med+Safe eLearning program, including login details and password, to complete the online exam.</p>\n<p>Students are encouraged to undertake preparatory practice of the Med+Safe questions prior to the exam. Each assessment draws on a large pool of questions. Each time you attempt the assessment you will receive different questions of a similar style and content.</p>\n<p><strong>Students are required to achieve 100% accuracy with unlimited attempts within the exam timeframe. </strong></p>\n<p>Students are to refer to the course Blackboard site for additional details related to this assessment.</p>\n<p><strong>Medication administration on clinical placement must occur under direct Registered Nurse supervision. This is the required scope of practice for all UQ nursing students.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The Med+Safe certificate and student ID must be shown to the invigilator and marked off the student list before leaving the exam venue. Students must submit the Med+Safe certificate to Blackboard within 24 hours of the examination.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Clinical Placement",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p>Due dates are dependent on the allocated placement.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Activity/ Performance",
            "category": "Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>An expectation of this course is satisfactorily meeting the Nursing and Midwifery Board of Australia (NMBA) Registered Nurse Standards for Practice while practicing under the scope of a second year, second semester Master of Nursing Studies student. The course requires successful completion of 280 hours of clinical placement. The formative and summative assessment items need to be completed with successful Summative Australian Nursing Standards Assessment Tool (ANSAT). </p>\n<p>All items of assessment are submitted via MyProgress (ePAD) during placement via the tabs in your ePAD portal.<strong> </strong></p>\n<p><strong>Part A: Formative Assessment </strong></p>\n<p><strong>1. Placement Readiness Plan</strong></p>\n<p>Within the first two days of clinical placement students will develop a Placement Plan. The overall aim of the plan is to support you to develop agency in your learning and consider how to integrate learning and feedback between different contexts. Through completing placement plans iteratively, you demonstrate your ability to take initiative to prepare for placement and review previous assessments to identify gaps or challenges that need further work as you progress towards working as a Registered Nurse. </p>\n<p><strong>2. Clinical Skills Assessment</strong></p>\n<p>Within the first half of your clinical placement (prior to your Formative ANSAT) you will select three clinical skills to demonstrate to your Buddy RN or Clinical Facilitator. You will choose one from the medication administration clinical skills list, one from the patient assessment clinical skills list, and one from the clinical procedures clinical skills list. You will demonstrate your ability to safely undertake these activities, and request feedback on your performance via ePAD. Information on how to complete your Clinical Skills Assessment will be provided to you prior to starting placement.</p>\n<p><strong>3. Self-evaluation of Nursing Standards of Practice</strong></p>\n<p>Immediately prior to undertaking your Formative ANSAT you will self-evaluate your performance against the NMBA Registered Nurse Standards for Practice. The aim of this task is to support your ability to evaluate your own performance through making comparisons of your work to that of your peers, supervisors and to the descriptions in the rubric. Through iterative engagement with the standards of practice, you will demonstrate your ability to actively seek and action feedback information and to persist despite the emotional challenges associated with engaging in constructive feedback. </p>\n<p><strong>4. Formative ANSAT</strong></p>\n<p>Must be completed and submitted via ePAD at the mid-point of placement (after approx. 140 hours of placement)</p>\n<ul>\n<li>Must be signed by Buddy RN/Preceptor or PPE/Clinical Supervisor.</li>\n<li>All sections must be completed (scores and comments).</li>\n<li><em>Students must receive a score of 3 or above on every criterion to meet the expected level of performance.</em></li>\n</ul>\n<p>Please note: Submitting the Formative ANSAT mid-placement will ensure that students who have not yet met the expected level of performance (scores of 3 and above) can be assisted with a Learning Support Plan through to the end of placement. </p>\n<p><strong>5. Feedback and Action Plan</strong></p>\n<p>Immediately following your Formative ANSAT you will reflect on the feedback you have received and identify areas for improvement (completed via ePAD). The purpose of this task is to assess capacity for self-reflection and ability to process feedback from various sources, to deeply engage with your level of knowledge and professional skills. Through reviewing your completed Formative ANSAT in ePAD, you will demonstrate your ability for accurate self-evaluation and showcase your proficiency in monitoring professional and clinical development over time, reflect on achievements, and identify areas for further growth. </p>\n<p><strong>Part B: Summative Assessment:</strong></p>\n<p><strong>1. Hand Hygiene Certificate:</strong></p>\n<p>Hand hygiene is a fundamental nursing skill and is essential to safe patient care. You are required to complete the Hand Hygiene for Clinical Healthcare Workers online module. Successful completion of this assessment is defined as achieving 100% in the quiz at the end of the module and uploading the certificate to ePAD prior to your Formative ANSAT. You have unlimited attempts to achieve a pass grade prior to the submission due date. </p>\n<p><strong>2. Summative ANSAT</strong></p>\n<p>Must be completed on your last or second-to-last shift and submitted via ePAD by the end of placement:</p>\n<ul>\n<li>Must be signed by Buddy RN/Preceptor or PPE/Clinical Supervisor.</li>\n<li>All sections must be completed (scores and comments).</li>\n<li><em>Students must receive a score of 3 or above on every criterion to pass. </em>(Any scores of 2 or below at this final assessment means that a student has not achieved passing requirements for this course).</li>\n<li>The completed timesheet must demonstrate all required hours of clinical placement for this course, undertaken within the rostered timeframe as advised by the Clinical Placement Unit.</li>\n</ul>\n<p>Students are to refer to the \"Assessment\" tab located within the Course Blackboard site for further details and specifications of the assessment items.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>All items of assessment are submitted via MyProgress (ePAD) during placement via the tabs in the student ePAD portal.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 12(28 Jul - 26 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lectures</strong><br><p>In this course there are two Lectures occurring in teaching Weeks 1 and 12. Please see your timetable and the NURS7131 Blackboard site for more information.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Lectures</strong>",
            "topic_description": "Lectures In this course there are two Lectures occurring in teaching Weeks 1 and 12. Please see your timetable and the NURS7131 Blackboard site for more information.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(28 Jul - 02 Nov)",
            "activity_type": "Case-based learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Online Modules</strong><br><p>There are learning modules in Blackboard for students to complete across the semester.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Online Modules</strong>",
            "topic_description": "Online Modules There are learning modules in Blackboard for students to complete across the semester.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 4 To Week 13(18 Aug - 02 Nov)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshops</strong><br><p>In this course there are two Workshops relating to transition to graduate practice in Weeks 4 and 13. Please see your Timetable and the NURS7131 Blackboard site for more information.</p></br></p><p><strong>Learning outcomes:</strong> L02, L05, L06</p></div></td>",
            "topic_title": "<strong>Workshops</strong>",
            "topic_description": "Workshops In this course there are two Workshops relating to transition to graduate practice in Weeks 4 and 13. Please see your Timetable and the NURS7131 Blackboard site for more information.",
            "learning_outcomes": [
                "L02",
                "L05",
                "L06"
            ]
        }
    ]
}