{
    "course_title": "Environmental Philosophy",
    "study_period": "Sem 2 2025",
    "location": "External",
    "attendance": "Online",
    "url": "https://course-profiles.uq.edu.au/course-profiles/PHIL7221-61293-7560",
    "full_course_code": "PHIL7221-61293-7560",
    "course_code": "PHIL7221",
    "class_code": "61293",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "appreciate ethical, social and political issues raised by human relationships to the environment"
        },
        {
            "number": "LO2.",
            "description": "understand how ethical and political theory can help frame arguments relating to environmental obligations"
        },
        {
            "number": "LO3.",
            "description": "understand how ethical and political theory can help frame arguments relating to environmental obligations or policies."
        },
        {
            "number": "LO4.",
            "description": "appreciate the diverse disciplinary perspectives which deal with environmental problems"
        },
        {
            "number": "LO5.",
            "description": "better and more precisely analyse and articulate problems"
        },
        {
            "number": "LO6.",
            "description": "better analyse and evaluate complex ethical dilemmas"
        },
        {
            "number": "LO7.",
            "description": "think critically, systemically and carefully in analysing complex problems"
        },
        {
            "number": "LO8.",
            "description": "improved capacity to develop depth and reasoning in arguments relating to environmental imperatives."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Tutorial Participation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p> 7/08/2025 - 30/10/2025</p>\n<p>\n</p><p>Participation is assessed in tutorials, which occurs in Weeks 2 - 13, excluding Weeks 3 and 9.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Activity/ Performance",
            "category": "Participation/ Student contribution",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students are assessed on their engagement with in-class activities according to the criteria below. This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<p>Your tutorial participation will be assessed according to the following criteria: </p>\n<p>1.    Evidence of participation in discussions.</p>\n<p>2.    Evidence of preparation for the tutorial, most notably through completing the set readings.</p>\n<p>3.    Quality of contributions to discussions.</p>\n<p>4.    Fostering of group discussions, through courteous and respectful interactions with staff and     students. </p>\n<p>5.    Attendance is necessary to fulfil the above criteria, as per the course requirements, but marks cannot be awarded for attendance alone.</p>\n<p> To achieve a grade of 7 (High Distinction, 85-100%), your attendance will be flawless and your participation exceptional. This grade reflects exceptional levels of preparation, mastery of course materials, and very high quality contributions to, and fostering of, group discussions. You should be able to engage with your peers very effectively.</p>\n<p> </p>\n<p>To achieve a grade of 6 (Distinction, 75-84) your attendance will be excellent and your participation very substantial. This grade reflects excellent levels of preparation, knowledge of course materials, and high quality contributions to, and fostering of, group discussions. You should be able to engage with your peers effectively.</p>\n<p> </p>\n<p>To achieve a grade of 5 (Credit, 65 – 74%), your attendance and participation will be good. This grade reflects proficient levels of preparation, good knowledge of course materials, and good quality contributions to, and fostering of, group discussions.</p>\n<p> </p>\n<p>To achieve a grade of 4 (Pass, 50 – 64%) your attendance and participation will be satisfactory. This grade reflects adequate levels of preparation and knowledge of course materials, and an acceptable quality of contributions to, and fostering of, group discussions.</p>\n<p>To achieve a grade of 3 (Marginal Fail, 45 – 49%) your attendance and participation will be unsatisfactory. This grade reflects irregular attendance and/or participation and superficial knowledge of course materials and basic levels of preparation. However, when in attendance, there is evidence of your ability to demonstrate developing achievement in contributions to, and fostering of, group discussions.</p>\n<p> </p>\n<p>To achieve a grade of 2 (Fail, 25-44%), your attendance and participation will be very unsatisfactory. This grade reflects irregular attendance and/or participation, minimal knowledge of course materials, little evidence of preparation, and mixed to low quality of contributions to, and fostering of, group discussions.</p>\n<p> </p>\n<p>To achieve a grade of 1 (Low Fail, 0-24%), your attendance and participation will be unsatisfactory. This grade reflects irregular attendance and/or participation, an no evidence of preparation, and little or no evidence of quality of contributions to, and fostering of, group discussions.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>In Class Activities.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>Students need to demonstrate the participation criteria in the whole tutorial on a regular basis.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Quiz",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 25/09/2025 3:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The quiz will be comprised of multiple-choice, true-false, or one-word answers covering moral frameworks and game theory. It will  be conducted during the lecture on 25 September. Students will have one hour to complete the quiz. This assessment task is to be completed in supervised setting. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<p>Your quiz assessment task will be assessed according to the following criteria: </p>\n<p> </p>\n<p>1.    Ability to produce a succinct response to a directed question.</p>\n<p>2.    Knowledge of key themes, ideas or content.</p>\n<p>3.    Ability to employ relevant terminology.</p>\n<p>4.    Ability to write in clear English (where applicable).</p>\n<p>Unlike formative assessment undertaken during your course (such as book reviews and essays), quiz answers are typically marked on right or wrong basis for multiple choice, single word and short answer questions. The overall grade achieved for a quiz is arrived at by totalling the marks for its constituent elements.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Online Submission.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>Students will be required to submit the quiz when the time limit is reached.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Take-Home Essay Assignment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 26/09/2025 4:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L08",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will be given an essay question involving a public goods dilemma scenario to analyse at the end of class on 25/9 and will be given 24 hours to complete a 1000 word response and submit to Turnitin. (There will be no tutorials this week.) This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>Students will be assessed according to the following criteria:</p>\n<ol>\n<li>Ability to construct a well-reasoned argument.</li>\n<li>Evidence of understanding of central issues.</li>\n<li>Ability to form a well-structured essay. </li>\n<li>Engagement with academic sources and evidence, as required. </li>\n<li>Insight and/or creativity in interpreting texts or constructing a point of view or argument.</li>\n<li>Capacity to produce a coherent and well-written essay using correct grammar and syntax;  appropriately referenced if required.</li>\n</ol>\n<p><br/></p>\n<p> To achieve a grade of 7 (High Distinction, 85-100%), your take-home exam essay should demonstrate an exceptional level of rigour in argumentation and understanding of issues, exceptional organization of material, extensive research, and insightful and creative discussion. The written expression and presentation should be excellent and follow discipline conventions.</p>\n<p> </p>\n<p>To achieve a grade of 6 (Distinction, 75-84%), your take-home exam essay should demonstrate an advanced level of rigour in argumentation and understanding of issues, very good organisation of material, wide research, and a capable synthesis of research materials. The written expression and presentation should be very good and follow discipline conventions.</p>\n<p> </p>\n<p>To achieve a grade of 5 (Credit, 65 – 74%), your take-home exam essay should demonstrate a proficient level of rigour in argumentation and understanding of issues, good organization of material, a good level of research, and synthesis of research materials. The written expression and presentation should be good and largely follow discipline conventions.</p>\n<p> </p>\n<p>To achieve a grade of 4 (Pass, 50 – 64%), your take-home exam essay should demonstrate a basic level argumentation, a fundamental understanding of issues, adequate organisation of material, a basic level of research, and an adequate synthesis of research materials. Your written expression and presentation should be satisfactory and follow discipline conventions. </p>\n<p><br/></p>\n<p>To achieve a grade of 3 (Marginal Fail, 45 – 49%), your take-home exam essay will demonstrate that your attempt, while underdeveloped and falling short of a pass, shows your emerging ability to apply basic knowledge and skills. Your argumentation and understanding of issues will be superficial, your material poorly organised and synthesis of research materials limited. Your written expression and presentation should be adequate and should attempt to follow discipline conventions.</p>\n<p> </p>\n<p>To achieve a grade of 2 (Fail, 25-44%), your take-home exam essay will demonstrate that your argumentation and understanding of issues was deficient, that your research was limited and/or poorly organised and explained, and that you did not understand fundamental aspects of the course. Your writing will be poor and/or inappropriate, and will not follow discipline conventions.</p>\n<p> </p>\n<p>To achieve a grade of 1 (Low Fail, 0-24%), your take-home exam essay will demonstrate that you have failed to meet the minimum learning requirements and skill acquisition for this assessment task. You will not have mounted sound arguments and/or understood relevant issues. Your research will be limited and inadequately explained. Your essay will be poorly organised and/or poorly written, and will not follow discipline conventions.</p>\n<p> </p>\n<p><em>Failing Criteria and Academic Misconduct</em></p>\n<p><em>Fabrication or misrepresentation of sources will result in an automatic maximum grade of 2 for this assessment, regardless of performance in other criteria. This includes but is not limited to: citing non-existent sources or attributing false quotes to real sources. Such issues demonstrate failure to meet the core learning outcomes for the course and may also be referred for academic misconduct</em></p>\n<p> </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Online to Turnitin.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Essay with Oral Follow Up Component",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 20/10/2025 2:00 pm</p>\n<p>\n</p><p>Submit electronically to Turnitin. Oral follow up questions will be scheduled during the final two weeks of classes in a one-on-one interview with the marker.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L08",
            "mode": "Oral, Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Written: 1,800 word philosophy essay arguing for a position (+/- 10% word limit). The word limit does not include titles, direct quotation, references and bibliographic information. Please include a word count excluding these items in your submission. You may use APA7, Chicago17th, MLA, or CSE Reference styles, but you must use the same consistently throughout, and must include page numbers (i.e. page number version of your chosen style) where applicable. This written component has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. Use of AI needs to be appropriately referenced.</p>\n<p>Follow Up Oral Component: Following their written submission, students will also give a brief summary of their position and answer on the spot follow up questions about their written essay with the marker. These will be scheduled during the last two weeks of the semester in a one-on-one interview with the marker. This follow up oral component is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<p><em>Requirements for Submission of Essays:</em></p>\n<ol>\n<li>You must submit an electronic copy only through Turnitin under 'Assessment' on Blackboard. Check your paper has submitted properly, you should receive and keep a confirmation.</li>\n<li>The actual wording of the question should not be typed on your assignment.</li>\n<li>Include a word count of your paper excluding titles, direct quotation, references and bibliographic information. </li>\n<li>Students are responsible for familiarizing themselves with School policy regarding academic advice, assessment, plagiarism, etc. Students are encouraged to read the UQ Student Integrity and Misconduct policy (<a href=\"http://ppl.app.uq.edu.au/content/3.60.04-student-integrity-and-misconduct\">http://ppl.app.uq.edu.au/content/3.60.04-student-integrity-and-misconduct</a> and refer to Section 6.1 of this Electronic Course Profile. PLAGIARISM is an academic offence and will be penalized.</li>\n</ol>\n<p><br/></p>\n<p>Grading Criteria for your essay and follow up oral:</p>\n<ol>\n<li>Ability to define the topic or philosophical issue under debate. (Topic definition.)</li>\n<li>Ability to construct a well-reasoned argument for a certain point of view. (Argument and Structure.)</li>\n<li>Depth and breadth of understanding of the various positions in a philosophical debate. (Scope and Depth of Treatment)</li>\n<li>Insight and/or originality in interpreting texts or constructing a point of view or argument. (Originality)</li>\n<li>Capacity to produce a polished, well-written and appropriately referenced essay. (Presentation)</li>\n<li>Demonstrated understanding of student's own essay submission.</li>\n<li>Ability to clarify claims in essay upon further questioning.</li>\n<li>Capacity to describe thought processes and logical relationships of ideas in the written component.</li>\n</ol>\n<p> </p>\n<p>To achieve a grade of 7 (High Distinction, 85-100%), your essay should reflect an exceptional level of achievement. It should demonstrate that you have undertaken extensive, high-level research, that you are able to form a very rigorous, sustained (multi-layered) and well-organised argument, and that your discussion is original and creative. It should also demonstrate that you are able to evaluate and organise data and/or evidence in a critical manner and that you have a sophisticated and insightful understanding of problems and issues. Your essay will be very well written, clear and concise, pay strict attention to discipline conventions and have minimal, if any errors in referencing and expression: <em>This grade is assigned for a total (sum of all the assessment components) in the range 85-100%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>To achieve a grade of 6 (Distinction, 75-84%), your essay should reflect an advanced level of achievement. It should demonstrate that you have undertaken wide research, that you are able to form a rigorous, sustained (multi-layered) and well-organised argument, and that your discussion is coherent and convincing. It should also demonstrate that you are able to evaluate data and/or evidence in a perceptive manner, and that your understanding of problems and issues is perceptive and insightful. Your essay will be well written, clear and concise, follow discipline conventions and have few errors in referencing and expression: <em>This grade is assigned for a total (sum of all the assessment components) in the range 75-84%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>To achieve a grade of 5 (Credit, 65 – 74%) your essay should reflect a proficient level of achievement. It should demonstrate that you have undertaken the expected level of research, that you are able to develop or adapt convincing, sustained (multi-layered) arguments and justify them adequately, that you are able to evaluate data and/or evidence in a proficient manner, and that you have a good understanding of problems and issues. The presentation and referencing of your essay will largely follow discipline conventions, perhaps have some errors in referencing and expression, and demonstrate your ability to communicate effectively: <em>This grade is assigned for a total (sum of all the assessment components) in the range 65-74%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>To achieve a grade of 4 (Pass, 50 – 64%) your essay should reflect functional achievement. It should demonstrate that you are able to apply, in a non-stereotypical way, fundamental concepts and skills, that you have undertaken a basic level of research and have the basic ability to evaluate data and/or evidence, to identify problems and issues, to offer insights and to develop routine arguments. Your organisation, writing and referencing will be adequate, not stereotypical, and use some of the discipline conventions to communicate appropriately: <em>This grade is assigned for a total (sum of all the assessment components) in the range 50-64%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>To achieve a grade of 3 (Marginal Fail, 45 – 49%), your essay should reflect developing levels of achievement. It should demonstrate that you have a superficial knowledge of fundamental concepts and skills, that you have undertaken a basic level of research, made some attempt to evaluate data and/or evidence, to identify problems and issues, and to offer insights. Your arguments, while underdeveloped, show your emerging ability to apply knowledge and skills. Your organisation and writing will be adequate, perhaps poor, and your referencing and use of discipline conventions poor/and or inconsistent. Alternatively, your essay may, in part, be well written and suggest engagement and achievement but will (a) mostly exhibit stereotypical and superficial understanding and (b) mostly fail to develop a sustained (multi-layered) argument: <em>This grade is assigned for a total (sum of all the assessment components) in the range 45-49%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>To achieve a grade of 2 (Fail, 25-44%) your essay will reflect deficiencies in skill acquisition and in your understanding of the fundamental concepts of the course. It will demonstrate that you have not undertaken adequate research, that you are unable to evaluate data and/or evidence, to identify problems and issues, or to offer insights adequately. Your arguments will be unsupported and/or inappropriate, your organisation and writing will be poor and/or inappropriate and referencing and use of discipline conventions poor/and or inconsistent. Alternatively, your essay may suggest developing or higher achievement but will (a) exhibit stereotypical and superficial understanding and (b) fail to develop a sustained (multi-layered) argument: <em>This grade is assigned for a total (sum of all the assessment components) in the range 25-44%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>To achieve a grade of 1 (Low Fail, 0-24%), your essay will reflect minimal evidence of achievement, and exhibit deficiencies in skill acquisition and in your understanding of the fundamental concepts of the course. It will demonstrate that you have not undertaken adequate research, that you are unable to evaluate data and/or evidence, to identify problems and issues, and/or to offer insights adequately. Your arguments will be unsupported and/or inappropriate, your organisation and writing will be poor and/or inappropriate, and referencing and use of discipline conventions poor/and or inconsistent: <em>This grade is assigned for a total (sum of all the assessment components) in the range 1-24%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>Grade X: No assessable work received. </p>\n<p> </p>\n<p><em>Failing Criteria and Academic Misconduct</em></p>\n<p><em>Fabrication or misrepresentation of sources will result in an automatic maximum grade of 2 for this assessment, regardless of performance in other criteria. This includes but is not limited to: citing non-existent sources or attributing false quotes to real sources. Such issues demonstrate failure to meet the core learning outcomes for the course and may also be referred for academic misconduct.</em></p>\n<p> </p>\n<p><br/></p>\n<p><br/></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission to turnitin.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(28 Jul - 03 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week One: Introduction</strong><br><p>Introduction to ethical theory and environmental ethics, Facts/Values, Intrinsic/Instrumental Value, Anthropocentrism, Relationship of Conservation and Ethics </p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week One: Introduction</strong>",
            "topic_description": "Week One: Introduction Introduction to ethical theory and environmental ethics, Facts/Values, Intrinsic/Instrumental Value, Anthropocentrism, Relationship of Conservation and Ethics",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 13(04 Aug - 02 Nov)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorials</strong><br><p>Tutorials commence in Week 2 and run to week 13. There are no tutorials in Weeks 3 or 9.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Tutorials</strong>",
            "topic_description": "Tutorials Tutorials commence in Week 2 and run to week 13. There are no tutorials in Weeks 3 or 9.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 2(04 Aug - 10 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2: Ethical Frameworks in environmental debates</strong><br><p>Ethical Frameworks which figure centrally in environmental debates: Utilitarianism, Deontology, Liberalism, Rights, Social Contract; Virtue Ethics, Ethics of Care, Relational Ethics</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 2: Ethical Frameworks in environmental debates</strong>",
            "topic_description": "Week 2: Ethical Frameworks in environmental debates Ethical Frameworks which figure centrally in environmental debates: Utilitarianism, Deontology, Liberalism, Rights, Social Contract; Virtue Ethics, Ethics of Care, Relational Ethics",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 3(11 Aug - 17 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3: Indigenous Perspectives</strong><br><p>Indigenous Perspectives and Relationships with other ethical frameworks</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 3: Indigenous Perspectives</strong>",
            "topic_description": "Week 3: Indigenous Perspectives Indigenous Perspectives and Relationships with other ethical frameworks",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 4(18 Aug - 24 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4: Game Theory, Public Goods, and the Prisoner's Dilemma</strong><br><p>In this lecture, we explore how public goods dilemmas have important explanatory value and public management implications for environmental, conservation, and public health outcomes. </p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Week 4: Game Theory, Public Goods, and the Prisoner's Dilemma</strong>",
            "topic_description": "Week 4: Game Theory, Public Goods, and the Prisoner's Dilemma In this lecture, we explore how public goods dilemmas have important explanatory value and public management implications for environmental, conservation, and public health outcomes.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 5(25 Aug - 31 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5: Environmental Problems, Collective Action and Morality</strong><br><p>In the lecture we extend our discussion to consider how public goods dilemmas connect to political theory and moral obligations.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 5: Environmental Problems, Collective Action and Morality</strong>",
            "topic_description": "Week 5: Environmental Problems, Collective Action and Morality In the lecture we extend our discussion to consider how public goods dilemmas connect to political theory and moral obligations.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 6(01 Sep - 07 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6: Liberalism, Environmental Problems, and Property Rights</strong><br><p>In this week, we look at property rights, their connection to liberalism, and critiques of this relationship, given the challenge to conservation goals raised by private use of land.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 6: Liberalism, Environmental Problems, and Property Rights</strong>",
            "topic_description": "Week 6: Liberalism, Environmental Problems, and Property Rights In this week, we look at property rights, their connection to liberalism, and critiques of this relationship, given the challenge to conservation goals raised by private use of land.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 7(08 Sep - 14 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7: Obligations to Future Generations, Ecojustice and Assessing Values in an Economy</strong><br><p>Obligations to future generations, environmental justice, or the Just Distribution of environmental harms and benefits, and the challenge of assessing values in an economy.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 7: Obligations to Future Generations, Ecojustice and Assessing Values in an Economy</strong>",
            "topic_description": "Week 7: Obligations to Future Generations, Ecojustice and Assessing Values in an Economy Obligations to future generations, environmental justice, or the Just Distribution of environmental harms and benefits, and the challenge of assessing values in an economy.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8: Species Biodiversity</strong><br/><p>Given the central goal of biodiversity in conservation science, how do we explain the value of species, and what challenge does this raise for traditional moral frameworks?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 8: Species Biodiversity</strong>",
            "topic_description": "Week 8: Species Biodiversity Given the central goal of biodiversity in conservation science, how do we explain the value of species, and what challenge does this raise for traditional moral frameworks?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9: In Class Quiz and receive take-home essay. (No tutorials this week)</strong><br/></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 9: In Class Quiz and receive take-home essay. (No tutorials this week)</strong>",
            "topic_description": "Week 9: In Class Quiz and receive take-home essay. (No tutorials this week)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 10(06 Oct - 12 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10:Animal Rights and Conservation</strong><br/><p>How do we weigh a moral demand for the ethical treatment of animals with conservation practice?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 10:Animal Rights and Conservation</strong>",
            "topic_description": "Week 10:Animal Rights and Conservation How do we weigh a moral demand for the ethical treatment of animals with conservation practice?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 11(13 Oct - 19 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11: Animal Rights, Conservation Puzzles and philosophical puzzles in Restoration.</strong><br/></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 11: Animal Rights, Conservation Puzzles and philosophical puzzles in Restoration.</strong>",
            "topic_description": "Week 11: Animal Rights, Conservation Puzzles and philosophical puzzles in Restoration.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 12(20 Oct - 26 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12: Non-Anthropocentric Views</strong><br/><p>Reflection on themes from the semester: Anthropocentrism and its alternatives, and appeals to nature.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 12: Non-Anthropocentric Views</strong>",
            "topic_description": "Week 12: Non-Anthropocentric Views Reflection on themes from the semester: Anthropocentrism and its alternatives, and appeals to nature.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 13(27 Oct - 02 Nov)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13: Ethical Criteria for Conservation Programs</strong><br/><p>In this week we bring together a number of themes across the semester to look at criteria for the public justification of conservation or environmental public health programs.</p></p><p><strong>Learning outcomes:</strong> L05, L06, L08</p></div></td>",
            "topic_title": "<strong>Week 13: Ethical Criteria for Conservation Programs</strong>",
            "topic_description": "Week 13: Ethical Criteria for Conservation Programs In this week we bring together a number of themes across the semester to look at criteria for the public justification of conservation or environmental public health programs.",
            "learning_outcomes": [
                "L05",
                "L06",
                "L08"
            ]
        }
    ]
}