{
    "course_title": "Pharmacy Practice and Medicines Management 2B",
    "study_period": "Sem 2 2025",
    "location": "Dutton Park",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/PHRM2102-60322-7560",
    "full_course_code": "PHRM2102-60322-7560",
    "course_code": "PHRM2102",
    "class_code": "60322",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Apply physiological, pathophysiological, pharmacological, and clinical knowledge regarding the following conditions and their management: cardiovascular disease, nephrology/renal injury and disease, neurology/neurodegenerative disorders, haematology/blood disorders, and primary care dermatology/common skin conditions"
        },
        {
            "number": "LO2.",
            "description": "Apply relevant ethical and legal frameworks in professional practice"
        },
        {
            "number": "LO3.",
            "description": "Demonstrate appropriate oral and written communication in the professional context"
        },
        {
            "number": "LO4.",
            "description": "Apply skills in dispensing, consultation, assessing and supporting medication adherence, medication reconciliation and managing a drug interaction"
        },
        {
            "number": "LO5.",
            "description": "Provide patient-centred, socially, and culturally appropriate care in a range of pharmacy practice contexts"
        },
        {
            "number": "LO6.",
            "description": "Develop interprofessional practice skills including role clarification, team functioning, interprofessional communication and client-centred care"
        },
        {
            "number": "LO7.",
            "description": "Evaluate and synthesise information from diverse sources to justify professional decisions in the practice of Pharmacy"
        },
        {
            "number": "LO8.",
            "description": "Engage with consumers, patients, carers, pharmacy staff and other members of the healthcare team as part of work-integrated learning"
        },
        {
            "number": "LO9.",
            "description": "Demonstrate development of reflective practice, professional competence, and expertise, including simulated learning in preparation for work-integrated learning (experiential placements)"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Professional Practice Skills",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>10% (5% for PP1, 5% for PPP2) </dd>",
            "due_date": "<dd><p>PPP1 22/08/2025</p>\n<p>PPP2 24/10/2025</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L08, L09",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Professional Practice (Skills) Portfolio (PPP)</strong></p>\n<p>Throughout the semester you will attend and participate in tutorials where communication, professional, and dispensing skills will be practiced, refined, and reflected upon through a suite of case-based scenarios with embedded dispensing exercises. Each week you will develop skills across multiple activities, including information gathering/consultation, dispensing/labelling, and counselling. As another example of possible evidence of skill development, checking of dispensing is an essential step and is considered best practice, therefore developing a process for this is a good skill to have – you might choose to use this for the PPP ePortfolio.</p>\n<p>If you chose to submit evidence of your dispensing then <strong>a photo</strong> of the dispensing label (using your allocated mock patient surname) with required ancillary/CAL labels placed on the product print-out and the original prescription showing the third-party PBS/pharmacy label attached (to simulate a complete dispensing). This will help the marker to check your dispensing. </p>\n<p>Your choice of evidence and single activity selected from any two tutorials for each PPP (1 and 2) is your decision with one being from a dispensing tutorial and another from a consult/counselling tutorial - choose a case or part of a case from each tutorial that best reflects your knowledge gained and is personal to your learning. </p>\n<p>In this assessment, students are taking the role of a pharmacist. Depending on the learning activity/case, this may involve checking prescriptions for clinical appropriateness, sorting out administration and funding issues, product selection, and labelling medications.</p>\n<p>Students are required to ensure that all legally required labels (e.g. drugs listed in Appendix K of the SUSMP) and all recommended CALs (according the APF) have been included as per a new or change to an existing medicine.</p>\n<ul>\n<li>The are TWO PPP submission points: PPP1 [worth 5%] and PPP2 [worth 5%] with a final submission at the end of week 4 for PPP1 and end of week 12 for PPP2. Either PPP can be submitted after any two tutorials in so far as the reflection and relevant evidence are from any combination of ONE dispensing tutorial activity and ONE consultation tutorial activity (e.g. end of Week 2, 3 or 4 for PPP1).</li>\n<li>Attendance at the tutorials will be necessary to develop the evidence required for this assessment.</li>\n<li>You will collate the evidence, reflect on your progress then submit for assessment.</li>\n<li>ONE submission is allowed for each of PPP1 and PPP2, and no re-submission.</li>\n<li>Submissions are due within 15 minutes of the end of the associated consult/dispensing tutorials, by 11:15am for those in morning tutorials and 2:15pm for afternoon tutorials.</li>\n</ul>\n<p>More detail and marking criteria will be provided in tutorials and via the Learn.UQ (Blackboard) site.</p>\n<p><em>This task has been designed to be challenging, authentic, and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission:</strong> Dispensing evidence will be uploaded to ePortfolio.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Engagement tasks",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>18% (3% per quiz) </dd>",
            "due_date": "<dd><p>Quiz 1: 15/08/2025 5:00 pm</p>\n<p>Quiz 2: 8/09/2025 5:00 pm</p>\n<p>Quiz 3: 26/09/2025 5:00 pm</p>\n<p>Quiz 4: 17/10/2025 5:00 pm</p>\n<p>Quiz 5: 31/10/2025 5:00 pm</p>\n<p>Quiz 6: 31/10/2025 5:00 pm</p>\n<p>\n</p><p>Complete each quiz during the 10 days prior to the respective due date.</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<ul>\n<li>This is an online quiz series based on the content at the end of the relevant learning activity from online content (UQ Extend), workshops, tutorials, and practicals.</li>\n<li><strong>Quizzes are to be completed by week 3, 6, 9, 11, and 13 (there are two due in Week 13).</strong></li>\n<li>Online quizzes will be used to test your understanding of each week’s content.</li>\n<li>There are a total of six (6) quizzes; each quiz is worth 3% of the final mark [total of 18%].</li>\n<li>Questions may be multiple choice, drop down and in-line questions, drag &amp; drop, matching, labelling diagrams, and short answer (mostly requiring one to five words and some requiring just a few sentences).</li>\n<li>The quiz will be marked electronically, correct answers will be awarded the marks indicated beside the question, incorrect answers will be awarded zero.</li>\n<li><em>This assessment task evaluates students' abilities, skills and knowledge that can be completed without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). </em>However, Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students <strong>must </strong>clearly reference any use of AI or MT in each instance. </li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Access the quizzes via the links provided in Learn.UQ (Blackboard).</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Community Pharmacy Placement WIL portfolio",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 12/09/2025 5:00 pm</p></dd>",
            "learning_objectives": "L02, L03, L04, L05, L06, L07, L08, L09",
            "mode": "Activity/ Performance, Written",
            "category": "Placement, Portfolio, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The community pharmacy placement consists of pre-placement, at placement, and post-placement components.</p>\n<p>The following components MUST be fulfilled for the community pharmacy week WIL portfolio:</p>\n<p><strong>Setting:</strong> Community Pharmacy. A week-long block placement (37.5 hours) in Week 5 of semester.</p>\n<p><strong>PRE-PLACEMENT:</strong> Preceptors are advised of the skills that the students have demonstrated in simulated environments during previous PHRM courses to cover the components of the Entrustable Professional Activities (EPAs).</p>\n<ul>\n<li>Students must have passed PHRM2101 to be eligible to attend placement.</li>\n<li>Students must provide placement details (Pharmacy name and address, Preceptor name, and Placement times) via InPlace. This online information is to be completed with the placement times/dates that have been agreed upon with the placement site preceptor and placement site details should be entered into InPlace and approved prior to commencing placement.</li>\n</ul>\n<p><strong>AT PLACEMENT:</strong> Students will be expected to take in a prescription, dispense medicines, and consult with consumers regarding common OTC requests, all with direct, proactive supervision. Preceptors will make an entrustment decision on EPAs based on student activities across the placement.</p>\n<ul>\n<li>The EPAs are a formative assessment item, to provide you with feedback on your progress.</li>\n<li>Prior to the end of your placement, you will complete the self-assessment of your professionalism on placement and each of the three EPAs, and then meet with your preceptor to get feedback and their rating of your level of entrustment. The entrustment decisions should ideally be made at the end of the week-long placement.</li>\n<li>EPAs to be completed on this placement are:</li>\n<li>Taking in a prescription</li>\n<li>Dispensing a prescription</li>\n<li>Provision of OTC Medicine</li>\n</ul>\n<p><strong>POST-PLACEMENT:</strong> Attend the timetabled de-briefing class focussing on self-reflection and discussion of feedback and placement experiences.</p>\n<p><strong>Assessment:</strong> Students will write a reflection and prepare an Individual Learning Plan (ILP) for the next community pharmacy placement. Use the template in the ePortfolio to complete your reflection and ILP (pass/fail)<strong>. </strong></p>\n<ul>\n<li><em>Reflection:</em><strong> </strong>Write up to a maximum of 300 words in which you reflect on your learning and the feedback you received from your preceptor. The reflection will provide the basis on which to prepare your ILP.</li>\n<li><em>ILP:</em> Draft an ILP and bring to your placement de-brief tutorial to discuss with your peers. Your ILP includes:</li>\n<li>learning goals for your next placement,</li>\n<li>skills development,</li>\n<li>activities required to meet your goals and evaluation that you achieved your learning goals.</li>\n</ul>\n<p><em>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission: </strong>After the de-brief tutorial, submit your reflection and ILP in ePortfolio (access via Learn.UQ).</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Interprofessional Collaborative Practice",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p>Refer to the IPCP assessment information on Learn.UQ (Blackboard) for the assessment due date for your team.</p></dd>",
            "learning_objectives": "L06",
            "mode": "Written",
            "category": "Participation/ Student contribution",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Please refer to the IPCP assessment information on Learn.UQ for the assessment due date for your team.</p>\n<p>This is a team assessment, and all team members are expected to contribute equally to the team’s assessment items. Teams will be assigned during your first tutorial. There are three (3) parts to this assessment:</p>\n<p><strong>Part One</strong> requires you to complete a worksheet and will draw on the online and face-to-face content from Module 1 of the IPCP curriculum focusing on role-clarification and client-centred care. Length: There is no word limit for the worksheet.</p>\n<p><strong>Part Two</strong> involves creating a 3-minute video which draws upon the online and face-to-face content from Modules 2 and 3 of the IPCP curriculum focusing on interprofessional communication, team functioning and client-centred care. </p>\n<p>Length: Video 3 minutes </p>\n<p><strong>Part Three</strong> involves a written assignment (300 words max) which draws on the online and face-to-face content from Modules 2 and 3 of the IPCP curriculum focusing on how client-centred care can be improved.</p>\n<p><strong>Length:</strong> The word limit for the written assignment is 300 words combined, including in-text references</p>\n<p>Teams will need to submit all three parts of your assessment in the Assessment tab on the IPCP Learn.UQ course site. Additional information regarding submission will be provided on the IPCP Learn.UQ course site. </p>\n<p>Please refer to the assessment information on Learn.UQ for further details and requirements for the assessment.</p>\n<p><em>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The IPCP module is a Pass/Fail assessment task. Students who pass the module will receive a course grade based on the remaining assessment in the course.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-4",
            "assessment_title": "Written Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>42%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>8/11/2025 - 22/11/2025</p></dd>",
            "learning_objectives": "L01, L03, L07, L09",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This exam will be delivered via Inspera. You are required to bring your own device to complete the exam in-person during the end-of-semester exam period.</p>\n<p>There are two sections for this assessment:</p>\n<p>Section One - Dispensing accuracy</p>\n<p>Section Two - Knowledge-based critical thinking</p>\n<p><strong>Section One [5%]</strong></p>\n<ul>\n<li>You will be presented with images of TWO dispensed items showing: 1. the original prescription, 2. the printed label, and 3. the product for each item [2.5% for each dispensing check]. This will be similar to checking activities undertaken during the dispensing tutorials.</li>\n<li>The scenario is you, as the pharmacist completing a final check.</li>\n<li>There is an error that you need to identity for each dispensing and requires that you write a concise summary e.g. wrong strength on label or incorrect product or wrong formulation on label, into the blank space provided in the exam screen.</li>\n<li>No resources are allowed.</li>\n</ul>\n<p><strong>Section Two [37%]</strong></p>\n<p>You will be presented with multiple choice questions (MCQs), multiple response questions (MRQs), and short answer responses (SARs) related to a case scenario. The purpose of this assessment is to examine your ability to apply your knowledge of the course topics e.g. cardiology, neurology and therapeutic management, and use critical thinking skills. The case scenario answers will consists of short-answer questions limited to a few words or a single short sentence per mark.</p>\n<p>The questions will cover, but not limited to, the following:</p>\n<ul>\n<li>demonstrate an understanding of the pathophysiology of the condition being treated and the mechanisms by which key classes of drugs work,</li>\n<li>apply the evidence and best-practice guidance regarding management of the condition to the individual,</li>\n<li>identify and evaluate the risk of adverse events associated with treatment,</li>\n<li>justifying the management plan,</li>\n<li>consider the ways in which individual patient factors and social situation can affect treatment and outcomes,</li>\n<li>evaluate and adjust the treatment plan according to patient needs.</li>\n</ul>\n<p>Inspera allows for various answer formats including matching items, in-line/drop-down menus within a sentence, drag &amp; drop, and multiple response. See Learn.UQ (Blackboard) for practice questions and marking rubrics.</p>\n<p>The exam will be undertaken via the Inspera eAssessment platform (as will any deferred or supplementary written exams). Go to the Inspera Assessment Information page link to navigate to the Library Services web page which provides further information on: how to access Inspera, on-campus invigilated exams in Inspera, device requirements, familiarisation opportunities, submitting assessment and access to the Student Laptop Scheme and short-term laptop-loans.</p>\n<p><em>Link for Inspera Assessment Information page:</em></p>\n<p><a href=\"https://elearning.uq.edu.au/student-guides-original/inspera-assessment-original\">Inspera Assessment (Original) - eLearning - University of Queensland</a></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-5",
            "assessment_title": "Oral Consultation Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>8/11/2025 - 22/11/2025</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L08, L09",
            "mode": "Oral",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The oral consultation examination is a school-based exam that is scheduled during the examination period. The exam will likely run over two days; students will be notified of their allocated session via Learn.UQ (Blackboard) prior to the exam revision period.</p>\n<p>The skills and competencies assessed at each station are mapped to Entrustable Professional Activities (EPAs) that will underpin your placements as you progress through the degree.</p>\n<p><strong>Station One - Complete medication history and patient education</strong> in a hospital setting <strong>[10 minutes</strong> <strong>plus 5 minutes perusal; 20%]</strong>:</p>\n<p><strong>A. Medication history:</strong></p>\n<p>Before a ward round, you decide to complete a full and best-possible medication history for a newly admitted patient. Determine the use of existing and new medication/s. Ensure patient centred care (PCC) is raised including non-pharmacological aspects are ascertained such as difficulties with taking medications, lifestyle, cultural, and social. You will be provided with the patient's medication chart and a recent dispensing history from their regular community pharmacy.</p>\n<p><strong>B. Patient education:</strong></p>\n<p>One medication from the patient's chart will be pre-allocated and identified for you to consider and prepare during the pre-exam 5 min perusal time. Students will provide patient counselling to the patient from Part A. During this station the student will explain to the patient how to use the medication as though the patient is about to be discharged from hospital, including: dose, frequency, duration, adverse effects and their management, monitoring and follow-up with the GP, and lifestyle issues in patient-centred language. This station requires all PCC issues raised by the patient in Part A to be addressed by offering some practical and useful advice.</p>\n<p>The focus is on communication and explanation in patient centred language, and demonstration of understanding of the medication, medical condition and the context, including the specifics of the patient’s situation - hence patient centred care (PCC).</p>\n<p>Resources are allowed for Station One (see below).</p>\n<p><strong>Station Two - Uncomplicated diagnosis and provision of OTC medicine </strong>in a community pharmacy setting <strong>[5 minutes; 10%]:</strong></p>\n<p>A new customer presents to your pharmacy with a concern about a skin problem. Complete a consultation including taking a medication history, make a diagnosis, and provide an OTC product recommendation and patient education (as a new medicine).</p>\n<p>No resources are allowed for Station Two.</p>\n<p><strong>Resources: </strong>A pen, blank paper and an approved calculator are provided. Students are <strong>NOT</strong> permitted to bring any other resources into the exam; this includes but is not limited to, notes, phones, textbooks or watches. Students can access key clinical resources for Station One: the AMH and APF as hardcopy only (as provided in the tutorials). These resources are provided by the school, student copies are not allowed. Students should ensure they are familiar with these resources prior to the exam. No resources are allowed for Station Two.</p>\n<p>This oral exam will be recorded and retained as per university policy. The recording will be stored in a secure manner and will only be accessed if required for the purposes of moderation of marking; provision of feedback to the student; and/or re-marking following a successful re-mark application.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission</strong>: The oral consultation examination is a school-based exam that is scheduled during the examination period</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(28 Jul - 02 Nov)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Pharmacology and therapeutics</strong><br><p>Weeks 1-4 and 6-13. Course Introduction; the Cardiovascular System, Kidney, Blood Disorders, and OTC Dermatology. Each week you should complete the active online learning via UQ-EXTEND (non-timetabled) BEFORE attending the weekly workshop. On-campus classes: 2-hour workshop.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L09</p></div></td>",
            "topic_title": "<strong>Pharmacology and therapeutics</strong>",
            "topic_description": "Pharmacology and therapeutics Weeks 1-4 and 6-13. Course Introduction; the Cardiovascular System, Kidney, Blood Disorders, and OTC Dermatology. Each week you should complete the active online learning via UQ-EXTEND (non-timetabled) BEFORE attending the weekly workshop. On-campus classes: 2-hour workshop.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L09"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(28 Jul - 02 Nov)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Pharmacology and therapeutics: UQ-Extend</strong><br/><p>Weeks 1 to 4, and 6 to 13. Active online learning covering the pharmacology and therapeutics topics for this course. There is at minimum 2-hr per week of work expected to be completed before each associated workshop.</p></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Pharmacology and therapeutics: UQ-Extend</strong>",
            "topic_description": "Pharmacology and therapeutics: UQ-Extend Weeks 1 to 4, and 6 to 13. Active online learning covering the pharmacology and therapeutics topics for this course. There is at minimum 2-hr per week of work expected to be completed before each associated workshop.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(28 Jul - 02 Nov)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Consultation and Dispensing</strong><br/><p>Weeks 1-4 and 6-13. Weekly 2-hour tutorials covering Consultation/Dispensing and OTC Dermatology.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L09</p></div></td>",
            "topic_title": "<strong>Consultation and Dispensing</strong>",
            "topic_description": "Consultation and Dispensing Weeks 1-4 and 6-13. Weekly 2-hour tutorials covering Consultation/Dispensing and OTC Dermatology.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L09"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 9(28 Jul - 28 Sep)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Cardio-electrophysiology: Week 1, 6, and 9</strong><br><p>Cardio-electrophysiology in weeks 1, 6 and 9. Each week you should complete the active online learning via Extend BEFORE attending the weekly workshop. On-campus 2-hour practicals (normal and abnormal ECG) are scheduled in certain weeks.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Cardio-electrophysiology: Week 1, 6, and 9</strong>",
            "topic_description": "Cardio-electrophysiology: Week 1, 6, and 9 Cardio-electrophysiology in weeks 1, 6 and 9. Each week you should complete the active online learning via Extend BEFORE attending the weekly workshop. On-campus 2-hour practicals (normal and abnormal ECG) are scheduled in certain weeks.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 10(04 Aug - 12 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Interprofessional Collaborative Practice</strong><br><p>IPCP Modules 1 to 3 are completed in PHRM2102.</p>\n<p><strong>Interprofessional Collaborative Practice Modules (Monday/ Thursday) (Tutorials);</strong> Dates on Allocate + </p>\n<p>Participants will work in small teams in the tutorial groups with students from Dentistry, Exercise Physiology and Sports Science, Midwifery, Nursing, Occupational Therapy, Pharmacy, Physiotherapy, Social Work and Speech Pathology. </p>\n<p>There are three modules that consist of on-line preparation and face-to-face in class (or via Zoom) learning activities. You will work in your team to engage in a range of learning activities to develop your knowledge and skills to help prepare you for working in teams when caring for clients. </p>\n<p>·      In Module One, you will learn from, with and about your peers on their role and the roles of others in caring for clients. </p>\n<p>·      In Module Two you will develop the skills to communicate effectively with team members and appreciate the consequences when communication breaks down and is ineffective. </p>\n<p>·      In Module Three, you will develop your knowledge and skills to work in an effective team through participation in an on-line escape room activity with your team. </p>\n<p>You will also follow the healthcare journey of a client across the three modules. </p>\n<p>Note a possible clash with the placement in Week 5 for some students completing a IPCP module. If this occurs, please let your team know, make sure you catch-up on the learning activities, catch-up on key concepts from team members, and ensure you are up-to-date on any assessment items/tasks.</p></br></p><p><strong>Learning outcomes:</strong> L06</p></div></td>",
            "topic_title": "<strong>Interprofessional Collaborative Practice</strong>",
            "topic_description": "Interprofessional Collaborative Practice IPCP Modules 1 to 3 are completed in PHRM2102. Interprofessional Collaborative Practice Modules (Monday/ Thursday) (Tutorials); Dates on Allocate + Participants will work in small teams in the tutorial groups with students from Dentistry, Exercise Physiology and Sports Science, Midwifery, Nursing, Occupational Therapy, Pharmacy, Physiotherapy, Social Work and Speech Pathology. There are three modules that consist of on-line preparation and face-to-face in class (or via Zoom) learning activities. You will work in your team to engage in a range of learning activities to develop your knowledge and skills to help prepare you for working in teams when caring for clients. ·      In Module One, you will learn from, with and about your peers on their role and the roles of others in caring for clients. ·      In Module Two you will develop the skills to communicate effectively with team members and appreciate the consequences when communication breaks down and is ineffective. ·      In Module Three, you will develop your knowledge and skills to work in an effective team through participation in an on-line escape room activity with your team. You will also follow the healthcare journey of a client across the three modules. Note a possible clash with the placement in Week 5 for some students completing a IPCP module. If this occurs, please let your team know, make sure you catch-up on the learning activities, catch-up on key concepts from team members, and ensure you are up-to-date on any assessment items/tasks.",
            "learning_outcomes": [
                "L06"
            ]
        },
        {
            "learning_period": "Week 5(25 Aug - 31 Aug)",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Community Pharmacy Placement</strong><br/><p>WEEK 5: Work-integrated Learning (WIL). Full time placement in a community pharmacy.</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Community Pharmacy Placement</strong>",
            "topic_description": "Community Pharmacy Placement WEEK 5: Work-integrated Learning (WIL). Full time placement in a community pharmacy.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        }
    ]
}