{
    "course_title": "Pharmacy Practice and Medicines Management 3B",
    "study_period": "Sem 2 2025",
    "location": "Dutton Park",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/PHRM3102-60011-7560",
    "full_course_code": "PHRM3102-60011-7560",
    "course_code": "PHRM3102",
    "class_code": "60011",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (21/07/2025 - 15/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Apply clinical and therapeutic knowledge, using integrated case-based learning for the following: geriatrics, paediatrics, cancer and cancer therapies, pain management, palliative care and voluntary assisted dying, as well as common poisonings and toxicities, and medication management of patients in the critical care setting"
        },
        {
            "number": "LO2.",
            "description": "Apply relevant legal and ethical frameworks in pharmacy practice"
        },
        {
            "number": "LO3.",
            "description": "Undertake systematic medication reconciliation, synthesise and apply clinical and professional knowledge to resolve medication related problems and collaboratively optimise patient health outcomes"
        },
        {
            "number": "LO4.",
            "description": "Dispense medications safely, effectively and legally and provide a tailored consultation to patients and carers with complex needs"
        },
        {
            "number": "LO5.",
            "description": "Provide patient-centred, socially, and culturally appropriate care in a range of pharmacy practice contexts (including over-the-counter and prescription medication management, and medication review)"
        },
        {
            "number": "LO6.",
            "description": "Demonstrate interprofessional collaborative care"
        },
        {
            "number": "LO7.",
            "description": "Administer injectable formulations in accordance with current jurisdiction-specific legislation, scope of practice and PharmBA Guidelines"
        },
        {
            "number": "LO8.",
            "description": "Demonstrate development of professional competence and expertise through reflective practice in a work-integrated learning environment"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Engagement Tasks",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20% (5% for each engagement task) </dd>",
            "due_date": "<dd><p>There are four engagement tasks in this course, with the due dates varying according to your group. See Learn.UQ (Blackboard) for your assessment schedule. The first engagement task is scheduled to be released in teaching week 2.</p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L06",
            "mode": "Activity/ Performance, Product/ Artefact/ Multimedia, Written",
            "category": "Paper/ Report/ Annotation, Quiz, Role play/ Simulation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>There are four engagement tasks for PHRM3102. Engagement Tasks help consolidate your knowledge in medication review, patient education and general course content, and provide a key opportunity to prepare for assessments (and attract up to 5% per activity for satisfactory completion).</p>\n<p><strong>The first three engagement tasks </strong>are designed to be completed in groups. </p>\n<ul>\n<li>Together with your peers, you will work as a group on clinical problems and/or case-based scenarios that will enable you to clarify, explain and/or apply concepts and key information, and subsequently create (and share) resources (for example, medication review, counselling on medications/ a medical device and knowledge of different therapeutic/prophylactic regimens e.g. in cancer). This collaborative learning will enable you to explore and articulate your understanding of key concepts with your peers.</li>\n<li>We will use case-based discussions (i.e. mini clinical medication reviews and questions) for you and your group to collaboratively complete during the semester. </li>\n<li>Time to work on your engagement task will be provided during specified tutorials. <strong>It is strongly recommended that you attend these tutorials. </strong></li>\n<li>Additionally, you can meet with your group members to work on engagement tasks during your PAS sessions on Monday mornings, and via discussion on MS Teams, or arrange separate times to meet and collaborate as suits the group.</li>\n<li>Engagement tasks will be completed and submitted through group collaboration and engagement in MS Teams. </li>\n</ul>\n<p><strong>The fourth engagement task </strong>will be delivered as a quiz and completed individually.</p>\n<ul>\n<li>The fourth (and final) engagement task will assess your knowledge of the Cancer module via an online Inspera quiz accessible via Learn.UQ (Blackboard). </li>\n<li>The quiz will be open from Monday week 12 to Friday week 13.</li>\n</ul>\n<p>Please see Learn.UQ (Blackboard) for details on the engagement tasks, which will be released as you progress through the course. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>See Learn.UQ (Blackboard) for submission instructions for each engagement activity.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Professional Practice Portfolio and Reflection",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>10% (5% for each professional skills task) </dd>",
            "due_date": "<dd><p>There are two professional skills tasks, with the due dates varying according to your group. See Learn.UQ (Blackboard) for your assessment schedule.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Activity/ Performance",
            "category": "Practical/ Demonstration",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>During weeks 1 to 12 there will be TWO tutorials that will include a professional practice portfolio (i.e. Communication, dispensing, counselling, and reflection component). <strong>It is strongly recommended that you attend these tutorials. </strong>Refer to your timetable in Learn.UQ (Blackboard) for details.</p>\n<p>During the tutorial you will consider one or more prescriptions. The student must assess whether the script is legal and whether the medication and/or dosage is appropriate for the patient:</p>\n<ol>\n<li>If the script is not legal and/or the dosage is not appropriate, the script is not to be dispensed</li>\n<li>If the script is legal and the dosage is appropriate for the patient, the script is to be dispensed using FRED to produce a dispensing label. The dispensing label with appropriate ancillary labels will be inserted in the “PHRM3102 Label Upload Sheet”, a photo taken of this sheet, and this photo uploaded into the Dispensing ePortfolio - Dispensing submission. The dispensing task will be marked by your tutor.</li>\n</ol>\n<p>Students will be required to submit their professional skills task assessment as the following items:</p>\n<ul>\n<li>original prescription with third party labels</li>\n<li>labelled product(s) with ancillary labels as per current APF</li>\n<li>answer associated questions and reflections</li>\n</ul>\n<p>More information on professional skills tasks and due dates can be found on Learn.UQ (Blackboard) in the assessment section.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission:</strong> Submit each professional practice portfolio within 24 hours of the end of the tutorial of the associated module. Dispensing labels, key counselling points and reflective statements will be uploaded to / completed within ePortfolio.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Work-Integrated Learning Portfolio",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p>Submit within 2 weeks of completing your placement. See Learn.UQ (Blackboard) for your placement and assessment schedule.</p></dd>",
            "learning_objectives": "L08",
            "mode": "Written",
            "category": "Placement, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>All students are to submit within 2 weeks of completing their placement:</p>\n<p><strong>A. Community Pharmacy WIL Placement Portfolio</strong> <strong>AND</strong></p>\n<p><strong>B. Students allocated to Hospital Pharmacy</strong> (half of the cohort) must complete this component of the WIL Portfolio.</p>\n<p>PHRM3102 placements are sourced by the WIL Partnerships Coordinator in the School of Pharmacy.</p>\n<p><strong>A. COMMUNITY PHARMACY WIL PORTFOLIO (all students)</strong></p>\n<p><strong>This is a week-long block placement (37.5 hours; 7.5 hours/day). At placement, students are expected to consult with consumers regarding common OTC requests, take a medication history either from a patient new to the pharmacy or an existing patient presenting with a new medicine and educate a patient on a new medication, all with direct, proactive supervision. Preceptors will make an entrustment decision on EPAs based on student activities across the placement.</strong></p>\n<p><strong>The following components must be fulfilled for the community pharmacy WIL portfolio:</strong></p>\n<p><em>1. Entrustable Professional Activities (EPAs):</em></p>\n<ul>\n<li>Provision of OTC Medicines (for relevant clinical area(s) covered in second year late Semester 2 or early semester 1 in third year) (community pharmacy).</li>\n<li>Taking a medication history either from a new patient to the pharmacy or an existing patient presenting with a new medicine.</li>\n<li>Educating a patient on their new medication(s).</li>\n<li><strong>The entrustment decisions can only be made over a full 5-day placement, failure to attend all 5 days will result in no entrustment decision and the student will have to arrange to make up for the missed days</strong> so that an entrustment decision can be made.</li>\n</ul>\n<p><em>2. Individual Learning Plan (ILP) and Placement Reflection</em></p>\n<p>Students must attend the timetabled placement debriefing tutorial in the week following their placement in order to facilitate ILP and placement reflection.</p>\n<p><em>Individual learning Plan (ILP): </em>Complete the templates for two learning goals (goals 1 and 2) in the ePortfolio (see templates and Learn.UQ for further instructions). Completing the templates that make up your ILP requires you to provide brief answers to the following questions:</p>\n<ul>\n<li>What do you want to work towards at your next community pharmacy placement?</li>\n<li>How will you and your preceptor know you are making progress toward achieving these goals?</li>\n<li>Which skills, knowledge or experiences do you need to further develop to achieve these goals?</li>\n<li>How will working towards this goal help you develop as a pharmacist and how long do you expect it will take you to reach these goals?</li>\n</ul>\n<p><em>Reflection: </em>The reflection should be a maximum of 500 words, taking into consideration your newly created learning plan. Identify key learning moments or challenges during your placement and discuss self-observation and/or feedback that has informed your performance in relation to these key learning moments. Use the reflection template in the ePortfolio to complete your reflection.</p>\n<p>After the debriefing tutorial, submit your EPAs, ILP and reflection to the ePortfolio via the assessment link in the PHRM3102 Learn.UQ site. The marking criteria/rubric for this assessment task is available on Learn.UQ.</p>\n<p><strong>B. HOSPITAL PHARMACY PLACEMENT WIL PORTFOLIO (allocated students only)</strong></p>\n<p><strong>This is a week-long block placement (37.5 hours; 7.5 hours/day). Students are allocated to a specific hospital site for their placement. At placement, students are expected to consult with patients, carers, pharmacy staff and other members of the healthcare team to take a best possible medication history, educate a patient on their medication(s) and a chart review that may follow on from the medication history, all with direct, proactive supervision. Preceptors will make an entrustment decision on EPAs based on student activities across the placement.</strong></p>\n<p><strong>For assessment, students must produce self-assessment of Entrustable Professional Activities (EPAs), as well as Placement Reflection and Individual Learning Plan for the next hospital pharmacy placement. The following components MUST be fulfilled for the hospital pharmacy WIL portfolio:</strong></p>\n<p><strong>1.Entrustable Professional Activities (EPAs).</strong></p>\n<ul>\n<li>Taking a medication history.</li>\n<li>Educating a patient on their medication(s).</li>\n<li>Chart review that may follow on from the medication history.</li>\n<li><strong>The entrustment decisions can only be made over a full 5-day placement, failure to attend all 5 days will result in no entrustment decision and the student will have to arrange to make up for the missed days</strong> so that an entrustment decision can be made.</li>\n</ul>\n<p>2.Individual Learning Plan (ILP) and Placement Reflection.</p>\n<p>Students must attend the timetabled placement debriefing tutorial in the week following their placement in order to facilitate ILP and Placement Reflection.</p>\n<p><em>Individual learning Plan (ILP): </em>Complete the templates for two learning goals (goals 1 and 2) in the ePortfolio (see templates and Learn.UQ for further instructions). Completing the templates that make up your ILP requires you to provide brief answers to the following questions:</p>\n<ul>\n<li>What do you want to work towards at your next hospital placement?</li>\n<li>How will you and your preceptor know you are making progress toward achieving these goals?</li>\n<li>Which skills, knowledge or experiences do you need to further develop to achieve these goals?</li>\n<li>How will working towards this goal help you develop as a pharmacist and how long do you expect it will take you to reach these goals?</li>\n</ul>\n<p><em>Reflection: </em>The reflection should be a maximum of 500 words, taking into consideration your newly created learning plan. Identify key learning moments or challenges during your placement and discuss self-observation and/or feedback that has informed your performance in relation to these key learning moments. Use the reflection template in the ePortfolio to complete your reflection.</p>\n<p>After the debriefing tutorial, submit your EPAs, ILP and reflection to the ePortfolio via the assessment link in the PHRM3102 Learn.UQ site. The marking criteria/rubric for this assessment task is available on Learn.UQ (Blackboard).</p>\n<p><strong>Generative AI and Machine Translation:</strong> This task has been designed to be challenging, authentic and complex. Whilst students may use Artificial Intelligence (AI) and Machine Translation (MT) technologies, successful completion of the assessment will require students to critically engage in specific contexts and tasks for which AI will provide only limited support and guidance. A failure to reference AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission: </strong>After the debriefing tutorial, submit the required documents to the ePortfolio via the assessment link in the PHRM3102 Learn.UQ site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Vaccination training",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p>Online quiz 1PM on: 7/10/2025</p>\n<p>Practical assessment: 7/10/2025 - 15/10/2025</p>\n<p>\n</p><p>The vaccination module and quiz will open in teaching week 4. Pass the quiz by 1PM on Tuesday of week 10 (no extensions permitted) to be eligible to attend the vaccination workshop and complete the associated practical assessment in weeks 10 or 11. See Learn.UQ (Blackboard) for your workshop schedule.</p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L06",
            "mode": "Activity/ Performance, Written",
            "category": "Practical/ Demonstration",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>This assessment comprises three components, which must be completed in sequence:</strong></p>\n<p><strong>1. </strong>Online Learning Module (via UQ Extend):</p>\n<ul>\n<li>Complete the self-directed vaccination training module.</li>\n</ul>\n<p><strong>2.</strong> Online Quiz (via Learn.UQ):</p>\n<ul>\n<li>A multiple-choice quiz assessing key vaccination concepts. </li>\n<li>Achieve a minimum score of 80% to pass. </li>\n<li>Multiple attempts are permitted. </li>\n<li>This quiz must be passed by Tuesday of Teaching Week 10 to be eligible to attend the workshop.</li>\n<li>No extensions to this deadline are permitted.</li>\n</ul>\n<p><strong>3.</strong> Vaccination Workshop (Week 10 or 11):</p>\n<ul>\n<li>Attend and participate in the face-to-face vaccination skills workshop. </li>\n<li>This includes practical demonstration and assessment of vaccination administration techniques. </li>\n<li>Completion of the online quiz is a prerequisite for attending the workshop. Failure to complete and pass the quiz will result in non-admittance to the workshop.</li>\n<li>See Learn.UQ (Blackboard) for information on the criteria to pass this assessment.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission:</strong> Complete the quiz at the link provided in Learn.UQ (Blackboard) and complete the vaccination practical assessment during the vaccination workshop.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-4",
            "assessment_title": "Written Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>8/11/2025 - 22/11/2025</p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L06",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This exam will be an in person invigilated online written exam using the Inspera eAssessment platform (as will any deferred or supplementary written exams). Go to the <a href=\"https://elearning.uq.edu.au/student-guides-original/inspera-assessment-original\">Inspera Assessment Information page</a> link to navigate to the Library Services web page which provides further information on: how to access Inspera, on-campus invigilated exams in Inspera, device requirements, familiarisation opportunities, submitting assessment and access to the Student Laptop Scheme and short-term laptop-loans.</p>\n<p><strong>There are two parts to the exam, 1) integrated case scenario (70%) and 2) a series of multiple choice/multiple answer questions (30%)</strong></p>\n<p><strong>1) </strong>You will provide a structured clinically appropriate response to integrated case scenario(s) involving patients experiencing conditions discussed throughout the course (worth 70% of the final exam).</p>\n<p>In your response you will be required to:</p>\n<ul>\n<li>Apply evidence and best-practice guidance regarding management of the condition to the individual.</li>\n<li>Provide a structured response to one or more integrated cases. You will identify and prioritise any clinical problems (in the context of their medications) for the patient and provide a plan with appropriate monitoring and counselling points for resolving the medication-related problem.</li>\n<li>Justify the management plan</li>\n<li>Consider monitoring needs in the context of each problem that you have identified</li>\n<li>Appropriately interpret the role of the pharmacist and other health professionals in supporting the patient</li>\n<li>Consider the ways in which individual patient factors and social situation affect treatment and outcomes</li>\n<li>Prepare the document as a communication of your review to another health professional (e.g. general practitioner, specialist, nurse, or pharmacist)</li>\n</ul>\n<p><strong>2)</strong> Answer a series of<strong> </strong>multiple choice or multiple answer questions (worth 30% of the final exam).</p>\n<p>Further information, examples and marking criteria are provided in Learn.UQ (Blackboard).</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-5",
            "assessment_title": "OSCE Oral Consultation Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>8/11/2025 - 22/11/2025</p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L06",
            "mode": "Oral",
            "category": "Examination, Practical/ Demonstration, Role play/ Simulation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The oral consultation examination is a school-based exam that is scheduled during the examination period. Students will be notified of their allocated session via Learn.UQ prior to the exam revision period.</p>\n<p>The skills and competencies assessed at each station are mapped to Entrustable Professional Activities (EPAs) that will underpin your clinical placements as you progress through the degree.</p>\n<p><strong>OSCE [A, Medication History and identification of clinical issues; B, Resolving clinical issues and communication; C, Patient Education] [30% overall]: </strong></p>\n<p>The OSCE has 3 key parts all on the same case, in a community OR hospital setting.</p>\n<p><strong>Part A. Information gathering and history taking, identification of clinical issues and reasoning [10%]:</strong></p>\n<ul>\n<li>On presentation of a prescription/ hospital medication chart, <strong>complete a full medication history with the patient</strong>. Determine the use of existing and new medication/s. Ensure both pharmacological and non-pharmacological aspects such as difficulties with taking medications, lifestyle, cultural, and social concerns are ascertained.</li>\n<li><strong>Identify clinical issues</strong>. There may be multiple patient-centred clinical issues that are to be identified (in part A) and addressed (in parts B and C).</li>\n</ul>\n<p><strong>Part B. Interprofessional Collaboration - Discussion with the Doctor to resolve any clinical issues [10%]:</strong></p>\n<ul>\n<li>You are required to explain, and communicate with a doctor, any potential clinical issues that are identified by you acting as the pharmacist. You will need to make appropriate recommendations and resolve any clinical issues you identify working collaboratively with the doctor.</li>\n</ul>\n<p><strong>Part C. Patient Education and Medicines Management [10%]:</strong></p>\n<ul>\n<li>After resolution of the issue(s), students will then provide patient counselling to the 'patient' for the solution that was agreed to with the 'doctor’.</li>\n<li>During this interaction, the student will need to explain to the patient any medication changes and how to use the medication(s), including: dose; frequency; duration; adverse effects and their management; monitoring and lifestyle issues in patient centred manner.</li>\n<li>Lifestyle advice should also be offered ensuring a holistic, patient centred approach. Consider the ways in which individual patient factors and social situation affect treatment and outcomes.</li>\n</ul>\n<p><strong>Resources:</strong> Students are permitted to have ONLY a pen and blank paper, and may bring an approved calculator into the exam (you may need a calculator to check doses). Students are NOT permitted to bring any other resources into the exam; this includes but is not limited to, notes, phones, textbooks, or watches. You will have access to key clinical resources (AMH and APF), ensure you are familiar with these resources prior to the exam.</p>\n<p>This oral exam will be recorded and retained as per university policy. The recording will be stored in a secure manner and will only be accessed if required for the purposes of moderation of marking, provision of feedback to the student, and/or re-marking following a successful re-mark application.</p>\n<p>Further information and marking criteria are provided in Learn.UQ (Blackboard).</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission:</strong> The OSCE will be completed in person at the School of Pharmacy during the central exam period.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(28 Jul - 02 Nov)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshops</strong><br><p>Workshops are two hours long and cover the following topics:</p>\n<ul>\n<li>Module 1: Medication assessment and review skills, Critical thinking and clinical problem solving</li>\n<li>Modules 2 to 4: Geriatric medication management</li>\n<li>Modules 5 and 6: Medication management in chronic conditions using integrated cases</li>\n<li>Module 7: Paediatric medication management</li>\n<li>Module 8: Clinical toxicology and critical care</li>\n<li>Module 9: Pain management</li>\n<li>Module 10: Cancer care</li>\n<li>Module 11: Palliative care and voluntary assisted dying</li>\n</ul></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Workshops</strong>",
            "topic_description": "Workshops Workshops are two hours long and cover the following topics: Module 1: Medication assessment and review skills, Critical thinking and clinical problem solving Modules 2 to 4: Geriatric medication management Modules 5 and 6: Medication management in chronic conditions using integrated cases Module 7: Paediatric medication management Module 8: Clinical toxicology and critical care Module 9: Pain management Module 10: Cancer care Module 11: Palliative care and voluntary assisted dying",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(28 Jul - 02 Nov)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorials</strong><br/><p>Tutorials are three hours long and cover the following topics:</p>\n<ul>\n<li>Tutorial 1: Hospital medication history taking, reconciliation, and review</li>\n<li>Tutorial 2: Community pharmacy medication review and management, introduction to Engagement Task 1</li>\n<li>Tutorial 3: Geriatric integrated case and professional practice skills assessment</li>\n<li>Tutorial 4: Geriatric integrated case</li>\n<li>Tutorial 5: OSCE practice, and introduction to Engagement Task 2</li>\n<li>Tutorial 6: Paediatric case(s) and professional skills assessment</li>\n<li>Tutorial 7: Toxicology and critical care case(s), introduction to Engagement Task 3</li>\n<li>Tutorial 8: Vaccination workshop</li>\n<li>Tutorial 9: Cancer cases</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Tutorials</strong>",
            "topic_description": "Tutorials Tutorials are three hours long and cover the following topics: Tutorial 1: Hospital medication history taking, reconciliation, and review Tutorial 2: Community pharmacy medication review and management, introduction to Engagement Task 1 Tutorial 3: Geriatric integrated case and professional practice skills assessment Tutorial 4: Geriatric integrated case Tutorial 5: OSCE practice, and introduction to Engagement Task 2 Tutorial 6: Paediatric case(s) and professional skills assessment Tutorial 7: Toxicology and critical care case(s), introduction to Engagement Task 3 Tutorial 8: Vaccination workshop Tutorial 9: Cancer cases",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(28 Jul - 02 Nov)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>UQ Extend active online learning</strong><br/><p>Complete the online learning provided in UQ Extend, accessible via the link at Learn.UQ (Blackboard).</p>\n<ul>\n<li>Module 1: Medication assessment and review skills, Critical thinking and clinical problem solving</li>\n<li>Modules 2 to 4: Geriatric medication management and Vaccination training</li>\n<li>Modules 5 and 6: Medication management in chronic conditions using integrated cases</li>\n<li>Module 7: Paediatric medication management</li>\n<li>Module 8: Clinical toxicology and critical care</li>\n<li>Module 9: Pain management</li>\n<li>Module 10: Cancer care</li>\n<li>Module 11: Palliative care and voluntary assisted dying</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>UQ Extend active online learning</strong>",
            "topic_description": "UQ Extend active online learning Complete the online learning provided in UQ Extend, accessible via the link at Learn.UQ (Blackboard). Module 1: Medication assessment and review skills, Critical thinking and clinical problem solving Modules 2 to 4: Geriatric medication management and Vaccination training Modules 5 and 6: Medication management in chronic conditions using integrated cases Module 7: Paediatric medication management Module 8: Clinical toxicology and critical care Module 9: Pain management Module 10: Cancer care Module 11: Palliative care and voluntary assisted dying",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 3 To Week 10(11 Aug - 12 Oct)",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Work Integrated Learning </strong><br><p>There are two placements within this course:</p>\n<ul>\n<li>All students will complete a week-long block placement (37.5 hours; 7.5 hours/day) in a Community Pharmacy.</li>\n<li>Half of the cohort will complete a week-long block placement (37.5 hours; 7.5 hours/day) in a Hospital Pharmacy.</li>\n<li>The other half of the cohort complete the Hospital Pharmacy placement in PHRM3101.</li>\n<li>The schedule for placements will be provided on Learn.UQ (Blackboard) and in your personal timetable.</li>\n</ul></br></p><p><strong>Learning outcomes:</strong> L08</p></div></td>",
            "topic_title": "<strong>Work Integrated Learning </strong>",
            "topic_description": "Work Integrated Learning There are two placements within this course: All students will complete a week-long block placement (37.5 hours; 7.5 hours/day) in a Community Pharmacy. Half of the cohort will complete a week-long block placement (37.5 hours; 7.5 hours/day) in a Hospital Pharmacy. The other half of the cohort complete the Hospital Pharmacy placement in PHRM3101. The schedule for placements will be provided on Learn.UQ (Blackboard) and in your personal timetable.",
            "learning_outcomes": [
                "L08"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 10 To Week 11(06 Oct - 19 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Vaccination Workshop</strong><br><p>The 3-hour vaccination workshop is a learning experience concluding with practical assessment of vaccination competency.</p></br></p><p><strong>Learning outcomes:</strong> L06</p></div></td>",
            "topic_title": "<strong>Vaccination Workshop</strong>",
            "topic_description": "Vaccination Workshop The 3-hour vaccination workshop is a learning experience concluding with practical assessment of vaccination competency.",
            "learning_outcomes": [
                "L06"
            ]
        }
    ]
}