{
    "course_title": "Professional Practice 2",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/PHTY4402-60272-7560",
    "full_course_code": "PHTY4402-60272-7560",
    "course_code": "PHTY4402",
    "class_code": "60272",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (29/09/2025 - 31/10/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate ethical and professional decision making and behaviour appropriate to physiotherapy while applying knowledge and understanding of standards of physiotherapy practice, relevant codes of conduct, and client rights."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate a competent level of effective verbal, non-verbal and written communication skills applied to all aspects of practice including interactions with clients, professionals and the community."
        },
        {
            "number": "LO3.",
            "description": "Demonstrate a competent understanding of the presentation and management of a wide range of clinical problems across the lifespan while being respectful and sensitive to individual client needs."
        },
        {
            "number": "LO4.",
            "description": "Demonstrate a competent ability to appropriately, safely, accurately, systematically and efficiently assess a client to determine and prioritise problems via gathering, integrating and interpreting appropriate data related to the patient."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate an appropriate process of clinical reasoning in making decisions related to the client such as developing a hypothesis, determining patient outcomes."
        },
        {
            "number": "LO6.",
            "description": "Demonstrate an understanding of the importance of goal-setting with clients and self-management for return of function, work and leisure activities."
        },
        {
            "number": "LO7.",
            "description": "Demonstrate to a competent standard of ability to interpret, analyse and integrate the assessment findings in the development of a hypothesis."
        },
        {
            "number": "LO8.",
            "description": "Select, develop and implement safe, appropriate and effective physiotherapy and other intervention plan to a competent standard using problem solving skills such as critical thinking and judgement while aiming to achieve client treatment goals."
        },
        {
            "number": "LO9.",
            "description": "Develop an integrative and holistic physiotherapy intervention of patients, acknowledging individual differences."
        },
        {
            "number": "LO10.",
            "description": "Evaluate the effectiveness and efficiency of interventions using appropriate re-evaluation and / or valid and reliable outcome measures."
        },
        {
            "number": "LO11.",
            "description": "Demonstrate the ability to provide advice and education relevant to interventions and formulated hypothesis."
        },
        {
            "number": "LO12.",
            "description": "Demonstrate accurate and appropriate documentation that meets ethical and legal requirements depending on the context."
        },
        {
            "number": "LO13.",
            "description": "Demonstrate the integration of evidence-based practice into the practice setting."
        },
        {
            "number": "LO14.",
            "description": "Demonstrate appreciation of the diverse roles and scope of physiotherapy practice in a range of settings eg community, industry, regional/rural, public, private."
        },
        {
            "number": "LO15.",
            "description": "Demonstrate an appreciation of the roles of other disciplines and participate as a member of an interdisciplinary/multi-professional team including delegation to staff under physiotherapy supervision."
        },
        {
            "number": "LO16.",
            "description": "Demonstrate an ability to reflect on ones own professional development and physiotherapy practice."
        },
        {
            "number": "LO17.",
            "description": "Demonstrate commitment to wellness, health promotion and injury prevention with clients."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Professional behaviour, communication on immersion - Continuous assessment: professional performance",
            "special_indicators": [],
            "weighting": "<dd>30% Compulsory Pass </dd>",
            "due_date": null,
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will assess and provide physiotherapy management for clients over a five week full-time immersion in a variety of settings. Students' performance of their professional behaviour and communication will be assessed on a continuous basis across the immersion using ongoing observation of student/client interactions and assessment of student's knowledge, skills and professional behaviour against the Australian Physiotherapy Council Standards for an Entry-level physiotherapist.</p>\n<p>Students are also expected to complete their own self-assessment as per the APP process.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": null,
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Clinical performance on immersion - Continuous assessment: clinical performance",
            "special_indicators": [],
            "weighting": "<dd>70% Compulsory Pass </dd>",
            "due_date": null,
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will assess and provide physiotherapy management for clients over a five week full-time immersion in a variety of settings. Students' performance of their ability to to perform assessment, analysis and planning, apply intervention, using an appropriate evidence base and risk management strategies will be assessed on a continuous basis across the immersion using ongoing observation of student/client interactions and assessment of student's knowledge, skills and professional behaviour against the Australian Physiotherapy Council Standards for an Entry-level physiotherapist.</p>\n<p>Students are also expected to complete their own self-assessment as per the APP process.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": null,
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Clinical/professional immersion - Continuous assessment of professional performance",
            "special_indicators": [],
            "weighting": "<dd> Formative assessment </dd>",
            "due_date": null,
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>\n</p>\n<p>The purpose of formative assessment is to improve the quality of learning by providing information on strengths and weaknesses and to help identify strategies for improvement. Formative assessment is designed to help students understand how they are progressing. This type of assessment typically occurs throughout a clinical immersion and can be in many forms. It may be informal or as part of structured feedback.</p>\n<p>During clinical immersions formal formative feedback occurs at the mid immersion point. Students are expected to contribute to this process and engage in dialogue about their current performance and how they could develop their skills further in the remainder of the placement. Feedback is intended to improve learning and subsequent clinical practice. Development of skill will only occur if students incorporate feedback into practice during clinical immersions.</p>\n<p>Students are also expected to complete their own self-assessment as per the APP process.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": null,
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Full-time Physiotherapy Practice Immersion</strong><br><p>Professional Practice: Students will experience a five week full-time immersion in an appropriate physiotherapy workplace setting under the supervision of a clinical educator. They will assess, develop management plans, deliver interventions and continually re-assess clients in the setting. They will develop and integrate knowledge, skills and professional physiotherapy behaviours required to function as an entry-level physiotherapist.</p></br></p></div></td>",
            "topic_title": "<strong>Full-time Physiotherapy Practice Immersion</strong>",
            "topic_description": "Full-time Physiotherapy Practice Immersion Professional Practice: Students will experience a five week full-time immersion in an appropriate physiotherapy workplace setting under the supervision of a clinical educator. They will assess, develop management plans, deliver interventions and continually re-assess clients in the setting. They will develop and integrate knowledge, skills and professional physiotherapy behaviours required to function as an entry-level physiotherapist.",
            "learning_outcomes": []
        }
    ]
}