{
    "course_title": "The Political Dynamics of Development and Resistance",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/POLS2404-61510-7560",
    "full_course_code": "POLS2404-61510-7560",
    "course_code": "POLS2404",
    "class_code": "61510",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Appreciate the relationship between theory and practice in development."
        },
        {
            "number": "LO2.",
            "description": "Competently analyse political dynamics in development processes at local, regional and global levels, as well as between them."
        },
        {
            "number": "LO3.",
            "description": "Successfully relate issues and problems in contemporary development governance to their historical, social, and political underpinnings."
        },
        {
            "number": "LO4.",
            "description": "Identify and critically analyse conceptual frameworks in the context of case examples."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Tutorial participation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>35% Tutorial Participation 16%; a In-class Quizzes total 19% each 9.5% </dd>",
            "due_date": "<dd><p>Tutorial Participation 6/08/2025 - 10/10/2025</p>\n<p>Quiz 1 27/08/2025 - 29/08/2025</p>\n<p>Quiz 2 24/09/2025 - 26/09/2025</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Oral, Written",
            "category": "Participation/ Student contribution, Quiz, Tutorial/ Problem Set",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Tutorial Participation and In-Class Quizzes</strong></p>\n<p>You will receive a total of 35 points for tutorial participation as follows:</p>\n<p><br/></p>\n<p><strong>Tutorial Participation (16%)</strong></p>\n<p>Your participation mark is based on both attendance and active engagement during tutorials.</p>\n<ul>\n<li>You will earn 2 points per tutorial: 1% for attendance and 1% for participation. There are 8 tutorials in total, making up 16% of your final grade.</li>\n</ul>\n<p><br/></p>\n<p><strong>In-Class Quizzes (19%)</strong></p>\n<ul>\n<li>You are required to complete two short quizzes during tutorial sessions: Week 5 Quiz and Week 9 Quiz. Each quiz will take 15–20 minutes. Each is worth 9.5%, for a combined total of 19%</li>\n</ul>\n<p><br/></p>\n<p><strong>Task Description:</strong></p>\n<p>The Tutorial Participation mark is based on your attendance and participation. You are expected to attend and actively participate in eight tutorials. Each tutorial includes hands-on activities such as group discussions, mapping exercises, data analysis, and peer feedback. You will also use part of the tutorial time to prepare for your group case study by engaging in team planning, research coordination, and collaborative exercises.</p>\n<p>Two short in-class quizzes (Week 5 and Week 9) will assess understanding of key theoretical concepts (e.g., feminist political economy, ontological politics). More information will be available in POLSIS 2404 Blackboard site on the Quiz and tutorial reading.</p>\n<p><strong>Please also note the following expectations with regard to tutorials: you are expected to:</strong></p>\n<ul>\n<li>Arrive on time</li>\n<li>Demonstrate a willingness to speak or participate in class activities</li>\n<li>Engage with your peers respectfully</li>\n</ul>\n<p><strong>Tutorials can be exciting and intellectually stimulating - the more prepared you are the more you will benefit from the engagement with your group as a whole!</strong></p>\n<p><strong>Please note</strong>: Preparation in advance for each tutorial -- especially covering the required readings for each topic - will make for better and engaging discussions with your group. These discussions are an invaluable opportunity to engage constructively and respectfully with others in the group. Tutorials also provide an opportunity to address any specific questions that you may have about the readings and / or topic more generally.</p>\n<p><strong>Written work in place of tutorial participation:</strong></p>\n<p>Students who miss single or multiple tutorials for a valid reason (including illness) may complete a short critical piece of written work in place of participation. For each missed tutorial, write a 250-word reflection on one of the readings for that week and submit to your tutor. Students to <strong>contact the Course Coordinator or their tutor</strong> if they miss a tutorial or quiz.</p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p>The Tutorial Participation mark is based on your attendance and participation. <strong>Please note that it is your responsibility to ensure that you sign-off on the weekly attendance sheet for tutorials that you attend.</strong></p>\n<p><strong>Assessment Breakdown</strong>:</p>\n<p>- 2% per tutorial for attendance and engagement (8 tutorials = 16%)</p>\n<p>- 9.5% per quiz (2 quizzes = 19%)</p>\n<p><strong>Total tutorial mark</strong>: Your tutorial participation marks will be released after the last lecture. It is your responsibility to check your result for this and if you have any queries regarding the final (total) mark for tutorial participation you should contact your tutor by e-mail (this email should be copied to the course coordinator) within a week of the release of the marks for your tutorial participation.</p>\n<p><strong>PLEASE NOTE: </strong>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) and Machine Translation (MT) tools will not be permitted when completing the Quiz component. Any attempted use of Ai or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Please note that it is your responsibility to ensure that you sign-off on the weekly attendance sheet for tutorials that you attend.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Group Case Study Analysis of Development Resistance",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>40% 10% Draft Plan week 7; 25% Case Study Submission Week 10; 5% Peer review Form completed Week 10 </dd>",
            "due_date": "<dd><p>Draft Research Plan 12/09/2025 5:00 pm</p>\n<p>Final Essay 7/10/2025 2:00 pm</p>\n<p>Peer Review Form 7/10/2025 4:30 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Essay/ Critique, Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Group Case Study Analysis and Peer Review</strong></p>\n<p>Each group of 4-5 students will submit an essay of 2500 words on your chosen case study or policy document in two stages.</p>\n<p><strong>Stage 1:</strong> Your group will be required to submit a draft research plan or storyboard (500 words) (10%) on Week 7</p>\n<p><strong>Stage 2</strong>: A final written group essay report (2,000 words) that includes visual component (e.g., map, infographic) (25%) in Week 10.</p>\n<p>Each student will be required to submit a peer review form assessing team contributions (5%) in Week 10.</p>\n<p><br/></p>\n<p><strong>Task Description:</strong></p>\n<p>In this group assignment, students will work collaboratively in teams of 4–5 to produce a 2,500-word case study analysis focused on a selected development resistance movement or policy document from a list that will be posted to <strong>Blackboard</strong> by the Course Coordinator in Week 2. This task is designed to deepen your understanding of how development is contested and reimagined through collective action and alternative frameworks.</p>\n<p><strong>Purpose</strong>:</p>\n<p>This assessment aim is to build your capacity to critically examining development as a political and relational process. It encourages you to apply interdisciplinary theories and analytical tools to real-world struggles for justice, sovereignty, and transformation. Through collaborative research, you will explore how resistance movements challenge dominant development paradigms and propose alternative futures. it also seeks to build your capacity to engage in collaborative research and team work. You will be supported to navigate group dynamics through dedicated check-in times during tutorials.</p>\n<p><strong>Task Requirements</strong>:</p>\n<ul>\n<li>Case Selection: Choose one resistance movement or policy document from the provided list posted to Blackboard in Week 2</li>\n<li>Theoretical Integration: Apply at least two theoretical frameworks discussed in the course (e.g., post-development, climate justice, feminist political economy, decolonial thought) to critically analyse your case.</li>\n<li>Analytical Component: Your analysis must include one or more of the following:</li>\n<li>Spatial analysis (e.g., mapping territorial claims or urban struggles)</li>\n<li>Digital analysis (e.g., examining online activism or platform politics)</li>\n<li>Quantitative analysis (e.g., using data to support claims about inequality, access, or impact)</li>\n<li>Structure &amp; Presentation:</li>\n<li>Clear introduction and background of the case</li>\n<li>Application of theoretical frameworks</li>\n<li>Analytical insights using selected methods</li>\n<li>Conclusion reflecting on broader implications for development and resistance</li>\n<li>Proper referencing and academic writing style</li>\n<li>Group Organisation and Planning :  Selection of group members will be in Week 2 during the tutorial time, so be there. Case studies and policy documents will be posted to the Blackboard site on Week 2. Selection of case study by the group will be facilitated during the tutorial on Week 4. Two 10-15 minute \"group check-in\" sessions to facilitate health group dynamics are built in Week 6 and Week 8 Tutorials.</li>\n<li>Students with exceptional circumstances that impact their ability to participate in the group work will need to inform their tutor or course coordinator and negotiate their contributions with their peers.</li>\n</ul>\n<p><strong>Submission Plan</strong></p>\n<p>Each group will submit an essay of 2500 words on your chosen case study or policy document. Your group will be required to submit:</p>\n<p>- <strong>Week 7:</strong> A draft research plan or storyboard (500 words) (10%) – due Friday 12 Sept 5pm</p>\n<p>- <strong>Week 10: </strong>A written report (2,000 words) to include visual component (e.g., map, infographic) (25%) due Tuesday 7 October  2pm</p>\n<p>- <strong>Week 10: </strong>A peer review form assessing team contributions (individual weighting) (5%) due Tuesday 7 October  4:30pm</p>\n<p><strong>Presentation: </strong>Your essay must be typed (1.5-line-spaced) fully referenced and include a bibliographic list. The Peer Review Form will posted to Blackboard and should be completed by each student</p>\n<p><strong>Submission: Please note that submissions have to be made via POLS2404 designated Turnitin Link (Blackboard), using Word-encoding ( .doc, or .docx extensions); .pdf files are <em>not </em>acceptable!!! </strong></p>\n<p><strong>Word count:</strong> Please ensure that you provide a <strong>word count at the end </strong>of your essay excluding the bibliographic list.</p>\n<p><strong>PLEASE NOTE:</strong></p>\n<p>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI or MT to support their learning and complete this assessment task e.g revision of the authentic assessment or a component of the assessment task. Students must clearly reference any use of generative AI or MT in each instance. Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct.</p>\n<p>To pass this assessment, students will be required to critically engage with their specific context beyond the support and guidance of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Essay topics will be posted on the POLS2404 Blackboard site in advance</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Video Presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p>Video Submission 28/10/2025 2:00 pm</p>\n<p>Online Q&amp;A Session  29/10/2025 10:00 am</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Oral, Product/ Artefact/ Multimedia",
            "category": "Creative Production/ Exhibition, Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Video Presentation: This assessment is delivered in two stages:</strong></p>\n<p><strong>Stage 1:</strong> Submit a 5 minute recorded video presentation on a development challenge - (15%)</p>\n<p><strong>Stage 2:</strong> Participate in a 5 minute online Q&amp;A session on your chosen topic in a Teams breakout room with 4-5 peers (10%)</p>\n<p><br/></p>\n<p><strong>Task Description</strong></p>\n<p>This assessment invites you to critically explore a development challenge in a country you are familiar with, and communicate your findings through a short, engaging multimedia presentation. You will analyse how colonial histories continue to shape economic, social, or environmental conditions today, using an intersectional lens and multimedia tools.</p>\n<p>This task encourages critical analysis of development as a contested and historically rooted process. Builds your skill in the application of intersectional and decolonial frameworks. It build your capacity to creatively communicate complex ideas using digital tools.</p>\n<p><strong>Task Instructions</strong></p>\n<p>Part 1: Pre-recorded Video Presentation (5 minutes) – 15%</p>\n<p>Create a short, creative, and visually engaging video that:</p>\n<ul>\n<li>Introduces a development challenge in a specific country</li>\n<li>Analyses how colonial legacies continue to shape this issue</li>\n<li>Applies an intersectional perspective (e.g., race, gender, class, indigeneity)</li>\n<li>Uses multimedia tools (e.g., visuals, maps, voiceover, data, etc.) to support your analysis</li>\n</ul>\n<p><br/></p>\n<p><strong>Part 2</strong>: Live Q&amp;A Session (5 minutes) – 10%</p>\n<p>During the final lecture (Week 13), you will:</p>\n<ul>\n<li>Join a Teams breakout room with 4–5 peers</li>\n<li>Play your pre-recorded video</li>\n<li>Participate in a 5-minute live Q&amp;A, responding to questions from your peers</li>\n</ul>\n<p><br/></p>\n<p><strong>Presentation: </strong>Your video can use graphics, images, maps etc to convey your ideas. Your video should include a reference list. It should demonstrate a high standard of grammar, and general presentation and conform to the standards set out in the School of Political Science and International Studies. Your video will be marked according to the assessment criteria posted in Blackboard.</p>\n<p><strong>PLEASE NOTE:</strong></p>\n<p>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI or MT to support their learning and complete this assessment task e.g revision of the authentic assessment or a component of the assessment task. Students must clearly reference any use of generative Ai or MT in each instance. Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct.</p>\n<p>To pass this assessment, students will be required to critically engage with their specific context during the Q&amp;A session.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission:</strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(28 Jul - 03 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1: Welcome, Introductions and Methodological Foundations</strong><br><p>Our first meeting will be dedicated to introducing and outlining the course, its modalities and its objectives. We will talk about the organisation of the learning experience, and about how we will approach the complex but very interesting topic of political dynamics of development and resistance. We explore the evolution of development theory and the importance of resistance in shaping political outcomes. Theories include modernisation theory, dependency theory, and intersectionality. To prepare for the opening meeting, please refer to the Library Reading List for POLS2404.</p></br></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Week 1: Welcome, Introductions and Methodological Foundations</strong>",
            "topic_description": "Week 1: Welcome, Introductions and Methodological Foundations Our first meeting will be dedicated to introducing and outlining the course, its modalities and its objectives. We will talk about the organisation of the learning experience, and about how we will approach the complex but very interesting topic of political dynamics of development and resistance. We explore the evolution of development theory and the importance of resistance in shaping political outcomes. Theories include modernisation theory, dependency theory, and intersectionality. To prepare for the opening meeting, please refer to the Library Reading List for POLS2404.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 2(04 Aug - 10 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2: Feminist Political Economy Perspectives on Development </strong><br><p>This week introduces feminist political economy as a critical lens for understanding development, focusing on how global economic systems shape and often marginalize gendered labour, care work, and social reproduction. We examine how intersecting structures of power—such as patriarchy, capitalism, and colonialism—impact women and other marginalized groups in both formal and informal economies.</p>\n<p>Key theoretical frameworks include social reproduction theory and feminist economics, which help us analyse the undervaluation of care work and the systemic invisibility of gendered labour in mainstream development discourse. Case studies such as global care chains and UN gender data initiatives will be used to ground these theories in real-world contexts.</p>\n<p>This module contributes to the course’s broader aim of rethinking development by foregrounding the relational and embodied dimensions of labour, and by highlighting how feminist perspectives offer transformative alternatives to dominant economic models.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Week 2: Feminist Political Economy Perspectives on Development </strong>",
            "topic_description": "Week 2: Feminist Political Economy Perspectives on Development This week introduces feminist political economy as a critical lens for understanding development, focusing on how global economic systems shape and often marginalize gendered labour, care work, and social reproduction. We examine how intersecting structures of power—such as patriarchy, capitalism, and colonialism—impact women and other marginalized groups in both formal and informal economies. Key theoretical frameworks include social reproduction theory and feminist economics, which help us analyse the undervaluation of care work and the systemic invisibility of gendered labour in mainstream development discourse. Case studies such as global care chains and UN gender data initiatives will be used to ground these theories in real-world contexts. This module contributes to the course’s broader aim of rethinking development by foregrounding the relational and embodied dimensions of labour, and by highlighting how feminist perspectives offer transformative alternatives to dominant economic models.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(04 Aug - 10 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 1</strong><br><p><strong>Feminist Political Economy in Practice</strong></p>\n<p>This  week’s tutorial introduces key concepts in feminist political economy through interactive activities. Students will take part in a group discussion on global care chains, exploring how gendered labour is shaped by transnational inequalities. The session also includes a hands-on introduction to UN gender data, where students will begin learning how to interpret and apply quantitative insights to development issues. Finally, students will form their groups for the upcoming case study assessment to begin planning their topics and approach.</p>\n<p><br/></p></br></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Tutorial 1</strong>",
            "topic_description": "Tutorial 1 Feminist Political Economy in Practice This  week’s tutorial introduces key concepts in feminist political economy through interactive activities. Students will take part in a group discussion on global care chains, exploring how gendered labour is shaped by transnational inequalities. The session also includes a hands-on introduction to UN gender data, where students will begin learning how to interpret and apply quantitative insights to development issues. Finally, students will form their groups for the upcoming case study assessment to begin planning their topics and approach.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3(11 Aug - 17 Aug)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3: Open Reading Week</strong><br><p>This week we continue with the task of exploring conceptual aspects of understanding the politics of development and resistance, and we focus in particular on its political economy underpinnings. Karl Polanyi s work provides a rich and instructive framework for working through some of the contradictions and conflicts induced by market-centred development. We encounter his concept of a double-movement and consider its relevance for understanding and analysing resistance to the politics of the market. Some concrete examples will supplement our discussion throughout.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Week 3: Open Reading Week</strong>",
            "topic_description": "Week 3: Open Reading Week This week we continue with the task of exploring conceptual aspects of understanding the politics of development and resistance, and we focus in particular on its political economy underpinnings. Karl Polanyi s work provides a rich and instructive framework for working through some of the contradictions and conflicts induced by market-centred development. We encounter his concept of a double-movement and consider its relevance for understanding and analysing resistance to the politics of the market. Some concrete examples will supplement our discussion throughout.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 3(11 Aug - 17 Aug)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Open Reading Week</strong><br/></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Open Reading Week</strong>",
            "topic_description": "Open Reading Week",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 4(18 Aug - 24 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4: Ontological Politics &amp; Plural Worldviews</strong><br><p>This week introduces the concept of <em>ontological politics</em>, focusing on how different communities construct, experience, and defend diverse ways of being and knowing. We explore how Indigenous cosmologies challenge dominant development paradigms by revealing that development is not a singular or universal trajectory, but a contested and plural process shaped by multiple realities.</p>\n<p>Through theories of political ontology and decolonial thought, students will examine how knowledge systems are embedded in power relations and how struggles over land, life, and meaning are also struggles over what counts as reality. Case studies—such as the Zapatista movement—will illustrate how Indigenous worldviews offer alternative visions of autonomy, care, and collective life beyond the logic of extractivism and linear progress.</p>\n<p>This module deepens the course’s commitment to rethinking development by foregrounding the politics of knowledge and the legitimacy of diverse world-making practices.</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 4: Ontological Politics &amp; Plural Worldviews</strong>",
            "topic_description": "Week 4: Ontological Politics & Plural Worldviews This week introduces the concept of ontological politics , focusing on how different communities construct, experience, and defend diverse ways of being and knowing. We explore how Indigenous cosmologies challenge dominant development paradigms by revealing that development is not a singular or universal trajectory, but a contested and plural process shaped by multiple realities. Through theories of political ontology and decolonial thought, students will examine how knowledge systems are embedded in power relations and how struggles over land, life, and meaning are also struggles over what counts as reality. Case studies—such as the Zapatista movement—will illustrate how Indigenous worldviews offer alternative visions of autonomy, care, and collective life beyond the logic of extractivism and linear progress. This module deepens the course’s commitment to rethinking development by foregrounding the politics of knowledge and the legitimacy of diverse world-making practices.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4(18 Aug - 24 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 2</strong><br><p><strong>Mapping Indigenous Territories and Development Conflicts</strong></p>\n<p>This tutorial begins with a recap of key concepts from the lecture, focusing on ontological politics and Indigenous cosmologies. Students will then engage in a spatial mapping activity to explore how Indigenous territories intersect with development conflicts, highlighting contested claims to land, resources, and sovereignty. This exercise encourages critical reflection on how space and knowledge are politicised in development contexts. The session will conclude with the formation of case study assessment groups and initial topic selection, helping students begin planning their collaborative research projects.</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Tutorial 2</strong>",
            "topic_description": "Tutorial 2 Mapping Indigenous Territories and Development Conflicts This tutorial begins with a recap of key concepts from the lecture, focusing on ontological politics and Indigenous cosmologies. Students will then engage in a spatial mapping activity to explore how Indigenous territories intersect with development conflicts, highlighting contested claims to land, resources, and sovereignty. This exercise encourages critical reflection on how space and knowledge are politicised in development contexts. The session will conclude with the formation of case study assessment groups and initial topic selection, helping students begin planning their collaborative research projects.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5(25 Aug - 31 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5: Post-Development Alternatives</strong><br><p>This week introduces post-development theory as a critique of mainstream development paradigms, challenging Western-centric notions of progress, growth, and modernity. We trace contemporary global inequalities and political domination to their colonial roots, examining how development has historically been co-constituted with systems of power, representation, and knowledge production.</p>\n<p>Students will engage with alternative frameworks such as <em>Buen Vivir</em> and <em>Ubuntu</em>, which offer relational, community-based, and ecologically grounded visions of well-being. These perspectives reject the universalising logic of development and instead propose plural, culturally embedded pathways toward justice and sustainability.</p>\n<p>This module supports the course’s broader aim of rethinking development by foregrounding epistemic diversity and the need to decolonise both theory and practice.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Week 5: Post-Development Alternatives</strong>",
            "topic_description": "Week 5: Post-Development Alternatives This week introduces post-development theory as a critique of mainstream development paradigms, challenging Western-centric notions of progress, growth, and modernity. We trace contemporary global inequalities and political domination to their colonial roots, examining how development has historically been co-constituted with systems of power, representation, and knowledge production. Students will engage with alternative frameworks such as Buen Vivir and Ubuntu , which offer relational, community-based, and ecologically grounded visions of well-being. These perspectives reject the universalising logic of development and instead propose plural, culturally embedded pathways toward justice and sustainability. This module supports the course’s broader aim of rethinking development by foregrounding epistemic diversity and the need to decolonise both theory and practice.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 5(25 Aug - 31 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 3</strong><br><p><strong>Rethinking Well-Being and Quiz 1</strong></p>\n<p>In this tutorial, we critically examine how well-being is measured beyond conventional economic indicators like GDP. Through a comparative analysis of alternative well-being frameworks—including those rooted in relational, ecological, and cultural values—students will reflect on how development can be understood through more inclusive and justice-oriented lenses. The session also includes Quiz 1, an in-class activity designed to assess your understanding of key concepts introduced in the first three weeks, including post-development theory, colonial legacies, and plural pathways to well-being.</p></br></p><p><strong>Learning outcomes:</strong> L02, L04</p></div></td>",
            "topic_title": "<strong>Tutorial 3</strong>",
            "topic_description": "Tutorial 3 Rethinking Well-Being and Quiz 1 In this tutorial, we critically examine how well-being is measured beyond conventional economic indicators like GDP. Through a comparative analysis of alternative well-being frameworks—including those rooted in relational, ecological, and cultural values—students will reflect on how development can be understood through more inclusive and justice-oriented lenses. The session also includes Quiz 1, an in-class activity designed to assess your understanding of key concepts introduced in the first three weeks, including post-development theory, colonial legacies, and plural pathways to well-being.",
            "learning_outcomes": [
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(01 Sep - 07 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong> Week 6: Climate Justice &amp; Environmental Resistance</strong><br/><p>This week examines the intersection of environmental degradation and social justice, highlighting how ecological crises are deeply entangled with histories of colonialism, global inequality, and resistance. Students will critically engage with concepts such as <em>climate colonialism</em>, <em>extractivism</em>, and the <em>environmentalism of the poor</em>, using these to interrogate dominant narratives of sustainability and development.</p>\n<p>Drawing on theories of environmental justice and <em>slow violence</em>, the module explores how environmental harms are unevenly distributed and resisted, particularly by Indigenous and marginalized communities. Case studies—including the Standing Rock Sioux resistance to the Dakota Access Pipeline and Amazonian struggles against deforestation—will ground theoretical insights in lived experiences of resistance.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong> Week 6: Climate Justice &amp; Environmental Resistance</strong>",
            "topic_description": "Week 6: Climate Justice & Environmental Resistance This week examines the intersection of environmental degradation and social justice, highlighting how ecological crises are deeply entangled with histories of colonialism, global inequality, and resistance. Students will critically engage with concepts such as climate colonialism , extractivism , and the environmentalism of the poor , using these to interrogate dominant narratives of sustainability and development. Drawing on theories of environmental justice and slow violence , the module explores how environmental harms are unevenly distributed and resisted, particularly by Indigenous and marginalized communities. Case studies—including the Standing Rock Sioux resistance to the Dakota Access Pipeline and Amazonian struggles against deforestation—will ground theoretical insights in lived experiences of resistance.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(01 Sep - 07 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 4</strong><br/><p><strong>Climate Justice and Group Assessment Check-in Session</strong></p>\n<p>This week’s tutorial focuses on applied policy writing through a climate justice statement drafting exercise, where students will articulate key principles and demands grounded in the course’s critical frameworks. The activity encourages students to reflect on the intersection of environmental degradation, inequality, and resistance. </p>\n<p>The session also includes the first of two <strong>check-in</strong> sessions on group case study projects, providing space to assess group dynamics, clarify roles, and refine research plans as students prepare for their collaborative assessment</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Tutorial 4</strong>",
            "topic_description": "Tutorial 4 Climate Justice and Group Assessment Check-in Session This week’s tutorial focuses on applied policy writing through a climate justice statement drafting exercise, where students will articulate key principles and demands grounded in the course’s critical frameworks. The activity encourages students to reflect on the intersection of environmental degradation, inequality, and resistance. The session also includes the first of two check-in sessions on group case study projects, providing space to assess group dynamics, clarify roles, and refine research plans as students prepare for their collaborative assessment",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7(08 Sep - 14 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7: Labour Struggles &amp; Just Transitions</strong><br/><p>This week explores the politics of labour within development, focusing on how workers and labouring communities navigate and resist systems of exclusion and precarity. Building on earlier discussions of political economy and historical legacies of inequality, we examine how labour struggles have evolved in response to shifting global dynamics, including informalisation, austerity, and climate change.</p>\n<p>We critically engage with contemporary debates around labour rights, informal economies, and the potential of universal basic income and social protection as tools for justice. The concept of a <em>just transition</em>—ensuring that climate action does not deepen inequality—is central to our inquiry. Through case studies such as Ecuador’s post-extractivist movements and global green job transitions, students will apply theories of labour resistance and political economy to real-world struggles.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 7: Labour Struggles &amp; Just Transitions</strong>",
            "topic_description": "Week 7: Labour Struggles & Just Transitions This week explores the politics of labour within development, focusing on how workers and labouring communities navigate and resist systems of exclusion and precarity. Building on earlier discussions of political economy and historical legacies of inequality, we examine how labour struggles have evolved in response to shifting global dynamics, including informalisation, austerity, and climate change. We critically engage with contemporary debates around labour rights, informal economies, and the potential of universal basic income and social protection as tools for justice. The concept of a just transition —ensuring that climate action does not deepen inequality—is central to our inquiry. Through case studies such as Ecuador’s post-extractivist movements and global green job transitions, students will apply theories of labour resistance and political economy to real-world struggles.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7(08 Sep - 14 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 5</strong><br/><p><strong>Labour Data and Video Assessment Planning</strong></p>\n<p>This tutorial begins with a recap of key concepts from the lecture, focusing on labour struggles and just transitions. Students will engage in a hands-on data analysis activity using labour statistics and transition policy examples to explore patterns of inequality, precarity, and reform. </p>\n<p>The session also includes dedicated time for planning the individual video assessment, with a focus on the visual and multimedia components. Students will discuss strategies for presenting their research creatively and effectively, and clarify expectations for both the video and live Q&amp;A components.</p></p><p><strong>Learning outcomes:</strong> L02, L04</p></div></td>",
            "topic_title": "<strong>Tutorial 5</strong>",
            "topic_description": "Tutorial 5 Labour Data and Video Assessment Planning This tutorial begins with a recap of key concepts from the lecture, focusing on labour struggles and just transitions. Students will engage in a hands-on data analysis activity using labour statistics and transition policy examples to explore patterns of inequality, precarity, and reform. The session also includes dedicated time for planning the individual video assessment, with a focus on the visual and multimedia components. Students will discuss strategies for presenting their research creatively and effectively, and clarify expectations for both the video and live Q&A components.",
            "learning_outcomes": [
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8: Urban Inequality and the Politics of Space</strong><br/><p>In this week we explore how urban spaces are shaped by and contested through power, inequality, and resistance. We explore the politics of space through the lens of <em>spatial justice</em> and the <em>right to the city</em>, examining how urban development often reproduces exclusion along lines of class, race, and colonial legacies.</p>\n<p>Students will engage with critical urban theory and grassroots responses to urban inequality, focusing on housing struggles, displacement, and the reclaiming of public space. Case studies from Latin America and Europe will illustrate how urban social movements challenge dominant models of development and articulate alternative urban futures grounded in justice, dignity, and collective rights.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 8: Urban Inequality and the Politics of Space</strong>",
            "topic_description": "Week 8: Urban Inequality and the Politics of Space In this week we explore how urban spaces are shaped by and contested through power, inequality, and resistance. We explore the politics of space through the lens of spatial justice and the right to the city , examining how urban development often reproduces exclusion along lines of class, race, and colonial legacies. Students will engage with critical urban theory and grassroots responses to urban inequality, focusing on housing struggles, displacement, and the reclaiming of public space. Case studies from Latin America and Europe will illustrate how urban social movements challenge dominant models of development and articulate alternative urban futures grounded in justice, dignity, and collective rights.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 6</strong><br/><p><strong>Mapping Urban Resistance and Group Case Study Check-In</strong></p>\n<p>This tutorial begins with a GIS mapping exercise to explore urban resistance movements and spatial justice. Students will analyse how contested urban spaces reflect broader struggles over development, displacement, and the right to the city. The activity encourages critical engagement with spatial data and visual storytelling. </p>\n<p>The session also includes our second group <strong>check-in</strong> for the case study assessment, providing time to reflect on group dynamics, refine research plans, and ensure progress toward a cohesive and collaborative final submission.</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Tutorial 6</strong>",
            "topic_description": "Tutorial 6 Mapping Urban Resistance and Group Case Study Check-In This tutorial begins with a GIS mapping exercise to explore urban resistance movements and spatial justice. Students will analyse how contested urban spaces reflect broader struggles over development, displacement, and the right to the city. The activity encourages critical engagement with spatial data and visual storytelling. The session also includes our second group check-in for the case study assessment, providing time to reflect on group dynamics, refine research plans, and ensure progress toward a cohesive and collaborative final submission.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9: Water, Power, and Indigenous Resistance</strong><br/><p>This week explores water as a deeply political, cultural, and spiritual resource, central to both development struggles and Indigenous sovereignty. We examine how access to and governance of water is shaped by colonial histories, extractive economies, and contested claims to land and life.</p>\n<p>Students will engage with Indigenous perspectives on water governance and resistance, focusing on how water is defended not only as a resource but as a relative, a right, and a site of cultural survival. Case studies such as the Dakota Access Pipeline protests and Māori struggles for water rights will ground our analysis in real-world movements that challenge dominant development paradigms.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 9: Water, Power, and Indigenous Resistance</strong>",
            "topic_description": "Week 9: Water, Power, and Indigenous Resistance This week explores water as a deeply political, cultural, and spiritual resource, central to both development struggles and Indigenous sovereignty. We examine how access to and governance of water is shaped by colonial histories, extractive economies, and contested claims to land and life. Students will engage with Indigenous perspectives on water governance and resistance, focusing on how water is defended not only as a resource but as a relative, a right, and a site of cultural survival. Case studies such as the Dakota Access Pipeline protests and Māori struggles for water rights will ground our analysis in real-world movements that challenge dominant development paradigms.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 7</strong><br/><p><strong>Mapping Water Conflicts and Quiz 2</strong></p>\n<p>This tutorial focuses on the politics of water through a conflict mapping exercise, where students will analyse disputes over water access, governance, and extraction. Using real-world examples, the activity deepens understanding of water sovereignty, Indigenous resistance, and the contested nature of environmental resources in development contexts. </p>\n<p>The session also includes Quiz 2, an in-class assessment designed to evaluate your grasp of key concepts from recent modules, including environmental justice, extractivism, and Indigenous governance.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Tutorial 7</strong>",
            "topic_description": "Tutorial 7 Mapping Water Conflicts and Quiz 2 This tutorial focuses on the politics of water through a conflict mapping exercise, where students will analyse disputes over water access, governance, and extraction. Using real-world examples, the activity deepens understanding of water sovereignty, Indigenous resistance, and the contested nature of environmental resources in development contexts. The session also includes Quiz 2, an in-class assessment designed to evaluate your grasp of key concepts from recent modules, including environmental justice, extractivism, and Indigenous governance.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Mid Sem break(29 Sep - 05 Oct)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MID-SEMESTER BREAK</strong><br/><p>(Mid-Semester Break)</p></p></div></td>",
            "topic_title": "<strong>MID-SEMESTER BREAK</strong>",
            "topic_description": "MID-SEMESTER BREAK (Mid-Semester Break)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(06 Oct - 12 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10: Food Sovereignty and Agrarian Resistance</strong><br/><p>This week focuses on food justice and the global struggle for food sovereignty as a powerful alternative to industrial agriculture and corporate-controlled food systems. We examine the Food Sovereignty Movement (FSM) as a transnational network advancing ecologically sustainable, socially just, and culturally grounded approaches to food production, distribution, and consumption.</p>\n<p>Students will critically compare industrial agribusiness models with agroecological alternatives, exploring how peasant movements—such as <em>La Vía Campesina</em>—mobilize against land dispossession, environmental degradation, and the commodification of food. We will analyse the political and economic forces shaping global food systems and the grassroots strategies used to reclaim autonomy over land, seeds, and livelihoods.</p>\n<p>This module contributes to the course’s broader aim of rethinking development by highlighting how food sovereignty movements challenge dominant paradigms and offer transformative visions rooted in solidarity, sustainability, and resistance.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 10: Food Sovereignty and Agrarian Resistance</strong>",
            "topic_description": "Week 10: Food Sovereignty and Agrarian Resistance This week focuses on food justice and the global struggle for food sovereignty as a powerful alternative to industrial agriculture and corporate-controlled food systems. We examine the Food Sovereignty Movement (FSM) as a transnational network advancing ecologically sustainable, socially just, and culturally grounded approaches to food production, distribution, and consumption. Students will critically compare industrial agribusiness models with agroecological alternatives, exploring how peasant movements—such as La Vía Campesina —mobilize against land dispossession, environmental degradation, and the commodification of food. We will analyse the political and economic forces shaping global food systems and the grassroots strategies used to reclaim autonomy over land, seeds, and livelihoods. This module contributes to the course’s broader aim of rethinking development by highlighting how food sovereignty movements challenge dominant paradigms and offer transformative visions rooted in solidarity, sustainability, and resistance.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10(06 Oct - 12 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 8</strong><br/><p><strong>Advocacy Writing and Final Assessment Prep</strong></p>\n<p>In our final tutorial, we focus on advocacy writing by drafting a concise and persuasive policy brief on food sovereignty. This exercise draws on course themes of resistance, justice, and alternative development models, helping students translate critical analysis into actionable policy language. </p>\n<p>We will also conduct a final <strong>check-in on the video assessment</strong>, with particular attention to preparing for the live Q&amp;A component. Students will have the opportunity to share progress, clarify expectations, and receive peer feedback to strengthen their final presentations.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Tutorial 8</strong>",
            "topic_description": "Tutorial 8 Advocacy Writing and Final Assessment Prep In our final tutorial, we focus on advocacy writing by drafting a concise and persuasive policy brief on food sovereignty. This exercise draws on course themes of resistance, justice, and alternative development models, helping students translate critical analysis into actionable policy language. We will also conduct a final check-in on the video assessment , with particular attention to preparing for the live Q&A component. Students will have the opportunity to share progress, clarify expectations, and receive peer feedback to strengthen their final presentations.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(13 Oct - 19 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11: Digital Resistance and the Politics of Technology</strong><br/><p>This week explores the dual role of digital technologies as tools of both resistance and control within contested development landscapes. We critically examine how digital platforms shape political participation, surveillance, and social movements, drawing on theories of networked protest, digital rights, and platform capitalism.</p>\n<p>We investigate how digital activism emerges in response to authoritarianism, inequality, and dispossession, while also considering how technologies can reinforce existing power structures. Case studies such as the Arab Spring and Indigenous digital sovereignty movements will ground our analysis in real-world struggles over visibility, voice, and autonomy in the digital sphere.</p>\n<p>This approach helps us rethink development by interrogating how digital technologies mediate power, resistance, and justice in contemporary global contexts.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 11: Digital Resistance and the Politics of Technology</strong>",
            "topic_description": "Week 11: Digital Resistance and the Politics of Technology This week explores the dual role of digital technologies as tools of both resistance and control within contested development landscapes. We critically examine how digital platforms shape political participation, surveillance, and social movements, drawing on theories of networked protest, digital rights, and platform capitalism. We investigate how digital activism emerges in response to authoritarianism, inequality, and dispossession, while also considering how technologies can reinforce existing power structures. Case studies such as the Arab Spring and Indigenous digital sovereignty movements will ground our analysis in real-world struggles over visibility, voice, and autonomy in the digital sphere. This approach helps us rethink development by interrogating how digital technologies mediate power, resistance, and justice in contemporary global contexts.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12(20 Oct - 26 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12: Transnational Resistance and Solidarity Economies</strong><br/><p>This week explores how transnational movements and solidarity economies challenge neoliberal development models and cultivate alternative political imaginaries. We examine how global networks of resistance—rooted in diverse local struggles—forge connections across borders to contest inequality, corporate power, and extractive governance.</p>\n<p>We engage with the political practices and visions of movements such as the World Social Forum and Zapatista internationalism, analysing how they construct spaces of autonomy, mutual aid, and collective action. Emphasis is placed on how these movements reimagine development through principles of solidarity, self-determination, and grassroots democracy.</p>\n<p>This module contributes to the course’s broader aim of rethinking development by highlighting the power of transnational resistance to inspire transformative alternatives grounded in justice, care, and cooperation.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Week 12: Transnational Resistance and Solidarity Economies</strong>",
            "topic_description": "Week 12: Transnational Resistance and Solidarity Economies This week explores how transnational movements and solidarity economies challenge neoliberal development models and cultivate alternative political imaginaries. We examine how global networks of resistance—rooted in diverse local struggles—forge connections across borders to contest inequality, corporate power, and extractive governance. We engage with the political practices and visions of movements such as the World Social Forum and Zapatista internationalism, analysing how they construct spaces of autonomy, mutual aid, and collective action. Emphasis is placed on how these movements reimagine development through principles of solidarity, self-determination, and grassroots democracy. This module contributes to the course’s broader aim of rethinking development by highlighting the power of transnational resistance to inspire transformative alternatives grounded in justice, care, and cooperation.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13(27 Oct - 02 Nov)",
            "activity_type": "Applied Class",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13: Video Presentation</strong><br/><p><strong>Final Presentations – Development Challenges and Resistance</strong></p>\n<p>In this final online lecture, students will present their individual video assessments in a collaborative and supportive setting. Using Microsoft Teams, students will be randomly assigned to breakout rooms of 4–5 peers, where each person will share their 5-minute pre-recorded video, followed by a 5-minute live Q&amp;A led by their peers.</p>\n<p>This session is designed to showcase your research on development challenges and resistance movements, while also practicing critical communication and engagement skills. The Q&amp;A component encourages thoughtful dialogue and reflection, reinforcing the course’s emphasis on relational learning, applied analysis, and diverse perspectives on development.</p>\n<p>The Q&amp;A session will be recorded to assist in marking each student's engagement in their content area discussion.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 13: Video Presentation</strong>",
            "topic_description": "Week 13: Video Presentation Final Presentations – Development Challenges and Resistance In this final online lecture, students will present their individual video assessments in a collaborative and supportive setting. Using Microsoft Teams, students will be randomly assigned to breakout rooms of 4–5 peers, where each person will share their 5-minute pre-recorded video, followed by a 5-minute live Q&A led by their peers. This session is designed to showcase your research on development challenges and resistance movements, while also practicing critical communication and engagement skills. The Q&A component encourages thoughtful dialogue and reflection, reinforcing the course’s emphasis on relational learning, applied analysis, and diverse perspectives on development. The Q&A session will be recorded to assist in marking each student's engagement in their content area discussion.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}