{
    "course_title": "Second Language Writing: Teaching and Researching",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SLAT7827-61192-7560",
    "full_course_code": "SLAT7827-61192-7560",
    "course_code": "SLAT7827",
    "class_code": "61192",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "demonstrate and apply knowledge of the key issues in L2 writing teaching and research for problem-solving L2 writing issues across diverse world contexts"
        },
        {
            "number": "LO2.",
            "description": "evaluate theories, materials and methodologies used in teaching L2 writing around the world."
        },
        {
            "number": "LO3.",
            "description": "reflect on key pedagogical practices and issues related to L2 writing arising from work integrated learning activities"
        },
        {
            "number": "LO4.",
            "description": "collaborate on innovative solutions to teaching and researching L2 writing via digital resources"
        },
        {
            "number": "LO5.",
            "description": "develop teaching materials for L2 writing that are grounded in established state-of-the-art theoretical and pedagogical practice"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Written Corrective Feedback on L2 writing - Practical",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>35%</dd>",
            "due_date": "<dd><p> 12/09/2025 4:00 pm</p>\n<p>\n</p><p>Friday, WEEK 7</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Practical/ Demonstration, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This task asks students to provide written corrective feedback (WCF) on real L2 writers' written production, so as to enable these writers to improve the text at both local and global levels during subsequent revision, <em>and </em>acquire the relevant language too.</p>\n<ul>\n<li>TWO L2 written texts are provided. You will provide WCF on BOTH of these.</li>\n<li>The WCF should be HAND WRITTEN (so as to include different direct/indirect WCF forms, e.g. strikethrough, underline, circle, error codes, etc.).</li>\n<li>You will need to print out the texts, provide WCF on them, and either scan/take photos of your WCF, and add these images to the top of your assessment document (under your name/student ID).</li>\n<li>This means the images must be clear enough for the marker to see what you have done (images that are too small/blurry will not be accepted).</li>\n<li>There are NO \"RIGHT\" answers for this task. You must use your knowledge of English (to resolve the errors), and knowledge of WCF (to appropriately treat the errors for revision).</li>\n<li>This part of the task is NOT graded - e.g., you do not receive extra marks for providing WCF on ALL errors. You simply have to provide the WCF you feel is appropriate.</li>\n</ul>\n<p>--------------------------------------------------------------------------------------------------</p>\n<p>Following this task, you are asked to do the following (in the same document):</p>\n<p>a) <strong>Describe</strong> the WCF you have provided on the student's texts in terms of the relative provision of direct, indirect, local, global, focused or unfocused WCF (about 500 words).</p>\n<p><strong>What </strong>WCF did you provide? Did you use only one type, or a combination? What subtypes were used, if any?</p>\n<p>b) <strong>Justify</strong> your decision to a) above - explain <strong>why </strong>you chose the WCF you did, and <strong>how </strong>this is supposed to help the writer improve their texts <strong>and </strong>learn the language too, based on the relevant literature on WCF covered in the course (about 1000 words).</p>\n<p>This part of the task is graded.</p>\n<p>--------------------------------------------------------------------------------------------------</p>\n<p>(Word counts above are excluding references/appendices).</p>\n<p>References should be provided in APA7th format at all times (e.g. for both in-text citation and end of text reference lists).</p>\n<p>Overuse of direct quotes will be penalised, as will excessive borrowing from the course textbook (no more than 1 citation from the course textbook is allowed)</p>\n<p><strong>STATEMENT ON AI &amp; MT</strong></p>\n<p><strong>This task has been designed to be challenging, authentic and complex. Whilst students may use Al technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference Al use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of Al tools.</strong></p>\n<p><strong>Note: Using generative AI to do the WCF is not advised because generative AI will give you DIFFERENT ANSWERS each time you ask it. We know this, because we have researched it. Use your knowledge of English and your knowledge of WCF/Second language acquisition instead.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submissions to be made through Turnitin only - no hardcopy submissions will be accepted.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "RIPPLE material creation, evaluation + video reflection",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 31/10/2025 4:00 pm</p>\n<p>\n</p><p>Friday, WEEK 13</p>\n<p>RIPPLE learning materials are due weekly, with a 2 week window in which to submit (so the RIPPLE task for Week 1 must be submitted by Week 3, Week 2 in Week 4, etc.)</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Oral, Product/ Artefact/ Multimedia, Written",
            "category": "Participation/ Student contribution, Presentation, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>RIPPLE is a technology developed through UQ that allows students to create learning materials, and have other students rate these materials for their effectiveness.</p>\n<p>SLAT7827 will use of RIPPLE as a weekly ongoing assessment. This will work as an 'enhanced' version of a learning journal / weekly reflection of the type usually offered through Blackboard in other courses (e.g., SLAT7806).</p>\n<p>This assessment is in TWO PARTS.</p>\n<p><strong>PART 1</strong></p>\n<p>Each week, students must create a set of learning materials based on a question posed by the course coordinator. These will be in the form of an \"AI prompt reflection\", where you will use your preferred generative AI application to engage with the weekly question, noting the prompts used, the generative AI output, and your evaluation of the output in terms of its accuracy and impact on your own beliefs. Alternatively, you may use the 'notes' function to answer the weekly question, supplementing your answer with links to useful videos, journal articles, or other online resources. There is no minimum or maximum word limit on these submissions. Students will receive guidance, examples and training in the Week 1 tutorial about how to create these materials and upload them to the RIPPLE platform. <em>The learning materials should be designed so as to be useful for MA-level students in understanding SLAT7805 course content</em>. </p>\n<p>There are 12 weeks of content in SLAT7827, and students must complete <strong>at least 10 sets of learning materials</strong> to pass SLAT7827. RIPPLE tracks the number of materials students create. You have two weeks to complete each weeks' content from the Monday that week begins.</p>\n<p>In addition, there is a short evaluation component for other students' learning materials. All SLAT7827 students should evaluate at least <strong>three</strong> other students' learning materials per week, for<strong> a minimum of 30 evaluations</strong> required to pass SLAT7827. Again, training on how to evaluate other's materials will be provided in the Week 1 tutorial. RIPPLE tracks the number of evaluations students complete. </p>\n<p>Students' evaluations will leave a 'ranking' for the created learning materials, and students can use these materials to help them better understand weekly content.</p>\n<p>This part of the assessment is PASS/FAIL - you MUST complete the 10 learning materials / 30 moderations or you cannot pass this course.</p>\n<p>---------------------------------------</p>\n<p><strong>PART 2</strong></p>\n<p>For the REFLECTION part of the assessment, students need to produce a VIDEO REFLECTION on the process and outcomes of creating their learning materials and evaluating the materials of others. Students should:</p>\n<p>A) Comment specifically<em> </em>on ONE of their highest-ranked sets of learning materials and explain why/how these materials were chosen and how they might improve others' knowledge of SLAT7827 course content</p>\n<p>B) Comment on TWO specific sets of learning materials supplied by others that the student ranked highly or found particularly useful, and how these improved the student's knowledge of SLAT7827 course content.</p>\n<p>This video reflection should be approximately 5 minutes long. A link to upload the video will be given in the relevant 'assessment' folder in the course Blackboard site, with instructions also provided by your tutor prior to upload. A PPT is NOT permitted - you must simply talk to the camera showing your face in full screen mode.</p>\n<p><strong>STATEMENT ON AI &amp; MT</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission of the learning materials are done through the RIPPLE platform</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "L2 textbook unit",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 19/11/2025 4:00 pm</p>\n<p>\n</p><p>Wednesday, EXAM WEEK 2</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Product/ Design, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Final assessment</strong></p>\n<p>In the final project you will develop a set of instructional materials/teaching resources suitable for publication in a textbook series by a major publisher, with an accompanying reflective essay on how the materials were designed and the L2 writing theory/theories underpinning this design.</p>\n<p><strong>Task Description</strong></p>\n<p>The focus of this assessment is on the development of a set of classroom materials for a <strong>SINGLE</strong> unit on teaching writing skills in a second or foreign language setting, following one of a number of sample writing briefs provided by the 'publisher'.</p>\n<p>The materials should cover approximately 2 hours of classroom instruction time, and include<strong> both solo and group writing tasks as well as some opportunity for written (corrective) feedback (either from peers or the teacher)</strong>.</p>\n<p>The materials will be pitched at the L2 level/learning context/topic specified in the sample briefs.</p>\n<p>You are strongly encouraged to develop materials that you can use in your own teaching now or in the future.</p>\n<p><strong>The materials you will develop should follow the provisions in the sample brief you select for this assessment, </strong>and so a full description of these cannot be provided in the ECP.  </p>\n<p>As part of the assessment you will <strong>also be required to provide a reflective essay</strong> explaining the particular materials used.</p>\n<p>This will include a statement of <em>why</em> you have developed these particular materials (based on course content/relevant theories/research) and <em>what</em> the expected learning outcomes are.</p>\n<p>This essay will be based in part on the literature we have encountered over the course of the semester but you are encouraged to go beyond that as required.</p>\n<p>The reflective essay is not a research paper/traditional essay, but academic references are still needed and should go beyond the weekly readings from the course handbook.</p>\n<p><strong>The reflective essay accompanying the materials should be presented in the following format (note the suggested word counts for each section are a GUIDE, not the RULE):</strong></p>\n<p><em>Overview</em>. A short section providing the background and rationale for the teaching and learning objectives of the proposed materials as a whole, based on your interpretation of the guidelines from the publishing brief as well as your knowledge and experience. You should cite references where appropriate. You are not limited to the reading list for material. Why did you choose this brief, and what will you/teachers/the students gain from making/teaching/completing these materials? (150 words)</p>\n<p><em>Materials and procedure</em>. A longer description of the proposed learning materials, including instructions, describing your rationale for the individual activities you chose. The teaching materials (what the student sees) can be in self-access format or designed for a teacher-fronted class (according to the brief you select). Where, how, and by whom the materials will be used? The procedure should be described in such a manner that the materials can be used by anyone. (800 words)</p>\n<p><em>Reflection</em>. A final statement describing what you learned as a result of developing the materials. How has developing these materials helped you understand the theories and issues in L2 writing research? What has developing these materials changed for you as a teacher/researcher? Are there any implications and limitations of your materials for real-world use? (250 words)</p>\n<p>Format: A word-processed set of materials can be used, but you are also welcome to develop and present the materials in an alternative digital media. This could be online or in PowerPoint format. </p>\n<p>Length: 1200 words of text. <strong>Words used in the actual materials or in reference list do not count toward the word limit, nor do appendices</strong>. Submit through Turnitin ONLY - no hard copies will be accepted for this course.  </p>\n<p><strong>STATEMENT ON AI &amp; MT</strong></p>\n<p><strong>This task has been designed to be challenging, authentic and complex. Whilst students may use Al technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference Al use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of Al tools.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission by Turnitin only - no hardcopies will be accepted.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(28 Jul - 03 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1</strong><br><p>Dimensions in L2 writing theory and research: Learning to write and writing to learn</p></br></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Week 1</strong>",
            "topic_description": "Week 1 Dimensions in L2 writing theory and research: Learning to write and writing to learn",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 2(04 Aug - 10 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2</strong><br/><p>Theoretical orientations to L2 writing</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Week 2</strong>",
            "topic_description": "Week 2 Theoretical orientations to L2 writing",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 3(11 Aug - 17 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3</strong><br/><p>Writing in EFL and ESL schools</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Week 3</strong>",
            "topic_description": "Week 3 Writing in EFL and ESL schools",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4(18 Aug - 24 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4</strong><br/><p>L2 writers in higher education; Writing for Academic and Specific Purposes</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 4</strong>",
            "topic_description": "Week 4 L2 writers in higher education; Writing for Academic and Specific Purposes",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5(25 Aug - 31 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5</strong><br/><p>Key issues of debate about feedback on writing</p></p><p><strong>Learning outcomes:</strong> L04</p></div></td>",
            "topic_title": "<strong>Week 5</strong>",
            "topic_description": "Week 5 Key issues of debate about feedback on writing",
            "learning_outcomes": [
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(01 Sep - 07 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6</strong><br/><p>Focus on texts and readers: Linguistic and rhetorical features</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 6</strong>",
            "topic_description": "Week 6 Focus on texts and readers: Linguistic and rhetorical features",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7(08 Sep - 14 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7</strong><br/><p>Focus on writers: Processes and strategies</p></p><p><strong>Learning outcomes:</strong> L03, L04</p></div></td>",
            "topic_title": "<strong>Week 7</strong>",
            "topic_description": "Week 7 Focus on writers: Processes and strategies",
            "learning_outcomes": [
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8</strong><br/><p>The development of digital literacies</p></p><p><strong>Learning outcomes:</strong> L01, L05</p></div></td>",
            "topic_title": "<strong>Week 8</strong>",
            "topic_description": "Week 8 The development of digital literacies",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9</strong><br/><p>Collaborative writing</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Week 9</strong>",
            "topic_description": "Week 9 Collaborative writing",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10(06 Oct - 12 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10</strong><br/><p>Language development in second language writing</p></p><p><strong>Learning outcomes:</strong> L02, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 10</strong>",
            "topic_description": "Week 10 Language development in second language writing",
            "learning_outcomes": [
                "L02",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 11(13 Oct - 19 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11</strong><br/><p>Second language writing assessment</p></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Week 11</strong>",
            "topic_description": "Week 11 Second language writing assessment",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 12(20 Oct - 26 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12</strong><br/><p>Quantitative and qualitative inquiry in L2 writing</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 12</strong>",
            "topic_description": "Week 12 Quantitative and qualitative inquiry in L2 writing",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 13(27 Oct - 02 Nov)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13 - Wrap up, final assessment check</strong><br/></p><p><strong>Learning outcomes:</strong> L02, L05</p></div></td>",
            "topic_title": "<strong>Week 13 - Wrap up, final assessment check</strong>",
            "topic_description": "Week 13 - Wrap up, final assessment check",
            "learning_outcomes": [
                "L02",
                "L05"
            ]
        }
    ]
}