{
    "course_title": "An Urban World",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SOCY2340-61592-7560",
    "full_course_code": "SOCY2340-61592-7560",
    "course_code": "SOCY2340",
    "class_code": "61592",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate a familiarity with the key theories and debates that have emerged within the fields of urban sociology;"
        },
        {
            "number": "LO2.",
            "description": "Identify the connections between local (urban) and global processes. This includes understanding the dimensions of lived space and the impacts that processes such as industrialisation, globalisation and postmodernity have had on them;"
        },
        {
            "number": "LO3.",
            "description": "Demonstrate knowledge of the historical development of Australian cities, suburbs and identify how the Australian experience of urban life differs from and resembles other countries;"
        },
        {
            "number": "LO4.",
            "description": "Demonstrate sound analytical skills, and a developed 'sociological imagination', by identifying how peoples experiences of urban life are both influenced by, and also affect, factors such as social class, race, age, gender and consumption;"
        },
        {
            "number": "LO5.",
            "description": "Communicate sociological understandings and analyses of the city to both professional/academic and lay audiences in a variety of media."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Reflections - 7 x Padlet Digital Reflections",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                }
            ],
            "weighting": "<dd>60%</dd>",
            "due_date": "<dd><p> 4/08/2025 - 20/10/2025</p>\n<p>Week 2 Reflection due 2pm, 11/08/2025</p>\n<p>Week 3 Reflection due 2pm, 18/08/2025</p>\n<p>Week 8 Reflection due 2pm, 22/09/2025</p>\n<p>\n</p><p>7 weekly reflections assessed for the 10 topics between weeks 2 and 12. Weeks 2, 3 and 8 are compulsory - you can then choose which four of the remaining seven topics to submit. Each Padlet reflection is due at 2pm one day before the following Seminar class.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Padlet Digital Reflections </strong></p>\n<p>This assessment is worth 60% of your semester marks</p>\n<p>Assessment: 7 weekly reflections for the 10 topics between weeks 2 and 12 </p>\n<p><strong>Weeks 2, 3 and 8</strong> <strong>are compulsory - you can then choose which four of the remaining seven topics to submit.</strong></p>\n<p><strong>Length of contribution</strong>: 300-500 words each week, as well as other media.</p>\n<p>Marks:  </p>\n<p>Possible marks = 60 (8.6 x 7 reflections).   </p>\n<p>If you fail to complete a compulsory reflection, that reflection will be included as one of your total reflections with zero marks.</p>\n<p><strong>What’s a Padlet digital story?</strong></p>\n<p>Padlet is a UQ online application featuring a virtual wall that allows you to post contributions each week to the same Padlet page.</p>\n<p>Each week you will add a Padlet reflection of 300 – 500 words in length</p>\n<p>For more information on Padlet and how to install it and use it, see <a href=\"https://web.library.uq.edu.au/library-services/it/learnuq-blackboard-help/collaborative-tools/padlet\">https://web.library.uq.edu.au/library-services/it/learnuq-blackboard-help/collaborative-tools/padlet</a>. You will be introduced to Padlet in Week 1.</p>\n<p><strong>How do I do it?</strong></p>\n<p>Each reflection journal entry will be based on the topic for that week of the course. It will be up to you what particular ideas, issues, theories and real world examples you write about. Instructions:</p>\n<ul>\n<li>Write in the first person (me, I)</li>\n<li><strong>For academic references, use only the Blackboard resources provided for each topic (readings, videos, lecture notes, additional resources)</strong></li>\n<li>Demonstrate that you understand a particular aspect of the week’s topic by describing and reflecting on it. You don't need to cover the entire week's content. You should choose a particular aspect of the week's material and deal with it more comprehensively (i.e. go for depth rather than breadth)</li>\n<li>Apply what you have learnt to a ‘real world’ example. This can be something you have experienced yourself, something you have read about or seen in the news – anything that has happened or exists in the world around you.</li>\n<li>Use the features of the padlet to introduce any visual representations – photos, short videos, diagrams, artwork - be creative!</li>\n</ul>\n<p><strong>How is it assessed? </strong></p>\n<p>How will I be marked?</p>\n<p>Your marker will award marks for the following: </p>\n<ol>\n<li>demonstrated understanding of the topic and reading beyond the lecture notes</li>\n<li>creativity in applying your sociological imagination to everyday examples </li>\n<li>written expression and imaginative use of media</li>\n</ol>\n<p>Your individual contribution will be marked on the quality of the research that went into it (i.e. engagement with, and understanding of, readings, lecture materials, and other sources), your presentation of materials and, importantly, your willingness to reflect on the material rather than just summarise it.  </p>\n<p>There will be an opportunity to ask questions/clarify during our first class and I will post an example Padlet contribution on Blackboard. I will also post examples of high scoring contributions (with students' permission) during the early weeks of the semester to allow you to learn from others' work. </p>\n<p><strong>Marking criteria</strong> and/or marking rubrics for this course are available in the ‘Assessment’ folder in Blackboard.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Each Padlet reflection is due one day before the following workshop at 2pm. (e.g. the first Padlet story, based on Week 2 material, is due by the day before our Week 3 seminar). Create and submit your Padlet story through the Padlet UQ website: <a href=\"https://padletuq.padlet.org/auth/login\">padletuq.padlet.org</a> . Further instructions will be provided on Blackboard and in week 1 of class.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Critical mini-documentary",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 30/10/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L04, L05",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Creative Production/ Exhibition",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>AI Use: This assessment task evaluates students' abilities, skills, and knowledge without the aid of Artificial Intelligence (AI). Students are advised that using AI technologies to develop this assessment is strictly prohibited and may constitute student misconduct under the Student Code, which includes AI- Conduct. This includes the use of AI-generated VoiceOver.</strong></p>\n<p>This assessment is worth 40 percent of your total semester marks.</p>\n<p>Because this course is about space and place and how social relations are made possible in space and place, this assessment lets you use both video and commentary to create a <strong>7-10 minute critical mini-documentary</strong> about an urban place of your choosing. </p>\n<p>The purpose of the assessment is for you to apply what you have learnt during the semester to a place in the city you chose (not a whole city), effectively telling a story about that place but using the sociological concepts we discussed during the semester. We will have plenty of time to think and discuss this assessment and choose your place during the semester, and more details will be available on Blackboard. You will receive training in how to script and storyboard your video, as well as how to shoot effective video with your smartphone and basic video editing using free software.</p>\n<p>- You can cooperate with other students, friends and family for production, props, interviewees etc, but the final product must be your work</p>\n<p><strong>Note</strong>: For identity verification purposes, you need to speak to the camera for at least 30 seconds in each: (1) during the introduction (2) in location at your selected place and (3) during the conclusion of your documentary.</p>\n<p>For this assessment, you need only a smartphone to record video and audio. Place selection, creativity, and conceptual content will be assessed rather than technical video production proficiency. </p>\n<p>- Videos should be uploaded by the due date.. Instructions on how to do this will be available on Blackboard.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assessment to be uploaded by the due date, a link will be provided on Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(28 Jul - 03 Aug)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong> Introduction: The city and us</strong><br/><p>The purpose of this first week is to provide students with an overview of the course content, assessment and objectives. An introduction to the major themes will be provided as well as a discussion outlining just what we understand a city to be.</p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong> Introduction: The city and us</strong>",
            "topic_description": "Introduction: The city and us The purpose of this first week is to provide students with an overview of the course content, assessment and objectives. An introduction to the major themes will be provided as well as a discussion outlining just what we understand a city to be.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(04 Aug - 10 Aug)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Space and place</strong><br/><p>We will explore some of the basic sociological concepts that inform urban sociology, that is, how a space can be made  social , how spaces become  places , and the importance of who or what creates those places.<br/>\nWe also explore the ways that humans live in homes and the importance attached to them; and finally the concept of  community , its myriad meanings and how and why it is invoked so often in contemporary Western society. These are all concepts that will be re-visited throughout the coming weeks and the purpose is to provide you with a good foundation for the remainder of your study this semester.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L05</p></div></td>",
            "topic_title": "<strong>Space and place</strong>",
            "topic_description": "Space and place We will explore some of the basic sociological concepts that inform urban sociology, that is, how a space can be made  social , how spaces become  places , and the importance of who or what creates those places. We also explore the ways that humans live in homes and the importance attached to them; and finally the concept of  community , its myriad meanings and how and why it is invoked so often in contemporary Western society. These are all concepts that will be re-visited throughout the coming weeks and the purpose is to provide you with a good foundation for the remainder of your study this semester.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 3(11 Aug - 17 Aug)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Home and community</strong><br><p>We will explore some of the basic sociological concepts that inform urban sociology, that is, how a space can be made social , how spaces become places , and the importance of who or what creates those places. We also explore the ways that humans live in homes and the importance attached to them; and finally the concept of community, its myriad meanings and how and why it is invoked so often in contemporary Western society. These are all concepts that will be re-visited throughout the coming weeks and the purpose is to provide you with a good foundation for the remainder of your study this semester.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Home and community</strong>",
            "topic_description": "Home and community We will explore some of the basic sociological concepts that inform urban sociology, that is, how a space can be made social , how spaces become places , and the importance of who or what creates those places. We also explore the ways that humans live in homes and the importance attached to them; and finally the concept of community, its myriad meanings and how and why it is invoked so often in contemporary Western society. These are all concepts that will be re-visited throughout the coming weeks and the purpose is to provide you with a good foundation for the remainder of your study this semester.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 4(18 Aug - 24 Aug)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Historical Roots and the 20th Century city</strong><br/><p>This week we look at the social history of the city. We will focus mainly on the city as we recognise it today, the form that emerged after the industrial revolution. In the twentieth century the great modernist project came of age. The city of the industrial revolution took on many of its current-day characteristics, and this is the century in which the Australian city as we recognise it emerged. The twentieth century also saw the maturation of urban sociology as a discipline and we will discuss some important theoretical concepts in 20th and 21st Century urban sociology.</p>\n<p>We will also have a presentation from Itali on scriptwriting and storyboarding this week.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Historical Roots and the 20th Century city</strong>",
            "topic_description": "Historical Roots and the 20th Century city This week we look at the social history of the city. We will focus mainly on the city as we recognise it today, the form that emerged after the industrial revolution. In the twentieth century the great modernist project came of age. The city of the industrial revolution took on many of its current-day characteristics, and this is the century in which the Australian city as we recognise it emerged. The twentieth century also saw the maturation of urban sociology as a discipline and we will discuss some important theoretical concepts in 20th and 21st Century urban sociology. We will also have a presentation from Itali on scriptwriting and storyboarding this week.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5(25 Aug - 31 Aug)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Gentrification &amp; change</strong><br/><p>Governments at every level has made a commitment to the compact city , where existing infrastructure and urban space is used to increase population density rather than adding to the existing urban sprawl. There are social consequences to this policy and this week we will use Peter Walters' research in West End to explore the nature of an inner city urban community, issues of lifestyle, gentrification and how, and why, residents resist and adapt to change.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Gentrification &amp; change</strong>",
            "topic_description": "Gentrification & change Governments at every level has made a commitment to the compact city , where existing infrastructure and urban space is used to increase population density rather than adding to the existing urban sprawl. There are social consequences to this policy and this week we will use Peter Walters' research in West End to explore the nature of an inner city urban community, issues of lifestyle, gentrification and how, and why, residents resist and adapt to change.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6(01 Sep - 07 Sep)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>A suburban world and The Australian Dream</strong><br/><p>What is suburb? Why are they important? This century, according to many commentators is the. Century of the suburb and suburban life is how most urban dwellers will experience the city in the 21st Century. This week we examine why this is important, then focus on the unique place that the suburb has in Australian life.</p>\n<p>We will also have a presentation from Itali on smartphone videography and editing this week.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>A suburban world and The Australian Dream</strong>",
            "topic_description": "A suburban world and The Australian Dream What is suburb? Why are they important? This century, according to many commentators is the. Century of the suburb and suburban life is how most urban dwellers will experience the city in the 21st Century. This week we examine why this is important, then focus on the unique place that the suburb has in Australian life. We will also have a presentation from Itali on smartphone videography and editing this week.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 7(08 Sep - 14 Sep)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Privatopias: The disappearing public realm</strong><br/><p>This week we take a closer look at the concept of the  public realm  and the tensions that arise between access for all to the space in a city and private property rights. We examine some recent and not so recent phenomena in urban development - the  gated community  and the  master planned estate , as well as the shopping mall; all created by capital for the more or less exclusive use of residents. We will use examples from both Australia and the US to show how these places appeal to the postmodern concept of the biographical construction of their target markets and discuss what sort of contribution is made to the  commons  by these places.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Privatopias: The disappearing public realm</strong>",
            "topic_description": "Privatopias: The disappearing public realm This week we take a closer look at the concept of the  public realm  and the tensions that arise between access for all to the space in a city and private property rights. We examine some recent and not so recent phenomena in urban development - the  gated community  and the  master planned estate , as well as the shopping mall; all created by capital for the more or less exclusive use of residents. We will use examples from both Australia and the US to show how these places appeal to the postmodern concept of the biographical construction of their target markets and discuss what sort of contribution is made to the  commons  by these places.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Documentary week</strong><br/><p>Now that you have completed your script ands storyboarding for you mini documentary, you can use this week to make a start on your site work and become familiar with the editing process.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L05</p></div></td>",
            "topic_title": "<strong>Documentary week</strong>",
            "topic_description": "Documentary week Now that you have completed your script ands storyboarding for you mini documentary, you can use this week to make a start on your site work and become familiar with the editing process.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L05"
            ]
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Marginalisation and the indigenous city</strong><br/><p>This week, we investigate the city with a focus on indigenous people, both in Australia and overseas, to try and understand more about how the original inhabitants see urban places shaped by others.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Marginalisation and the indigenous city</strong>",
            "topic_description": "Marginalisation and the indigenous city This week, we investigate the city with a focus on indigenous people, both in Australia and overseas, to try and understand more about how the original inhabitants see urban places shaped by others.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Mid Sem break(29 Sep - 05 Oct)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MID SEMESTER BREAK</strong><br/></p></div></td>",
            "topic_title": "<strong>MID SEMESTER BREAK</strong>",
            "topic_description": "MID SEMESTER BREAK",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(06 Oct - 12 Oct)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Informality and and the Southern City</strong><br/><p>This week we turn our attention to how the majority of the worlds urban population live - in the cities of the global south. We focus on the 'informal city', slums and slum life and the idea of the 'urban subaltern'.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Informality and and the Southern City</strong>",
            "topic_description": "Informality and and the Southern City This week we turn our attention to how the majority of the worlds urban population live - in the cities of the global south. We focus on the 'informal city', slums and slum life and the idea of the 'urban subaltern'.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 11(13 Oct - 19 Oct)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Migration and the City</strong><br/><p>This week, we will explore the impact of mass migrations on cities, communities, and the fate of migrants themselves.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Migration and the City</strong>",
            "topic_description": "Migration and the City This week, we will explore the impact of mass migrations on cities, communities, and the fate of migrants themselves.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 12(20 Oct - 26 Oct)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The City and the Environment</strong><br/><p>The city is seen as both the cause and possibly the saviour for current environmental challenges facing our planet. This week we look at the ways in which cities and various forms of living might contribute to environmental problems, the ways that planning and development might address these problems and the associated social conditions and consequences that we must consider. We will use examples from around the world and discuss their relevance to Australian urban conditions and practises.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>The City and the Environment</strong>",
            "topic_description": "The City and the Environment The city is seen as both the cause and possibly the saviour for current environmental challenges facing our planet. This week we look at the ways in which cities and various forms of living might contribute to environmental problems, the ways that planning and development might address these problems and the associated social conditions and consequences that we must consider. We will use examples from around the world and discuss their relevance to Australian urban conditions and practises.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13(27 Oct - 02 Nov)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Work on documentaries</strong><br/><p>This week is an opportunity to finalize the documentary before submission.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Work on documentaries</strong>",
            "topic_description": "Work on documentaries This week is an opportunity to finalize the documentary before submission.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        }
    ]
}