{
    "course_title": "Sociology of the Environment",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SOCY2020-61589-7560",
    "full_course_code": "SOCY2020-61589-7560",
    "course_code": "SOCY2020",
    "class_code": "61589",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Explain the social dimensions of a variety of national and international environmental problems"
        },
        {
            "number": "LO2.",
            "description": "Compare and contrast diverse theoretical and conceptual approaches, and apply these to understand - and design responses to - contemporary environmental problems"
        },
        {
            "number": "LO3.",
            "description": "Engage critically with contemporary public debates on a variety of environmental issues"
        },
        {
            "number": "LO4.",
            "description": "Critically appraise globally sourced academic literature - including global south and north, and Indigenous scholars - in the field of sociology of environment"
        },
        {
            "number": "LO5.",
            "description": "Apply diverse knowledges - including Indigenous and local ecological knowledges - to explain contemporary environment issues"
        },
        {
            "number": "LO6.",
            "description": "Explain how a healthy environment is directly connected to human rights, including Indigenous rights"
        },
        {
            "number": "LO7.",
            "description": "Design and evaluate diverse strategies for affecting positive social and environmental change"
        },
        {
            "number": "LO8.",
            "description": "Think independently, critically reflect and develop a reasoned argument, as well as listen deeply and work carefully with others"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "in-class Quizzes (3 x 15% each)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>45%</dd>",
            "due_date": "<dd><p> 5/08/2025 - 28/10/2025</p>\n<p>\n</p><p>in-class quiz</p></dd>",
            "learning_objectives": "L01, L02, L03, L06, L07",
            "mode": "Written",
            "category": "Examination, Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>There will be 3 seminar quizzes (each worth 15%) that will be held across 3 of the seminars. You will be made aware that there is a seminar quiz at the start of the chosen class (not before). You will be provided with 45 minutes at the end of the class to complete this quiz.</p>\n<p>You are required to be in attendance at the seminar to participate in the quiz. In the event that you are unable to attend the class when the quiz is allocated, please notify Kristen Lyons in advance, and an alternative time will be made for you to complete in her office.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>AI Use: </strong>This assessment task is to be completed in-person. The use of Artificial Intelligence (AI) tools will not be permitted. Any attempted use of AI may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>In-class quiz will be submitted to the lecturer before you leave the Seminar, in the selected 3 weeks.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Sociological analysis of an environmental film",
            "special_indicators": [],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 10/10/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment task requires you to apply your sociological imagination to critically examine the film ‘Ants and Grasshoppers’ (2021). The film will be played during the lecture in week 6 - and you must attend class to watch it. You will then be required to provide a sociological analysis of the issues and themes of the film. You should draw from specific content and themes in the film, as well as literature in this course, in answering the following questions as part of your film review:</p>\n<ol>\n<li>What are the various ways this film showcases climate justice, and importantly, climate injustice? How are discourses about climate (in)justice assembled, presented and contested?</li>\n<li>How does the film showcase the significance of gender equality in building a climate just future? </li>\n<li>How might Anita and Esther's experience have been similar and/or different had they travelled from Malawi to Australia, rather than the US? In other words, what are the similarities and differences between Australia and the US related to political and public responses to the climate crisis, as well as local movements driving climate justice? </li>\n</ol>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p>Use of AI:<strong> </strong>this task has been designed to be challenging, authentic, and complex. Successful completion of this assessment will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. To pass, students will be required to demonstrate detailed comprehension of their written submission independent of AI tools. AI may be used only for simple tasks including spell-checking, grammar-checking, and translation. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct. \tAdditional resources are available through\t<a href=\"https://web.library.uq.edu.au/study-and-learning-support/ai-student-hub\">UQ AI Student Hub</a>.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Reflective Journal",
            "special_indicators": [],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 28/10/2025 2:00 pm</p></dd>",
            "learning_objectives": "L01, L03, L08",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You are required to write a reflective journal of a maximum of 1800 words (9 x 200 words). This reflective journal should showcase your reflections - and learning through personal insights - across the semester. By reflections, I mean your thinking; the way you are making sense of and/or grappling with course content, as well as broader ideas that are coming up for you as you learn your way through the course. Each week (except the weeks we have in class quiz), you are required in ways that enable you to explore your ideas. You are encouraged to reflect on course content (including lecture material, in class discussion as well as set weekly readings). You might also like to reflect on case studies of environmental issues you are learning about, as well as broader politics and public debates that are playing out across the course of the semester. You should aim to take a diverse approach to this activity; that is, do not reflect on the same thing (e.g. one reading) each week. Rather, you will be rewarded for reflecting on different things (e.g. a reading, lecture content, workshop discussion, real life politics) in different weeks. You will also be rewarded not simply for describing the thing (the content etc) but rather, reflecting on it. By this, I mean thinking about it in creative and different ways. You might like to think through what thoughts and feelings come up for you in light of our weekly learnings.</p>\n<p>The final due date for the complete reflections journal is 28-Oct. This is to be submitted via Turnitin. You will have the opportunity to gain feedback throughout the semester, and there will be space in some seminars to write your reflective journals.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>AI Use: </strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(28 Jul - 03 Aug)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1 Introduction to Sociology of Environment: the why's and the what's</strong><br/><p>We start here in week 1 with an introduction to environmental sociology, including the why's and the what's! This week we dive into a couple of quick reads from Professor Stewart Lockie, Director of the Cairns Institute at James Cook University, and one of Australia's leading environmental sociologists. These readings will assist you to understand the why and what of environmental sociology - two important introductory pieces. Together, this is a good launch pad for your journey in Sociology of Environment. While you might be thinking, hang on, these readings are a decade old, they were part of the first edition of the Australian journal 'Environmental Sociology', that really set the scene for what was to come for the discipline. This is a good opportunity to connect with this journal too, I am sure you will find many other articles of relevance. </p>\n<p>We will start our weekly reflective practice today in class time together. </p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 1 Introduction to Sociology of Environment: the why's and the what's</strong>",
            "topic_description": "Week 1 Introduction to Sociology of Environment: the why's and the what's We start here in week 1 with an introduction to environmental sociology, including the why's and the what's! This week we dive into a couple of quick reads from Professor Stewart Lockie, Director of the Cairns Institute at James Cook University, and one of Australia's leading environmental sociologists. These readings will assist you to understand the why and what of environmental sociology - two important introductory pieces. Together, this is a good launch pad for your journey in Sociology of Environment. While you might be thinking, hang on, these readings are a decade old, they were part of the first edition of the Australian journal 'Environmental Sociology', that really set the scene for what was to come for the discipline. This is a good opportunity to connect with this journal too, I am sure you will find many other articles of relevance. We will start our weekly reflective practice today in class time together.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 2(04 Aug - 10 Aug)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2: Diverse conceptual approaches in environmental sociology </strong><br/><p>This week we start sinking our teeth into some key sociological theories that inform thinking in this field. The content from this week (and along with week 3) should, I hope, inform the rest of your semester in this course; you should feel free to dive back into this reading material, and go deeper into ideas introduced this week, in the weeks to come. The first reading this week is from Professor John Hannigan, who is a leading thinker in the field of environmental sociology. He will take you on a journey across political economy, risk, environmental modernisation and more, and in so doing, show you there are multiple ways in which we can come to think sociologically about the environment. You'll also engage with the thinking from Professor Donna Haraway, a world leading critical science and technology studies scholar who as changed the way many of us think about relations with the more than human world. In this piece from her, you will begin to grapple with themes associated with the anthropocene. Overall, this week, you will leave with a bag full of theories to make sense of environmental issues.</p>\n<p>Seminar activity: on-going reflective practice - some in class time to work on this assessment task.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Week 2: Diverse conceptual approaches in environmental sociology </strong>",
            "topic_description": "Week 2: Diverse conceptual approaches in environmental sociology This week we start sinking our teeth into some key sociological theories that inform thinking in this field. The content from this week (and along with week 3) should, I hope, inform the rest of your semester in this course; you should feel free to dive back into this reading material, and go deeper into ideas introduced this week, in the weeks to come. The first reading this week is from Professor John Hannigan, who is a leading thinker in the field of environmental sociology. He will take you on a journey across political economy, risk, environmental modernisation and more, and in so doing, show you there are multiple ways in which we can come to think sociologically about the environment. You'll also engage with the thinking from Professor Donna Haraway, a world leading critical science and technology studies scholar who as changed the way many of us think about relations with the more than human world. In this piece from her, you will begin to grapple with themes associated with the anthropocene. Overall, this week, you will leave with a bag full of theories to make sense of environmental issues. Seminar activity: on-going reflective practice - some in class time to work on this assessment task.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 3(11 Aug - 17 Aug)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3 : Critical Indigenous Studies and Climate Justice</strong><br/><p>This week we continue sinking our teeth into key sociological theories that inform thinking in this field. The content from this week should, I hope, and along with the week 2 lecture and readings, inform the rest of your semester in this course. You should feel free to dive back into this reading material, and go deeper into ideas introduced this week, in the weeks to come. The first reading this week is from Dr Kyle Whyte, Potawatomi Indigenous scholar, based at Michigan State University, where he heads up the Indigenous Climate Change and Climate Justice group. The second is from Dr Farhana Sultana, and internationally recognised interdisciplinary scholar focused on water rights and climate justice, amongst other topics. In the pieces you will read from this week, you will come to understand the ways in which colonisation, and for us in Australia, the settler colonial state, has profoundly shaped environmental impacts and issues. You'll also begin to see the intersections between environmental justice and Indigenous rights. We will also explore the connections between environmental problems, inequality and the environmental justice framework. Environmental justice has become a central defining framework for social movements. It has also become increasingly recognised as significant within environmental sociological theorising, particularly on the basis that it enables us to bring together the intersection of ways communities may grapple with environmental problems (including on the basis of Indigeneity, ethnicity, gender etc). You will leave this week knowing more about the ways in which a justice framework matters in terms of making sense of contemporary environmental problems, including the climate crisis, and its situatedness in histories of colonialism.</p>\n<p>We will also take some time in this seminar to discuss the requirements of the film review assessment task. This is the 'not to be missed' seminar for those wishing to shine in their assessment item for this course.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Week 3 : Critical Indigenous Studies and Climate Justice</strong>",
            "topic_description": "Week 3 : Critical Indigenous Studies and Climate Justice This week we continue sinking our teeth into key sociological theories that inform thinking in this field. The content from this week should, I hope, and along with the week 2 lecture and readings, inform the rest of your semester in this course. You should feel free to dive back into this reading material, and go deeper into ideas introduced this week, in the weeks to come. The first reading this week is from Dr Kyle Whyte, Potawatomi Indigenous scholar, based at Michigan State University, where he heads up the Indigenous Climate Change and Climate Justice group. The second is from Dr Farhana Sultana, and internationally recognised interdisciplinary scholar focused on water rights and climate justice, amongst other topics. In the pieces you will read from this week, you will come to understand the ways in which colonisation, and for us in Australia, the settler colonial state, has profoundly shaped environmental impacts and issues. You'll also begin to see the intersections between environmental justice and Indigenous rights. We will also explore the connections between environmental problems, inequality and the environmental justice framework. Environmental justice has become a central defining framework for social movements. It has also become increasingly recognised as significant within environmental sociological theorising, particularly on the basis that it enables us to bring together the intersection of ways communities may grapple with environmental problems (including on the basis of Indigeneity, ethnicity, gender etc). You will leave this week knowing more about the ways in which a justice framework matters in terms of making sense of contemporary environmental problems, including the climate crisis, and its situatedness in histories of colonialism. We will also take some time in this seminar to discuss the requirements of the film review assessment task. This is the 'not to be missed' seminar for those wishing to shine in their assessment item for this course.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 4(18 Aug - 24 Aug)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4: Campaigning to Save the Great Barrier Reef </strong><br/><p>We start this week with a further chapter from Professor John Hannigan. This will give you a solid grounding in the social constructivist approach, including the key conceptual tools available from this approach. You'll then dive into the Great Barrier Reef, starting with a collaborative writing project by Rohan Lloyd, Maxine Newlands and Theresa Petray, all academics based at James Cook University in Townsville. There is also a short piece published in the Conversation that reports on the latest science regarding reef health, and the way in which our Great Barrier Reef - and our failures to protect it - continues to demand international attention, and rightly so. (<a href=\"https://theconversation.com/unesco-expresses-utmost-concern-at-the-state-of-the-great-barrier-reef-257638\">https://theconversation.com/unesco-expresses-utmost-concern-at-the-state-of-the-great-barrier-reef-257638</a>)</p>\n<p>We will then watch the new feature length film \"Northern Waters\", which explores the aftermath of the successful 1960s \"Save the Reef Campaign\". For more details please visit <a href=\"https://art-museum.uq.edu.au/northern-waters\">https://art-museum.uq.edu.au/northern-waters</a> </p></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Week 4: Campaigning to Save the Great Barrier Reef </strong>",
            "topic_description": "Week 4: Campaigning to Save the Great Barrier Reef We start this week with a further chapter from Professor John Hannigan. This will give you a solid grounding in the social constructivist approach, including the key conceptual tools available from this approach. You'll then dive into the Great Barrier Reef, starting with a collaborative writing project by Rohan Lloyd, Maxine Newlands and Theresa Petray, all academics based at James Cook University in Townsville. There is also a short piece published in the Conversation that reports on the latest science regarding reef health, and the way in which our Great Barrier Reef - and our failures to protect it - continues to demand international attention, and rightly so. ( https://theconversation.com/unesco-expresses-utmost-concern-at-the-state-of-the-great-barrier-reef-257638 ) We will then watch the new feature length film \"Northern Waters\", which explores the aftermath of the successful 1960s \"Save the Reef Campaign\". For more details please visit https://art-museum.uq.edu.au/northern-waters",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5(25 Aug - 31 Aug)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5: Food Sovereignty, sustainability labour and the environment</strong><br/><p>This week we will explore the connections between global food systems and their environmental (and social, human/non-human animal rights) impacts. To do this, you'll be introduced to the concept of food sovereignty, as detailed by world leading thinker in the field, Dr Raj Patel (also the film maker from the film we watch in week 6). Raj will help you to understand the ways the right to food can be understood, and the intersections between achieving the right to food with gender based equality. Then, Jo Lindsay from Monash University, and along with her colleagues, will introduce explore the challenges of engaging in the work to reduce waste - including food waste, a significant global challenge. To do this, they introduce you to the concept of sustainability labour, and draw out the gendered dimensions of this work. </p></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 5: Food Sovereignty, sustainability labour and the environment</strong>",
            "topic_description": "Week 5: Food Sovereignty, sustainability labour and the environment This week we will explore the connections between global food systems and their environmental (and social, human/non-human animal rights) impacts. To do this, you'll be introduced to the concept of food sovereignty, as detailed by world leading thinker in the field, Dr Raj Patel (also the film maker from the film we watch in week 6). Raj will help you to understand the ways the right to food can be understood, and the intersections between achieving the right to food with gender based equality. Then, Jo Lindsay from Monash University, and along with her colleagues, will introduce explore the challenges of engaging in the work to reduce waste - including food waste, a significant global challenge. To do this, they introduce you to the concept of sustainability labour, and draw out the gendered dimensions of this work.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(01 Sep - 07 Sep)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6: film screening Ants and Grasshoppers</strong><br/><p>This week we will watch the film 'Ants and Grasshoppers', by Raj Patel. This film critically explores the disconnect between heavy emitting countries and those communities most vulnerable in the face of a rapidly changing climate. Raj takes you from Malawi to Washington D.C. and this film is told from the perspective of Anita, a Malawian farmer, climate campaigner and community organiser. This film will enable you to see climate denialism, climate justice, diverse forms of resistance in the face of the climate crisis, as well as the vital place of gender justice in addressing environmental challenges. We will watch the film together, and stop throughout to discuss and explore ideas. This week will set you up to effectively achieve the assessment item for this course - the film review.</p>\n<p>There are two readings to assist you in making sense of this film, and that you are encouraged to engage with in writing your film review. The first is a chapter from John Hannigan on environmental discourses. The second, led by Jennifer Rice from the University of Chicago, introducing the term climate apartheid to make sense of the lived experience of climate crisis, and dominant responses to it.</p>\n<p>This seminar will be vital for you in preparing your assessment for this course, the film review. In this seminar, we will start to reflect on the series of questions you are required to address as part of this assessment task.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L08</p></div></td>",
            "topic_title": "<strong>Week 6: film screening Ants and Grasshoppers</strong>",
            "topic_description": "Week 6: film screening Ants and Grasshoppers This week we will watch the film 'Ants and Grasshoppers', by Raj Patel. This film critically explores the disconnect between heavy emitting countries and those communities most vulnerable in the face of a rapidly changing climate. Raj takes you from Malawi to Washington D.C. and this film is told from the perspective of Anita, a Malawian farmer, climate campaigner and community organiser. This film will enable you to see climate denialism, climate justice, diverse forms of resistance in the face of the climate crisis, as well as the vital place of gender justice in addressing environmental challenges. We will watch the film together, and stop throughout to discuss and explore ideas. This week will set you up to effectively achieve the assessment item for this course - the film review. There are two readings to assist you in making sense of this film, and that you are encouraged to engage with in writing your film review. The first is a chapter from John Hannigan on environmental discourses. The second, led by Jennifer Rice from the University of Chicago, introducing the term climate apartheid to make sense of the lived experience of climate crisis, and dominant responses to it. This seminar will be vital for you in preparing your assessment for this course, the film review. In this seminar, we will start to reflect on the series of questions you are required to address as part of this assessment task.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L08"
            ]
        },
        {
            "learning_period": "Week 7(08 Sep - 14 Sep)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7: Loss and emotions and eco-anxiety</strong><br/><p>This week we explore the complex ways in which loss is understood - from the perspectives of those affected by environmental changes. We turn our attention to Australia's recent bushfire crisis to do this. Your readings include a piece by Bhiamie Williamson, Jessica Weir and Vanessa Cavanagh, who describe and analyse the ways destruction of Country from an Aboriginal perspective is tied to broader ongoing settler colonial destruction that bares down upon Aboriginal and Torres Strait Islander Australians. Associate Professor Rebecca Olson (who many of you may know, also a member of the School of Social Science at UQ) and colleagues will then assist us to explore eco-anxiety and other emotions tied to climate change. and its impacts</p>\n<p>We will also have a special guest lecture from Meg Sands, who is currently undertaking a Bachelor of Social Science honours project on media representations of eco-emotions. She will talk about her research, including her two well known Australian case studies of environmental activism, the Youth Climate Strike and Knitting Nannas.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Week 7: Loss and emotions and eco-anxiety</strong>",
            "topic_description": "Week 7: Loss and emotions and eco-anxiety This week we explore the complex ways in which loss is understood - from the perspectives of those affected by environmental changes. We turn our attention to Australia's recent bushfire crisis to do this. Your readings include a piece by Bhiamie Williamson, Jessica Weir and Vanessa Cavanagh, who describe and analyse the ways destruction of Country from an Aboriginal perspective is tied to broader ongoing settler colonial destruction that bares down upon Aboriginal and Torres Strait Islander Australians. Associate Professor Rebecca Olson (who many of you may know, also a member of the School of Social Science at UQ) and colleagues will then assist us to explore eco-anxiety and other emotions tied to climate change. and its impacts We will also have a special guest lecture from Meg Sands, who is currently undertaking a Bachelor of Social Science honours project on media representations of eco-emotions. She will talk about her research, including her two well known Australian case studies of environmental activism, the Youth Climate Strike and Knitting Nannas.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8: Indigenous People and Blue Carbon in Australia</strong><br/><p>This week we will have a guest lecture from Mr Brian Warner, Secretary of the Kabi Kabi Peoples Aboriginal Corporation, and leading advocate for Indigenous-led blue carbon projects in Australia. Mr Warner will provide an overview of some of the ways Aboriginal and Torres Strait Islander people in Australia are leading responses to the challenge of climate change, including through ecological restoration and blue carbon projects. He will explain blue carbon to you, as well as some of the challenges and opportunities for Indigenous peoples that blue carbon - and carbon offset more widely - generates. He will discuss issues related to cultural heritage and rights, upholding sea Country, as well as other themes and issues. </p>\n<p>You are set to read two pieces that it would be most excellent if you can read prior to this lecture; a report from the Indigenous Carbon Industry Foundation which provides an excellent introduction and overview to key issues in the emerging blue carbon industry, and a brilliant literature review from Jennifer Atchison and colleagues which paints a big picture of key social issues related to the sector. </p></p><p><strong>Learning outcomes:</strong> L02, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Week 8: Indigenous People and Blue Carbon in Australia</strong>",
            "topic_description": "Week 8: Indigenous People and Blue Carbon in Australia This week we will have a guest lecture from Mr Brian Warner, Secretary of the Kabi Kabi Peoples Aboriginal Corporation, and leading advocate for Indigenous-led blue carbon projects in Australia. Mr Warner will provide an overview of some of the ways Aboriginal and Torres Strait Islander people in Australia are leading responses to the challenge of climate change, including through ecological restoration and blue carbon projects. He will explain blue carbon to you, as well as some of the challenges and opportunities for Indigenous peoples that blue carbon - and carbon offset more widely - generates. He will discuss issues related to cultural heritage and rights, upholding sea Country, as well as other themes and issues. You are set to read two pieces that it would be most excellent if you can read prior to this lecture; a report from the Indigenous Carbon Industry Foundation which provides an excellent introduction and overview to key issues in the emerging blue carbon industry, and a brilliant literature review from Jennifer Atchison and colleagues which paints a big picture of key social issues related to the sector.",
            "learning_outcomes": [
                "L02",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9: Gender, the environment, and environmental movements</strong><br/><p>We continue the key theme around (in)equality and (in)justice, this time adding an explicitly gendered perspective to our approach. You will learn about ecofeminism(s), and consider the ways this approach might be brought to bare in approaches to managing environmental issues and problems, including how an ethic of care might be applied. You'll start this week with a reading from Val Plumwood, one of Australia's key environmental philosophers, including in the field of ecofeminism. Her chapter will help you understand the diverse ways in which ecofeminism can be framed and approached, and why it matters for 21st century environmental problem solving. You will also read a piece from Dr Robyn James and colleagues, which sets out the vital need for environmental movements to consider gender to ensure good conservation outcomes. </p>\n<p>We will allow time in class for reflective practice.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 9: Gender, the environment, and environmental movements</strong>",
            "topic_description": "Week 9: Gender, the environment, and environmental movements We continue the key theme around (in)equality and (in)justice, this time adding an explicitly gendered perspective to our approach. You will learn about ecofeminism(s), and consider the ways this approach might be brought to bare in approaches to managing environmental issues and problems, including how an ethic of care might be applied. You'll start this week with a reading from Val Plumwood, one of Australia's key environmental philosophers, including in the field of ecofeminism. Her chapter will help you understand the diverse ways in which ecofeminism can be framed and approached, and why it matters for 21st century environmental problem solving. You will also read a piece from Dr Robyn James and colleagues, which sets out the vital need for environmental movements to consider gender to ensure good conservation outcomes. We will allow time in class for reflective practice.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Mid Sem break(29 Sep - 05 Oct)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-Semester Break</strong><br/><p>No Seminar.</p></p></div></td>",
            "topic_title": "<strong>Mid-Semester Break</strong>",
            "topic_description": "Mid-Semester Break No Seminar.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(06 Oct - 12 Oct)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10: Post-Apocalyptic Environmentalism and the Dark Mountain Project</strong><br/><p>This week you will be introduced to ideas around post-apocalyptic environmentalism; including what it might mean to sit with the troubles we currently face, rather than responding to the urge we might feel to act quickly, and potentially without care or consideration. You will be introduced to the Dark Mountain project as a case study to explore what post apocalyptic politics might look  like in practice. Guiding our thinking this week will be a guest lecture from Dr Lena Taylor, who has recently graduated from her PhD on this exact topic - she is literally a world expert in the field. </p>\n<p>In terms of our readings, this week we will engage with Nigerian public intellectual Bayo Akomolafe - 'How to be available now: side notes from the para-pragmatic'. In this piece, Akomolafe invites us to stop rushing to respond to the crises we are facing, and instead, to consider the possibilities that might arise by leaving space to sit with, and where, we are at. We will also engage with the work of Professor Sharon Stein and colleagues from the Gesturing Towards Decolonial Futures Collective to think through how we might sit with these troubles as part of our university studies and life. </p></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 10: Post-Apocalyptic Environmentalism and the Dark Mountain Project</strong>",
            "topic_description": "Week 10: Post-Apocalyptic Environmentalism and the Dark Mountain Project This week you will be introduced to ideas around post-apocalyptic environmentalism; including what it might mean to sit with the troubles we currently face, rather than responding to the urge we might feel to act quickly, and potentially without care or consideration. You will be introduced to the Dark Mountain project as a case study to explore what post apocalyptic politics might look  like in practice. Guiding our thinking this week will be a guest lecture from Dr Lena Taylor, who has recently graduated from her PhD on this exact topic - she is literally a world expert in the field. In terms of our readings, this week we will engage with Nigerian public intellectual Bayo Akomolafe - 'How to be available now: side notes from the para-pragmatic'. In this piece, Akomolafe invites us to stop rushing to respond to the crises we are facing, and instead, to consider the possibilities that might arise by leaving space to sit with, and where, we are at. We will also engage with the work of Professor Sharon Stein and colleagues from the Gesturing Towards Decolonial Futures Collective to think through how we might sit with these troubles as part of our university studies and life.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(13 Oct - 19 Oct)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11: Rights, Regenerative Worldview and Nature</strong><br/><p>This week you will learn about of of the most dynamic areas of legal studies and practice - the rights of nature. </p>\n<p>We will have another special guest lecturer - Sara Mejia Munoz, a human rights lawyer with extensive experience working in Colombia, who is currently finalising her PhD in the School of Social Science at UQ on the topic of Indigenous rights and green extractivism in Colombia. </p>\n<p>You'll be guided by readings from a number of Australia's leading thinkers and advocates in this space. You will read a piece from Kankawa Nagara Knight, Anne Poelina and Sandra Wooltorton to think about a regenerative worldview that comes into view when we see the rights of - and responsibilities to - the rest of nature. You will also read a piece from Dr Michelle Maloney (who is also director of Australian Earth Laws Alliances) to explore what recognition of the rights of nature might mean for environmental decision making and environmental management. How might governance be done differently, in situations where rights were accorded to rivers, mountains and other natural places, regardless of the so called use value to humans?</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Week 11: Rights, Regenerative Worldview and Nature</strong>",
            "topic_description": "Week 11: Rights, Regenerative Worldview and Nature This week you will learn about of of the most dynamic areas of legal studies and practice - the rights of nature. We will have another special guest lecturer - Sara Mejia Munoz, a human rights lawyer with extensive experience working in Colombia, who is currently finalising her PhD in the School of Social Science at UQ on the topic of Indigenous rights and green extractivism in Colombia. You'll be guided by readings from a number of Australia's leading thinkers and advocates in this space. You will read a piece from Kankawa Nagara Knight, Anne Poelina and Sandra Wooltorton to think about a regenerative worldview that comes into view when we see the rights of - and responsibilities to - the rest of nature. You will also read a piece from Dr Michelle Maloney (who is also director of Australian Earth Laws Alliances) to explore what recognition of the rights of nature might mean for environmental decision making and environmental management. How might governance be done differently, in situations where rights were accorded to rivers, mountains and other natural places, regardless of the so called use value to humans?",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 12(20 Oct - 26 Oct)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12: Shh! ... Quiet Activism</strong><br/><p>In this seminar we will explore what is meant by quiet activism, and critically examine our thoughts and ideas about its role in affecting social change. We will explore themes around care, collectivities and creativity. We will at least start the conversation talking about food and the environment, but we will let our ideas about quiet activism take us to as yet unknown and undefined places. You will read a piece on veganism and small businesses in Sydney to explore quiet activism in practice, as well as a chapter from the book led by Professor Wendy Steele and colleagues.</p>\n<p>Bring your imaginations to this class, you will be very much shaping where this open discussion takes us.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 12: Shh! ... Quiet Activism</strong>",
            "topic_description": "Week 12: Shh! ... Quiet Activism In this seminar we will explore what is meant by quiet activism, and critically examine our thoughts and ideas about its role in affecting social change. We will explore themes around care, collectivities and creativity. We will at least start the conversation talking about food and the environment, but we will let our ideas about quiet activism take us to as yet unknown and undefined places. You will read a piece on veganism and small businesses in Sydney to explore quiet activism in practice, as well as a chapter from the book led by Professor Wendy Steele and colleagues. Bring your imaginations to this class, you will be very much shaping where this open discussion takes us.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 13(27 Oct - 02 Nov)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13: Getting some closure</strong><br/><p>In this final seminar for the semester we will weave some threads together, reflect on our learnings, our unlearnings, and where we might be going next. You are invited to read one final chapter from John Hannigan, the conclusion from his text book, Environmental Sociology.</p></p><p><strong>Learning outcomes:</strong> L03, L08</p></div></td>",
            "topic_title": "<strong>Week 13: Getting some closure</strong>",
            "topic_description": "Week 13: Getting some closure In this final seminar for the semester we will weave some threads together, reflect on our learnings, our unlearnings, and where we might be going next. You are invited to read one final chapter from John Hannigan, the conclusion from his text book, Environmental Sociology.",
            "learning_outcomes": [
                "L03",
                "L08"
            ]
        }
    ]
}