{
    "course_title": "Language & Literacy & the School Environment",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SPCH7123-60337-7560",
    "full_course_code": "SPCH7123-60337-7560",
    "course_code": "SPCH7123",
    "class_code": "60337",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Critically evaluate the speech pathologists’ role working in an educational context, demonstrating expert knowledge in the principles of multi-tiered systems of support, inclusive education and person- and family- centred care."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate mastery of the principles, purposes and methods of communication assessment for school-aged children."
        },
        {
            "number": "LO3.",
            "description": "Design and justify comprehensive assessment plans that reflect expert consideration of a school-age child’s educational, social, and cultural contexts."
        },
        {
            "number": "LO4.",
            "description": "Critically analyse and interpret assessment data to inform evidence-based management of communication difficulties in school-aged children."
        },
        {
            "number": "LO5.",
            "description": "Formulate advanced, curriculum-aligned intervention plans that maximise educational and social outcomes for school-aged children, grounded in evidence-based practices."
        },
        {
            "number": "LO6.",
            "description": "Communicate assessment findings and intervention recommendations clearly and effectively to families and interdisciplinary teams, demonstrating advanced skills in professional reporting and feedback delivery."
        },
        {
            "number": "LO7.",
            "description": "Apply expert knowledge of culturally responsive practice when working with culturally and linguistically diverse populations and Aboriginal and Torres Strait Islander peoples."
        },
        {
            "number": "LO8.",
            "description": "Demonstrate leadership, collaboration, and reflective practice when working with other speech pathologists and interprofessional teams, contributing expert knowledge and advocating for the communication needs of school-aged children."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Narrative Analysis and Teacher Report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 5/09/2025 1:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment task has two components. The first component is completed in pairs, and the second component must be completed individually. Both components are due at the same day/time.</p>\n<p>The aims of this assessment are to develop students' skills in (i) discourse analysis (in pairs), and (ii) writing a summary report of assessment results for a classroom teacher (individually). The two components to this assessment task are as follows:</p>\n<p>1. In pairs, students will analyse a narrative sample for microstructure (semantic content, syntactic structure and fluency), and macrostructure (story grammar and complexity). Parts of the analysis will be completed during class time under the direction of the tutor, with the expectation the remainder of the analysis will be completed by the students outside of class time. This component is completed in pairs.</p>\n<p>2. Students will independently write a summary report of the client's performance on the narrative task for the classroom teacher. This component is completed individually.</p>\n<p>Further information about this assessment item will be made available on the SPCH7123 Blackboard site.</p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students will submit this assignment via Turnitin on the SPCH7123 Blackboard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Case Based Assignment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 10/10/2025 1:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assignment is to be completed individually. Students will be provided with the results of a screening assessment and teacher observations. They will need to devise a comprehensive management plan that outlines the next steps for managing the case including assessment and classroom strategies and adjustments. Students will also be required to design a one-page handout for the child's teacher or parent. Students will be able to choose the target audience and focus of their handout based on the provided case information.</p>\n<p>The assignment details and task requirements will be made available on the SPCH7123 Blackboard site.</p>\n<p><br/></p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students will submit this assignment via Turnitin on the SPCH7123 Blackboard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "End of Semester Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40% Must Pass </dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>8/11/2025 - 22/11/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This exam will be delivered in Inspera Assessment and will be completed on your personal laptop on campus.</p>\n<p>The examination will be presented in a case-based and short-answer question format. This examination will require the integration of knowledge to respond to questions relating to a number of clinical cases. The exam will focus on online self-directed learning and tutorial content from Week 7 of semester onwards. Students will be required to revise information from the assessment content (Weeks 1-6) with a particular focus on differential diagnosis and interpretation of assessment data for management purposes. Further information, including details of the format of the exam will be provided on the SPCH7123 Blackboard site in the second half of semester.</p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Not scheduled",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Online self-directed learning modules</strong><br><p>Each week students will complete these interactive, self-paced modules which describe the key theoretical and practice aspects of assessment, analysis, differential diagnosis, and intervention for school-age children with communication difficulties. Students are required to complete this self-directed online learning prior to attendance and participation in the weekly tutorials.</p></br></p></div></td>",
            "topic_title": "<strong>Online self-directed learning modules</strong>",
            "topic_description": "Online self-directed learning modules Each week students will complete these interactive, self-paced modules which describe the key theoretical and practice aspects of assessment, analysis, differential diagnosis, and intervention for school-age children with communication difficulties. Students are required to complete this self-directed online learning prior to attendance and participation in the weekly tutorials.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(28 Jul - 02 Nov)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Weekly Tutorials</strong><br><p>These weekly tutorials will incorporate small group discussions to further explore assessment, analysis, differential diagnosis, and intervention practices when working with school-age children. Tutorials have been designed for experiential learning, therefore students are expected to attend and participate in all tutorials. It is essential that students prepare for weekly tutorials by completing the online self-directed learning modules and associated preparation activities and bringing this information to their tutorial ready to share. As students will be working in small groups, tutorials will not be recorded.</p></br></p></div></td>",
            "topic_title": "<strong>Weekly Tutorials</strong>",
            "topic_description": "Weekly Tutorials These weekly tutorials will incorporate small group discussions to further explore assessment, analysis, differential diagnosis, and intervention practices when working with school-age children. Tutorials have been designed for experiential learning, therefore students are expected to attend and participate in all tutorials. It is essential that students prepare for weekly tutorials by completing the online self-directed learning modules and associated preparation activities and bringing this information to their tutorial ready to share. As students will be working in small groups, tutorials will not be recorded.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 1(28 Jul - 03 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction to the school-aged child and environment </strong><br><p>This lecture will provide students with an understanding of important concepts and principles of working with school-aged populations. There will be a panel presentation from speech pathologists working in education and private practice to provide students with an overview of the speech pathologists role in education. The lecture will be delivered on campus. It is highly recommended that students attend, however, a lecture recording will be made available.</p></br></p></div></td>",
            "topic_title": "<strong>Introduction to the school-aged child and environment </strong>",
            "topic_description": "Introduction to the school-aged child and environment This lecture will provide students with an understanding of important concepts and principles of working with school-aged populations. There will be a panel presentation from speech pathologists working in education and private practice to provide students with an overview of the speech pathologists role in education. The lecture will be delivered on campus. It is highly recommended that students attend, however, a lecture recording will be made available.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Interprofessional Workshop</strong><br/><p>During Week 8, students will participate in an interprofessional workshop with Master's of Education students. Further information about the workshop will be provided during semester.</p></p></div></td>",
            "topic_title": "<strong>Interprofessional Workshop</strong>",
            "topic_description": "Interprofessional Workshop During Week 8, students will participate in an interprofessional workshop with Master's of Education students. Further information about the workshop will be provided during semester.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(27 Oct - 02 Nov)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Course Summary Lecture</strong><br/><p>The final lecture will provide a summary and revision of content covered throughout the course as well as preparation for the End of Semester Examination. The lecture will be delivered on campus. It is highly recommended that students attend, however, a lecture recording will be made available.</p></p></div></td>",
            "topic_title": "<strong>Course Summary Lecture</strong>",
            "topic_description": "Course Summary Lecture The final lecture will provide a summary and revision of content covered throughout the course as well as preparation for the End of Semester Examination. The lecture will be delivered on campus. It is highly recommended that students attend, however, a lecture recording will be made available.",
            "learning_outcomes": []
        }
    ]
}