{
    "course_title": "Family Therapy Traditions:  Basic Concepts and Skills",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SWSP7267-61329-7560",
    "full_course_code": "SWSP7267-61329-7560",
    "course_code": "SWSP7267",
    "class_code": "61329",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand the significance of the shift from seeing individuals to seeing families, and to articulate key concepts in understanding problems from a systemic and contextual framework."
        },
        {
            "number": "LO2.",
            "description": "Describe each of the main schools upon which family therapy is based in terms of theoretical concepts, interventions and key skills."
        },
        {
            "number": "LO3.",
            "description": "Apply the theoretical positions of various schools of family therapy to family problems and conceptualise cases in a manner consistent with the main schools."
        },
        {
            "number": "LO4.",
            "description": "Understand an integrative framework for understanding families and to guide family therapy practice."
        },
        {
            "number": "LO5.",
            "description": "Be aware of and sensitive to the ethical issues in family therapy, including the influence of the therapist's own experience of family on his or her practice."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Core Concepts of Family Therapy",
            "special_indicators": [],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 26/08/2025 1:00 pm</p></dd>",
            "learning_objectives": "L01, L02",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Family therapy represents \"a whole new way of conceptualising human problems, of understanding behaviour, the development of symptoms, and their resolution.\" (Sluzki, 1978, p366)</p>\n<p>Entering into the field of Family Therapy requires a significant shift in frameworks from the dominant concepts of individual psychotherapy to the more contextual concepts of systemic thinking. This change is significant enough to be seen as a shift in paradigm and worldview (Becvar &amp; Becvar, 2014).</p>\n<p>The purpose of the mini-essays is to assess the student's knowledge of the core concepts of family therapy and systems theory. Students are to select three (3) key concepts from the supplied list and write a brief explanation of the concept in their own words (<em>Marking Rubric 1</em>), as well as a brief example or application of the concept in relation to families or family therapy (<em>Marking Rubric 2</em>). Clear links to supporting literature should be provided through the first part of each essay (explanation of concept) but are not required in the second part (example/application). The mini-essays are not intended to be linked and each should stand on their own.</p>\n<p>Each essay is to be no more than 500 words each, for a total of 1500 words (+/- 10%).</p>\n<p><em>Penalty for word count outside the word limit: A word count that exceeds the maximum will be penalised through a reduction of 10% of the total mark available for the assessment.</em></p>\n<p>Theoretical Concepts (choose any 3):</p>\n<ul>\n<li>Feedback loops</li>\n<li>Circular causality</li>\n<li>System boundaries</li>\n<li>Double bind hypothesis</li>\n<li>Projective identification (from objects relations theory)</li>\n<li>Attachment styles</li>\n<li>Motivational schema (from neuropsychotherapy model)</li>\n<li>Social constructionism</li>\n<li>Deconstruction</li>\n<li>Reframing</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>This assessment requires students to submit an electronic version of their assignment via Blackboard. The electronic version of your assignment will be submitted via Blackboard, using the Turnitin software.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "The Experience of Family",
            "special_indicators": [],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p> 23/09/2025 1:00 pm</p></dd>",
            "learning_objectives": "L05",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Task: Reflection</p>\n<p>Word limit: 1500 words (+/- 10%)</p>\n<p><em>Penalty for word count outside the word limit: A word count that exceeds the maximum will be penalised through a reduction of 10% of the total mark available for the assessment.</em></p>\n<p>\"Because forming a working relationship is central to psychotherapy, it is important that therapists be aware of the various dimensions of family-of-origin relationships that may influence their present interactions with clients.\" (Kier &amp; Lawson, 1999, p119)</p>\n<p>All of the major schools of family therapy place a strong emphasis on the counsellor being as self-aware as possible on the influence of their own experience of family on their practice as a therapist. This task requires students to consider: (A) various aspects of their experience of their own family and, (B) to reflect upon the influence that this experience may have upon their counselling practice. In this way the reflection is to be structured in two sections:</p>\n<p><strong>SECTION A - Experience of Family<em> (Marking Rubric 1)</em></strong></p>\n<p>Students are to reflect upon their experience of their own family and to write a summary of that experience. This summary could effectively act as an introduction to the most significant parts of your experience of your family. It is expected that the explanations of experiences extend beyond the most obvious interpretations by hypothesising possible causal mechanisms, such as connecting personal experiences with the underlying identified patterns and themes of your family as suggested in the example questions below. The purpose of this reflection is to consider your own lived experience of family and therefore this reflection is more of a personal than an academic piece. Instead you are encouraged to write in a style that is comfortable for you without worrying how it ties into the various theories or approaches that will be discussed in the course. As such, first person language is also acceptable, and references are not required.</p>\n<p>To help guide your reflections, you may like to consider the following topics and questions (or perhaps even discuss them with a trusted friend or peer before writing):</p>\n<ul>\n<li>Composition and Structure: Who made up your family? How was your family 'organised' or 'structure'? What roles did different people play? </li>\n<li>Pattern and Systems: How would you describe the family's interactions? Were there any notable patterns or cycles to your family's functioning? Did the family have any significant rules (spoken or unspoken) that governed its functioning? </li>\n<li>History and Story: What significant events shaped the nature of the family (you might think into previous generations as well)? What are some of your family's most significant stories? </li>\n<li>Values and Beliefs: What did your family hold to be significant or important? Were there any cultural (e.g. ethnicity, class, religion, etc.) norms that shaped your family? What would an 'outsider' notice about your family if they were to join it? </li>\n</ul>\n<p>These questions are examples to guide reflection, and therefore do not have to be applied rigidly. </p>\n<p><strong>SECTION B - Impact of Family Experience on Professional Practice <em>(Marking Rubric 2)</em></strong></p>\n<p>This section asks students to reflect upon how that experience of their own family has impacted upon their practice as a helping professional. Questions that students might consider include: </p>\n<ul>\n<li>How might have your experience of family shaped your decision to enter the helping professions?</li>\n<li>What things have you learned from your experience of family that you think will be an asset to your professional practice?</li>\n<li>Are there any things that you have learned from your experience of family which might be a challenge to you in your professional practice? </li>\n<li>Given your experience of family, are there any types of families or family problems that you think would be more challenging than others for you to work with?  </li>\n</ul>\n<p>Again, these questions are to guide reflection, and therefore do not have to be applied rigidly. The reflection should, however, ultimately focus on the potential impacts (positive and/or challenging) of their family experiences on their professional practice with clients.</p>\n<p><em>A note on self-care: </em></p>\n<p>Thinking about and discussing our own life-experiences regarding our families can sometimes raise emotions and memories that we haven't thought about for a while. More to the point, sometimes this can happen when we don't expect it. Naturally, this very fact proves that this process of self-awareness is an important one, as it prepares you for any challenging material that you might experience from your clients. That is why it is important to be compassionate with yourself so that you can grow through this experience, firstly for your own sake and secondly for your future work. </p>\n<p>Therefore, you are encouraged to consider some processes of self-care as you write these reflections. For instance, allow yourself time and space to write these responses so that you are not rushed or pressured. Consider whether you have a supportive person that you know lined up to debrief after you consider the questions (e.g. arrange to have coffee with a close friend, or talk with one of your peers from class). Perhaps you could even discuss these questions with a close friend or peer before you write your answers, so that you are more aware of the feelings that come up. And, of course, you might have other ideas for yourself that you know would work for you, and you are encouraged to use these.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>This assessment requires students to submit an electronic version of their assignment via Blackboard. The electronic version of your assignment will be submitted via Blackboard, using the Turnitin software.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Structured Case Analysis",
            "special_indicators": [],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 28/10/2025 1:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Word limit: 2000 words (+/-10%) + process report of transcript (not included in word count)</p>\n<p><em>Penalty for word count outside the word limit: A word count that exceeds the maximum will be penalised through a reduction of 10% of the total mark available for the assessment</em></p>\n<p>Format: Structured Case Study, including process report. Case study research has long been an essential feature in both the development and testing of theory in counselling and family therapy. In particular, the use of real-life cases put the theory and the case into conversation, allowing each to be elaborated by the other.</p>\n<p>Task: Students are to choose a single case from the “Family Therapy with the Experts” series, which present demonstrations of family therapy from a master of the discipline. This filmed series of family therapy demonstrations is accessible through the UQ Library (<a href=\"https://search.library.uq.edu.au/permalink/f/18av8c1/61UQ_ALMA51175793070003131\">https://search.library.uq.edu.au/permalink/f/18av8c1/61UQ_ALMA51175793070003131</a>). Students are to choose one demonstration of a family therapy theory.</p>\n<p>The structured case study should contain the following elements:</p>\n<ol>\n<li>Introduction to the Theory. This section should present a focused and succinct summary of the theory. The aim of this section is to orientate the reader to the conceptual framework which would inform the aims of the therapist in the recording. <strong>(Marking Rubric 2)</strong></li>\n<li>Description of the Family. The description should also be succinct and clear, yet provide enough detail to effectively orientate a reader who is unfamiliar to the family. It should summarise the composition of the family, the presenting problem(s), and any information that is needed to make sense of the critical commentary that will follow. It should also be written in a way that is respectful, such as to be acceptable if any member of the family were to read it. <strong>(Marking Rubric 1)</strong></li>\n<li>Critical Commentary. The commentary needs to include two parts. Firstly, it needs to comment on the application of the family therapy theory to the particulars of this family’s problems. This includes both how the theory would formulate and explain their problems <em>and</em> how this therapist demonstrated the aims and interventions of this theory. <strong>(Marking Rubric 2)</strong> Secondly, it needs to provide a critical discussion of this application. This could include (but is not limited to) things like evaluation of the accuracy and appropriateness of this theory for the family, alternative hypotheses or interventions for the family’s issues (from other theories or research), or topics and issues that were not addressed by the therapist. This critical evaluation should lead to justified recommendations on the aims and directions for future work with this family. <strong>(Marking Rubric 3)</strong> It is expected that the commentary is well-argued with clear reasoning and reference to evidence from both the session and relevant research.</li>\n<li>Transcript and Process Report. The case study needs to include a transcript of <em>no more than 10 minutes</em> of the family therapy session. The choice of segment is up to the student. The transcript is to be presented as a process report; that is, with brief commentary throughout on key processes that are occurring during the session. These processes should include family interpersonal processes (e.g. interpersonal interactions not evident from the transcript alone), theoretical interpretations (i.e. how the theory would formulate or interpret material in the session), and family therapy skills and interventions (i.e. key skills or interventions used by the therapist). <strong>(Marking Rubric 4)</strong> [N.B. the transcript and process report are not included in the word count]</li>\n</ol>\n<p>Clear links to supporting literature should be provided throughout, with the exception of the transcript and process report.</p>\n<p><em>Resources:</em></p>\n<p>The workshops in Weeks 5-10 will directly address major branches of family therapy that may be relevant to your case analysis. Therefore students are strongly encouraged to have chosen their case study before the commencement of these workshops, as there will be opportunities to begin applying material during the learning activities.</p>\n<p>Links to the recordings and to transcripts (where available) will be available in the ‘Assessment’ section of Blackboard. Examples of process reports will also be made available.  </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>This assessment requires students to submit an electronic version of their assignment via Blackboard. The electronic version of your assignment will be submitted via Blackboard, using the Turnitin software.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(28 Jul - 03 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Foundations I: Introduction and Foundations</strong><br/><p>Introduction to SWSP7267 History and core concepts of Family Therapy</p>\n<p>Readings/Ref: Becvar (Ch 2-3); Gladding (Ch 1-2); Goldenberg (Ch 1)</p></p><p><strong>Learning outcomes:</strong> L01, L04, L05</p></div></td>",
            "topic_title": "<strong>Foundations I: Introduction and Foundations</strong>",
            "topic_description": "Foundations I: Introduction and Foundations Introduction to SWSP7267 History and core concepts of Family Therapy Readings/Ref: Becvar (Ch 2-3); Gladding (Ch 1-2); Goldenberg (Ch 1)",
            "learning_outcomes": [
                "L01",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 2(04 Aug - 10 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Foundations II: Core Concepts</strong><br/><p>Introduction to common roots of Family Therapy: systems theory &amp; cybernetics; attachment theory; social constructivism</p>\n<p>Readings/Ref: Becvar (Ch 3-4); Goldenberg (Ch 1); Gladding (Ch 1-3)</p></p><p><strong>Learning outcomes:</strong> L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Foundations II: Core Concepts</strong>",
            "topic_description": "Foundations II: Core Concepts Introduction to common roots of Family Therapy: systems theory & cybernetics; attachment theory; social constructivism Readings/Ref: Becvar (Ch 3-4); Goldenberg (Ch 1); Gladding (Ch 1-3)",
            "learning_outcomes": [
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 3(11 Aug - 17 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Foundations III: Core Concepts in Practice</strong><br/><p>Integrated Family Assessment - Eight Lenses Integrated Family Formulation - Three Columns</p>\n<p>Readings/Ref: Becvar (Ch 14); Goldenberg (Ch 17); Gladding (Ch 14)</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Foundations III: Core Concepts in Practice</strong>",
            "topic_description": "Foundations III: Core Concepts in Practice Integrated Family Assessment - Eight Lenses Integrated Family Formulation - Three Columns Readings/Ref: Becvar (Ch 14); Goldenberg (Ch 17); Gladding (Ch 14)",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4(18 Aug - 24 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Skills I: Joining Family</strong><br/><p>Joining and building rapport with family/group Hearing story and setting agenda</p>\n<p>Readings/Ref: Rivett (Ch 2); Corey (Ch 5)</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Skills I: Joining Family</strong>",
            "topic_description": "Skills I: Joining Family Joining and building rapport with family/group Hearing story and setting agenda Readings/Ref: Rivett (Ch 2); Corey (Ch 5)",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5(25 Aug - 31 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Branches of Family Therapy: Structural</strong><br/><p>Family Therapy for Problematic Cycles - Structural Family Therapy</p>\n<p>Readings/Ref: Becvar (Ch 10); Goldenberg (Ch 10); Gladding (Ch 11)</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Branches of Family Therapy: Structural</strong>",
            "topic_description": "Branches of Family Therapy: Structural Family Therapy for Problematic Cycles - Structural Family Therapy Readings/Ref: Becvar (Ch 10); Goldenberg (Ch 10); Gladding (Ch 11)",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(01 Sep - 07 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Branches of Family Therapy: Strategic</strong><br/><p>Family Therapy for Problematic Cycles - Strategic Family Therapy</p>\n<p>Readings/Ref: Becvar (Ch 11-12); Goldenberg (Ch 11); Gladding (Ch 12)</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Branches of Family Therapy: Strategic</strong>",
            "topic_description": "Branches of Family Therapy: Strategic Family Therapy for Problematic Cycles - Strategic Family Therapy Readings/Ref: Becvar (Ch 11-12); Goldenberg (Ch 11); Gladding (Ch 12)",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7(08 Sep - 14 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Branches of Family Therapy: Generational</strong><br/><p>Family Therapies for Problematic Attachments - Trans-generational Models / Bowen Family Therapy</p>\n<p>Readings/Ref: Becvar (Ch 7); Goldenberg (Ch 8); Gladding (Ch 8)</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Branches of Family Therapy: Generational</strong>",
            "topic_description": "Branches of Family Therapy: Generational Family Therapies for Problematic Attachments - Trans-generational Models / Bowen Family Therapy Readings/Ref: Becvar (Ch 7); Goldenberg (Ch 8); Gladding (Ch 8)",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Branches of Family Therapy: Experiential</strong><br/><p>Family Therapies for Problematic Attachments - Symbolic-Experiential Family Therapy / Human Validation Process Model</p>\n<p>Readings/Ref: Becvar (Ch 8, 11); Goldenberg (Ch 9); Gladding (Ch 9)</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Branches of Family Therapy: Experiential</strong>",
            "topic_description": "Branches of Family Therapy: Experiential Family Therapies for Problematic Attachments - Symbolic-Experiential Family Therapy / Human Validation Process Model Readings/Ref: Becvar (Ch 8, 11); Goldenberg (Ch 9); Gladding (Ch 9)",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Branches of Family Therapy: Narrative</strong><br/><p>Therapies for Problematic Beliefs - Narrative Family Therapy</p>\n<p>Readings/Ref: Becvar (Ch 13); Goldenberg (Ch 14); Gladding (Ch 13)</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Branches of Family Therapy: Narrative</strong>",
            "topic_description": "Branches of Family Therapy: Narrative Therapies for Problematic Beliefs - Narrative Family Therapy Readings/Ref: Becvar (Ch 13); Goldenberg (Ch 14); Gladding (Ch 13)",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10(06 Oct - 12 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Branches of Family Therapy: Cognitive</strong><br/><p>Therapies for Problematic Beliefs - Cognitive Behavioural Family Therapy</p>\n<p>Readings/Ref: Becvar (Ch 9); Goldenberg (Ch 12); Gladding (Ch 10)</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Branches of Family Therapy: Cognitive</strong>",
            "topic_description": "Branches of Family Therapy: Cognitive Therapies for Problematic Beliefs - Cognitive Behavioural Family Therapy Readings/Ref: Becvar (Ch 9); Goldenberg (Ch 12); Gladding (Ch 10)",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(13 Oct - 19 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Skills II: Working with Families</strong><br/><p>Testing approaches; Facilitation skills; Group facilitation</p>\n<p>Readings/Ref: Corey (Ch 5)</p></p><p><strong>Learning outcomes:</strong> L01, L03, L05</p></div></td>",
            "topic_title": "<strong>Skills II: Working with Families</strong>",
            "topic_description": "Skills II: Working with Families Testing approaches; Facilitation skills; Group facilitation Readings/Ref: Corey (Ch 5)",
            "learning_outcomes": [
                "L01",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 12(20 Oct - 26 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Skills III: Working with Families</strong><br/><p>Whole class reflecting team roleplay + analysis</p>\n<p>Readings/Ref: Corey (Ch 5)</p></p><p><strong>Learning outcomes:</strong> L01, L03, L05</p></div></td>",
            "topic_title": "<strong>Skills III: Working with Families</strong>",
            "topic_description": "Skills III: Working with Families Whole class reflecting team roleplay + analysis Readings/Ref: Corey (Ch 5)",
            "learning_outcomes": [
                "L01",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13(27 Oct - 02 Nov)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Application: From Theory to Practice</strong><br/><p>Course Review Topics in Family Therapy (Student Chosen) Professional Development as a Family Therapist</p>\n<p>Readings/Ref: Goldenberg (Ch 6)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Application: From Theory to Practice</strong>",
            "topic_description": "Application: From Theory to Practice Course Review Topics in Family Therapy (Student Chosen) Professional Development as a Family Therapist Readings/Ref: Goldenberg (Ch 6)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}