{
    "course_title": "Foundational Social Work Field Practice Course in Child, Youth and Family",
    "study_period": "Sem 2 2025",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SWSP3028-61465-7560",
    "full_course_code": "SWSP3028-61465-7560",
    "course_code": "SWSP3028",
    "class_code": "61465",
    "semester_code": "7560",
    "semester_details": "Semester 2, 2025 (28/07/2025 - 22/11/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Describe the key occupational groups, issues, and challenges within child, youth, and family services."
        },
        {
            "number": "LO2.",
            "description": "Explain and apply the core principles and frameworks relevant to child protection, family support, and trauma-informed practice."
        },
        {
            "number": "LO3.",
            "description": "Analyse the impact of societal factors, trauma, and violence on children, families, and communities, and evaluate the effectiveness of different intervention strategies."
        },
        {
            "number": "LO4.",
            "description": "Apply knowledge of risk and safety factors to assess case studies, formulate intervention plans, and develop goals in social work."
        },
        {
            "number": "LO5.",
            "description": "Discuss ethical considerations, relevant legislative frameworks, and findings from inquiries in social work practice related to child protection, and critically evaluate their implications."
        },
        {
            "number": "LO6.",
            "description": "Apply culturally sensitive practices when engaging with Aboriginal and Torres Strait Islander peoples and Culturally and Linguistically Diverse communities and critically evaluate the impact of different positionalities on cultural safety."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "In-semester exam: Child Protection Case Assessment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>35% marked out of 100 </dd>",
            "due_date": "<dd><p> 26/08/2025 8:00 am</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Students must sit the examination to be eligible to pass the course.</strong></p>\n<p>The exam will occur in class time in Week 5. The case study for the exam will be released on the Blackboard site on the Friday of Week 4.</p>\n<p>The test will commence at the beginning of the lecture.</p>\n<p>Some \"new\" information about the family may also be supplied as part of the exam. Students will have 10 minutes reading time and a further 90 minutes in which to complete the exam.</p>\n<p>In the test, students will be provided with written instructions. The test will include:</p>\n<ul>\n<li>identification and discussion of the signs of <em>safety</em> and of<em> risk</em></li>\n<li>identification of <em>further factors</em> that would need to be considered in a child protection assessment</li>\n<li>outline a <em>short plan</em> for the next stage of assessment and intervention to enhance the child/children's well-being and safety based on their assessment of risk and of safety.</li>\n</ul>\n<p>This test is <em>closed book</em>, meaning that students can only bring writing equipment and a standard unmarked English language dictionary to their desk for the test. </p>\n<p>Students are expected to make reference to the course material including literature, though a precise/formal reference list is not required.</p>\n<p>This assessment piece is conducted as an exam and students who fail to attend the test will receive zero marks. </p>\n<p>Students who arrive late for the test will not receive extra time to complete the test.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Social Work Practice Portfolio (inc student presentations)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>65% marked out of 100 </dd>",
            "due_date": "<dd><p>8/09/2025 - 20/10/2025</p>\n<p>Part 1: Group Seminar/Presentation (Weeks 7-9 and, 11-12 inclusive). NB: Week 10 is on a public holiday. </p>\n<p> 12/11/2025 1:00 pm</p>\n<p>\n</p><p>Part 2: Workbook (All 5 questions are to be submitted as one document by 1pm, 12 November)</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Activity/ Performance, Written",
            "category": "Notebook/ Logbook, Practical/ Demonstration, Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This description is only a summary of the task. For full details, including the marking rubric, please refer to the course Learn UQ (Blackboard) site.</p>\n<p>The Practice Portfolio consists of two parts, as follows:</p>\n<ol>\n<li>An in-class group seminar/presentation on a child protection sector inquiry, and</li>\n<li>A workbook consisting of four 300-word responses and one 600-word response (total of 1800 words)</li>\n</ol>\n<p><em>Part 1 - Group Seminar/Presentation:</em></p>\n<ul>\n<li>This is a group activity. Each student will participate in a team that will lead a 50 minute in-class seminar regarding a specific public Inquiry related to the human services sector and the populations social workers serve. </li>\n<li>By the end of Week One, students will allocate to a team with a specific topic.</li>\n<li>The student led seminars will occur each week from 8th of September until (and including) 20th of October (Weeks7-9 and,1-12 inclusive). Noting Week 10 is on a public holiday.</li>\n</ul>\n<p><em>Part 2 - Workbook</em></p>\n<ul>\n<li>The workbook will be comprised of the following five exercises related to seminar and student lead presentation content.</li>\n<li>To answer workbook questions, students need to draw directly from student lead presentations in Weeks 7–12. These presentations are not recorded which means that students are required to attend all tutorials (Weeks 7-12) in person to ensure they can appropriately answer each question. Students must also demonstrate a capacity to draw on lectures/seminars and reading materials, including the material from the course reading list. </li>\n<li>All 5 workbook questions are to be submitted as one document by 1pm, 12th November 2025<strong>. </strong>The workbook must include a single reference list. Students must use APA 7th referencing. Workbook responses for questions 1- 4 are 300 words each and for question 5 is 600 words (total of 1800 words)<strong>. </strong>The assessment must be presented in 12-point font in Times New Roman or similar type face. 1.5 or 2 line spacing is required. Whilst students may use AI technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</li>\n<li>A failure to reference generative AI use may constitute student misconduct under the Student Code of Conduct.</li>\n<li>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI tools.</li>\n</ul>\n<p>See rubric in the blackboard site for a detailed breakdown of criteria and weighting.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The workbook requires students to submit an electronic version of their assignment via Blackboard. The electronic version of your assignment will be submitted via Blackboard, using the Turnitin software.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(28 Jul - 03 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction to the Course</strong><br/><p>Introduction to practice with children, young people and families. Today's lecture will focus on:</p>\n<ol>\n<li>mapping the field of practice with children, young people and families.</li>\n<li>an introduction to the Queensland child protection context.</li>\n<li>an introduction to types of risk and harm</li>\n<li>discussion of the course's assessment requirements, including how to run a workshop style seminar.</li>\n</ol></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Introduction to the Course</strong>",
            "topic_description": "Introduction to the Course Introduction to practice with children, young people and families. Today's lecture will focus on: mapping the field of practice with children, young people and families. an introduction to the Queensland child protection context. an introduction to types of risk and harm discussion of the course's assessment requirements, including how to run a workshop style seminar.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 2(04 Aug - 10 Aug)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Assessing risk of harm and death</strong><br/><p>Understanding &amp; responding to risk of harm and death. Lecture and tutorials combined into a Seminar (Weeks 2, 3, 4, 6 &amp; 13). Lecture for 2 hours and whole class tutorial for 1 hour. Tutorials will involve a mix of structured learning activities to complement lecture content and opportunities to prepare for your group presentations. Group presentations will happen in tutorials (across two groups/rooms) from Weeks 7 to 12.</p>\n<p>Today's seminar focuses on:</p>\n<ol>\n<li>an introduction to the Signs of Safety approach to assessment.</li>\n<li>practice in a Signs of Safety Assessment in preparation for exam.</li>\n</ol>\n<p>Guest lecture to discuss:</p>\n<ol>\n<li>key considerations in assessing signs of child abuse and neglect, including assessment of high risk of harm or death.</li>\n<li>the consideration of numerous factors contributing to harm, including family and domestic violence.</li>\n</ol></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Assessing risk of harm and death</strong>",
            "topic_description": "Assessing risk of harm and death Understanding & responding to risk of harm and death. Lecture and tutorials combined into a Seminar (Weeks 2, 3, 4, 6 & 13). Lecture for 2 hours and whole class tutorial for 1 hour. Tutorials will involve a mix of structured learning activities to complement lecture content and opportunities to prepare for your group presentations. Group presentations will happen in tutorials (across two groups/rooms) from Weeks 7 to 12. Today's seminar focuses on: an introduction to the Signs of Safety approach to assessment. practice in a Signs of Safety Assessment in preparation for exam. Guest lecture to discuss: key considerations in assessing signs of child abuse and neglect, including assessment of high risk of harm or death. the consideration of numerous factors contributing to harm, including family and domestic violence.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 3(11 Aug - 17 Aug)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Children's wellbeing and protection</strong><br/><p>Understanding &amp; responding to children's well-being and protection. Today's seminar focuses on: </p>\n<ol>\n<li>discussion on the importance of early intervention, family support and advocacy.</li>\n<li>psycho-social needs of children with a focus on promoting healthy, secure attachment.</li>\n</ol></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Children's wellbeing and protection</strong>",
            "topic_description": "Children's wellbeing and protection Understanding & responding to children's well-being and protection. Today's seminar focuses on: discussion on the importance of early intervention, family support and advocacy. psycho-social needs of children with a focus on promoting healthy, secure attachment.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 4(18 Aug - 24 Aug)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Early Intervention &amp; Family Support</strong><br/><p>Understanding &amp; undertaking early intervention and family support. Today's seminar focuses on: </p>\n<ol>\n<li>approaches to early intervention, family support and advocacy to enhance family well-being and to reduce the risk of children' being harmed.</li>\n<li>further practice in a Signs of Safety Assessment in preparation for the in-class exam.</li>\n</ol></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Early Intervention &amp; Family Support</strong>",
            "topic_description": "Early Intervention & Family Support Understanding & undertaking early intervention and family support. Today's seminar focuses on: approaches to early intervention, family support and advocacy to enhance family well-being and to reduce the risk of children' being harmed. further practice in a Signs of Safety Assessment in preparation for the in-class exam.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 5(25 Aug - 31 Aug)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In-class test</strong><br/><p>Students will undertake an in-class test in this session.</p>\n<p>As always, students should arrive promptly by 8am as the test will commence at 8:10am and no extra time will be available to those who arrive late.</p>\n<p>Please note that there is no tutorial this week.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>In-class test</strong>",
            "topic_description": "In-class test Students will undertake an in-class test in this session. As always, students should arrive promptly by 8am as the test will commence at 8:10am and no extra time will be available to those who arrive late. Please note that there is no tutorial this week.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6(01 Sep - 07 Sep)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Inquiries &amp; the over-representation of Aboriginal and Torres Strait Islander peoples in statutory systems</strong><br/><p>Understanding &amp; responding to the over-representation of Aboriginal and Torres Strait Islander peoples in statutory systems. Today's seminar focuses on:</p>\n<ol>\n<li>the role of public inquiries in creating better service systems and justice for service users</li>\n<li>critically discussion of the Bringing Them Home Report</li>\n</ol></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Inquiries &amp; the over-representation of Aboriginal and Torres Strait Islander peoples in statutory systems</strong>",
            "topic_description": "Inquiries & the over-representation of Aboriginal and Torres Strait Islander peoples in statutory systems Understanding & responding to the over-representation of Aboriginal and Torres Strait Islander peoples in statutory systems. Today's seminar focuses on: the role of public inquiries in creating better service systems and justice for service users critically discussion of the Bringing Them Home Report",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 7(08 Sep - 14 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Presentations</strong><br/><p>This week the first student-led presentations will commence in both tutorial groups (held from 9am - 10am and 10am - 11am). </p>\n<p>Today's presentations will be on the Royal Commission into Institutional Responses to Child Sexual Abuse.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Presentations</strong>",
            "topic_description": "Presentations This week the first student-led presentations will commence in both tutorial groups (held from 9am - 10am and 10am - 11am). Today's presentations will be on the Royal Commission into Institutional Responses to Child Sexual Abuse.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 7(08 Sep - 14 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Responding to Institutional Abuse</strong><br/><p>Understanding &amp; responding to Institutional Abuse. Today's lecture focuses on trauma informed approaches to practice, particularly in response to people who have experienced institutional abuse.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Responding to Institutional Abuse</strong>",
            "topic_description": "Responding to Institutional Abuse Understanding & responding to Institutional Abuse. Today's lecture focuses on trauma informed approaches to practice, particularly in response to people who have experienced institutional abuse.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Presentations</strong><br/><p>Student-led presentations in both tutorial groups (held from 9am - 10am and 10am - 11am). Today's presentations will be on the \"Not now, not ever\" report on domestic and family violence concerns and reforms in Queensland.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Presentations</strong>",
            "topic_description": "Presentations Student-led presentations in both tutorial groups (held from 9am - 10am and 10am - 11am). Today's presentations will be on the \"Not now, not ever\" report on domestic and family violence concerns and reforms in Queensland.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8(15 Sep - 21 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Social Work in Domestic &amp; Family Violence</strong><br/><p>Understanding &amp; responding to domestic and family violence (DFV) Today's lecture focuses on:</p>\n<ol>\n<li>what domestic and family violence is</li>\n<li>the impact of DFV on family members' well-being and capacity to act protectively towards children at risk</li>\n<li>the role of social workers in identifying and responding to domestic and family violence</li>\n</ol></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Social Work in Domestic &amp; Family Violence</strong>",
            "topic_description": "Social Work in Domestic & Family Violence Understanding & responding to domestic and family violence (DFV) Today's lecture focuses on: what domestic and family violence is the impact of DFV on family members' well-being and capacity to act protectively towards children at risk the role of social workers in identifying and responding to domestic and family violence",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Presentations</strong><br/><p>Student-led presentations in both tutorial groups (held from 9am - 10am and 10am - 11am). Today's presentations will be on forced adoptions.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Presentations</strong>",
            "topic_description": "Presentations Student-led presentations in both tutorial groups (held from 9am - 10am and 10am - 11am). Today's presentations will be on forced adoptions.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 9(22 Sep - 28 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Re-emergence of adoption in child welfare</strong><br/><p>Understanding &amp; responding to adoption in child welfare. Today's lecture focuses on: </p>\n<ol>\n<li>the ongoing impact of forced adoption</li>\n<li>the re-emergence of adoption as an option for children in out-of-home care (OOHC) and the Permanent Care Order model.</li>\n</ol></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Re-emergence of adoption in child welfare</strong>",
            "topic_description": "Re-emergence of adoption in child welfare Understanding & responding to adoption in child welfare. Today's lecture focuses on: the ongoing impact of forced adoption the re-emergence of adoption as an option for children in out-of-home care (OOHC) and the Permanent Care Order model.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 11(13 Oct - 19 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Presentations</strong><br/><p>Student-led presentations in both tutorial groups (held from 9am - 10am and 10am - 11am). Today's presentations will be on the: </p>\n<ol>\n<li>The Forgotten Australians</li>\n<li>2014 Senate Inquiry into Out of Home Care.</li>\n</ol></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Presentations</strong>",
            "topic_description": "Presentations Student-led presentations in both tutorial groups (held from 9am - 10am and 10am - 11am). Today's presentations will be on the: The Forgotten Australians 2014 Senate Inquiry into Out of Home Care.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 11(13 Oct - 19 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Out-of-home care: Problems and prospects</strong><br/><p>Understanding &amp; working within the out-of-home care system. Today's lecture focuses on: </p>\n<ol>\n<li>the experience of young people who cannot live with their families</li>\n<li>consideration of the challenges and opportunities provided by different forms of out-of-home care and adoption.</li>\n</ol></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Out-of-home care: Problems and prospects</strong>",
            "topic_description": "Out-of-home care: Problems and prospects Understanding & working within the out-of-home care system. Today's lecture focuses on: the experience of young people who cannot live with their families consideration of the challenges and opportunities provided by different forms of out-of-home care and adoption.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 12(20 Oct - 26 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Presentations</strong><br/><p>Student-led presentations in both tutorial groups (held from 9am - 10am and 10am - 11am). Today's presentations will be on the Atkinson Report into Youth Justice.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Presentations</strong>",
            "topic_description": "Presentations Student-led presentations in both tutorial groups (held from 9am - 10am and 10am - 11am). Today's presentations will be on the Atkinson Report into Youth Justice.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 12(20 Oct - 26 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Youth Justice</strong><br/><p>Understanding &amp; working within the Youth Justice system. Today's lecture focuses on:</p>\n<ol>\n<li>the role of social workers in the youth justice system</li>\n<li>how frontline social workers can play a support role with young people involved in child protection and youth justice systems</li>\n</ol>\n<p>We hope to have a guest speaker from the Youth Advocacy Centre to discuss their work.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Youth Justice</strong>",
            "topic_description": "Youth Justice Understanding & working within the Youth Justice system. Today's lecture focuses on: the role of social workers in the youth justice system how frontline social workers can play a support role with young people involved in child protection and youth justice systems We hope to have a guest speaker from the Youth Advocacy Centre to discuss their work.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 13(27 Oct - 02 Nov)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Being a Youth Advocate</strong><br/><p>Understanding the role of a Youth Advocate. Today's seminar focuses on:</p>\n<ol>\n<li>the skill of writing advocacy letters to decision-makers</li>\n<li>a review of the work covered throughout the semester and 'tie it all together'</li>\n</ol></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Being a Youth Advocate</strong>",
            "topic_description": "Being a Youth Advocate Understanding the role of a Youth Advocate. Today's seminar focuses on: the skill of writing advocacy letters to decision-makers a review of the work covered throughout the semester and 'tie it all together'",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}