{
    "course_title": "Agribusiness Value Chain Management",
    "study_period": "Sem 1 2026",
    "location": "External",
    "attendance": "Online",
    "url": "https://course-profiles.uq.edu.au/course-profiles/AGRC7050-20688-7620",
    "full_course_code": "AGRC7050-20688-7620",
    "course_code": "AGRC7050",
    "class_code": "20688",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Evaluate drivers of change in the agribusiness sector and how they influence value chain formation/management."
        },
        {
            "number": "LO2.",
            "description": "Discuss underlying principles behind value chain management."
        },
        {
            "number": "LO3.",
            "description": "Evaluate the theoretical concepts underpinning formation, operation and performance of coordinated value chains and their practical application in agribusiness."
        },
        {
            "number": "LO4.",
            "description": "Critically analyse and report on value chain management practices and communicate findings with critical reasoning."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Consultancy Proposal",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 16/03/2026 2:00 pm</p></dd>",
            "learning_objectives": "L01, L03",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment task is designed to simulate a professional consultancy application for an international development partner undertaking a value chain development project in a low- or middle-income country. Students are required to assume the role of a prospective agribusiness consultant responding to a project opportunity in their home country or a country with which they are familiar. Students will then develop a 1,500-word consultancy proposal outlining how they would analyse the value chain of their preferred commodity. The proposal should be written in a professional consultancy style and framed as a response to an international development partner’s Terms of Reference (ToR) for the consultant. The proposal should also include an analytical framework (for example, to understand consumer/market perspectives, value chain mapping, value creating or waste reduction opportunities and to pre‑plan data sources and analytical methods), which would guide the detailed analysis of the value chain in later tasks.</p>\n<p>The task aims to develop students’ capacity to apply value chain concepts and analytical frameworks in a realistic, policy- and development-oriented context, consistent with professional expectations in international agribusiness and development practice. This proposal forms the foundation for successive assessment tasks in the course. Careful selection and thoughtful design of this proposal are therefore essential for successful progression through the course. More detailed instructions, assessment criteria and submission requirements will be provided on the course Blackboard site. If unsure, students can discuss with the lecturer or the teaching staff to confirm the appropriateness of their preferred industry and commodity for this assignment.</p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. The use of AI or MT must be referenced appropriately. Please see assessment guidelines in blackboard course site for specific instructions.</p>\n<p>A useful link: https://guides.library.uq.edu.au/referencing/ai-tools-assignments.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your Assessment task, in Blackboard, via the Turnitin link by the submission deadline. You should also retain an electronic copy of every piece of assessment you submit.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Value Chain Analysis - Report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 11/05/2026 2:00 pm</p></dd>",
            "learning_objectives": "L01, L03, L04",
            "mode": "Written",
            "category": "Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment task builds directly on the Consultancy Proposal submitted earlier in the course. Students are required to retain the same agrifood industry and commodity, value chain focus and approach approved in the previous assessment. The task simulates the delivery of a professional consultancy report prepared for an international development partner seeking evidence-based insights to inform value chain development interventions.</p>\n<p>Students will translate their proposed analytical focus and approach into a 4000-word value chain analysis report, consistent with expectations for postgraduate-level consultancy work in agribusiness and international development. The report should examine the existing and potential structure, process, functions and interventions required to develop the commodity value chains for the industry or an agribusiness within the industry. You must include a 500-word Artificial Intelligence (AI) Reflection, as Annex, explaining tools (e.g., ChatGPT, Grammarly) and prompts used, outlining AI related disclosure and providing critique of AI use for the purpose of this assignment.</p>\n<p>The report must be based on secondary data and information sources, including (but not limited to) academic literature, industry reports, government publications, donor and development partner reports, market analyses, and reputable grey literature. Students are prohibited from doing primary data collection as primary data is not required for this assessment.</p>\n<p>The analysis should demonstrate a systematic and critical application of value chain concepts, frameworks and assessment, with clear links to development objectives relevant to the country and sector context. More detailed instructions, assessment criteria and submission requirements will be provided on the course Blackboard site.</p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. </p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. The use of AI or MT must be referenced appropriately. Please see assessment guidelines in blackboard course site for specific instructions. </p>\n<p>A useful link: https://guides.library.uq.edu.au/referencing/ai-tools-assignments.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your Assessment task, in Blackboard, via the Turnitin link by the submission deadline. You should also retain an electronic copy of every piece of assessment you submit.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Presentation followed by QA - Value Chain Analysis and Management",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p>The presentation (online) will be scheduled on lecture days and during class hours in week 12 &amp; 13, with the possibility of extending beyond the regular contact hours.  18/05/2026 - 29/05/2026</p>\n<p>Submission of PowerPoint slides due 5pm 29/05/2026</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students are required to make a 10-minute oral presentation on their value chain analysis report (10 marks), followed by a Q&amp;A session on principles and practices of value chain management and analysis (30 marks), contents covered during the semester. The presentation and follow-up Q&amp;A will be recorded and marked by at least two examiners. </p>\n<p>The final version of your presentation slides (which will be assessed as a part of the oral presentation) should be submitted through Turnitin in the course blackboard site. Students will then give the oral presentation during the scheduled presentation time. The presentation will be scheduled on lecture days and during contact hours, with the possibility of extending beyond the regular contact hours. The presentation schedules, guidelines and marking criteria will be posted on the Blackboard site. </p>\n<p>This is an identity-verified assessment task; therefore, this task is to be completed in person (in class by in-person students and online via Zoom by external students). Have your student ID for your scheduled presentation.</p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. The use of AI or MT must be referenced appropriately. Please see assessment guidelines in blackboard course site for specific instructions.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your PowerPoint slides in Blackboard via the Turnitin link by the submission deadline. You should also retain an electronic copy of every piece of assessment you submit.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 11",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture-cum-Workshop Series</strong><br/><p>The weekly three-hour scheduled learning activities include lecture-cum-workshop series (2 hours) and tutorials (1 hour). Lecture and workshop sessions are designed to be delivered in hybrid mode (simultaneous on-campus and online via Zoom). These sessions will not be timetabled for external students, but they can attend the sessions scheduled for in-person students via live Zoom. </p>\n<p>Lecture-cum-workshop sessions are recorded and available through the course Blackboard site after the scheduled lecture hours. These sessions focus on foundational and advanced knowledge and understanding of the course contents. They are delivered using multiple teaching-learning methods, including PowerPoint presentations, interactive quizzes, case studies, case/problem-based learning, flip learning, panel discussion, group discussion, and guest presentation. Please refer to the full timetable in the course Blackboard site.</p></p><p><strong>Sub-activity:</strong> Course overview; Changing nature of agribusiness and value chain (VC) approach in agricultural development Value chain management (VCM): underlying principles, practices and concepts Value chain analysis - process and dimensions Consumer Value and value creation Value chain case study from developing country contexts Value chain analysis - methods and data for secondary analysis Value chain case study: application of VCM principles and practices in developed economy context Value chain management: achieving competitiveness, indicators and metrics, credibility and triangulation Value chain management: building and sustaining relationships Inclusive Value Chains: power, governance Enabling roles of policies and barriers and drivers of implementing value chain strategies</p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Lecture-cum-Workshop Series</strong>",
            "topic_description": "Lecture-cum-Workshop Series The weekly three-hour scheduled learning activities include lecture-cum-workshop series (2 hours) and tutorials (1 hour). Lecture and workshop sessions are designed to be delivered in hybrid mode (simultaneous on-campus and online via Zoom). These sessions will not be timetabled for external students, but they can attend the sessions scheduled for in-person students via live Zoom. Lecture-cum-workshop sessions are recorded and available through the course Blackboard site after the scheduled lecture hours. These sessions focus on foundational and advanced knowledge and understanding of the course contents. They are delivered using multiple teaching-learning methods, including PowerPoint presentations, interactive quizzes, case studies, case/problem-based learning, flip learning, panel discussion, group discussion, and guest presentation. Please refer to the full timetable in the course Blackboard site. Sub-activity: Course overview; Changing nature of agribusiness and value chain (VC) approach in agricultural development Value chain management (VCM): underlying principles, practices and concepts Value chain analysis - process and dimensions Consumer Value and value creation Value chain case study from developing country contexts Value chain analysis - methods and data for secondary analysis Value chain case study: application of VCM principles and practices in developed economy context Value chain management: achieving competitiveness, indicators and metrics, credibility and triangulation Value chain management: building and sustaining relationships Inclusive Value Chains: power, governance Enabling roles of policies and barriers and drivers of implementing value chain strategies",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 11(02 Mar - 17 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial series </strong><br><p>The tutorial sessions are designed to allow group work, follow-up discussions of lecture contents, formative feedback and assignment preparation. Students attend these sessions as per their enrolment mode. In Person students attend the tutorial sessions in-person, whereas external students can complete the tutorials online (via synchronized Zoom sessions with in-person students) or offline (via Discussion Board). Depending on the enrolment mode, tutorial activities involve independent task completion, workshops, group discussions, guest insights, formative assessments, student presentations, role play, mini-case analysis, peer review and preparation for assignments and the final presentation and QA. Week 3 and Week 7 tutorials are set for formative checkpoints in which students submit a one-page outline of the proposal for quick feedback (Week 3) and share a draft section of the report for peer and tutor comments (Week 7). </p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Tutorial series </strong>",
            "topic_description": "Tutorial series The tutorial sessions are designed to allow group work, follow-up discussions of lecture contents, formative feedback and assignment preparation. Students attend these sessions as per their enrolment mode. In Person students attend the tutorial sessions in-person, whereas external students can complete the tutorials online (via synchronized Zoom sessions with in-person students) or offline (via Discussion Board). Depending on the enrolment mode, tutorial activities involve independent task completion, workshops, group discussions, guest insights, formative assessments, student presentations, role play, mini-case analysis, peer review and preparation for assignments and the final presentation and QA. Week 3 and Week 7 tutorials are set for formative checkpoints in which students submit a one-page outline of the proposal for quick feedback (Week 3) and share a draft section of the report for peer and tutor comments (Week 7).",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        }
    ]
}