{
    "course_title": "Leadership in Rural Industries & Communities",
    "study_period": "Sem 1 2026",
    "location": "External",
    "attendance": "Online",
    "url": "https://course-profiles.uq.edu.au/course-profiles/AGRC7046-20668-7620",
    "full_course_code": "AGRC7046-20668-7620",
    "course_code": "AGRC7046",
    "class_code": "20668",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Apply key principles and procedures of leadership as it can be applied in a rural and regional context"
        },
        {
            "number": "LO2.",
            "description": "Apply the dynamics of personal attributes in leadership"
        },
        {
            "number": "LO3.",
            "description": "Apply leadership in a group, industry and community context, and be able to practise leadership effectively in at least one of these contexts"
        },
        {
            "number": "LO4.",
            "description": "Demonstrate the ability to manage issues that arise in leadership such as manage conflict, foster the development of teams, mentor others, create collective vision etc."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate the ability to sustain leadership functions in groups and in other settings"
        },
        {
            "number": "LO6.",
            "description": "Demonstrate the skills and processes to learn from experience and learn collaboratively"
        },
        {
            "number": "LO7.",
            "description": "Demonstrate the ability to orally articulate, justify, and defend leadership judgement in response to questioning, including reflection on evidence use, uncertainty, and alternative perspectives."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Learning project plan",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p> 27/03/2026 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Learning Project Plan is your comprehensive action plan for the experiential learning project you will carry out during the semester. It focuses on addressing a leadership challenge and setting personal leadership development goals. This assessment integrates the first three steps of the experiential learning cycle:</p>\n<ul>\n<li>Reflection on the Situation: Identify and analyze a leadership challenge. This is often something that you have struggled with in the past in group settings —for example, fostering collaboration, managing conflict, or ensuring equitable participation.</li>\n<li>Generalisation: Use leadership theories from Module 1 and Module 2 to formulate your leadership goals and objectives.</li>\n<li>Planned Action<strong>:</strong> Design a practical plan for demonstrating leadership in the group project and achieving your personal leadership goals.</li>\n</ul>\n<p><br/></p>\n<p>Your Learning Project Plan should include:</p>\n<ul>\n<li>A reflection on the importance of leadership in your professional or personal context, particularly in group settings.</li>\n<li>Examples of leadership aspects you find enjoyable, challenging, or intimidating, especially in collaborative environments.</li>\n<li>Identify an existing situation that allows you to practise your leadership, ethically and constructively, without needing to organise a new activity. Identify a real situation in your current life where you can practise leadership ethically and constructively <em>before the end of May</em>, when the course finishes. This must be an existing context you are already involved in — you should not create a new activity solely for this assessment. Suitable contexts include (but are not limited to):<strong> </strong>a workplace project or routine task, a student club, sports team, or committee, a volunteer or community organisation, a study group or team assignment, a family or household coordination challenge, any group activity where decisions, coordination, or negotiation occur.</li>\n<li>A description of the leadership challenge you anticipate.</li>\n<li>An analysis of this leadership challenge using leadership concepts and frameworks from Module 1 and Module 2</li>\n<li>Planned actions and strategies for demonstrating leadership, ensuring the focus is on leadership (not management or administration).</li>\n</ul>\n<p><br/></p>\n<p>This integrated approach helps you align the general topic of leadership with your personal interests and ensures your development goals are clear, actionable, and relevant to your context.</p>\n<p><strong>Word Limit:</strong> 1,000 words (excluding references).</p>\n<p><br/></p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. </p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. The use of AI or MT must be referenced appropriately. Please see assessment guidelines in blackboard course site for specific instructions. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your Assessment task, in Blackboard, via the Turnitin link by the submission deadline. You should also retain an electronic copy of every piece of assessment you submit.  </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Literature review",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 13/04/2026 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment develops students’ capacity to exercise informed leadership judgement in complex agricultural and rural systems by designing, executing, and critically reflecting on a literature review process.</p>\n<p>Leaders in agriculture and rural industries must make decisions under conditions of uncertainty, competing evidence, and uneven access to tools and technologies. Artificial intelligence is increasingly available as a form of decision support, but its use is neither neutral nor universally appropriate. Effective leadership involves knowing when to adopt new tools, when to limit their use, and when to rely on alternative approaches.</p>\n<p>In this assessment, students may choose whether or not to use AI tools to support their literature review. Regardless of the pathway chosen, students remain responsible for problem framing, literature selection, synthesis, and interpretation.</p>\n<p>The emphasis of the task is on process, judgement, and reflexive practice, not on the production of polished text.</p>\n<p>Students are required to:</p>\n<ol>\n<li>Define and justify a leadership-relevant issue in agriculture or rural industries.</li>\n<li>Design and document a literature review workflow, explaining the rationale for key methodological choices.</li>\n<li>Explicitly justify their decision to use or not use AI tools, including consideration of benefits, risks, limitations, and context.</li>\n<li>Curate and prioritise relevant literature, demonstrating evaluative judgement rather than exhaustive coverage.</li>\n<li>Explain how insights were synthesised into a coherent understanding of the issue.</li>\n<li>Reflect on the implications of their chosen approach for leadership practice in real-world agricultural and rural contexts.</li>\n</ol>\n<p>The literature review text itself is treated as supporting evidence.</p>\n<p>When assessment results and feedback are available an announcement will be made via the course Blackboard site.</p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. </p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. The use of AI or MT must be referenced appropriately. Please see assessment guidelines in blackboard course site for specific instructions. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your Assessment task, in Blackboard, via the Turnitin link by the submission deadline. You should also retain an electronic copy of every piece of assessment you submit.  </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Pre-recorded Oral Presentation with Oral Q&A Check-in",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p>Pre-recorded Presentation submission due 2:00pm 15/05/2026</p>\n<p>Q&amp;A to occur during scheduled class times in Week 12 and 13, as advised by the course coordinator. In Person - live, in person. External - live, via Zoom. 18/05/2026 - 29/05/2026</p></dd>",
            "learning_objectives": null,
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Overview:</strong> At the end of the semester, you will undertake a Q&amp;A session discussing your pre-recorded presentation, showcasing the knowledge and insights you have gained from your learning project. This pre-recorded presentation with live Q&amp;A will account for 30% of your overall grade for the course.</p>\n<p><strong>1) Pre-recorded Presentation Guidelines - due 15/5/2026 2:00pm:</strong></p>\n<p><strong>•\tDuration</strong>: The recorded presentation should be exactly 10 minutes long.</p>\n<p><strong>•\tFormat</strong>: You may use board displays, PowerPoint slides, or any other visual aids to enhance your presentation.</p>\n<p>•\t<strong>Delivery</strong>: Engage the audience. Do not read from a fully written-out text. You may use notes to guide your presentation, but reliance on extensive reading will be penalized. You must be in view throughout the entire recorded presentation.</p>\n<p><br/></p>\n<p><strong>2) Q&amp;A session - Learning Project - completed in scheduled class time of week 12 - week 13 (as required) live via Zoom:</strong></p>\n<p><strong>Overview:</strong></p>\n<p>After presenting your Learning project, you will participate in a live Q&amp;A session. This session allows you to demonstrate your grasp of self-guided development of leadership skills through experiential learning, justify your decisions, and reflect on practical implications and real-world challenges.</p>\n<p><strong>Format &amp; Timing:</strong></p>\n<ul>\n<li>Each student has 10<strong> </strong>minutes to present and 5 minutes to respond to questions.</li>\n<li>Questions may be asked by the instructor and/or tutor.</li>\n</ul>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. The use of AI or MT must be referenced appropriately. Please see assessment guidelines in blackboard course site for specific instructions. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your Presentation, in the course Blackboard site, via the assessment's specific submission link by the due date and time. You should also retain an electronic copy of every piece of assessment you submit.  </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Learning project report",
            "special_indicators": [],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 29/05/2026 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Word limit: 3000 words</p>\n<p>The Leadership Project is an integral part of the learning process of the course. It is important that students not only learn in the workshop settings of the course, but also students \"learn by doing\". The learning project challenges students to plan <em>and conduct</em> a project where they apply principles and practices of leadership in a \"real life\" situation. This could include activities such as enhancing your leadership practice with an existing group or organisation, working with existing leaders, or contributing to a leadership initiative in everyday life. While activities such as enhancing your leadership practice with the workplace, an existing group or organisation are valuable, research also demonstrates leadership is effectively practised and developed in personal situations. The learning project can be based on a workplace, community or personal situation incorporating your normal work or personal interests. A suitable situation will allow you to develop all of Kouzes and Posner’s <em>Five Practices of Exemplary Leadership</em> while using Action Learning as a framework for learning and improvement<em>.</em></p>\n<p>An <em>excellent</em> project would include these steps:</p>\n<p>1.     Identify an existing situation that allows you to practise your leadership, ethically and constructively, without needing to organise a new activity. </p>\n<p>2.    Conscious application of the <em>Five Practices of Exemplary Leadership</em> to your chosen situation, alongside a range of other leadership concepts and techniques introduced during the course.</p>\n<p>3.     Use of at least two Learning Cycles that demonstrate your ability to learn from experience.</p>\n<p>4.     From your observations, identify how your knowledge, understanding, skills and attitudes to leadership have changed, as a result of taking conscious leadership action. This can include reflection on ‘leading the self first’ but 'leading self first' cannot be the main focus only.</p>\n<p>5.     Describe how you can apply and continue to grow leadership skills into the future.</p>\n<p>Note that allowing for your leadership project to be in a personal situation means that all students have the opportunity to practise leadership for their projects, regardless of being domestic or international students. Students can practise in family, shared household, student or cultural and sporting groups, or in recreational situations with friends.</p>\n<p>Participants must submit a written report on their learning project (3000 words, excluding the list of references but including in-text references). Full instructions will be given and discussed early in the semester. Your learning project report should build on your Project Plan but you will not be held to anything that you included in your original Project Plan.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your Assessment task, in Blackboard, via the Turnitin link by the submission deadline. You should also retain an electronic copy of every piece of assessment you submit.  </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(23 Feb - 31 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop series</strong><br><p>Please refer to the full timetable in the course Blackboard site. The workshops will be recorded. </p></br></p><p><strong>Sub-activity:</strong> Module 1: Introduction to Leadership Module 2: Leading Change Module 3: The individual in Leadership Module 4: Leading groups and teams Module 5: Leadership in negotiation Module 6: Leadership in practice</p></div></td>",
            "topic_title": "<strong>Workshop series</strong>",
            "topic_description": "Workshop series Please refer to the full timetable in the course Blackboard site. The workshops will be recorded. Sub-activity: Module 1: Introduction to Leadership Module 2: Leading Change Module 3: The individual in Leadership Module 4: Leading groups and teams Module 5: Leadership in negotiation Module 6: Leadership in practice",
            "learning_outcomes": []
        }
    ]
}