{
    "course_title": "Medical Anthropology: Local and Global Perspectives",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/ANTH2250-21486-7620",
    "full_course_code": "ANTH2250-21486-7620",
    "course_code": "ANTH2250",
    "class_code": "21486",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Identify, compare and apply the key theories, concepts, and ethnographic approaches of medical anthropology"
        },
        {
            "number": "LO2.",
            "description": "Demonstrate and reflect on how culture shapes illness experiences, health, and healing practices"
        },
        {
            "number": "LO3.",
            "description": "Design, conduct and analyse narrative interviews on health and illness"
        },
        {
            "number": "LO4.",
            "description": "Evaluate the critical medical anthropology approach to health"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Methodology Workshop (in class, Week 4)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 16/03/2026 4:50 pm</p>\n<p>\n</p><p>This assessment consists of 2 tasks that are to be completed in class time in person in Week 4, between 2pm-4:50pm.</p></dd>",
            "learning_objectives": "L03",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>During this class, students will complete in-person assessable work on methodology that will help prepare students for the Illness Narrative Essay (see Task 2). As this is an in-person task in class, no AI is permitted and use of AI may constitute misconduct. No preparation is needed other than reading the weekly assigned readings. There are two parts to this task.</p>\n<p>Part 1. (10%) Students are asked to work in small groups to discuss illness narrative interviews and practice analysing an interview transcript individually, with some group discussion. Together students will complete a short worksheet with questions related to these activities. This work will be completed on paper in class time and submitted to the course coordinator for marking.</p>\n<p>Part 2. (15%) Individual Interview Plan Worksheet. Students are asked to complete an individual worksheet with questions related to their plans for this task and submit it in class to the course coordinator for marking and feedback.</p>\n<p>Marking Criteria/Grading Explanation:</p>\n<p>Group worksheet: 5%</p>\n<p>Individual contribution to group discussion and workshop engagement / 5%</p>\n<p>Individual worksheet: Interview planning and preparation /5%; Key concept and ethical considerations /10%</p>\n<p>A marking rubric is available on Blackboard Ultra under 'Assessment'.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Worksheets completed in class will be submitted in paper format during class in Week 4.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Illness Narrative Interview & Essay",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>35%</dd>",
            "due_date": "<dd><p> 13/04/2026 1:00 pm</p></dd>",
            "learning_objectives": "L02, L03",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>An illness narrative is a personal story about an illness experience. Illness narratives are used by medical anthropologists to understand the patient’s experience with a disease and to connect their experience to cultural and social conditions in which they live. (See additional resources about illness narrative on Blackboard Ultra). You are asked to design and conduct, record, through transcription or detailed notes, an illness narrative interview with a relative, classmate or friend, and then write an essay on that interview which analyses their story, including some direct quotes that represent their experience, and interpret the social/cultural meanings of their experience. In this essay, you will demonstrate your ability to explain and apply the meaning-centred or interpretive approach in medical anthropology by describing, identifying, and analysing cultural and social influences on health and illness using quotes from your interviewee and supporting references from anthropology texts. Word limit: 1600 +/- 10%. <strong>Reference in APA 7th.</strong></p>\n<p>The marking criteria for this task are (1) analysis of the interview (2) application of theory (3) structure and expression. A Marking Rubric<strong> </strong>is available in the ‘Assessment’ folder in Blackboard Ultra for this course. The marking rubric contains more detailed information about the expectations, criteria, and standards for this task and you should read it prior to starting your assignment.</p>\n<p><strong>Statement regarding AI use: </strong>You are permitted to use AI in this task provided you acknowledge your use and <a href=\"https://guides.library.uq.edu.au/tools-and-techniques/ai-student-hub/ai-for-assessment\">the UQ rules for using AI in assessment</a>. Additional resources are available through <a href=\"https://web.library.uq.edu.au/study-and-learning-support/ai-student-hub\">UQ AI Student Hub</a>.</p>\n<p>Examples of appropriate use of AI:   </p>\n<p>·        Feedback on your planned structure or content.</p>\n<p>·        Find relevant articles, books and other resources.</p>\n<p>·        Summarise literature on the topic.</p>\n<p>·        Proofread your draft.</p>\n<p>·        Improve your grammar and sentence structure.</p>\n<p>·        Acknowledge and reference your use of AI in a coversheet or reference list. </p>\n<p>Examples of inappropriate use of AI</p>\n<p>·        Don't copy and paste AI-generated outputs directly into your essay</p>\n<p>·        Don't use AI-generated content if it will prevent you from meeting the learning outcomes for the task.</p>\n<p>·        Don't use AI to translate your essay from another language into English and copy the text into your essay if it will prevent you from demonstrating your learning for in-person assessment.</p>\n<p>·        Don't upload licensed or copyright protected materials into AI tools.</p>\n<p>Source: <a href=\"https://guides.library.uq.edu.au/tools-and-techniques/ai-student-hub/ai-for-assessment\">https://guides.library.uq.edu.au/tools-and-techniques/ai-student-hub/ai-for-assessment</a> See link for more advice and checklists for using AI.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assessment electronically by the due time, on the due date. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Final Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>6/06/2026 - 20/06/2026</p></dd>",
            "learning_objectives": "L01, L04",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students are asked to complete a final exam with a mix of multiple choice and short answer questions. This will be on paper, in-person, and timetabled by Central Examinations in the end of semester exam period. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introducing Medical Anthropology</strong><br/><p>This session introduces what medical anthropology is all about, including some of its history, and explains the course content and assessments. As with all the lectures in the course it will be a mix of lecture and discussion or small group work, so please look at the Course Profile and the course reading guide on Blackboard Ultra and read the first chapter of the Singer et al textbook. See reading details on Blackboard Ultra.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Introducing Medical Anthropology</strong>",
            "topic_description": "Introducing Medical Anthropology This session introduces what medical anthropology is all about, including some of its history, and explains the course content and assessments. As with all the lectures in the course it will be a mix of lecture and discussion or small group work, so please look at the Course Profile and the course reading guide on Blackboard Ultra and read the first chapter of the Singer et al textbook. See reading details on Blackboard Ultra.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 2(02 Mar - 08 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Theoretical Approaches in Medical Anthropology</strong><br/><p>In this class we introduce the three main theoretical approaches within medical anthropology - that is, the interpretive or meaning-centred approach, the critical approach, and the ecological approach. This seminar and discussion provides essential content for your understanding of medical anthropology.</p></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Theoretical Approaches in Medical Anthropology</strong>",
            "topic_description": "Theoretical Approaches in Medical Anthropology In this class we introduce the three main theoretical approaches within medical anthropology - that is, the interpretive or meaning-centred approach, the critical approach, and the ecological approach. This seminar and discussion provides essential content for your understanding of medical anthropology.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Cultural Concepts of Health and Illness</strong><br/><p>This class focuses on how culture influences understandings of health and disease and healing systems through the ideas of ethnomedicine and disease causation. These are the core ideas of interpretive medical anthropology.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Cultural Concepts of Health and Illness</strong>",
            "topic_description": "Cultural Concepts of Health and Illness This class focuses on how culture influences understandings of health and disease and healing systems through the ideas of ethnomedicine and disease causation. These are the core ideas of interpretive medical anthropology.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Methodologies of Medical Anthropology - Assessment Workshop</strong><br/><p>This class focuses on how medical anthropology is done in practice and the principles that guide its methods. It introduces the practice of anthropological interview and the illness narrative interview.</p>\n<p>During this class, students will complete in-person assessable work related to the Illness Narrative Essay. In particular, students are asked to work in groups on developing interview questions and to individually complete an Interview Plan. This work will be completed on paper in class time and submitted.</p>\n<p>Students with an approved extension or adjustment will be offered another opportunity to complete this task. See more information about the in-class assessment workshop in Assessment.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Methodologies of Medical Anthropology - Assessment Workshop</strong>",
            "topic_description": "Methodologies of Medical Anthropology - Assessment Workshop This class focuses on how medical anthropology is done in practice and the principles that guide its methods. It introduces the practice of anthropological interview and the illness narrative interview. During this class, students will complete in-person assessable work related to the Illness Narrative Essay. In particular, students are asked to work in groups on developing interview questions and to individually complete an Interview Plan. This work will be completed on paper in class time and submitted. Students with an approved extension or adjustment will be offered another opportunity to complete this task. See more information about the in-class assessment workshop in Assessment.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Gender and Health</strong><br/><p>Considerations of gender are essential to medical anthropology, and sexuality has often been an area of contention between medicine and anthropology. This class introduces the anthropology of genders and sexualities and shows how these cultural and embodied constructs intersect with health and health care.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Gender and Health</strong>",
            "topic_description": "Gender and Health Considerations of gender are essential to medical anthropology, and sexuality has often been an area of contention between medicine and anthropology. This class introduces the anthropology of genders and sexualities and shows how these cultural and embodied constructs intersect with health and health care.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Reflections and Consultation</strong><br/><p>In this class we will take time for reflection on the illness narrative interviews you have done. You will also have the opportunity to seek final advice on your Illness Narrative essay. No lecture/readings.</p></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Reflections and Consultation</strong>",
            "topic_description": "Reflections and Consultation In this class we will take time for reflection on the illness narrative interviews you have done. You will also have the opportunity to seek final advice on your Illness Narrative essay. No lecture/readings.",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Mid-sem break(06 Apr - 12 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-semester break - No class</strong><br/><p>There is no class meeting during the mid-semester break.</p></p></div></td>",
            "topic_title": "<strong>Mid-semester break - No class</strong>",
            "topic_description": "Mid-semester break - No class There is no class meeting during the mid-semester break.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Health Inequalities and Local Biologies  </strong><br/><p>In addition to looking at culture, medical anthropology also asks how inequalities (social, political, environmental) affect health - this lecture will introduce and explore critical medical anthropology and its key concepts, including how anthropology understands the determinants of health. Building on the introduction to health inequalities, this session focuses on the concept of 'local biologies' and uses it to analyse racial disparities and the effects of racism on health. </p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Health Inequalities and Local Biologies  </strong>",
            "topic_description": "Health Inequalities and Local Biologies In addition to looking at culture, medical anthropology also asks how inequalities (social, political, environmental) affect health - this lecture will introduce and explore critical medical anthropology and its key concepts, including how anthropology understands the determinants of health. Building on the introduction to health inequalities, this session focuses on the concept of 'local biologies' and uses it to analyse racial disparities and the effects of racism on health.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Biomedicine, Biotechnologies, and Biopolitics</strong><br/><p>This class focuses on the anthropology of biomedicine, including ideas of the body, and critiques of the power relations embedded in medical practices and systems. We also look at anthropological analyses of biotechnologies and how anthropologists contribute to emerging technologies.</p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Biomedicine, Biotechnologies, and Biopolitics</strong>",
            "topic_description": "Biomedicine, Biotechnologies, and Biopolitics This class focuses on the anthropology of biomedicine, including ideas of the body, and critiques of the power relations embedded in medical practices and systems. We also look at anthropological analyses of biotechnologies and how anthropologists contribute to emerging technologies.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Reproductive Health and Justice</strong><br/><p>This class begins by looking at how inequalities and culture shape reproduction (including fertility, pregnancy, birth, childrearing) and then investigates the idea of reproductive justice for improving reproductive health policies and interventions. </p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Reproductive Health and Justice</strong>",
            "topic_description": "Reproductive Health and Justice This class begins by looking at how inequalities and culture shape reproduction (including fertility, pregnancy, birth, childrearing) and then investigates the idea of reproductive justice for improving reproductive health policies and interventions.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10(04 May - 10 May)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Public Holiday</strong><br/><p>No class due to Public Holiday</p></p></div></td>",
            "topic_title": "<strong>Public Holiday</strong>",
            "topic_description": "Public Holiday No class due to Public Holiday",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Embodied Difference &amp; Disability Worlds</strong><br/><p>Bringing in insights from Disability Studies, this class focuses on social and cultural understandings of dis/ability, including inequalities, activism, and enduring questions of what is 'normal' and how to understand 'difference'.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Embodied Difference &amp; Disability Worlds</strong>",
            "topic_description": "Embodied Difference & Disability Worlds Bringing in insights from Disability Studies, this class focuses on social and cultural understandings of dis/ability, including inequalities, activism, and enduring questions of what is 'normal' and how to understand 'difference'.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12(18 May - 24 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Global Health and Medical Humanitarianism</strong><br/><p>Global health and medical humanitarianism are important areas of anthropological practice and innovation. In this class we discuss what anthropology brings to the study of globally common diseases and how anthropologists contribute to improving health issues like infectious disease, malaria, malnutrition and HIV/AIDS.</p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Global Health and Medical Humanitarianism</strong>",
            "topic_description": "Global Health and Medical Humanitarianism Global health and medical humanitarianism are important areas of anthropological practice and innovation. In this class we discuss what anthropology brings to the study of globally common diseases and how anthropologists contribute to improving health issues like infectious disease, malaria, malnutrition and HIV/AIDS.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13(25 May - 31 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Course Conclusion</strong><br/><p>In this class we will review key concepts from the course, prepare for the final exam, and explore future directions in medical anthropology.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Course Conclusion</strong>",
            "topic_description": "Course Conclusion In this class we will review key concepts from the course, prepare for the final exam, and explore future directions in medical anthropology.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        }
    ]
}