{
    "course_title": "Ethnographic Fieldwork",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/ANTH3090-21488-7620",
    "full_course_code": "ANTH3090-21488-7620",
    "course_code": "ANTH3090",
    "class_code": "21488",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Articulate the interrelatedness of theory and method in anthropology and how these inform ethnographic fieldwork."
        },
        {
            "number": "LO2.",
            "description": "Communicate effectively on the topics covered by the course."
        },
        {
            "number": "LO3.",
            "description": "Exhibit knowledge of specific local contexts in which anthropologists undertake research."
        },
        {
            "number": "LO4.",
            "description": "Apply the knowledge and skills gained through the study of anthropology to specific problems, challenges and opportunities."
        },
        {
            "number": "LO5.",
            "description": "Apply reflective analysis to theoretical, ethical and applied contexts."
        },
        {
            "number": "LO6.",
            "description": "Demonstrate and transfer anthropological knowledge and skills in written work and verbal presentation."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Pre-fieldwork report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 2/04/2026 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Short report (1000 words) on background research. Electronic submission to Blackboard (via Turnitin). The pre-fieldwork report must contain a review of some relevant background literature (anthropological articles, book chapters, etc) in order to demonstrate preliminary knowledge of the topic and subject matter. The report must:</p>\n<ul>\n<li>Briefly discuss the key academic concept you have chosen and refer to at least four pieces of academic (anthropological) literature.</li>\n<li>Include the key research question that will guide your work during the period of fieldwork. The relationship between your question and the broader academic concept should be clear. </li>\n<li>Briefly describe the proposed case study, where it will occur and with whom. Also explain your recruitment strategies and evaluate the feasibility of the case study.</li>\n<li>Outline the methodology for your project (including one or more references to relevant methodological literature), and explain how the method(s) are suitable to address the research question.</li>\n</ul>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>AI Use</strong>: This assessment task evaluates student’s abilities, skills and knowledge to engage with theory and social science methods to produce a scholarly research plan. AI tools that summarise the literature may be used to generate key points for further writing, but students should be aware that these tools often miss the subtleties of arguments, may misrepresent authors' ideas, and may not provide you with enough knowledge to devise an adequate review of relevant literature, including the readings and case studies discussed during class. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct. Additional resources are available through <a href=\"https://web.library.uq.edu.au/study-and-learning-support/ai-student-hub\">UQ AI Student Hub</a>.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assessment electronically by the due time, on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Reflections",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 13/04/2026 - 18/05/2026</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Each student submits a one-page reflection during weeks 7, 8, 9, 11 and 12. These reflections are hand-written at the end of class and then handed in. They are to be 1x A4 page maximum.</p>\n<p>These reflections should address a topic discussed during in-class discussions that week and include 1) a brief summary of the relevant issue brought up during in-class discussion, and 2) your personal reflection on the issue in terms of your own fieldwork experiences and how it speaks to one or more academic readings you have completed for the course so far.</p>\n<p>Each reflection is marked out of 10, but only the best three (3) reflections will be counted (for a maximum of 30 points). Active participation during <strong>in-class discussions</strong> will be important to these reflections.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>AI Use: </strong>This assessment task will be completed in-person. The use of Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The reflections are handed in during class in hardcopy (see Learning Activities for the schedule and Blackboard for further details). You must submit your assignment by the due time, on the due date. You will hand in all work for that week’s assessment at the end of the class for the relevant week.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Field notebook(s)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p> 29/05/2026 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Notebook/ Logbook",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>During the course you will undertake research training. During this training you are to record handwritten fieldnotes in one or more notebooks. You will receive instructions on such recording during the course. A copy of the field notebook(s) is to be submitted at the end of the course. You may scan the notebook(s) and submit via Blackboard. Please scan in medium resolution to ensure the electronic document is readable but not overly large in terms of megabytes. Also ensure the scan is one single document and has the correct page orientation throughout.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>Use of AI: </strong>This assessment task will be completed in-person. The use of Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via Blackboard (scanned notebook(s)) or hand-in the hardcopy of the field notebook(s) at the School of Social Science Administration Office (level 3, Michie Building).</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Case Study",
            "special_indicators": [],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 8/06/2026 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Your final assessment is the case study essay (2,500 words). It must be based on your field research and your review of relevant anthropological literature. </p>\n<p>Suggested structure/ subheadings for the essay:</p>\n<ol>\n<li>Introduction: The key academic concept and references to relevant academic literature, leading to the main research question. Briefly describe the methodology you have employed (including references), and how you have structured the essay.</li>\n<li>A brief literature review (this is a more detailed evaluation of the literature referred to in the introduction. The focus should be on the methods employed by the authors of the works you engage with and what you see as the benefits and potential shortcomings of their approach).</li>\n<li>Data section (use a relevant subheading)</li>\n<li>Reflection. This reflection should reflect on your own fieldwork in the context of the methods discussed in the literature review. Indicate the most illuminating insights arising from your field research and what you have learned about benefits and challenges of ethnographic field research.</li>\n<li>Reference List</li>\n</ol>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>Use of AI: </strong>This assessment task evaluates student’s abilities, skills and knowledge to engage with theory and social science methods to produce a scholarly essay. AI tools that summarise the literature may be used to generate key points for further writing, but students should be aware that these tools often miss the subtleties of arguments, may misrepresent authors' ideas, and may not provide you with enough knowledge to devise an adequate review of relevant literature, including the readings and case studies discussed during class. AI may also misrepresent your original fieldwork data. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct. Additional resources are available through <a href=\"https://web.library.uq.edu.au/study-and-learning-support/ai-student-hub\">UQ AI Student Hub</a>.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assessment electronically by the due time, on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Course overview and introduction to ethnography and fieldwork</strong><br/><p>Class discussion about expectations, responsibilities and the basics of ethnography. Students will form pairs, and have a brief conversation about their experiences of anthropology and what might be an interesting case study on campus to undertake during the course. Students record these conversations in a separate field notebook (bring a notebook and pen to class each week). We finish with a class discussion about the themes emerging from the written notes about the experiences and case studies. We will organise thematic peer groups for on-campus ethnographic fieldwork.</p>\n<p>Introduction to ethnography, fieldwork &amp; overview</p>\n<p>What is the theory and practice of ethnography? You are expected to have read the first chapter of the text book (Madden 2017), Hart (1988) and the website 'Fieldwork: Making Anthropological Knowledge' prior to attending the class.</p></p></div></td>",
            "topic_title": "<strong>Course overview and introduction to ethnography and fieldwork</strong>",
            "topic_description": "Course overview and introduction to ethnography and fieldwork Class discussion about expectations, responsibilities and the basics of ethnography. Students will form pairs, and have a brief conversation about their experiences of anthropology and what might be an interesting case study on campus to undertake during the course. Students record these conversations in a separate field notebook (bring a notebook and pen to class each week). We finish with a class discussion about the themes emerging from the written notes about the experiences and case studies. We will organise thematic peer groups for on-campus ethnographic fieldwork. Introduction to ethnography, fieldwork & overview What is the theory and practice of ethnography? You are expected to have read the first chapter of the text book (Madden 2017), Hart (1988) and the website 'Fieldwork: Making Anthropological Knowledge' prior to attending the class.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(02 Mar - 08 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The field and observation</strong><br/><p>How can you plan and structure seeing? This class will begin with a brief unstructured observation, followed by discussion and a short period of more structured observation. Students make written notes in their field notebook. To prepare for the observations, students should read Price (2007)</p>\n<p>'The field' and ethnographic observation</p>\n<p>Where is the field? If the field is traditionally considered a far off-place in anthropology, what about ethnography done at home? Do we need to think of the field as a strange place in order for ethnographic practice to work? To prepare, students must read Madden, chapter 2 and chapter 5.</p></p></div></td>",
            "topic_title": "<strong>The field and observation</strong>",
            "topic_description": "The field and observation How can you plan and structure seeing? This class will begin with a brief unstructured observation, followed by discussion and a short period of more structured observation. Students make written notes in their field notebook. To prepare for the observations, students should read Price (2007) 'The field' and ethnographic observation Where is the field? If the field is traditionally considered a far off-place in anthropology, what about ethnography done at home? Do we need to think of the field as a strange place in order for ethnographic practice to work? To prepare, students must read Madden, chapter 2 and chapter 5.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ethics</strong><br/><p>In pairs, students will have a conversation about ethics and subjectivity in research. Students take written notes during these conversations. In the final discussion, we aim to identify themes emerging from the notes.</p>\n<p>Planning ethnographic research and ethics</p>\n<p>What are the moral and ethical dimensions of contemporary ethnographic research? We will consider what kinds of methods are appropriate where, for whom and when (Readings: Schepper-Hughes 2009 and Madden chapter 4).</p></p></div></td>",
            "topic_title": "<strong>Ethics</strong>",
            "topic_description": "Ethics In pairs, students will have a conversation about ethics and subjectivity in research. Students take written notes during these conversations. In the final discussion, we aim to identify themes emerging from the notes. Planning ethnographic research and ethics What are the moral and ethical dimensions of contemporary ethnographic research? We will consider what kinds of methods are appropriate where, for whom and when (Readings: Schepper-Hughes 2009 and Madden chapter 4).",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Interviewing and 'the group'</strong><br/><p>In pairs, students will disucss and take notes about the group chosen for preliminary study. What are some of the key defining characteristics of the group, what forms of diversity exist, and what makes the project interesting? In preparation, read Spradley (1979) on interview techniques and Madden (Chapter 3).</p>\n<p>The question of group, community &amp; society</p>\n<p>We will discuss how others have described the problem of writing about community and examine anthropological concepts such as group and society. For discussion, make notes about your own case study and the nature of the group or community based on the approaches described in the readings.</p></p></div></td>",
            "topic_title": "<strong>Interviewing and 'the group'</strong>",
            "topic_description": "Interviewing and 'the group' In pairs, students will disucss and take notes about the group chosen for preliminary study. What are some of the key defining characteristics of the group, what forms of diversity exist, and what makes the project interesting? In preparation, read Spradley (1979) on interview techniques and Madden (Chapter 3). The question of group, community & society We will discuss how others have described the problem of writing about community and examine anthropological concepts such as group and society. For discussion, make notes about your own case study and the nature of the group or community based on the approaches described in the readings.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Notes, coding and analysis</strong><br/><p>Writing fieldnotes and interpreting their contents. How do anthropologists construct field notes (about the nature of society, group or community, for example)? We will discuss the practice of note taking, coding and preliminary analysis of data. Bring your preliminary bibliography and any annotations you have made to class to assist in discussion.</p>\n<p>Interpreting human worlds</p>\n<p>How do we turn the experiences and observations from the field into research data? What kind of relationship is there between observation and description? At what point does interpretive work begin? Prepare by reading the Madden text (chapters 6 and 7) and Sanjek's chapter. </p></p></div></td>",
            "topic_title": "<strong>Notes, coding and analysis</strong>",
            "topic_description": "Notes, coding and analysis Writing fieldnotes and interpreting their contents. How do anthropologists construct field notes (about the nature of society, group or community, for example)? We will discuss the practice of note taking, coding and preliminary analysis of data. Bring your preliminary bibliography and any annotations you have made to class to assist in discussion. Interpreting human worlds How do we turn the experiences and observations from the field into research data? What kind of relationship is there between observation and description? At what point does interpretive work begin? Prepare by reading the Madden text (chapters 6 and 7) and Sanjek's chapter.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Questions and Planning</strong><br/><p>In groups, students discuss their draft pre-fieldwork reports, including the research question for their case study. Students should also devise a preliminary interview guide and a guide for any observations. How do these guides address the research question(s) and how do they speak to the relevant anthropological literature? What is practically required from here to complete your mini ethnographic case study? Students make written notes in their field notebook about these conversations.</p>\n<p>Approaches to ethnographic fieldwork: How do we come up with a good research question and how do we manage the practicalities of fieldwork?</p></p></div></td>",
            "topic_title": "<strong>Questions and Planning</strong>",
            "topic_description": "Questions and Planning In groups, students discuss their draft pre-fieldwork reports, including the research question for their case study. Students should also devise a preliminary interview guide and a guide for any observations. How do these guides address the research question(s) and how do they speak to the relevant anthropological literature? What is practically required from here to complete your mini ethnographic case study? Students make written notes in their field notebook about these conversations. Approaches to ethnographic fieldwork: How do we come up with a good research question and how do we manage the practicalities of fieldwork?",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In-class fieldwork reflection 1</strong><br/><p>Submit your hand-written one-page fieldwork reflection in class and participate in subsequent discussion to provide mutual support (see Blackboard assessment details).</p></p></div></td>",
            "topic_title": "<strong>In-class fieldwork reflection 1</strong>",
            "topic_description": "In-class fieldwork reflection 1 Submit your hand-written one-page fieldwork reflection in class and participate in subsequent discussion to provide mutual support (see Blackboard assessment details).",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In-class fieldwork reflection 2</strong><br/><p>Submit your hand-written one-page fieldwork reflection in class and participate in subsequent discussion to provide mutual support (see Blackboard assessment details).</p></p></div></td>",
            "topic_title": "<strong>In-class fieldwork reflection 2</strong>",
            "topic_description": "In-class fieldwork reflection 2 Submit your hand-written one-page fieldwork reflection in class and participate in subsequent discussion to provide mutual support (see Blackboard assessment details).",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In-class fieldwork reflection 3</strong><br/><p>Submit your hand-written one-page fieldwork reflection in class and participate in subsequent discussion to provide mutual support (see Blackboard assessment details).</p></p></div></td>",
            "topic_title": "<strong>In-class fieldwork reflection 3</strong>",
            "topic_description": "In-class fieldwork reflection 3 Submit your hand-written one-page fieldwork reflection in class and participate in subsequent discussion to provide mutual support (see Blackboard assessment details).",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(04 May - 10 May)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Public holdiay: no class</strong><br/></p></div></td>",
            "topic_title": "<strong>Public holdiay: no class</strong>",
            "topic_description": "Public holdiay: no class",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In-class fieldwork reflection 4</strong><br/><p>Submit your hand-written one-page fieldwork reflection in class and participate in subsequent discussion to provide mutual support (see Blackboard assessment details).</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>In-class fieldwork reflection 4</strong>",
            "topic_description": "In-class fieldwork reflection 4 Submit your hand-written one-page fieldwork reflection in class and participate in subsequent discussion to provide mutual support (see Blackboard assessment details).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 12(18 May - 24 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In-class fieldwork reflection 5</strong><br/><p>Submit your hand-written one-page fieldwork reflection in class and participate in subsequent discussion to provide mutual support (see Blackboard assessment details).</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>In-class fieldwork reflection 5</strong>",
            "topic_description": "In-class fieldwork reflection 5 Submit your hand-written one-page fieldwork reflection in class and participate in subsequent discussion to provide mutual support (see Blackboard assessment details).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 13(25 May - 31 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Evaluating ethnographic fieldwork and essay submission preparation</strong><br/><p>Course recap and preparation for the final assessment. In-class discussion and feedback on the fieldwork training undertaken during the course. For discussion and feedback, bring a draft structure of the essay and include some key fieldwork quotes or observations that illustrate a key point you may wish to make in the essay.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Evaluating ethnographic fieldwork and essay submission preparation</strong>",
            "topic_description": "Evaluating ethnographic fieldwork and essay submission preparation Course recap and preparation for the final assessment. In-class discussion and feedback on the fieldwork training undertaken during the course. For discussion and feedback, bring a draft structure of the essay and include some key fieldwork quotes or observations that illustrate a key point you may wish to make in the essay.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        }
    ]
}