{
    "course_title": "Plants and Archaeology: Food, fuel, foraging and farming in the human past",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/ARCS2080-20848-7620",
    "full_course_code": "ARCS2080-20848-7620",
    "course_code": "ARCS2080",
    "class_code": "20848",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand the general principles, methods and theory of archaeobotany"
        },
        {
            "number": "LO2.",
            "description": "Apply the analytical and theoretical approaches commonly used in archaeobotany to address research questions and understand human-plant interaction in the past"
        },
        {
            "number": "LO3.",
            "description": "Demonstrate critical understanding of the major methodological issues in archaeobotany and their impact on interpretation"
        },
        {
            "number": "LO4.",
            "description": "Understand the broader significance of archaeobotanical data to major archaeological and transdisciplinary questions and their appropriate application in these contexts"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Practical approaches in archaeobotany",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 16/03/2026 - 27/04/2026</p>\n<p>\n</p><p>Quizzes are completed  in the first 30 minutes of the scheduled practical class in each week from weeks 4-9 of semester. Quizzes will be completed and submitted in class under exam conditions (closed book and no conferral allowed)</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<ul>\n<li>This progressive assessment tests your understanding of the practical classes on plant macrofossils and microfossils, including the techniques applied in their analysis and interpretation.</li>\n<li>The assessment consists of 6 (six) quizzes that are completed weekly and in-person in the first 30 minutes of practical classes during weeks 4-9 of ARCS2080.</li>\n<li>Each quiz tests knowledge sequentially from the preceding practical class and associated learning (relevant online module and reading). For example the week 6 quiz will test the content of week 5's practical class and relevant case studies and knowledge from that week's lecture and resources from the reading list.</li>\n<li>Quizzes will be completed in-person during class time using pencils/pens using paper. You must bring your own pens/pencils to class.</li>\n<li>Each quiz consists of a series of short answer, multiple-choice and other multiform questions. You will not be asked to complete complex calculations but rather answer specific methodological questions and interpret datasets.</li>\n<li>You will have 30 minutes to complete each quiz.</li>\n<li>Your 50% mark will be calculated using the top 4 scores from the 6 weekly quizzes.</li>\n</ul>\n<p>This assessment comprises the secure (identity verified) assessment requirement for ARCS2080 in line with UQ assessment policy.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You will complete and submit the quiz paper in class during the specified time.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "ARCS2080 Report: Archaeobotany methodology statement and recommendation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 11/06/2026 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assignment tests the knowledge gained throughout ARCS2080 by applying it to a scenario-based project in which you will prepare a report for an Indigenous partner organisation. The report will present a recommendation identifying which archaeobotany methods should be used in a range of archaeological sites in a remote region of Australia to collect information about past societies and cultural change there. The report requires you to use comparative studies (cited peer-review papers) to justify your recommendations, and will evaluate the potential of the methods studied in ARCS2080 to provide information about the past in sites that have varying preservation and study potential. The partner organisation is particularly interested in understanding whether there is evidence for farming on their Country (covered in weeks 9-12 of the course) and how the research might help to improve management of Country in the future (week 13).</p>\n<p>The report will be explained, answered and marked using the Inspera Assessment platform via a link in the Assessments folder for this course found in Blackboard:</p>\n<ul>\n<li>Find more information about using Inspera Assessment from the <a href=\"https://web.library.uq.edu.au/library-services/it/learnuq-blackboard-help/inspera-assessment/your-assessments-inspera\">Library website</a>, which provides the latest information for students about using Inspera.</li>\n<li>To see what the interface looks like, please try out the Inspera demonstration test <a href=\"https://uqi.inspera.com/player/?assessmentRunId=120146679&amp;context=exam#/\">here</a>. This shows you the assessment interface using some test questions. Remember, Inspera is a university wide-platform, so there may be some question types in the demo that are not relevant to your discipline.</li>\n<li>To complete the assessment, you will require access to laptop/desktop computer that <a href=\"https://web.library.uq.edu.au/library-services/it/learnuq-blackboard-help/inspera-assessment/get-familiar-inspera#1\">meets the device requirements for Inspera</a> assessments. It is important that you check that your laptop meets the device requirements for using the Inspera Assessment platform. If you do not own a suitable laptop, you can <a href=\"https://web.library.uq.edu.au/library-services/it/laptop-loans\">borrow one from the Library</a> or book use of a <a href=\"https://web.library.uq.edu.au/library-services/it/computers-library\">desktop computer in the library</a>.</li>\n</ul>\n<p>The report will follow a specified structure, as detailed in Inspera.</p>\n<p>Answers should be in standard English prose, use appropriate disciplinary language and conventions, including full in-text citations and supporting references using APA style, and submitted via Inspera by the specified date and time. You may use tables and charts as required by the task, each with a clearly numbered caption. A reference list will be included.</p>\n<p><strong><em>Artificial Intelligence (AI) and Machine Translation (MT)</em></strong> are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. Classes will discuss the appropriate use of AI in this assessment, should you wish to use it. Additional resources are available through <a href=\"https://web.library.uq.edu.au/study-and-learning-support/ai-student-hub\"><em>UQ AI Student Hub</em></a>.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Why study plants in archaeology?</strong><br><p>ONLINE CLASS IN UQ EXTEND: This module introduces the scope, origins, history and importance of archaeobotany, providing the intellectual foundation for the course. Watch before class in Week 1.</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Why study plants in archaeology?</strong>",
            "topic_description": "Why study plants in archaeology? ONLINE CLASS IN UQ EXTEND: This module introduces the scope, origins, history and importance of archaeobotany, providing the intellectual foundation for the course. Watch before class in Week 1.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Welcome to Plants and Archaeology</strong><br/><p>This foundation lab session introduces the course, its aims, assessment and structure, building on the online module to explore why you should care about plants and the human past as archaeologists in training. Includes workshop activities on \"what are plants?\" and \"why are plants important?\" and a class Q&amp;A to resolve any uncertainties about the course. We also introduce our study area for Assessment 2, which you will prepare for during the whole course.</p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Welcome to Plants and Archaeology</strong>",
            "topic_description": "Welcome to Plants and Archaeology This foundation lab session introduces the course, its aims, assessment and structure, building on the online module to explore why you should care about plants and the human past as archaeologists in training. Includes workshop activities on \"what are plants?\" and \"why are plants important?\" and a class Q&A to resolve any uncertainties about the course. We also introduce our study area for Assessment 2, which you will prepare for during the whole course.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(02 Mar - 08 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Plants as food: Preservation and identification</strong><br/><p>ONLINE CLASS IN UQ EXTEND: Plant foods are a vital part of life, but hard to study in the past as their physical remains often are not preserved very well. After introducing what foods are, week explore how we can reconstruct the history of plant foods using archaeobotanical tools and a range of artefact and scientific approaches. As well as considering the variety of evidence, we consider how formation processes affect which foods we find, but also how taphonomy - the study of preservation - allows us to predict what we will find in specific environments and sites, empowering us to reconstruct food histories.</p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Plants as food: Preservation and identification</strong>",
            "topic_description": "Plants as food: Preservation and identification ONLINE CLASS IN UQ EXTEND: Plant foods are a vital part of life, but hard to study in the past as their physical remains often are not preserved very well. After introducing what foods are, week explore how we can reconstruct the history of plant foods using archaeobotanical tools and a range of artefact and scientific approaches. As well as considering the variety of evidence, we consider how formation processes affect which foods we find, but also how taphonomy - the study of preservation - allows us to predict what we will find in specific environments and sites, empowering us to reconstruct food histories.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(02 Mar - 08 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module A: The diversity of plant remains</strong><br/><p>In class we explore the types of plant remains found in archaeological sites, macrofossils and mincrofossils, and find out when and why they are preserved. This session introduces the main microscopy methods used in the practical classes and also the scientific standards expected in our work.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Module A: The diversity of plant remains</strong>",
            "topic_description": "Module A: The diversity of plant remains In class we explore the types of plant remains found in archaeological sites, macrofossils and mincrofossils, and find out when and why they are preserved. This session introduces the main microscopy methods used in the practical classes and also the scientific standards expected in our work.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Plant foods and human evolution</strong><br/><p>ONLINE CLASS IN UQ EXTEND: This week we dig deep to explore how plant foods shaped human evolution, including the development of <em>Homo sapiens</em> and our huge brains. Forget all that nonsense about 'man the hunter' and find out how plant-based nutrition has been a part of our lives for millennia and was essential in making us human.</p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Plant foods and human evolution</strong>",
            "topic_description": "Plant foods and human evolution ONLINE CLASS IN UQ EXTEND: This week we dig deep to explore how plant foods shaped human evolution, including the development of Homo sapiens and our huge brains. Forget all that nonsense about 'man the hunter' and find out how plant-based nutrition has been a part of our lives for millennia and was essential in making us human.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module B, Plant Macrofossils. Practical 1: The wonderful world of seeds!</strong><br/><p>This week we explore the wonders of seeds, the most commonly analysed and significant plant macrofossils in archaeobotany. We will look at how they are identified, including understanding the significance of landmarks and standard orientations in our work, and consider some of the challenges of quantification.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Module B, Plant Macrofossils. Practical 1: The wonderful world of seeds!</strong>",
            "topic_description": "Module B, Plant Macrofossils. Practical 1: The wonderful world of seeds! This week we explore the wonders of seeds, the most commonly analysed and significant plant macrofossils in archaeobotany. We will look at how they are identified, including understanding the significance of landmarks and standard orientations in our work, and consider some of the challenges of quantification.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Altered states: plants as medicines &amp; intoxicants</strong><br/><p>ONLINE CLASS IN UQ EXTEND: When did medicines and intoxicants such as drugs and alcohol appear in the human career, how do we know and what effect did they have on human culture change? Simple questions, but ones that have challenged archaeobotanists to develop new techniques and radically change our understanding of an important aspect of human life.</p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Altered states: plants as medicines &amp; intoxicants</strong>",
            "topic_description": "Altered states: plants as medicines & intoxicants ONLINE CLASS IN UQ EXTEND: When did medicines and intoxicants such as drugs and alcohol appear in the human career, how do we know and what effect did they have on human culture change? Simple questions, but ones that have challenged archaeobotanists to develop new techniques and radically change our understanding of an important aspect of human life.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module B, Plant Macrofossils. Practical 2: Crop remains in archaeobotany</strong><br/><p>Crop remains are fundamentally important for understanding ancient economies and the history of agriculture across the world. We look into the seeds, chaff, straw and other elements that are preserved and discuss how assemblage analysis has transformed our understanding of past farming systems.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Module B, Plant Macrofossils. Practical 2: Crop remains in archaeobotany</strong>",
            "topic_description": "Module B, Plant Macrofossils. Practical 2: Crop remains in archaeobotany Crop remains are fundamentally important for understanding ancient economies and the history of agriculture across the world. We look into the seeds, chaff, straw and other elements that are preserved and discuss how assemblage analysis has transformed our understanding of past farming systems.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Plants in ancient architecture, crafts and industry</strong><br/><p>ONLINE CLASS IN UQ EXTEND: Plant products, including wood, fibres, waxes and stems have been used to produce everything from buildings and artefacts to clothing and ornaments. This week we survey the history of plants beyond food and intoxicants from the Pleistocene to modern world.</p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Plants in ancient architecture, crafts and industry</strong>",
            "topic_description": "Plants in ancient architecture, crafts and industry ONLINE CLASS IN UQ EXTEND: Plant products, including wood, fibres, waxes and stems have been used to produce everything from buildings and artefacts to clothing and ornaments. This week we survey the history of plants beyond food and intoxicants from the Pleistocene to modern world.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module B, Plant Macrofossils. Practical 3: Fruits and nuts</strong><br/><p>This week we look at the diversity of fruit, nut and wild seed structures we find in archaeology and explore further how we can use measurements and simple statistics to understand their identity and use.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Module B, Plant Macrofossils. Practical 3: Fruits and nuts</strong>",
            "topic_description": "Module B, Plant Macrofossils. Practical 3: Fruits and nuts This week we look at the diversity of fruit, nut and wild seed structures we find in archaeology and explore further how we can use measurements and simple statistics to understand their identity and use.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Plant trade, exchange and ancient globalisation</strong><br/><p>ONLINE CLASS IN UQ EXTEND: Plants have been widely traded for millennia and that trade drove significant cultural, economic and social transformations in the deep past. In this lecture we look at how archaeology can reconstruct plant trade and some key studies of its history from the origins of agriculture and sedentism, to the origins of states, globalisation and European colonialism.</p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Plant trade, exchange and ancient globalisation</strong>",
            "topic_description": "Plant trade, exchange and ancient globalisation ONLINE CLASS IN UQ EXTEND: Plants have been widely traded for millennia and that trade drove significant cultural, economic and social transformations in the deep past. In this lecture we look at how archaeology can reconstruct plant trade and some key studies of its history from the origins of agriculture and sedentism, to the origins of states, globalisation and European colonialism.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module B, Plant Macrofossils. Practical 4: Indeterminate plant remains (wood and USO's)</strong><br/><p>Indeterminate plant remains are fragments of larger plant structures, such as woody stems, that lack clear morphology and can't be resolved into whole items, as is the case with seeds. This week introduces the largely anatomical approaches we use to identify them, including wood charcoals and underground storage organs (think potatoes). Using wood charcoals as an example we also explore how to analyse indeterminate remains to reconstruct plant economies and landscape change.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Module B, Plant Macrofossils. Practical 4: Indeterminate plant remains (wood and USO's)</strong>",
            "topic_description": "Module B, Plant Macrofossils. Practical 4: Indeterminate plant remains (wood and USO's) Indeterminate plant remains are fragments of larger plant structures, such as woody stems, that lack clear morphology and can't be resolved into whole items, as is the case with seeds. This week introduces the largely anatomical approaches we use to identify them, including wood charcoals and underground storage organs (think potatoes). Using wood charcoals as an example we also explore how to analyse indeterminate remains to reconstruct plant economies and landscape change.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Fuels and landscape management</strong><br/><p>ONLINE CLASS IN UQ EXTEND: As the main source of fuels for heat, cooking and industry, woodland and forests have been a major focus for landscape modification and management, and we look at how fuel histories can be constructed and what they tell us in a story now extending into the Pleistocene. </p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Fuels and landscape management</strong>",
            "topic_description": "Fuels and landscape management ONLINE CLASS IN UQ EXTEND: As the main source of fuels for heat, cooking and industry, woodland and forests have been a major focus for landscape modification and management, and we look at how fuel histories can be constructed and what they tell us in a story now extending into the Pleistocene.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module C, Plant microfossils. Practical 1: </strong><br/></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Module C, Plant microfossils. Practical 1: </strong>",
            "topic_description": "Module C, Plant microfossils. Practical 1:",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Gathering for a living</strong><br/><p>ONLINE CLASS IN UQ EXTEND: This week we start our exploration into the diverse ways humans have sustained themselves. We begin with foraging, also known as hunting and gathering, in which plants are harvested from natural vegetation growth. Sustaining humans since we first evolved, foraging has a deep and diverse history and with ever better methods we have increasingly detailed data from archaeological sites. Food is, however, not just about nutrition, and we also explore how food acquisition and sharing has developed as a key element of social behaviour.</p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Gathering for a living</strong>",
            "topic_description": "Gathering for a living ONLINE CLASS IN UQ EXTEND: This week we start our exploration into the diverse ways humans have sustained themselves. We begin with foraging, also known as hunting and gathering, in which plants are harvested from natural vegetation growth. Sustaining humans since we first evolved, foraging has a deep and diverse history and with ever better methods we have increasingly detailed data from archaeological sites. Food is, however, not just about nutrition, and we also explore how food acquisition and sharing has developed as a key element of social behaviour.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module C, Plant microfossils. Practical 2: </strong><br/></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Module C, Plant microfossils. Practical 2: </strong>",
            "topic_description": "Module C, Plant microfossils. Practical 2:",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Agriculture, cultivation and domestication</strong><br/><p>ONLINE CLASS IN UQ EXTEND: Agriculture is the production of food and other resources from plants (and animals) that are managed and domesticated - meaning they are under human control and selection - and the world's vast population and complex global society is built on it. This week we consider the diversity of agricultural systems and the key concepts cultivation and domestication.</p>\n<p><br/></p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Agriculture, cultivation and domestication</strong>",
            "topic_description": "Agriculture, cultivation and domestication ONLINE CLASS IN UQ EXTEND: Agriculture is the production of food and other resources from plants (and animals) that are managed and domesticated - meaning they are under human control and selection - and the world's vast population and complex global society is built on it. This week we consider the diversity of agricultural systems and the key concepts cultivation and domestication.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module D, Recovering plant remains. Practical 1: Manual/bucket flotation</strong><br><p>At UQ's ATARC, we will explore how to extract plant remains via flotation. We begin by considering the aims of such recovery, its logistics and design, learning how to float samples using bucket flotation! This is an active practice in which you will get wet and muddy. See Blackboard for note on appropriate clothing and footwear.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Module D, Recovering plant remains. Practical 1: Manual/bucket flotation</strong>",
            "topic_description": "Module D, Recovering plant remains. Practical 1: Manual/bucket flotation At UQ's ATARC, we will explore how to extract plant remains via flotation. We begin by considering the aims of such recovery, its logistics and design, learning how to float samples using bucket flotation! This is an active practice in which you will get wet and muddy. See Blackboard for note on appropriate clothing and footwear.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 10(04 May - 10 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Global perspectives on the origins of agriculture</strong><br/><p>ONLINE CLASS IN UQ EXTEND: Today's global society is built on the ancient and diverse foundations of ancient farming systems. This week we explore how archaeobotany has contributed to explaining where, when and why farming started at diverse places around the world in the deep past.</p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Global perspectives on the origins of agriculture</strong>",
            "topic_description": "Global perspectives on the origins of agriculture ONLINE CLASS IN UQ EXTEND: Today's global society is built on the ancient and diverse foundations of ancient farming systems. This week we explore how archaeobotany has contributed to explaining where, when and why farming started at diverse places around the world in the deep past.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10(04 May - 10 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module D, Recovering plant remains. Practical 2: Machine and hand pump flotation</strong><br/><p>At UQ's ATARC we explore the wonders of machine and hand pump flotation, which allow larger scale processing of soil samples. This is an active practice in which you will get wet and muddy. See Blackboard for note on appropriate clothing and footwear.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Module D, Recovering plant remains. Practical 2: Machine and hand pump flotation</strong>",
            "topic_description": "Module D, Recovering plant remains. Practical 2: Machine and hand pump flotation At UQ's ATARC we explore the wonders of machine and hand pump flotation, which allow larger scale processing of soil samples. This is an active practice in which you will get wet and muddy. See Blackboard for note on appropriate clothing and footwear.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Agriculture's ancient diversification and intensification</strong><br/><p>ONLINE CLASS IN UQ EXTEND: Agriculture has undergone significant changes as it spread and developed around the world. This week we look at some important moments of transformation, including the development of mixed farming, intensification, the secondary products revolution and the effects of trade on farming systems in some of the world's earliest examples of globalisation.</p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Agriculture's ancient diversification and intensification</strong>",
            "topic_description": "Agriculture's ancient diversification and intensification ONLINE CLASS IN UQ EXTEND: Agriculture has undergone significant changes as it spread and developed around the world. This week we look at some important moments of transformation, including the development of mixed farming, intensification, the secondary products revolution and the effects of trade on farming systems in some of the world's earliest examples of globalisation.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module D, Recovering plant remains. Practical 3: Machine and hand pump flotation (continued)</strong><br/><p>We continue and conclude our exploration of machine and hand pump flotation. This is an active practice in which you will get wet and muddy. See Blackboard for note on appropriate clothing and footwear.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Module D, Recovering plant remains. Practical 3: Machine and hand pump flotation (continued)</strong>",
            "topic_description": "Module D, Recovering plant remains. Practical 3: Machine and hand pump flotation (continued) We continue and conclude our exploration of machine and hand pump flotation. This is an active practice in which you will get wet and muddy. See Blackboard for note on appropriate clothing and footwear.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 12(18 May - 24 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Was Australia really a farming bystander? Evaluating Bruce Pascoe's \"Dark Emu\"</strong><br/><p>ONLINE CLASS IN UQ EXTEND: This week we look into the issue of how Australia's first people's exploited and shaped the landscape of this continent, including discussing whether they ever developed farming as proposed by Bruce Pascoe in his controversial work \"Dark Emu\".</p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Was Australia really a farming bystander? Evaluating Bruce Pascoe's \"Dark Emu\"</strong>",
            "topic_description": "Was Australia really a farming bystander? Evaluating Bruce Pascoe's \"Dark Emu\" ONLINE CLASS IN UQ EXTEND: This week we look into the issue of how Australia's first people's exploited and shaped the landscape of this continent, including discussing whether they ever developed farming as proposed by Bruce Pascoe in his controversial work \"Dark Emu\".",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12(18 May - 24 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module D, Recovering plant remains. Practical 4: Laboratory recovery and sample curation</strong><br/><p>We explore what is recovered by flotation and recovery rates, what we do next in the lab to extract plant remains, how we approach microfossil recovery and how to curate samples for the future.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Module D, Recovering plant remains. Practical 4: Laboratory recovery and sample curation</strong>",
            "topic_description": "Module D, Recovering plant remains. Practical 4: Laboratory recovery and sample curation We explore what is recovered by flotation and recovery rates, what we do next in the lab to extract plant remains, how we approach microfossil recovery and how to curate samples for the future.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 13(25 May - 31 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Archaeobotany &amp; the challenges of the Anthropocene</strong><br/><p>ONLINE CLASS IN UQ EXTEND: An understanding of past plant use and landscapes from archaeology is increasingly being used to revitalise and improve resilience of cultures, economies and landscapes today in the face of an unpredictable future. We conclude our course by exploring the potential and future of archaeobotany in the wider world.</p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Archaeobotany &amp; the challenges of the Anthropocene</strong>",
            "topic_description": "Archaeobotany & the challenges of the Anthropocene ONLINE CLASS IN UQ EXTEND: An understanding of past plant use and landscapes from archaeology is increasingly being used to revitalise and improve resilience of cultures, economies and landscapes today in the face of an unpredictable future. We conclude our course by exploring the potential and future of archaeobotany in the wider world.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13(25 May - 31 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Preparing your ARCS2080 Report (Assessment 3)</strong><br/><p>In this workshop we discuss your final assessment and undertake exercises to help complete research for your report. Bring your questions!</p></p></div></td>",
            "topic_title": "<strong>Preparing your ARCS2080 Report (Assessment 3)</strong>",
            "topic_description": "Preparing your ARCS2080 Report (Assessment 3) In this workshop we discuss your final assessment and undertake exercises to help complete research for your report. Bring your questions!",
            "learning_outcomes": []
        }
    ]
}