{
    "course_title": "Forensics: The Archaeology of Death & Crime Scenes",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/ARCS2003-20914-7620",
    "full_course_code": "ARCS2003-20914-7620",
    "course_code": "ARCS2003",
    "class_code": "20914",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Identify and describe characteristics of basic human skeletal anatomy (including naming and siding skeletal elements)"
        },
        {
            "number": "LO2.",
            "description": "Apply human skeletal anatomy knowledge and forensic anthropological techniques in creating a biological profile from human remains for forensic reporting purposes"
        },
        {
            "number": "LO3.",
            "description": "Describe and explain the natural processes occurring at and after human death, and cultural response to death"
        },
        {
            "number": "LO4.",
            "description": "Describe archaeological search and recovery techniques, and apply recording techniques in forensic context investigations"
        },
        {
            "number": "LO5.",
            "description": "Explain the role, history, and ethics of archaeology and anthropology within forensic investigations and the criminal justice system"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "In-class osteology exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>45%</dd>",
            "due_date": "<dd><p> 30/03/2026 - 31/03/2026</p>\n<p>\n</p><p>In scheduled practical class</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Osteology Exam will cover human osteology from the osteology practicals in weeks 1-5 and related lectures. This material covers human skeletal anatomy identification, siding and estimating demographic characteristics from human bones (e.g., age-at-death, biological sex, elements of ancestry, stature estimation), and differentiating between human and animal bones and teeth. </p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>Use of AI: </strong>This assessment task will be completed in-person. The use of Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The exam will be held in class time.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Online lecture quiz",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p> 5/05/2026 - 8/05/2026</p>\n<p>\n</p><p>Students can complete the quiz via Inspera at any point during Week 10. The quiz will last 30 minutes and must be completed in one sitting. The completion and submission can be done at any point in Week 10 as long as it occurs between 9AM Tuesday 5 May 2026 and 5PM Friday 8 May 2026.</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment will be a short online quiz delivered via Inspera testing your knowledge on key lecture content covered in weeks 6-9, including topics such as burial mapping, excavation, recovery of evidence, forensic search techniques and methods, human death and decomposition, and evidence handling. You can expect a combination of multiple choice questions, true/false statements, diagrams requiring completing blank descriptors, and hypothetical forensic scenarios requiring a short interpretation.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Online submission via Inspera.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Forensic report based on assemblage analysis",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 29/05/2026 5:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment requires you to physically examine human remains (casts) and objects recovered from a mock crime scene (representing a hypothetical site in Southeast Queensland uncovered during a Police raid), as well as written information relating to the human remains and objects. You are required to estimate whether the bones are human, the minimum number of individuals represented, the biological profile of the deceased (age-at-death, biological sex, ancestry if possible, stature, health status), and an approximate time of deposition of the individual(s). More detailed instructions will be available from our Blackboard site.</p>\n<p><strong>Word count</strong>: The word limit for this assignment is 2500 words, not including the reference list and the appendix/ces. </p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>Use of AI:</strong> This task has been designed to be challenging, authentic and complex. Whilst students may use AI technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which AI will provide only limited support and guidance. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct. Students must complete an AI usage declaration and submit it with their assessment. Additional resources are available through <a href=\"https://web.library.uq.edu.au/study-and-learning-support/ai-student-hub\">UQ AI Student Hub</a>.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Students will work in groups during the mapping and recording of the simulated crime scene and analysis of human remains and associated evidence, but will submit one individualised report per student.</strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction to forensic archaeology and anthropology, ethics, and human skeletal anatomy</strong><br/><p>This lecture provides an introduction to forensic archaeology and forensic anthropology, outlining their roles in the recovery and analysis of human remains within legal contexts. It will cover key ethical considerations that guide professional practice, including respect for the deceased and responsibilities to the living. The lecture will also introduce basic human skeletal anatomy, focusing on major bones and anatomical terminology essential for forensic identification and analysis.</p>\n<p>Learning Objectives: 1, 2, 5</p></p></div></td>",
            "topic_title": "<strong>Introduction to forensic archaeology and anthropology, ethics, and human skeletal anatomy</strong>",
            "topic_description": "Introduction to forensic archaeology and anthropology, ethics, and human skeletal anatomy This lecture provides an introduction to forensic archaeology and forensic anthropology, outlining their roles in the recovery and analysis of human remains within legal contexts. It will cover key ethical considerations that guide professional practice, including respect for the deceased and responsibilities to the living. The lecture will also introduce basic human skeletal anatomy, focusing on major bones and anatomical terminology essential for forensic identification and analysis. Learning Objectives: 1, 2, 5",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Human skeletal anatomy: terminology, skeletal inventory, standard anatomical position</strong><br/><p>This workshop begins with a local laboratory safety induction to ensure safe and appropriate working practices. Students will then be introduced to human bone anatomy, focusing on the identification, naming, and correct siding of major human skeletal elements and major differences between human and non-human animal bones. Hands-on examination of casts will develop foundational observational and anatomical skills essential for forensic analysis. Students will practise recording a skeletal inventory and laying out skeleton casts in a standard anatomical position.</p>\n<p>Learning Objectives: 1, 2, 5</p></p></div></td>",
            "topic_title": "<strong>Human skeletal anatomy: terminology, skeletal inventory, standard anatomical position</strong>",
            "topic_description": "Human skeletal anatomy: terminology, skeletal inventory, standard anatomical position This workshop begins with a local laboratory safety induction to ensure safe and appropriate working practices. Students will then be introduced to human bone anatomy, focusing on the identification, naming, and correct siding of major human skeletal elements and major differences between human and non-human animal bones. Hands-on examination of casts will develop foundational observational and anatomical skills essential for forensic analysis. Students will practise recording a skeletal inventory and laying out skeleton casts in a standard anatomical position. Learning Objectives: 1, 2, 5",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(02 Mar - 08 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Human skeletal anatomy: the appendicular skeleton</strong><br/><p>This lecture focuses on the human appendicular skeleton, covering the bones of the upper and lower limbs as well as the pectoral and pelvic girdles. Students will learn about identifying, naming, and siding key skeletal elements, with emphasis on anatomical features relevant to forensic analysis. The session builds foundational anatomical knowledge essential for the analysis and interpretation of human skeletal remains.</p>\n<p>Learning Objective: 1</p></p></div></td>",
            "topic_title": "<strong>Human skeletal anatomy: the appendicular skeleton</strong>",
            "topic_description": "Human skeletal anatomy: the appendicular skeleton This lecture focuses on the human appendicular skeleton, covering the bones of the upper and lower limbs as well as the pectoral and pelvic girdles. Students will learn about identifying, naming, and siding key skeletal elements, with emphasis on anatomical features relevant to forensic analysis. The session builds foundational anatomical knowledge essential for the analysis and interpretation of human skeletal remains. Learning Objective: 1",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(02 Mar - 08 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Human skeletal anatomy: the appendicular skeleton</strong><br/><p>This workshop focuses on the human appendicular skeleton, examining the bones of the upper and lower limbs as well as the pectoral and pelvic girdles. Students will learn to identify, name, and side key skeletal elements, with emphasis on anatomical features relevant to movement, function, and forensic analysis. The session builds foundational anatomical knowledge essential for the analysis and interpretation of human skeletal remains.</p>\n<p>Learning Objectives: 1</p></p></div></td>",
            "topic_title": "<strong>Human skeletal anatomy: the appendicular skeleton</strong>",
            "topic_description": "Human skeletal anatomy: the appendicular skeleton This workshop focuses on the human appendicular skeleton, examining the bones of the upper and lower limbs as well as the pectoral and pelvic girdles. Students will learn to identify, name, and side key skeletal elements, with emphasis on anatomical features relevant to movement, function, and forensic analysis. The session builds foundational anatomical knowledge essential for the analysis and interpretation of human skeletal remains. Learning Objectives: 1",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Human skeletal anatomy: the axial skeleton</strong><br/><p>This lecture covers the human axial skeleton, including the skull, vertebral column, ribs, sternum, and hyoid. Students will learn to identify, name, and side axial skeletal elements, with emphasis on key anatomical features and terminology relevant to forensic archaeology and anthropology. The session develops core anatomical knowledge essential for the analysis and interpretation of human skeletal remains.</p>\n<p>Learning Objectives: 1</p></p></div></td>",
            "topic_title": "<strong>Human skeletal anatomy: the axial skeleton</strong>",
            "topic_description": "Human skeletal anatomy: the axial skeleton This lecture covers the human axial skeleton, including the skull, vertebral column, ribs, sternum, and hyoid. Students will learn to identify, name, and side axial skeletal elements, with emphasis on key anatomical features and terminology relevant to forensic archaeology and anthropology. The session develops core anatomical knowledge essential for the analysis and interpretation of human skeletal remains. Learning Objectives: 1",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Human skeletal anatomy: the axial skeleton</strong><br/><p>This workshop covers the human axial skeleton, including the skull, vertebral column, ribs, sternum, and hyoid. Students will learn to identify, name, and side axial skeletal elements, with emphasis on key anatomical features and terminology relevant to forensic archaeology and anthropology. The session develops core anatomical knowledge essential for the analysis and interpretation of human skeletal remains.</p>\n<p>Learning Objectives: 1</p></p></div></td>",
            "topic_title": "<strong>Human skeletal anatomy: the axial skeleton</strong>",
            "topic_description": "Human skeletal anatomy: the axial skeleton This workshop covers the human axial skeleton, including the skull, vertebral column, ribs, sternum, and hyoid. Students will learn to identify, name, and side axial skeletal elements, with emphasis on key anatomical features and terminology relevant to forensic archaeology and anthropology. The session develops core anatomical knowledge essential for the analysis and interpretation of human skeletal remains. Learning Objectives: 1",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Human forensic osteology: estimation of age-at-death and biological sex</strong><br/><p>This lecture introduces key methods used in human forensic osteology to estimate age-at-death and biological sex from skeletal remains. Students will learn about morphological changes and sexually dimorphic traits of the skeleton, with particular emphasis on the pelvis, skull, and long bones. The lecture highlights the strengths, limitations, and ethical considerations associated with biological profile estimation in forensic contexts.</p>\n<p>Learning Objectives: 1, 2</p></p></div></td>",
            "topic_title": "<strong>Human forensic osteology: estimation of age-at-death and biological sex</strong>",
            "topic_description": "Human forensic osteology: estimation of age-at-death and biological sex This lecture introduces key methods used in human forensic osteology to estimate age-at-death and biological sex from skeletal remains. Students will learn about morphological changes and sexually dimorphic traits of the skeleton, with particular emphasis on the pelvis, skull, and long bones. The lecture highlights the strengths, limitations, and ethical considerations associated with biological profile estimation in forensic contexts. Learning Objectives: 1, 2",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Human forensic osteology: estimation of age-at-death and biological sex</strong><br/><p>This workshop introduces key methods used in human forensic osteology to estimate age-at-death and biological sex from skeletal remains. Students will learn about morphological changes and sexually dimorphic traits of the skeleton, with particular emphasis on the pelvis, skull, and long bones. The lecture highlights the strengths, limitations, and ethical considerations associated with biological profile estimation in forensic contexts.</p>\n<p>Learning Objectives: 1, 2</p></p></div></td>",
            "topic_title": "<strong>Human forensic osteology: estimation of age-at-death and biological sex</strong>",
            "topic_description": "Human forensic osteology: estimation of age-at-death and biological sex This workshop introduces key methods used in human forensic osteology to estimate age-at-death and biological sex from skeletal remains. Students will learn about morphological changes and sexually dimorphic traits of the skeleton, with particular emphasis on the pelvis, skull, and long bones. The lecture highlights the strengths, limitations, and ethical considerations associated with biological profile estimation in forensic contexts. Learning Objectives: 1, 2",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Human forensic osteology: estimation of stature, ancestry, examination of trauma</strong><br/><p>This lecture explores key aspects of human forensic osteology, focusing on the estimation of stature and ancestry, as well as the identification and interpretation of skeletal trauma. Students will be introduced to metric and non-metric methods used in forensic analysis, and will examine characteristics associated with different types of trauma. The session emphasises analytical reasoning, methodological limitations, and ethical considerations within forensic contexts.</p>\n<p>Learning Objectives: 1, 2</p></p></div></td>",
            "topic_title": "<strong>Human forensic osteology: estimation of stature, ancestry, examination of trauma</strong>",
            "topic_description": "Human forensic osteology: estimation of stature, ancestry, examination of trauma This lecture explores key aspects of human forensic osteology, focusing on the estimation of stature and ancestry, as well as the identification and interpretation of skeletal trauma. Students will be introduced to metric and non-metric methods used in forensic analysis, and will examine characteristics associated with different types of trauma. The session emphasises analytical reasoning, methodological limitations, and ethical considerations within forensic contexts. Learning Objectives: 1, 2",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Human forensic osteology: estimation of stature, ancestry, examination of trauma</strong><br/><p>This workshop explores key aspects of human forensic osteology, focusing on the estimation of stature and ancestry, as well as the identification and interpretation of skeletal trauma. Students will be introduced to metric and non-metric methods used in forensic analysis, and will examine characteristics associated with different types of trauma. The session emphasises analytical reasoning, methodological limitations, and ethical considerations within forensic contexts.</p>\n<p>Learning Objectives: 1, 2</p></p></div></td>",
            "topic_title": "<strong>Human forensic osteology: estimation of stature, ancestry, examination of trauma</strong>",
            "topic_description": "Human forensic osteology: estimation of stature, ancestry, examination of trauma This workshop explores key aspects of human forensic osteology, focusing on the estimation of stature and ancestry, as well as the identification and interpretation of skeletal trauma. Students will be introduced to metric and non-metric methods used in forensic analysis, and will examine characteristics associated with different types of trauma. The session emphasises analytical reasoning, methodological limitations, and ethical considerations within forensic contexts. Learning Objectives: 1, 2",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Forensic search methods and techniques</strong><br/><p>This lecture introduces forensic search methods and techniques used to locate and recover human remains and associated evidence. Students will explore a range of search strategies, including surface, sub-surface, and geophysical approaches, and consider how environmental and contextual factors influence search planning. The session emphasises systematic documentation, evidence preservation, and ethical and legal responsibilities in forensic investigations.</p>\n<p>Learning Objectives: 4, 5</p></p></div></td>",
            "topic_title": "<strong>Forensic search methods and techniques</strong>",
            "topic_description": "Forensic search methods and techniques This lecture introduces forensic search methods and techniques used to locate and recover human remains and associated evidence. Students will explore a range of search strategies, including surface, sub-surface, and geophysical approaches, and consider how environmental and contextual factors influence search planning. The session emphasises systematic documentation, evidence preservation, and ethical and legal responsibilities in forensic investigations. Learning Objectives: 4, 5",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In-class osteology exam </strong><br/><p>In-class osteology practical exam held during scheduled workshops on Monday and Tuesday.</p></p></div></td>",
            "topic_title": "<strong>In-class osteology exam </strong>",
            "topic_description": "In-class osteology exam In-class osteology practical exam held during scheduled workshops on Monday and Tuesday.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid-sem break(06 Apr - 12 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MID SEMESTER BREAK</strong><br/></p></div></td>",
            "topic_title": "<strong>MID SEMESTER BREAK</strong>",
            "topic_description": "MID SEMESTER BREAK",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>At the crime scene: burial mapping, excavation and recovery</strong><br/><p>This lecture focuses on crime scene procedures related to burial mapping, excavation, and the recovery of human remains. Students will be introduced to systematic methods for documenting burial contexts, applying controlled excavation techniques, and ensuring the accurate recovery and preservation of evidence. Emphasis is placed on maintaining context, chain of custody, and ethical and legal responsibilities throughout the forensic investigation. This lecture provides theoretical background for the ATARC crime scene investigation.</p>\n<p>Learning Objectives: 4, 5</p></p></div></td>",
            "topic_title": "<strong>At the crime scene: burial mapping, excavation and recovery</strong>",
            "topic_description": "At the crime scene: burial mapping, excavation and recovery This lecture focuses on crime scene procedures related to burial mapping, excavation, and the recovery of human remains. Students will be introduced to systematic methods for documenting burial contexts, applying controlled excavation techniques, and ensuring the accurate recovery and preservation of evidence. Emphasis is placed on maintaining context, chain of custody, and ethical and legal responsibilities throughout the forensic investigation. This lecture provides theoretical background for the ATARC crime scene investigation. Learning Objectives: 4, 5",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Crime scene recording at ATARC</strong><br/><p>Simulated crime scene excavation held at the Archaeology Teaching and Research Centre (ATARC). The ATARC is facility number 56J and is situated between the Alumni Teaching Garden and Sir William Macgregor Drive, near the UQ Lakes Bus Stop and opposite the CityCat Ferry Terminal.</p>\n<p>Learning Objectives: 4, 5</p></p></div></td>",
            "topic_title": "<strong>Crime scene recording at ATARC</strong>",
            "topic_description": "Crime scene recording at ATARC Simulated crime scene excavation held at the Archaeology Teaching and Research Centre (ATARC). The ATARC is facility number 56J and is situated between the Alumni Teaching Garden and Sir William Macgregor Drive, near the UQ Lakes Bus Stop and opposite the CityCat Ferry Terminal. Learning Objectives: 4, 5",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Human death, decomposition and burial</strong><br/><p>This lecture examines the processes of human death, decomposition, and burial, with a focus on how biological, environmental, and cultural factors influence post-mortem change. Students will explore stages of decomposition, taphonomic processes, and burial practices, and consider their relevance to forensic interpretation. The lecture highlights how these factors affect the recovery, analysis, and interpretation of human remains in forensic contexts.</p>\n<p>Learning objectives: 2, 3, 4, 5</p></p></div></td>",
            "topic_title": "<strong>Human death, decomposition and burial</strong>",
            "topic_description": "Human death, decomposition and burial This lecture examines the processes of human death, decomposition, and burial, with a focus on how biological, environmental, and cultural factors influence post-mortem change. Students will explore stages of decomposition, taphonomic processes, and burial practices, and consider their relevance to forensic interpretation. The lecture highlights how these factors affect the recovery, analysis, and interpretation of human remains in forensic contexts. Learning objectives: 2, 3, 4, 5",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Forensic assemblage analysis 1</strong><br/><p>In this workshop, students will begin analysing materials recovered from a simulated crime scene, including skeletal elements and associated objects. The session emphasises hands-on analytical skills, critical reasoning, and the application of forensic principles to real-world investigative scenarios.</p>\n<p>Learning objectives: 1, 2, 3, 4, 5</p></p></div></td>",
            "topic_title": "<strong>Forensic assemblage analysis 1</strong>",
            "topic_description": "Forensic assemblage analysis 1 In this workshop, students will begin analysing materials recovered from a simulated crime scene, including skeletal elements and associated objects. The session emphasises hands-on analytical skills, critical reasoning, and the application of forensic principles to real-world investigative scenarios. Learning objectives: 1, 2, 3, 4, 5",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Evidence: trace evidence, handling evidence</strong><br/><p>This lecture focuses on different types of evidence, including trace, and proper evidence handling in forensic contexts. Students will learn about small-scale materials such as hair, fibers, and soil, while maintaining chain of custody and minimising contamination. Emphasis is placed on practical skills, attention to detail, and the ethical and legal responsibilities associated with evidence management.</p>\n<p>Learning objectives: 4, 5</p></p></div></td>",
            "topic_title": "<strong>Evidence: trace evidence, handling evidence</strong>",
            "topic_description": "Evidence: trace evidence, handling evidence This lecture focuses on different types of evidence, including trace, and proper evidence handling in forensic contexts. Students will learn about small-scale materials such as hair, fibers, and soil, while maintaining chain of custody and minimising contamination. Emphasis is placed on practical skills, attention to detail, and the ethical and legal responsibilities associated with evidence management. Learning objectives: 4, 5",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Forensic assemblage analysis 2</strong><br/><p>In this workshop, students continue analysing materials recovered from a simulated crime scene, including skeletal elements and associated objects. The session emphasises hands-on analytical skills, critical reasoning, and the application of forensic principles to real-world investigative scenarios.</p>\n<p>Learning objectives: 1, 2, 3, 4, 5</p></p></div></td>",
            "topic_title": "<strong>Forensic assemblage analysis 2</strong>",
            "topic_description": "Forensic assemblage analysis 2 In this workshop, students continue analysing materials recovered from a simulated crime scene, including skeletal elements and associated objects. The session emphasises hands-on analytical skills, critical reasoning, and the application of forensic principles to real-world investigative scenarios. Learning objectives: 1, 2, 3, 4, 5",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(04 May - 10 May)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>No Lecture - Labour Day Public Holiday</strong><br/></p></div></td>",
            "topic_title": "<strong>No Lecture - Labour Day Public Holiday</strong>",
            "topic_description": "No Lecture - Labour Day Public Holiday",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(04 May - 10 May)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Inspera quiz based on week 6-9 lectures</strong><br/><p>Students can complete the Inspera quiz online at any point during Week 10 within a specified timeframe - see Assessment for details.</p></p></div></td>",
            "topic_title": "<strong>Inspera quiz based on week 6-9 lectures</strong>",
            "topic_description": "Inspera quiz based on week 6-9 lectures Students can complete the Inspera quiz online at any point during Week 10 within a specified timeframe - see Assessment for details.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Expert evidence, witness, and expert reporting</strong><br/><p>This lecture explores the role of expert evidence and testimony in forensic investigations. Students will learn about the responsibilities of expert witnesses, how to communicate findings clearly and accurately, and the principles of preparing written and oral forensic reports. Emphasis is placed on objectivity, ethical considerations, and the importance of presenting evidence in a way that is understandable and admissible in legal proceedings.</p>\n<p>Learning objectives: 5</p></p></div></td>",
            "topic_title": "<strong>Expert evidence, witness, and expert reporting</strong>",
            "topic_description": "Expert evidence, witness, and expert reporting This lecture explores the role of expert evidence and testimony in forensic investigations. Students will learn about the responsibilities of expert witnesses, how to communicate findings clearly and accurately, and the principles of preparing written and oral forensic reports. Emphasis is placed on objectivity, ethical considerations, and the importance of presenting evidence in a way that is understandable and admissible in legal proceedings. Learning objectives: 5",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Forensic assemblage analysis 3</strong><br/><p>In this workshop, students continue analysing materials recovered from a simulated crime scene, including skeletal elements and associated objects. The session emphasises hands-on analytical skills, critical reasoning, and the application of forensic principles to real-world investigative scenarios.</p>\n<p>Learning objectives: 1, 2, 3, 4, 5</p></p></div></td>",
            "topic_title": "<strong>Forensic assemblage analysis 3</strong>",
            "topic_description": "Forensic assemblage analysis 3 In this workshop, students continue analysing materials recovered from a simulated crime scene, including skeletal elements and associated objects. The session emphasises hands-on analytical skills, critical reasoning, and the application of forensic principles to real-world investigative scenarios. Learning objectives: 1, 2, 3, 4, 5",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(18 May - 24 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Bone and tooth histology in forensic anthropology</strong><br/><p>This lecture introduces bone and tooth histology in forensic anthropology, focusing on microscopic analysis assessing aspects such as age-at-death or diagenesis. Students will learn about sampling and examining histological slides, interpreting key features, and applying these observations to forensic investigations. Emphasis is placed on critical interpretation, and understanding the limitations and ethical considerations of histological methods.</p>\n<p>Learning objectives: 1, 2, 5</p></p></div></td>",
            "topic_title": "<strong>Bone and tooth histology in forensic anthropology</strong>",
            "topic_description": "Bone and tooth histology in forensic anthropology This lecture introduces bone and tooth histology in forensic anthropology, focusing on microscopic analysis assessing aspects such as age-at-death or diagenesis. Students will learn about sampling and examining histological slides, interpreting key features, and applying these observations to forensic investigations. Emphasis is placed on critical interpretation, and understanding the limitations and ethical considerations of histological methods. Learning objectives: 1, 2, 5",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(18 May - 24 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Forensic assemblage analysis 4</strong><br/><p>In this workshop, students continue analysing materials recovered from a simulated crime scene, including skeletal elements and associated objects. The session emphasises hands-on analytical skills, critical reasoning, and the application of forensic principles to real-world investigative scenarios.</p>\n<p>Learning objectives: 1, 2, 3, 4, 5</p></p></div></td>",
            "topic_title": "<strong>Forensic assemblage analysis 4</strong>",
            "topic_description": "Forensic assemblage analysis 4 In this workshop, students continue analysing materials recovered from a simulated crime scene, including skeletal elements and associated objects. The session emphasises hands-on analytical skills, critical reasoning, and the application of forensic principles to real-world investigative scenarios. Learning objectives: 1, 2, 3, 4, 5",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(25 May - 31 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Disasters, humanitarian crises, and mass graves</strong><br/><p>This session examines the forensic response to disasters, humanitarian crises, and mass graves. Students will explore the recovery, identification, and analysis of multiple human remains, and consider the logistical, ethical, and legal challenges involved. Emphasis is placed on systematic approaches, documentation, and the role of forensic anthropology and archaeology in supporting justice, humanitarian efforts, and the reconstruction of events.</p>\n<p>Learning objectives: 3, 4, 5</p>\n<p><br/></p></p></div></td>",
            "topic_title": "<strong>Disasters, humanitarian crises, and mass graves</strong>",
            "topic_description": "Disasters, humanitarian crises, and mass graves This session examines the forensic response to disasters, humanitarian crises, and mass graves. Students will explore the recovery, identification, and analysis of multiple human remains, and consider the logistical, ethical, and legal challenges involved. Emphasis is placed on systematic approaches, documentation, and the role of forensic anthropology and archaeology in supporting justice, humanitarian efforts, and the reconstruction of events. Learning objectives: 3, 4, 5",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(25 May - 31 May)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>No practical - finalising forensic report</strong><br><p>No practicals this week, students are encouraged to use this last week to finalise their forensic assemblage analysis reports.</p></br></p></div></td>",
            "topic_title": "<strong>No practical - finalising forensic report</strong>",
            "topic_description": "No practical - finalising forensic report No practicals this week, students are encouraged to use this last week to finalise their forensic assemblage analysis reports.",
            "learning_outcomes": []
        }
    ]
}