{
    "course_title": "Political Communication",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/COMU3222-21898-7620",
    "full_course_code": "COMU3222-21898-7620",
    "course_code": "COMU3222",
    "class_code": "21898",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand and discuss political communication as a field and as a practice."
        },
        {
            "number": "LO2.",
            "description": "Understand and evaluate the role and uses of speech, political campaigning, lobbying and activism to promote ideas and discourses, manage issues, and advocate for policy and causes."
        },
        {
            "number": "LO3.",
            "description": "Understand the role and uses of all forms of communication (news media, social media platforms, and different types of physical and online events) employed in political communication work (e.g. electoral campaigns and polls; speeches; debates; government policy decisions; lobby/advocacy papers) to persuade, mobilise audiences, and shape the agenda."
        },
        {
            "number": "LO4.",
            "description": "Research and analyse the political communication literature, policy papers, and advocacy actions to plan, write and present  individually or in groups  speeches, case study reports, and communication campaigns consistent with the course content and UQ standards."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "In-Class Writing Task",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30% 1250 words in total </dd>",
            "due_date": "<dd><p> 26/03/2026 - 22/05/2026</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>There will be 8 in-class writing tasks held in the lecture beginning in <strong>week 5 and concluding in week 12.</strong> <strong>This assignment asks students to critically reflect on some of the main political communication theories, concepts and topics discussed in the lectures in the previous weeks</strong>. You will be asked to briefly define the topic or concept in your own words and explain why this concept is important<strong> (a) to understand and analyse political projects, policy, or other issues at the local, state and federal levels;</strong> and/or <strong>(b) to give you some tools to communicate and promote the matter in hand effectively among relevant stakeholders via communication tool, such as media or events</strong>. You are also expected to <strong>apply or link the requested concept/topic to a recent or historical real-life example or case,</strong> mentioned in lectures, tutorials, weekly academic or professional readings, and/or from reliable media sites.</p>\n<p>You will be given <strong>15 minutes (5 minutes to prepare and 10 mins to write) to provide a handwritten answer of a maximum of 250 words.</strong> You may use an 'argument map' to help you develop your answer. <strong>A glossary of key topics/concepts will be posted to Blackboard (Assessment and Learning Resources section) in week 3. </strong> You are expected to <strong>identify, acknowledge or cite some of the ideas or authors you studied for the task</strong>. Therefore, reading, understanding and applying weekly material and participating in discussions in lectures and tutorials will be crucial to obtain the maximum grade. <strong>This assessment evaluates students' own critical thinking and problem-solving capabilities, engagement with course topics, and academic knowledge</strong>. Writing Tasks will not be set on holidays, or in the case of some special lectures, or unexpected events.</p>\n<p><strong>M</strong><strong>ore information on </strong><strong>specific dates or unanticipated changes, </strong><strong>and the assignment rubric will also be posted to Blackboard in week 3.</strong></p>\n<p><strong>IMPORTANT NOTE 1</strong>: There will be<strong> 8</strong><strong> opportunities</strong> <strong>to take the In-Class Writing Task, but </strong><strong>you only need to take 5 (valued at 6 pts each), which together will form 1250 words to get a maximum of 30 pts</strong><strong>. If you take more than 5 Writing Tasks, we will select the </strong><strong>best 5.</strong> This also means that <strong>you may miss up to 3 tasks without penalty.</strong> <strong>T</strong><strong>here will be NO opportunities to re-take individual papers, and no deferrals or alternative assessment are available </strong><strong>except in very specific circumstances, such as a ‘Disability Action Plan’ in place, or other genuine (documented/supported) reasons (medical reasons, carer’s responsibilities, sudden accidents).</strong> So please, try to take as many as In-Class Writing Tasks as you can.</p>\n<p><strong>IMPORTANT NOTE 2</strong>: This assignment will be completed <strong>individually, in person, during lectures, and is handwritten.</strong> <strong>You must bring your own pen(s) to the lecture</strong>. We will provide a task-sheet (paper) where you will write your name, student number, tutorial group and/or tutor’s name, and your answer. <strong>This task has been designed to be challenging, authentic and complex. So please engage with concepts and themes from the beginning</strong>. <strong>The use of </strong><strong>generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted</strong><strong>.</strong> Any attempted use of AI or MT may constitute <strong>student misconduct under the Student Code of Conduct.</strong> Upon entering the theater you will be asked to <strong>place your bags, laptops, smart phones, tablets or other electronics below your seats. </strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>This assignment will be completed individually, in person, during lectures, and is handwritten. There will be 8 in-class writing tasks held in the lecture beginning in week 5 and concluding in week 12. You will be given 15 minutes (5 minutes to prepare and 10 mins to write) to provide a handwritten 250-word answer (maximum). A task sheet (paper) will be provided in the lecture. <strong>You must bring your own pen(s).</strong> You will write your names, student number, tutorial number/day/time, and tutor's name. At the end of the 15 minutes, you will hand the paper with your answer to the lecturer and members of the teaching team who are present in the lecture room. All electronics/digital devices will be placed below your seats.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p><strong>Late Submission is NOT APPLICABLE. There will be NO opportunities to re-take individual papers and no alternative assessment is available except in very specific circumstances,  such as a ‘Disability Action Plan’ in place, or other genuine, well documented/supported reasons</strong> (medical, carer’s responsibility, other). So please, try to take as many In-Class Writing Tasks as you can.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Briefing Paper",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30% 1250 words </dd>",
            "due_date": "<dd><p> 24/04/2026 4:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>A2, Briefing Paper, is the research and issue/policy analysis step. </strong></p>\n<p><strong>This task will be executed in pairs, or groups of 3 students max, who will self-enrol on Blackboard and will continue to work together for Assignment 3. </strong>This assignment asks students to conduct research and to analyse a specific political/policy topic to produce a 'briefing paper' consisting of key findings, insights, analysis of the policy or issues, and preliminary proposal for the final political campaign plan or project (Assignment 3).The briefing paper is based on <strong>(a) situating the topic or issues posed by the client; (b) conducting desk/secondary research on recent or historical reports and similar real life cases; (c) a policy or issue analysis; (d) critical reflection</strong> <strong>on your findings or insights</strong> <strong>that are relevant, or respond to the client's brief;</strong> <strong>and (e) recommendations about possible communication strategies and tactics that could be used to craf the final political communication campaign plan</strong> (A3).</p>\n<p><strong>The Briefing Paper </strong>consists of a<strong> written 1250-word briefing paper about the issue or policy proposed by the political client. You are expected to research existing material, in Australia or other countries, that is relevant or similar (in topic or style) to the client's brief. </strong>For this task you will research and critically analyse a current, recent, or historical policy, campaign, or campaign element to write your brief or recommendations in matters of communication. Therefore, <strong>this material will be used to inform Assignment 3 “Political Communication Campaign”</strong>. <strong>Examples of relevant policy or issues include elections; relevant policy, referenda; advocacy or lobbying campaigns; information or cases from NGOs or multilateral organisations, or similar. </strong>While students are encouraged to identify a campaign themselves, there will be examples in the lectures and material posted to Blackboard that can be used in <strong>the policy analysis and briefing paper</strong>.</p>\n<p>Within the assignment, you will</p>\n<ul>\n<li><strong>Scenario analysis</strong> (this framework will be explained in lectures and tutorials in weeks 6 and 7): First, situate the main political/policy communication issue or need posed by the client, its context or background. Second, examine possible events or scenarios that could take place in the future to predict the various feasible results or possible outcomes. the \"what if\" question is key (activities in tutorials).</li>\n<li><strong>Research relevant opinion polls, statistics, policy papers, advocacy campaigns, and/or any other information linked with the selected client</strong> (there will be some materials and reports posted to Blackboard on weeks 2-7).</li>\n<li><strong>Policy analysis</strong>: Using the frameworks provided by the lecturer in weeks 6 and 7, students are expected to develop their own policy analysis of the topic at hand.</li>\n<li><strong>You are also expected to apply theoretical evidence</strong> from weekly readings, lecture slides, Glossary of Concepts also provided by the course, as well as illustrative evidence (real life cases) from the media and professional websites. <strong>Therefore, you must use both academic and professional resources to support the analysis</strong>.</li>\n<li><strong>You will also</strong> i<strong>dentify relevant communication strategies, new and original, proposed by you, or associated with past policies or campaigns. You are asked to critically analyse why they were successful or unsuccessful</strong> and explain why this example is relevant to respond to the client's brief and plan your final political communication campaign for Assignment 3. You will explain how you could use similar campaign and communication strategies and tactics to successfully develop your own campaign.</li>\n</ul>\n<p><strong>Note: </strong>You are expected to demonstrate <strong>human</strong> critical thinking and problem solving capabilities. You may use generative AI as a tool, <strong>but only to research topics or data</strong> associated with the relevant topic, <strong>not to write the full assignment</strong>. You <strong>must acknowledge, write, and reference (a) the use of AI; (b) the prompts you used to research, and (c) the AI tool you employed</strong>. <strong>You will use APA 7th to reference (in-text and ref. list) all the material, academic literature, media texts, and/or AI tools you use in this assignment, if applicable. A failure to reference AI and machine translation (MT) tools may constitute student misconduct under the Student Code of Conduct. Never identify or use the name of a real life client in your AI searches or prompts for privacy, copyright and other legal issues. </strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Political Communication Campaign",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40% 10-minute pitch and 2000-word portfolio </dd>",
            "due_date": "<dd><p> 29/05/2026 4:00 pm</p>\n<p>\n</p><p>Pitch: Oral, in person in Week 12 tutorials (21-22 May) = 5 pts/40</p>\n<p>Portfolio: Submit by 4pm 29 May 2025 (week 13) - 35 pts/40</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Oral, Written",
            "category": "Paper/ Report/ Annotation, Presentation, Portfolio, Reflection, Role play/ Simulation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>A3, The Political Communication Campaign, is the implementation step. Will be executed in pairs or groups of 3 (with the same partner students they worked for A2). </strong></p>\n<p>The previous assignment (A2 - Briefing Paper) asked students to research and analyse a specific political/policy topic to produce a briefing paper presenting insights into relevant material, similar real-life cases, and preliminary recommendations to design a political communication campaign for the selected client. So, based on the research insights provided by A2, Assignment 3 now asks <strong>students to design a political communication campaign plan and propose strategies and tactics that addresses the client’s brief.</strong></p>\n<p>The aim is to develop <strong>original or revamped communication, media, and/or promotion strategies that are persuasive and potentially effective</strong> <strong>to help solve the client's communication need or issue. The aim is to place the relevant issue in the public agenda and mobilise engagement and endorsement from relevant publics (electorate, citizens, stakeholders, audiences, community, and/or opinion leaders). </strong></p>\n<p>This assignment aims to give COMU3222 students the opportunity to demonstrate the political communication knowledge, understanding and problem-solving capabilities acquired during the semester by proposing effective communication strategies and tactics to effectively resolve/promote the client's need or issue.</p>\n<p><strong>Students will act as communication/media consultants to the campaign</strong>.Your written proposal will be presented in<strong> professional looking slides</strong> that will include:</p>\n<p><strong>Part 1: Executive summary (1000 words) with the following elements:</strong></p>\n<ul>\n<li>Professional presentation of your political communication consultancy team (maybe logo, name of political consultancy - credentials).</li>\n<li><strong>Summary of research insights</strong> (already displayed in A2): Summary of results of the scenario and policy analyses to situate the communication and media contexts, culture, or environment.</li>\n<li><strong>Summary and brief explanation of the main elements of your campaign that respond to the client's brief:</strong> (a) The issue; (b) goal(s) of the political communication campaign; (c) the specific policy/political communication topic/issue or need; (d) target audiences or stakeholders; (e) your proposed <strong>message(s) </strong>for this specific campaign and possible slogan (optional). The <strong>message should aim to be</strong> <strong>persuasive and effective</strong> to <strong>promote the issue, the political proponent, government, parliament, party, lobby group, or politician/client, raise awareness about the importance of the policy or issue, and include a call to action; </strong>(f) main communication strategies and tactics (e.g. media release(s), series of social media posts, blog post, events like town hall meetings, other). Include references of literature or websites used to design, support and justify your strategy</li>\n<li>A final section with a <strong>critical reflection</strong> (a couple of paragraphs) about (1) the importance of democratic, civil, communicative campaigning vs. populist, polarising, divisive, uncivil, and/or disruptive political campaigning, and/or (2) the relevance of news media vs challenges posed by social platforms and AI on democracy.</li>\n<li>You may use dot points in some sections of your presentation.</li>\n</ul>\n<p><strong>Part 2. Main tactics and channel(s) of communication or media (1000 words)</strong></p>\n<p>You can select a combination of the elements outlined below:</p>\n<p>A. <strong>Media text</strong>: you are asked to write a 1000-word text that may consist of:</p>\n<ul>\n<li>A <strong>media release; blog post; speech; podcast or video script</strong>. It can be a combination of these formats, provided it meets 1000 words. If you choose to write a media release or blog post, you should include accompanying visuals, photos and/or graphs (from free-copyright sites). You are invited to employ any skills learnt via MaPs training using Adobe InDesign, WordPress, or other like Shorthand. We are open to other ideas provided the content is equivalent to 1000 words.</li>\n<li><strong>A set/combination of relevant social media posts </strong>(that add up to close to 1000 words). This may be formed, for example, by a group of Facebook relevant posts (4 posts x 150+ words approx. each = 600+ words) and 5 linked (but differently worded) X posts (politicians still make statements via X); or Instagram posts of 60 words each = 300 characters) 60 x 5= 300 words. Each one of these posts should be ideally illustrated by copyright free pictures, table/graphs/visuals, and/or copyright free cartoon or drawing. Ideally you will not use AI on political material or videos as it is ethically problematic, unless it is used for satire, which should be clear and acknowledged.</li>\n</ul>\n<p><br/></p>\n<p><strong>OR</strong></p>\n<p>B. <strong>Strategic plan for a political event or activity: </strong>Such as<strong> </strong>town hall meeting; rally; publicity event, other. It should be a 1000-word, well-illustrated Plan. You will describe and briefly justify (in terms of its potential effectiveness) the main elements of the event, namely, its goal/purpose (what do you want to achieve with this activity?), key message (via a speech); target publics; main speakers, partners, endorsers; venue, logistics, and possible props, that you will mobilise to persuade your audiences. You may use dot points to outline your proposed event. <strong>You are also invited to use free copyright pictures, graphs or other visuals with data or statistics, to illustrate how the event will look like. </strong></p>\n<p><strong>Overall, Part 1 + Part 2 (the written components) make up 35 pts/40. </strong></p>\n<p><strong>IMPORTANT NOTE 1</strong>: The remaining <strong>5 pts /40 will come from the Pitch</strong>. You will briefly <strong>orally pitch/present</strong> the main elements of your political communication final campaign <strong>in tutorials in week 12. </strong>You will present <strong>goal, publics, message</strong>, and <strong>main political communication strategies and tactics</strong>,<strong> justifying what makes this plan different, original, persuasive, or effective</strong>. Note that <strong>the pitch is marked via the assignment 3 rubric (strategy item) and values 5/40 pts (marked by your tutor using the A4 rubric which includes a category for the pitch)</strong>. <strong>The feedback you will receive from your tutor during the oral pitch will help you refine your final submission of the political campaign plan</strong>. <strong>The pitch can last a maximum of 10 minutes (feedback and Q&amp;As included). You are expected to bring one or two slides</strong> with some visual representation of your proposed main political strategies or insights. The presentations will be recorded (as requested by the school). More on this task via Blackboard.</p>\n<p><strong>IMPORTANT NOTE 2: </strong>We will practice the political communication campaign in tutorials where we will compare the quality and accuracy of AI political communication campaigns vs traditional campaigns planned and designed by humans, based on human research and planning tools, and critical thinking. <strong>This assignment encourages students to plan the campaign themselves, strategically and critically. The digital and computational are seen as tools. Ultimately, you and your team colleagues are expected to design your own campaigns. </strong></p>\n<p>However, we understand that some media strategies and assets may involve, or have embedded, AI and/or Machine Translation (MT) tools. If this is the case, <strong>you MUST reference them using APA 7th</strong>.<strong> A failure to reference the academic literature, AI and MT tools may constitute student misconduct under the Student Code of Conduct.</strong></p>\n<p><strong>This task has been designed to be challenging, authentic and complex</strong>. Whilst students may use AI and/or MT technologies in the process, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide <strong>only </strong>limited support and guidance. <strong>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</strong></p>\n<p><strong>Recording of Oral and Practical Assessment</strong> </p>\n<ul>\n<li>All presentations will be recorded for marking purposes via recording facilities available where the assessment takes place (e.g. Zoom, camera device)  </li>\n<li>Recordings will be retained by the School of Communication and Arts for at least 12 months from the release of the final grade for the course.  </li>\n<li>Recordings will be stored in a secure manner and will only be accessed by authorised school staff for the purposes of: </li>\n<li>Moderation of marking;  </li>\n<li>Provision of feedback to the student(s) recorded; and/or  </li>\n<li>Re-marking following a successful re-mark application. </li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Pitch: In person in Week 12 tutorials.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1 Lecture: Political Communication - Speaker of the House Hon. Milton Dick: The importance of civic and democratic education</strong><br><p>Overview: What is political communication? How has PC, as a discipline and as a practice, changed overtime? From partisan media to today's platform politics - What are the main channels or platforms of political communication? Who dominates the news agenda? - Guest Lecturer: Speaker of the House, Hon. Milton Dick: <strong>The importance of civil language and civic education in democracy. </strong>All relevant topics for the In-Class Writing Task (IWT) starting in week 5.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 1 Lecture: Political Communication - Speaker of the House Hon. Milton Dick: The importance of civic and democratic education</strong>",
            "topic_description": "Week 1 Lecture: Political Communication - Speaker of the House Hon. Milton Dick: The importance of civic and democratic education Overview: What is political communication? How has PC, as a discipline and as a practice, changed overtime? From partisan media to today's platform politics - What are the main channels or platforms of political communication? Who dominates the news agenda? - Guest Lecturer: Speaker of the House, Hon. Milton Dick: The importance of civil language and civic education in democracy. All relevant topics for the In-Class Writing Task (IWT) starting in week 5.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1: NO TUTORIALS</strong><br/><p>Tutorials start in Week 2.</p></p></div></td>",
            "topic_title": "<strong>Week 1: NO TUTORIALS</strong>",
            "topic_description": "Week 1: NO TUTORIALS Tutorials start in Week 2.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(02 Mar - 08 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2 Lecture: Democracy, news and communication</strong><br/><p>Democracy, news, and communication - Do the rule of law, separation of power, and respect for human rights matter? What is the role of the news media? Does the news media still matter, or even exist? What is democracy? Democracy in Australia: (40 mins) - All relevant topics for the In-Class Writing Task starting in week 5. </p>\n<p>Internal guests discussing tools to do well in the Assessment: Senior Principal Learning Advisor, Mr Chris Frost: Argument MaPs (20 mins) - MaPs representatives and Outreach Librarian (30 Mins); </p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 2 Lecture: Democracy, news and communication</strong>",
            "topic_description": "Week 2 Lecture: Democracy, news and communication Democracy, news, and communication - Do the rule of law, separation of power, and respect for human rights matter? What is the role of the news media? Does the news media still matter, or even exist? What is democracy? Democracy in Australia: (40 mins) - All relevant topics for the In-Class Writing Task starting in week 5. Internal guests discussing tools to do well in the Assessment: Senior Principal Learning Advisor, Mr Chris Frost: Argument MaPs (20 mins) - MaPs representatives and Outreach Librarian (30 Mins);",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(02 Mar - 08 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2 Tutorial</strong><br/><p>Overview of the Assessment - Political communication cases, actors and topics overtime: Research political communication literature and media articles in class - Working with the \"COMU3222 Political Communication Glossary\" - Activities - Q &amp; As.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 2 Tutorial</strong>",
            "topic_description": "Week 2 Tutorial Overview of the Assessment - Political communication cases, actors and topics overtime: Research political communication literature and media articles in class - Working with the \"COMU3222 Political Communication Glossary\" - Activities - Q & As.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3 Lecture: Naming, framing, affective polarisation</strong><br/><p>Naming, framing, agenda setting, affective polarisation - Some key concepts: Authoritarianism, Fascism, Oligarchy: More visible and normalised than ever? How are they framed by media? - All relevant topics for the In-Class Writing Task (IWT)</p>\n<p><strong>IMPORTANT NOTE: Political Client briefs 1. Please attend.</strong></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 3 Lecture: Naming, framing, affective polarisation</strong>",
            "topic_description": "Week 3 Lecture: Naming, framing, affective polarisation Naming, framing, agenda setting, affective polarisation - Some key concepts: Authoritarianism, Fascism, Oligarchy: More visible and normalised than ever? How are they framed by media? - All relevant topics for the In-Class Writing Task (IWT) IMPORTANT NOTE: Political Client briefs 1. Please attend.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3 Tutorial</strong><br/><p>Simulation: Activity 1: Mock In-Class Writing Task (IWT) starting in week 5 - Activity 2: How do you access the news?; The different roles and types of impact of the media (of all types) on politics today. Discussion.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 3 Tutorial</strong>",
            "topic_description": "Week 3 Tutorial Simulation: Activity 1: Mock In-Class Writing Task (IWT) starting in week 5 - Activity 2: How do you access the news?; The different roles and types of impact of the media (of all types) on politics today. Discussion.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4 Lecture: Persuasion and Propaganda - Client Brief 2</strong><br/><p>Persuasion and Propaganda - Speech and policy writing: are they important? Relevant topics for the IWT.</p>\n<p><strong>IMPORTANT NOTE: Political Client briefs 2. Please attend.</strong></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 4 Lecture: Persuasion and Propaganda - Client Brief 2</strong>",
            "topic_description": "Week 4 Lecture: Persuasion and Propaganda - Client Brief 2 Persuasion and Propaganda - Speech and policy writing: are they important? Relevant topics for the IWT. IMPORTANT NOTE: Political Client briefs 2. Please attend.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4 Tutorial</strong><br/><p>Activities: (a) Workshopping naming, framing, agenda setting; (b) Discussing affective polarisation, civility and incivility today: Impact on political discourse and conversation.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 4 Tutorial</strong>",
            "topic_description": "Week 4 Tutorial Activities: (a) Workshopping naming, framing, agenda setting; (b) Discussing affective polarisation, civility and incivility today: Impact on political discourse and conversation.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5 Lecture: Government Communication</strong><br/><p><strong>First IWT - Important to attend</strong>.</p>\n<p>Government Communication - Relevant topic for IWTs and assignments 2 and 3.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 5 Lecture: Government Communication</strong>",
            "topic_description": "Week 5 Lecture: Government Communication First IWT - Important to attend . Government Communication - Relevant topic for IWTs and assignments 2 and 3.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5 Tutorial</strong><br/><p><strong>Important: Forming groups and Selecting clients for assignments 2 and 3 - Writing team members' names on tutorial activities' spread sheet.</strong></p>\n<p>Activities: Working on Persuasion and Propaganda: Activities.</p>\n<p>Workshopping client's briefs. Discussing assignment 2 (Briefing paper).</p>\n<p>Practicing the briefing paper - Intro to policy analysis and to briefing papers.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 5 Tutorial</strong>",
            "topic_description": "Week 5 Tutorial Important: Forming groups and Selecting clients for assignments 2 and 3 - Writing team members' names on tutorial activities' spread sheet. Activities: Working on Persuasion and Propaganda: Activities. Workshopping client's briefs. Discussing assignment 2 (Briefing paper). Practicing the briefing paper - Intro to policy analysis and to briefing papers.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6 Lecture: Policy Communication</strong><br/><p><strong>Second IWT</strong> <strong>- Important to attend (15 mins).</strong></p>\n<p>Policy Communication - Policy analysis - The power of lobbying - Relevant topics for the next IWTs and assignments 2 and 3 (35 mins).</p>\n<p><strong>NOTE</strong>: Guest lecturer: Analysing freedom of expresion and free press vis-a-vis government's new hate speech regulations/policy (Prof. Peter Greste - TBA) (40 mins).</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 6 Lecture: Policy Communication</strong>",
            "topic_description": "Week 6 Lecture: Policy Communication Second IWT - Important to attend (15 mins). Policy Communication - Policy analysis - The power of lobbying - Relevant topics for the next IWTs and assignments 2 and 3 (35 mins). NOTE : Guest lecturer: Analysing freedom of expresion and free press vis-a-vis government's new hate speech regulations/policy (Prof. Peter Greste - TBA) (40 mins).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6: NO TUTORIALS DUE TO PUBLIC HOLIDAY</strong><br/></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 6: NO TUTORIALS DUE TO PUBLIC HOLIDAY</strong>",
            "topic_description": "Week 6: NO TUTORIALS DUE TO PUBLIC HOLIDAY",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Mid-sem break(06 Apr - 12 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MID-SEMESTER BREAK</strong><br/></p></div></td>",
            "topic_title": "<strong>MID-SEMESTER BREAK</strong>",
            "topic_description": "MID-SEMESTER BREAK",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7 Lecture: Political Campaigning overtime - Third IWT - Guest Lecturer in Government Communication: Ms Helen Hutchings (CPRA - Phillips Group)</strong><br/><p><strong>Third IWT - Important to attend (15 mins).</strong></p>\n<p>Political Campaigning - Key elements - Changes overtime - Polling  - Relevant topics for the IWTs. (35 mins).</p>\n<p><strong>Guest Lecturer in Policy and Government Communication (important for A2 and A3): Ms Helen Hutchings, Managing Director of CPRA and Phillips Group - Expert in the field (40 mins).</strong></p>\n<p><br/></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 7 Lecture: Political Campaigning overtime - Third IWT - Guest Lecturer in Government Communication: Ms Helen Hutchings (CPRA - Phillips Group)</strong>",
            "topic_description": "Week 7 Lecture: Political Campaigning overtime - Third IWT - Guest Lecturer in Government Communication: Ms Helen Hutchings (CPRA - Phillips Group) Third IWT - Important to attend (15 mins). Political Campaigning - Key elements - Changes overtime - Polling  - Relevant topics for the IWTs. (35 mins). Guest Lecturer in Policy and Government Communication (important for A2 and A3): Ms Helen Hutchings, Managing Director of CPRA and Phillips Group - Expert in the field (40 mins).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7 Tutorial</strong><br><p>Workshopping Briefing Paper, Policy Analysis, Problem Solving Framework, \"White Papers\". Q&amp;As A2.</p>\n<p>Activities: (a) Practising argument maps on freedom of expression vs regulations; (b) using human policy analysis vs AI tools to write Briefing Paper(A2). Class discussion.</p>\n<p><br/></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 7 Tutorial</strong>",
            "topic_description": "Week 7 Tutorial Workshopping Briefing Paper, Policy Analysis, Problem Solving Framework, \"White Papers\". Q&As A2. Activities: (a) Practising argument maps on freedom of expression vs regulations; (b) using human policy analysis vs AI tools to write Briefing Paper(A2). Class discussion.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8 Lecture: Platform Politics - Using media on, in and for politics</strong><br><p><strong>Fourth IWT</strong> <strong>- Important to attend</strong>.</p>\n<p>Platform politics: Use of media in, on, and for politics. Social media, content creators, misinformation, polarisation, politicisation, post truth, and audience political engagement. Final Q&amp;As A2.\"</p>\n<p><strong>Guest lecturer on \"platform fascism\": Dr. Luke Munn</strong></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 8 Lecture: Platform Politics - Using media on, in and for politics</strong>",
            "topic_description": "Week 8 Lecture: Platform Politics - Using media on, in and for politics Fourth IWT - Important to attend . Platform politics: Use of media in, on, and for politics. Social media, content creators, misinformation, polarisation, politicisation, post truth, and audience political engagement. Final Q&As A2.\" Guest lecturer on \"platform fascism\": Dr. Luke Munn",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8 Tutorial</strong><br/><p>Workshopping political campaigning - Activities - Class discussion.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 8 Tutorial</strong>",
            "topic_description": "Week 8 Tutorial Workshopping political campaigning - Activities - Class discussion.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9 Lecture: Populist Communication</strong><br/><p><strong>Fifth IWT</strong> <strong>- Important to attend</strong>.</p>\n<p>Lecture's new topic: Populist communication - Features and appeals: A framework - Populism vs democracy - Living in a populist age - Cartoon and Populist Super Heroes - The use of AI and Credibility and Trust? Relevant to the next IWTs.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 9 Lecture: Populist Communication</strong>",
            "topic_description": "Week 9 Lecture: Populist Communication Fifth IWT - Important to attend . Lecture's new topic: Populist communication - Features and appeals: A framework - Populism vs democracy - Living in a populist age - Cartoon and Populist Super Heroes - The use of AI and Credibility and Trust? Relevant to the next IWTs.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9 Tutorial</strong><br/><p>Discussing Platform Politics, social media, political content creators and their impact and their impact on political campaigning.</p>\n<p>Prepping assignment 3: Activities - Using media in political campaigns: Workshopping strategies and tactics for groups' selected clients.</p>\n<p>Discussion.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 9 Tutorial</strong>",
            "topic_description": "Week 9 Tutorial Discussing Platform Politics, social media, political content creators and their impact and their impact on political campaigning. Prepping assignment 3: Activities - Using media in political campaigns: Workshopping strategies and tactics for groups' selected clients. Discussion.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10(04 May - 10 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10 Lecture: The moral language of politics in post-truth times</strong><br/><p><strong>Sixth IWT</strong> <strong>- Important to attend</strong>.</p>\n<p>The moral language of politics in post-truth times: The links between weakening democracy, legacy media, and the rise of \"dark politics\". Using Human visuals vs AI videos in politics - Credibility and Trust? Trivialisation of Politics?</p>\n<p>Prepping tips for Political Communication Campaign and Pitching session.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 10 Lecture: The moral language of politics in post-truth times</strong>",
            "topic_description": "Week 10 Lecture: The moral language of politics in post-truth times Sixth IWT - Important to attend . The moral language of politics in post-truth times: The links between weakening democracy, legacy media, and the rise of \"dark politics\". Using Human visuals vs AI videos in politics - Credibility and Trust? Trivialisation of Politics? Prepping tips for Political Communication Campaign and Pitching session.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10(04 May - 10 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10 Tutorial</strong><br/><p>Discussing Populist Communication Style and its appeal - Activities: The populist use of Human visuals vs AI videos - Cartoon and Populist Super Heroes trend - Credibility and Trust? Trivialisation of Politics?</p>\n<p><br/></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 10 Tutorial</strong>",
            "topic_description": "Week 10 Tutorial Discussing Populist Communication Style and its appeal - Activities: The populist use of Human visuals vs AI videos - Cartoon and Populist Super Heroes trend - Credibility and Trust? Trivialisation of Politics?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11: LECTURE: Living in post-truth, disruptive populist times - Review- Seventh IWT  </strong><br><p><strong>Seventh IWT - Please attend</strong></p>\n<p>Living in post-truth, disruptive populist times: From disrupting to dissembling democracy? </p>\n<p>Review towards the Political Comm Campaign Plan (Assignment 3) - the Pitch - Political Communication Campaign framework - Strategies and tactics - Q&amp;As </p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 11: LECTURE: Living in post-truth, disruptive populist times - Review- Seventh IWT  </strong>",
            "topic_description": "Week 11: LECTURE: Living in post-truth, disruptive populist times - Review- Seventh IWT Seventh IWT - Please attend Living in post-truth, disruptive populist times: From disrupting to dissembling democracy? Review towards the Political Comm Campaign Plan (Assignment 3) - the Pitch - Political Communication Campaign framework - Strategies and tactics - Q&As",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11: Tutorial </strong><br/><p>Final Q&amp;As session and review to prepare for Assignment 3.</p>\n<p>Practicing the Pitch. Activity: Political client-consultant role play.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 11: Tutorial </strong>",
            "topic_description": "Week 11: Tutorial Final Q&As session and review to prepare for Assignment 3. Practicing the Pitch. Activity: Political client-consultant role play.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12(18 May - 24 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12: Final IWT - Some pitching sessions might be scheduled</strong><br/><p><strong>Eight and final IWT.</strong> </p>\n<p>Some pitches might be accepted to take place during lecture time and place (in person), upon request to the course coordinator and respective tutors (provided well supported reasons).</p>\n<p>Critical Reflection on COMU3222 Learning Experience.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 12: Final IWT - Some pitching sessions might be scheduled</strong>",
            "topic_description": "Week 12: Final IWT - Some pitching sessions might be scheduled Eight and final IWT. Some pitches might be accepted to take place during lecture time and place (in person), upon request to the course coordinator and respective tutors (provided well supported reasons). Critical Reflection on COMU3222 Learning Experience.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12(18 May - 24 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12 Tutorial: Pitching sessions</strong><br/><p><strong>Pitching sessions</strong>: Presenting your political campaign ideas in tutorials - Marked oral in-class task to obtain feedback (see Assignment 3 instructions). Your pitch will be marked together with written A4 campaign Plan, included in the same rubric.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 12 Tutorial: Pitching sessions</strong>",
            "topic_description": "Week 12 Tutorial: Pitching sessions Pitching sessions : Presenting your political campaign ideas in tutorials - Marked oral in-class task to obtain feedback (see Assignment 3 instructions). Your pitch will be marked together with written A4 campaign Plan, included in the same rubric.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13(25 May - 31 May)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13: NO LECTURE - NO TUTORIALS</strong><br/></p></div></td>",
            "topic_title": "<strong>Week 13: NO LECTURE - NO TUTORIALS</strong>",
            "topic_description": "Week 13: NO LECTURE - NO TUTORIALS",
            "learning_outcomes": []
        }
    ]
}