{
    "course_title": "Communication Law and Ethics",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/COMU2160-21895-7620",
    "full_course_code": "COMU2160-21895-7620",
    "course_code": "COMU2160",
    "class_code": "21895",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "understand the principles of self-regulation, co-regulation and statutory regulation in the Australian media and communication industries;"
        },
        {
            "number": "LO2.",
            "description": "recognise the application of laws relating to intellectual property, privacy, national security and defamation to the media and communication industries in Australia and other jurisdictions;"
        },
        {
            "number": "LO3.",
            "description": "critically evaluate the application of ethics, regulations, and the law to specific circumstances and cases in the media and communication industries, particularly in Australia;"
        },
        {
            "number": "LO4.",
            "description": "act ethically as a practitioner in journalism and professional communication."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Mid-Semester Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30% Short and long answer </dd>",
            "due_date": "<dd><p>In-semester Saturday</p>\n<p>28/03/2026 - 2/05/2026</p></dd>",
            "learning_objectives": "L03, L04",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The examination (scheduled centrally) will consist of short-answer questions and test your understanding and application of course content from Week 1, 2, 3, 4, &amp; 5. The exam will be delivered on-campus.</p>\n<p>Please refer to Blackboard for further details on how to prepare for the exam.</p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Social Media Ban Analysis",
            "special_indicators": [],
            "weighting": "<dd>35% 1300 words </dd>",
            "due_date": "<dd><p> 8/05/2026 4:00 pm</p></dd>",
            "learning_objectives": "L01, L03, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>In a world’s first move that captured global attention, Australia passed legislation banning social media access for users under 16 years old last year. The legislation imposes substantial penalties of up to A$50 million on platforms that fail to prevent under-16s from creating accounts. While social media platforms like Snapchat, TikTok, Facebook, Instagram, and X are affected, the ban excludes gaming and messaging platforms.</p>\n<p>The legislation represents a significant shift in how governments approach youth safety online, moving beyond traditional self-regulatory frameworks to direct intervention. However, questions remain about whether such restrictions are the most effective way to protect young people online, or if alternative approaches might better achieve these goals while preserving the benefits of digital connectivity.</p>\n<p>For your assessment #2, please choose and complete one of the alternatives described below. </p>\n<p><strong>Alternative 1</strong></p>\n<p>In a 1300-word analysis (including an introduction and a conclusion), address the following questions:</p>\n<p>Provide an analysis discussing the pros and cons of Australia's social media ban for under-16s. While doing so, please:</p>\n<ul>\n<li>Discuss the perspectives of different stakeholders including parents, young people, platforms, educators, and policy makers.</li>\n<li>Discuss the limitations and challenges of implementing this type of regulation.</li>\n<li>Discuss the intended and unintended consequences of such a regulation on the media markets and stakeholders like parents, adults, young people, educators.</li>\n<li>Support your analysis with evidence and examples from previous literature focusing on effectiveness of methods for protecting children from negative effects of media products, the effectiveness and positive and negative consequences of statutory regulations about social media and regulations that restrict access to online content.</li>\n<li>Propose alternative approaches to protecting young people on social media. What other ways could we make social media safer for young people? Support your proposals with evidence from existing research or successful initiatives in other contexts.</li>\n</ul>\n<p><br/></p>\n<p>Your response should demonstrate critical thinking, engagement with multiple perspectives, and careful consideration of practical implications. Include relevant citations and examples to support your arguments.</p>\n<p><strong>Alternative 2</strong></p>\n<p>You are a reporter working for Reuters. You specialize in media technologies. It's the beginning of 2027 and Australia's social media ban has been in place for a year. Write a 1300-word news report about what happened since the law took effect. To what extent did it work? What were the reasons? What challenges were faced? What were the consequences of the law? The report should be an evidence-based analysis in the style of a detailed news feature that evaluates the ban's consequences.</p>\n<p>Your analysis should:</p>\n<ul>\n<li>Examine the impact of the ban through the lens of media the perspectives of different stakeholders including parents, young people, platforms, educators, and policy makers.</li>\n<li>Support your analysis with evidence and examples from previous literature focusing on effectiveness of methods for protecting children from negative effects of media products, the effectiveness and positive and negative consequences of statutory regulations about social media and regulations that restrict access to online content. Draw on existing research about similar regulatory interventions in other countries (e.g., France's age restrictions, UK's online safety measures).</li>\n<li>Discuss what lessons should regulators in other countries learn from Australia’s social media ban experiment.</li>\n</ul>\n<p><br/></p>\n<p>Your response should demonstrate critical thinking, engagement with multiple perspectives, and careful consideration of practical implications. Include relevant citations and examples to support your arguments.</p>\n<p> </p>\n<p><strong>Assessment Criteria</strong></p>\n<p>The criteria sheet is available on course Blackboard page.</p>\n<p><strong>Use of Artificial Intelligence in the Assessment: </strong></p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance and append a copy of the completed AI Info Table to summarise their use of AI at the end of their assessment.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via TurnItIn on Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Media Law Training Material",
            "special_indicators": [],
            "weighting": "<dd>35% 1300 words </dd>",
            "due_date": "<dd><p> 8/06/2026 4:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Role play/ Simulation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You are working as a training coordinator of the Human Resources department at a media company. You can choose the type of media company (e.g., an online news source, social media platform, newspaper, an AI video company). The Chief Learning Officer has given you the task of developing training materials regarding relevant laws.</p>\n<p>These training materials should serve as a resource for training new staff members in understanding and complying with these laws and maintaining ethical standards. As a pilot for his training program, you need to develop the training materials for one of the areas listed below. Please choose a domain that is relevant to the company you are working for (e.g., whistle-blower protection for a news organisation). This may include the following; however, you may choose another relevant domain with the approval of the course coordinator:</p>\n<ul>\n<li>Data privacy</li>\n<li>Freedom of Information (FOI)</li>\n<li>Whistle-blower Protection</li>\n<li>Legal protection of journalists and their sources (including shield laws and contempt)</li>\n<li>Defamation</li>\n<li>Intellectual property</li>\n</ul>\n<p>You can choose to develop the training material for a jurisdiction you are interested in (e.g., GDPR in the EU; Defamation Law in China; FOI in Australia).</p>\n<p><strong>Steps:</strong></p>\n<ol>\n<li>Pick the type of media company, law domain, and the jurisdiction you will work on.</li>\n<li><strong>Research:</strong> Research the relevant laws in the jurisdiction you have chosen. You can use the assigned readings as a reference; however, you will need to also familiarize yourself with recent case studies, examples, or controversies related to these laws in the media industry. </li>\n<li><strong>Training Materials Development:</strong> Determine the format of your training materials. You can produce a <strong>booklet, website, infographic, or video</strong>. You can also mix the formats. For example, you can create a website with short videos. If you want to design a booklet or an infographic, you can use publishing tools like Adobe InDesign, Canva, Word, Pages, Keynote, or PowerPoint. If you want to produce an interactive web resource, you can use web content management tools such as WordPress, Wix, or Weebly. If you want to produce videos, you can use video editing or animation tools like Adobe Premiere, Final Cut Pro, Adobe Animate. Keep in mind that this is not an essay; the training material you produce should be visually appealing.</li>\n<li><strong>Prepare Your Training:</strong> Produce the content of your training materials with the following sections:</li>\n<li><strong>Introduction:</strong> Provide an overview of the importance of the law area (e.g., privacy, free speech) for the media industry. Explain the potential consequences of non-compliance or organizations and their stakeholders. Please remember that the consequences you are describing should be specific to the law area you selected. For example, if you are focusing on copyright, the consequences you are describing should be about the consequences of failing to comply with copyright laws in the jurisdiction you are focusing on. </li>\n<li><strong>Relevant Laws:</strong> Summarize the relevant laws, including their key provisions and what they require from individuals and organizations. Illustrate the application of these laws with examples or scenarios specific to the media industry. Summarize relevant procedures that individuals and organizations should follow to comply with the law. For example, if you are describing the General Data Protection Regulation in the EU, a procedure you may need to describe would be what a company should do if a data subject requests to review the data you have about them. </li>\n<li><strong>Best Practice Guidelines:</strong> Develop a set of best practices and ethical guidelines that media professionals should follow to ensure compliance with the relevant laws you are describing. Again, keep in mind that the best practice and ethical guidelines should be specific to the legal area you are focusing on. For example, if you are focusing on defamation laws in Australia, you need to discuss what measures a journalist can take to avoid putting themselves at risk of defaming someone. </li>\n</ol>\n<p><strong>Important Notes:</strong></p>\n<ol>\n<li>The word length for the assignment is 1300 words</li>\n<li>While preparing your training material, please pay attention to formatting and style.</li>\n<li>Training materials should be engaging for the reader.</li>\n<li>If you choose to produce a video or multiple videos, each minute of video is equivalent to 120 words.</li>\n<li>Training material should assume that the reader has no previous training on the legal issues the training is focusing on. Please use a language that is accessible to adults who do not have prior training in media law. Minimize the use of technical or legal jargon. </li>\n<li>Long texts would confuse and bore the readers. Rather than just relying on lengthy texts, when appropriate, use techniques like bullets, lists. To reduce the burden on the reader, use section headers to divide long texts into short, digestible units. </li>\n<li>Use visual aids to increase the comprehensibility of the information. For example, when you are discussing procedures, you can use flow charts instead of summarizing the procedure with long sentences. Alternatively, you can use text boxes or thought bubbles to draw attention to a key point your readers should remember.</li>\n<li>For this assessment, you can use any citation style you use. If you want a style that will minimize interruptions in the text, we recommend the use of a style that relies on footnotes or endnotes (e.g., Chicago Manual of Style 17th edition – full note, IEEE, Springer – Humanities).</li>\n</ol>\n<p><strong>Assessment Criteria:</strong></p>\n<p>The criteria sheet is available on course Blackboard page. </p>\n<p><strong>Use of Artificial Intelligence in the Assessment: </strong></p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance and append a copy of the completed AI Info Table (available on course Blackboard page) to summarise their use of AI at the end of their assessment.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1 Lecture:</strong><br><p>Course overview and Introduction to the media landscape</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 1 Lecture:</strong>",
            "topic_description": "Week 1 Lecture: Course overview and Introduction to the media landscape",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1: NO TUTORIALS</strong><br><p>Tutorials start in Week 2</p></br></p></div></td>",
            "topic_title": "<strong>Week 1: NO TUTORIALS</strong>",
            "topic_description": "Week 1: NO TUTORIALS Tutorials start in Week 2",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(02 Mar - 08 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2 Lecture:</strong><br><ul>\n<li>Introduction to media ethics</li>\n<li>Why do we need ethics?</li>\n</ul></br></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 2 Lecture:</strong>",
            "topic_description": "Week 2 Lecture: Introduction to media ethics Why do we need ethics?",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(02 Mar - 08 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2 Tutorial:</strong><br><ul>\n<li>Introduction of Assessment #1</li>\n<li>Codes of Ethics in Communication</li>\n<li>Case Study: Ethics in PR</li>\n</ul></br></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 2 Tutorial:</strong>",
            "topic_description": "Week 2 Tutorial: Introduction of Assessment #1 Codes of Ethics in Communication Case Study: Ethics in PR",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3 Lecture:</strong><br><ul>\n<li>General Introduction to Ethical Theories</li>\n<li>Ethical Theories: Consequentialist Ethics</li>\n</ul></br></p><p><strong>Learning outcomes:</strong> L03, L04</p></div></td>",
            "topic_title": "<strong>Week 3 Lecture:</strong>",
            "topic_description": "Week 3 Lecture: General Introduction to Ethical Theories Ethical Theories: Consequentialist Ethics",
            "learning_outcomes": [
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3 Tutorial:</strong><br/><ul>\n<li>Consequentialist Ethics Review</li>\n<li>Case Study: Ethics in PR (continued from Week 2 with questions about consequentialism)</li>\n<li>Assessment #1 Clinic - Literature Search &amp; Using Zotero for Bibliographies</li>\n</ul>\n<p><br/></p></p><p><strong>Learning outcomes:</strong> L03, L04</p></div></td>",
            "topic_title": "<strong>Week 3 Tutorial:</strong>",
            "topic_description": "Week 3 Tutorial: Consequentialist Ethics Review Case Study: Ethics in PR (continued from Week 2 with questions about consequentialism) Assessment #1 Clinic - Literature Search & Using Zotero for Bibliographies",
            "learning_outcomes": [
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4 Lecture:</strong><br><ul>\n<li>Ethical Theories: Denontology</li>\n<li>Ethical Theories: Virtue Ethics</li>\n</ul></br></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 4 Lecture:</strong>",
            "topic_description": "Week 4 Lecture: Ethical Theories: Denontology Ethical Theories: Virtue Ethics",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4 Tutorial:</strong><br/><ul>\n<li>Assessment #1 Clinic - Discussion on Facts of the Case</li>\n<li>Review of Ethical Theories</li>\n<li>Case Study: Online Harms and Christchurch Mosque massacre</li>\n<li>Debate: Ethics of Generative AI</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 4 Tutorial:</strong>",
            "topic_description": "Week 4 Tutorial: Assessment #1 Clinic - Discussion on Facts of the Case Review of Ethical Theories Case Study: Online Harms and Christchurch Mosque massacre Debate: Ethics of Generative AI",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5 Lecture:</strong><br/><ul>\n<li>Primer on Legal Terms: Regulation, Self-Regulation and Co-Regulation</li>\n<li>Media Regulation: Competition and Ownership</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 5 Lecture:</strong>",
            "topic_description": "Week 5 Lecture: Primer on Legal Terms: Regulation, Self-Regulation and Co-Regulation Media Regulation: Competition and Ownership",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5 Tutorial:</strong><br/><ul>\n<li>Media Regulation Concepts Overview</li>\n<li>Comparative Analysis: Assessing Threats to Media Market Pluralism</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 5 Tutorial:</strong>",
            "topic_description": "Week 5 Tutorial: Media Regulation Concepts Overview Comparative Analysis: Assessing Threats to Media Market Pluralism",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6 Lecture:</strong><br/><p>Media Regulation: Broadcasting</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 6 Lecture:</strong>",
            "topic_description": "Week 6 Lecture: Media Regulation: Broadcasting",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6 Tutorial: NO TUTORIAL DUE TO PUBLIC HOLIDAY </strong><br/><p>No tutorials this week due to public holiday. </p></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 6 Tutorial: NO TUTORIAL DUE TO PUBLIC HOLIDAY </strong>",
            "topic_description": "Week 6 Tutorial: NO TUTORIAL DUE TO PUBLIC HOLIDAY No tutorials this week due to public holiday.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Mid-sem break(06 Apr - 12 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MID-SEMESTER BREAK</strong><br/></p></div></td>",
            "topic_title": "<strong>MID-SEMESTER BREAK</strong>",
            "topic_description": "MID-SEMESTER BREAK",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7 Lecture:</strong><br/><p>Media Regulation: Newspapers and Advertising</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 7 Lecture:</strong>",
            "topic_description": "Week 7 Lecture: Media Regulation: Newspapers and Advertising",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7 Tutorial:</strong><br/><ul>\n<li>Introduction to Assessment #2</li>\n<li>Case Study: Ad Standards and Nimble's Advertising</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 7 Tutorial:</strong>",
            "topic_description": "Week 7 Tutorial: Introduction to Assessment #2 Case Study: Ad Standards and Nimble's Advertising",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8 Lecture:</strong><br/><p>Media Regulation: Digital Platforms, Social Media and AI</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 8 Lecture:</strong>",
            "topic_description": "Week 8 Lecture: Media Regulation: Digital Platforms, Social Media and AI",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8 Tutorial:</strong><br/><ul>\n<li>Issues in Platform Regulation: Misinformation and Content Moderation on Digital Platforms</li>\n<li>Assessment #2 Clinic: The Social Media Ban - Dimensions of the Debate</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 8 Tutorial:</strong>",
            "topic_description": "Week 8 Tutorial: Issues in Platform Regulation: Misinformation and Content Moderation on Digital Platforms Assessment #2 Clinic: The Social Media Ban - Dimensions of the Debate",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9 Lecture:</strong><br/><p>Media Law: Freedom of Expression; Freedom of Information</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 9 Lecture:</strong>",
            "topic_description": "Week 9 Lecture: Media Law: Freedom of Expression; Freedom of Information",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9 Tutorial:</strong><br/><ul>\n<li>Case Study: Free Speech, BCC and Gary Lineker</li>\n<li>Introduction of Assessment #3</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 9 Tutorial:</strong>",
            "topic_description": "Week 9 Tutorial: Case Study: Free Speech, BCC and Gary Lineker Introduction of Assessment #3",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10(04 May - 10 May)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10: NO LECTURE OR TUTORIALS</strong><br/></p></div></td>",
            "topic_title": "<strong>Week 10: NO LECTURE OR TUTORIALS</strong>",
            "topic_description": "Week 10: NO LECTURE OR TUTORIALS",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11 Lecture:</strong><br/><p>Media Law: Defamation; Privacy</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 11 Lecture:</strong>",
            "topic_description": "Week 11 Lecture: Media Law: Defamation; Privacy",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11 Tutorial:</strong><br/><ul>\n<li>Defamation Defence Exercises</li>\n<li>Defamation Case Study: Ben Roberts-Smith</li>\n<li>Assessment #3 Clinic - Examples and Discussion</li>\n</ul></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 11 Tutorial:</strong>",
            "topic_description": "Week 11 Tutorial: Defamation Defence Exercises Defamation Case Study: Ben Roberts-Smith Assessment #3 Clinic - Examples and Discussion",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12(18 May - 24 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12 Lecture:</strong><br/><p>Media Law: Privacy (continued from Week 12); Intellectual Property</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 12 Lecture:</strong>",
            "topic_description": "Week 12 Lecture: Media Law: Privacy (continued from Week 12); Intellectual Property",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12(18 May - 24 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Weel 12 Tutorial:</strong><br/><ul>\n<li>Privacy Discussion: What \"Informed Consent\" Means?</li>\n<li>Intellectual Property Discussion: Balancing Copyrights and Public Access</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Weel 12 Tutorial:</strong>",
            "topic_description": "Weel 12 Tutorial: Privacy Discussion: What \"Informed Consent\" Means? Intellectual Property Discussion: Balancing Copyrights and Public Access",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13(25 May - 31 May)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13: NO LECTURE OR TUTORIALS</strong><br/></p></div></td>",
            "topic_title": "<strong>Week 13: NO LECTURE OR TUTORIALS</strong>",
            "topic_description": "Week 13: NO LECTURE OR TUTORIALS",
            "learning_outcomes": []
        }
    ]
}