{
    "course_title": "Communication Campaigns",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/COMU7301-21911-7620",
    "full_course_code": "COMU7301-21911-7620",
    "course_code": "COMU7301",
    "class_code": "21911",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Explore, discuss, and apply theoretical and professional frameworks to real life communication cases, situations or problems; demonstrate knowledge of ethical and regulatory obligations linked with communication planning; and provide critical insights into contemporary trends, challenges and opportunities in the strategic communication/PR field and practice."
        },
        {
            "number": "LO2.",
            "description": "Develop problem solving capabilities to work individually and in groups with integrity, vision and courage; analyse a client brief, its aims, context and challenges; specific communication needs, and main stakeholders involved; and conduct feasible research methods whose findings will inform the campaign planning process."
        },
        {
            "number": "LO3.",
            "description": "Design meaningful, ethical, and effective strategic communication campaigns, programs or projects that propose: (a) clear goals and a holistic strategy; (b) 'SMART' objectives; (c) meaningful messaging; (d) culturally aware strategies and tactics to connect with relevant publics via interpersonal, community and digital communication techniques, tools and channels; and, (e) adequate evaluation methods that ensure that objectives are met."
        },
        {
            "number": "LO4.",
            "description": "Analyse, write, and present cases, projects and campaigns critically, strategically, and ethically by effectively researching and using library, digital, and industry resources; academic referencing styles; relevant rubrics and frameworks; and basic statistical information and/or data analytics."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "In-Class Writing Task (sequence)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30% 1250 words </dd>",
            "due_date": "<dd><p> 24/03/2026 - 26/05/2026</p>\n<p>\n</p><p>Task sheets will be written during lecture time. </p></dd>",
            "learning_objectives": "L01, L02",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>There will be 8 in-class writing tasks held in the lecture beginning in week 5 and concluding in week 13 (no writing tasks in week 8 due to industry guest lecture). This assignment asks students to demonstrate knowledge and understanding of some of the main strategic communication theories, concepts and professional themes discussed during the lectures in the previous weeks.You will be asked to briefly <strong>define and critically reflect on the topic or concept</strong> in your own words, in a handwritten task-sheet. <strong>You will be prepared to explain why the concept/topic is important to understand, or resolve, strategic communication projects in either industry or academic settings. You will also be prepared to link the concept to a 'real-life' example from lectures, tutorials, weekly readings and/or reliable media sites</strong>. You will be given <strong>15 minutes (5 minutes to prepare and 10 mins to write)</strong> to provide a <strong>handwritten answer of a maximum of 250 words (5 X 250 = 1250 words in total</strong>). <strong>A list of key topics/concepts will be published on Blackboard (Assessment and Learning Resources section) in week 2. </strong> You are expected to <strong>acknowledge or cite some of the ideas or authors that were discussed in previous classes or in the material you studied for the assignment</strong>. Therefore, reading, understanding and applying weekly material and participating in discussions in lectures and tutorials will be crucial to obtain the maximum grade. You may use an 'argument map' to develop your answer. <strong>This assessment evaluates students' own critical thinking and problem solving capabilities, engagement with course themes, and academic knowledge</strong>. <strong>More information about this assignment, list of main topics, and the rubric, will be posted to Blackboard in week 2.</strong></p>\n<p><strong>IMPORTANT NOTE 1</strong>: There will be <strong>8 opportunities</strong> to take the In-Class Writing Tasks, but <strong>you only need to take 5 (valued at 6 pts each), which together will form a maximum of 30 pts</strong>. I<strong>f you do more than 5 Writing Tasks, we will select the best 5</strong>. This also means that you <strong>may miss up to 3 tasks</strong> without penalty. However, <strong>there will be NO opportunities to re-take individual papers, and no alternative assessment will be available (except in very specific circumstances</strong>,<strong> such as a ‘Disability Action Plan’ in place, or other genuine, well documented/supported reasons, such as medical issues, carer’s responsibility; sudden accident)</strong>. So please, try to take as many as In-Class Writing Tasks as you can.</p>\n<p><strong>IMPORTANT NOTE 2</strong>: This assignment will be completed in person, during lectures, and is handwritten. <strong>You must bring your own pen(s) to the lecture.</strong> <strong>We will provide a task-sheet (paper) where you will write your name, student number, tutorial group and/or tutor’s name, and your answer.</strong> This task has been designed to be challenging, authentic and complex. So please engage with concepts, relevant authors, and themes from the beginning. The use of <strong>generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted</strong>. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>This assignment will be completed in person, during lectures, and is handwritten. There will be 8 in-class writing tasks held in the lecture beginning in week 5 and concluding in week 13. You will be given 15 minutes (5 minutes to prepare and 10 mins to write) to provide a handwritten 250-word answer (maximum). A task sheet (paper) will be provided in the lecture. You must bring your own pen(s). You will write your names, student number, tutorial number/day/time, and tutor's name. At the end of the 15 minutes, you will hand the paper with your answer to the lecturer and/or members of the teaching team who are present in the lecture room. Writing Tasks will not be set on holidays, or when some special guests are scheduled, or in the case of unexpected events. Please refer to Blackboard for dates.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p><strong>Late Submission is NOT APPLICABLE (see assignment instructions).</strong></p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Situation Analysis & Research Proposal",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>10% 1000 words </dd>",
            "due_date": "<dd><p> 2/04/2026 4:00 pm</p></dd>",
            "learning_objectives": "L01, L02",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assignment (and the following ones) will be developed <strong>in groups of ideally 4 members (max 5) with whom you will continue to work for assignments 2 and 3</strong>. If you wish to work individually you will need to talk with the course coordinator and present genuine and well supported reasons.</p>\n<p>The groups will send an email to the tutor and course coordinator with the full names of all team members and the name of the selected client. You will also write your names on a spread sheet that will be provided in tutorials.<strong> </strong>Teamwork involves full commitment to work with professionalism, executing allocated tasks in time, and respecting each other (see UQ group work <a href=\"https://my.uq.edu.au/information-and-services/student-support/study-skills/group-work/working-group\">guidelines</a> and <a href=\"https://policies.uq.edu.au/document/view-current.php?id=412\">policy</a>; also material on Bb). <strong>IMPORTANT: </strong>ALL students will self-enrol in a Blackboard group (instructions Bb). If you do not self enrol on Bb, you will not be able to submit or see your feedback and grades. Talk with the course coordinator and tutor if you have any issues in this regard.</p>\n<p><strong>The team will submit just one report (the same for all) via Blackboard, and will receive the same feedback and marks.</strong></p>\n<p><strong>You may use a power point or word document to present this task. It may written using a mix of narrative style with dot points.</strong></p>\n<p><strong>This task should include a graph/table of your SWOT, PEST, or other type of situation or contextual analysis as an illustration of your initial research work. To strengthen your situation analysis you may also include a graph with a communication audit and preliminary stakeholder map (optional but desirable). You are expected to include a reference list citing any material or secondary research used in the findings, e.g. reports, textbook frameworks (the ref. list will not included in the word count). </strong></p>\n<p><strong>The task consists of two parts, </strong></p>\n<p><strong>(1) Written Report (5% - 500 words aprox.)</strong></p>\n<p>It will include:</p>\n<p>      i.        Key elements of your client organisation, background, ‘the issue’, that is, client’s communication need and aim ('problem statement') (presented by the client in week 3).</p>\n<p>     ii.        A Situation Analysis and/or PEST analysis, and a communication/media audit of your client organisation (this is preliminary background desk research).</p>\n<p>    iii.        Identify the main communication problems/opportunities/challenges that your client organisation faces.</p>\n<p>   iv.        Identify client's <strong>key stakeholder groups</strong> for this campaign specifically (stakeholder map may be included).</p>\n<p><strong>(2) Written Research Proposal (5% - 500 words approx.)</strong></p>\n<p>It will include:</p>\n<p>      i.        <strong>Research proposal</strong>: Your research approach and methods will include a <strong>sample research item</strong> (e.g. type of secondary research; or a questionnaire for a survey; or a type of social media analysis; or other.</p>\n<p>     ii.        The proposal should consist of <strong>feasible and realistic</strong> primary (quantitative or qualitative), and/OR secondary research methods; and/or social media analysis; and/or any mix of the above. Single methods are possible.</p>\n<p>    iii.        Justify briefly why the method(s) proposed is/are <strong>appropriate to respond to the client's brief and target publics's attitudes, in the context</strong> <strong>in which they operate</strong>.</p>\n<p>   iv.        <strong>Research schedule: </strong>A realistic timeline to complete the research task whose findings will inform A3. Feedback from your markers will help you advance towards the next step.</p>\n<p>More informationon Blackboard (Course Resources and Assessment folders).</p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Group submission via Blackboard</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Research Findings Report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20% 1500 word report </dd>",
            "due_date": "<dd><p> 30/04/2026 4:00 pm</p>\n<p>\n</p><p>Submit via Blackboard</p>\n<p><br/></p></dd>",
            "learning_objectives": "L01, L02, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Presentation, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This third task, a <strong>Report,</strong> will continue to be prepared and submitted with your respective groups. After conducting the research proposed in assignment 2, A3 asks you to prepare a Report that will include: </p>\n<ul>\n<li><strong>(a) A list of research findings; </strong></li>\n<li><strong>(b) An outline that will explain and justify why and how those findings will help you design the strategic communication plan for your client, and </strong><strong>will enable you to frame, reframe, or refine the goal; main message(s); target publics; </strong></li>\n<li><strong>(c) A minimum of one, preferably two preliminary SMART campaign objectives;</strong> </li>\n<li><strong>(d) A graph, table, or other schematic material whereby your group will display your research findings to your client and marker.</strong> This means that the Report will include some form of visualisation of your findings (you can use simple tables, graphs of any type, or other visuals). </li>\n</ul>\n<p><strong>Your report should have professional quality and creativity. </strong><strong>For this assignment you</strong> <strong>will try to use the organisation's logo, colours, and overall look and feel </strong>(see style guide if available). Also, you should start creating <strong>your own agency/consultancy name and</strong> <strong>logo to receive feedback</strong> (this is a simulation, but it is important to be and look profesional). </p>\n<p><strong>Through this task and its Report</strong> <strong>students will demonstrate their understanding of the communication challenge or problem </strong>presented by the client. Students are expected to <strong>identify and reflect upon the importance of their research findings and the way those findings will inform their campaign plan (A4). Students will also demonstrate their problem solving capabilities in strategic communication projects or issues.</strong> </p>\n<p><strong>IMPORTANT NOTE 1</strong>: <strong>For this report you will NOT include strategies and tactics YET (these will be included in the final Campaign Plan = A4).</strong></p>\n<p><strong>IMPORTANT NOTE 2: You are expected to include a reference list citing any material or secondary research used in the findings, e.g. textbook material, relevant reports, statistics (this ref. list will not included in the word count). </strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Group submission Blackboard</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Strategic Communication Campaign Plan",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40% 2000 word report and presentation </dd>",
            "due_date": "<dd><p> 11/06/2026 4:00 pm</p>\n<p>\n</p><p>Submit via Blackboard the written Campaign Plan on 11 June.</p>\n<p>Oral Pitch: Your group will pitch this plan in tutorials in week 13 (values 8 pts of the overall grade = 20% of 40 marked using the A4 rubric). You may bring one or two slides to the class. Groups will have 8 to 10 minutes per group to present. </p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Oral, Product/ Artefact/ Multimedia, Written",
            "category": "Paper/ Report/ Annotation, Presentation, Product/ Design",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>The fourth and final piece assessment, the Campaign Plan, consists of your Plan with the full proposal responding to the client. This task will be prepared, delivered and submitted by your group in two formats: (a) Pitch in Class on week 13 in tutorials (8 pts = 20%), listing the main elements of the campaign and highlighting a \"star tactic\"; and (b) Campaign Plan written and presented in slides submitted by the group via Blackboard (32 pts = 80%) on the due date (during Exam week 1).</strong> </p>\n<p><strong>The Pitch:</strong></p>\n<ul>\n<li><strong>In week 13 you will orally pitch the main elements of your plan and will display (in writing, digitally, graphically, audio-visually) ONE of the key tactics, assets, or collaterals that you will propose in your plan (the most important).</strong> <strong>Your group will have between 8 to10 mins including feedback. </strong>For example, a media release; a social media tactic; a website; a newsletter; brochure or flyer; a blog post for the client’s website; social media material; podcast or video; a PR event; a speech/conference; advocacy/lobby campaign; fundraising event; community relations/engagement plan and/or event, etc. In your pitch you will briefly justify why this is your main tactic, and how it will contribute to the success of your campaign for your client. The tactics and \"star tactic' should aim to be effective, ethical, socially and contextually aware, displaying attractive and meaningful content that can potentially meet the client's communication need. This task values 8 pts (20% of 40, which is the overall grade for this assignment) which will be marked using the overall assignment rubric ('Plan/Design' item). Your pitch, will last between 8 and 10 mins and will be recorded for marking purposes. Please let your course coordinator and tutor know in writing if you would prefer not to be recorded by either voice or image so accomodations can be made. Reference any computational material used in your \"star\" tactic or other elements.<strong> You may bring 1-3 slides to pitch</strong> your plan in class.</li>\n</ul>\n<p><br/></p>\n<p><em>All presentations</em> will be recorded for marking purposes via recording facilities available where the assessment takes place (eg. ECHO360, Zoom, camera device). Recordings will be retained by the School of Communication and Arts for at least 12 months from the release of the final grade for the course. Recordings will be stored in a secure manner and will only be accessed by authorised school staff for the purposes of: </p>\n<ul>\n<li>Moderation of marking;  </li>\n<li>Provision of feedback to the student(s) recorded; and/or  </li>\n<li>Re-marking following a successful re-mark application. </li>\n</ul>\n<p><br/></p>\n<p><strong>Your Campaign Plan ideally written in presentation slides format will include:</strong></p>\n<ol>\n<li><strong>Your consultancy name, professional-looking logo, and 'credentials' </strong>as PR/Comm consultant(s), and a cover letter addressed to your client (optional).</li>\n<li><strong>Executive Summary</strong> with the main campaign elements proposed by your group.</li>\n<li><strong>Your complete Campaign Plan where you will deploy: </strong>A refined/revised version of some of the elements already submitted for assignments 2 and 3, such as, (a) client's communication need/issue; (b) outline of research methods used and main findings; (c) main goal (intended outcome) of the specific campaign; (d) strategic approach; (e) key publics, (f) main message(s); (g) complete list of SMART objectives; and the following.</li>\n<li><strong>New elements:</strong> </li>\n</ol>\n<ul>\n<li><strong>Communication/action strategies and tactics</strong> (with the complete list of tactics).</li>\n<li><strong>Logistics: Campaign budget and schedule </strong>(two Gantt charts table or other).</li>\n<li><strong>Proposed evaluation methods</strong> (which may be used in the future, after execution) that will demonstrate that the objectives will be effectively met; ideally in a table vis-a-vis target publics and strategies.</li>\n<li><strong>Conclusion. </strong>A paragraph where you will briefly deploy the rationale, limitations, theoretical considerations (i.e. theoretical material that helped/inspired you in the planning process), used to inform the campaign proposal; and possible ethical/legal considerations that may arise from, or concern the campaign plan (if any) <strong>according to best practice frameworks</strong>; final recommendations (if any).</li>\n<li><strong>A reference list </strong>of any theories, frameworks, statistics from textbooks, reports, or online resources used in the planning, design and illustration of the Campaign, and other elements that may or may not be computational (e.g. the use of Canva, or other) <strong>which must be cited for integrity/ethical reasons </strong>(the ref. list will not be included in the word count). <strong>You will also reference your client's company or website.</strong></li>\n</ul>\n<p>Both, the Campaign Plan content and slides <strong>must aim at high a level of professional quality, creativity, and authenticity.</strong> <strong>All the elements in the Plan must respond to the client brief and campaign goal, and must be consistent with the client organisation's style guide</strong>. You will include the budget, schedule and evaluation methods (simulation) using tables/graphs for some of those items.<strong> Note that human writing and visuals are preferred to AI writing or images, which may look boring, repetitive and often lack creativity. You must not mention the client and its issues if you intend to use AI tools (if so you must reference and acknowledge its use).</strong> <strong>Overall, this is the task that will demonstrate your group's critical thinking and true problem solving capabilities, which are highly appreciated by the industry. </strong></p>\n<p><strong>It is crucial that students take relevant MaPS training workshops, as well as Library and LinkedIn Learning workshops in advance, during the first weeks of the semester.</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Group work via Blackboard</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1 Lecture: Welcome and Introduction</strong><br><p>Course &amp; Assessment overview - Introduction to strategic communication theory, campaigns, and research methods. Strategic Planning \"in a changing world\". Best Practice Frameworks. The importance of Context. PR Fields &amp; Ethical Practice. Meet your Librarian and MaPS team. The importance of academic integrity and writing.</p></br></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Week 1 Lecture: Welcome and Introduction</strong>",
            "topic_description": "Week 1 Lecture: Welcome and Introduction Course & Assessment overview - Introduction to strategic communication theory, campaigns, and research methods. Strategic Planning \"in a changing world\". Best Practice Frameworks. The importance of Context. PR Fields & Ethical Practice. Meet your Librarian and MaPS team. The importance of academic integrity and writing.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1 Turorial: NO TUTORIALS THIS WEEK</strong><br><p>Tutorials start in Week 2.</p></br></p></div></td>",
            "topic_title": "<strong>Week 1 Turorial: NO TUTORIALS THIS WEEK</strong>",
            "topic_description": "Week 1 Turorial: NO TUTORIALS THIS WEEK Tutorials start in Week 2.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(02 Mar - 08 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2 Lecture: Theory and Practice Frameworks</strong><br><p>Continue discussing theories, concepts, theory and practice frameworks, and current topics (prepping for Assignment 1). Intro to working for a client: Listening to client briefs (which will occur in weeks 3 and 4). The importance of critical thinking: Argument Maps (Guest - Learning Designer Senior Principal Manager, Mr Chris Frost).</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 2 Lecture: Theory and Practice Frameworks</strong>",
            "topic_description": "Week 2 Lecture: Theory and Practice Frameworks Continue discussing theories, concepts, theory and practice frameworks, and current topics (prepping for Assignment 1). Intro to working for a client: Listening to client briefs (which will occur in weeks 3 and 4). The importance of critical thinking: Argument Maps (Guest - Learning Designer Senior Principal Manager, Mr Chris Frost).",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 2(02 Mar - 08 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2: Turorial</strong><br><p>Introductions. Discussing the Assessment with focus on Assignment 1 (In-Class Writing Task). See case studies and examples relevant to theories and topics in recommended readings, for example, Luttrell &amp; Cap. Chapter 11), as well as industry websites.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 2: Turorial</strong>",
            "topic_description": "Week 2: Turorial Introductions. Discussing the Assessment with focus on Assignment 1 (In-Class Writing Task). See case studies and examples relevant to theories and topics in recommended readings, for example, Luttrell & Cap. Chapter 11), as well as industry websites.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3 Lecture: Theories, concepts and topics - Client Briefs (TBA)</strong><br><p>More on strategic communication theories, concepts and topics - Note that material relevant to Assignment 1 will continue throughout the semester with weekly content. </p>\n<p><strong>Client brief 1</strong> (<strong>TBA ) - IMPORTANT TO ATTEND</strong>.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 3 Lecture: Theories, concepts and topics - Client Briefs (TBA)</strong>",
            "topic_description": "Week 3 Lecture: Theories, concepts and topics - Client Briefs (TBA) More on strategic communication theories, concepts and topics - Note that material relevant to Assignment 1 will continue throughout the semester with weekly content. Client brief 1 ( TBA ) - IMPORTANT TO ATTEND .",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3 Tutorial</strong><br><p>Continue practicing A1: How to understand theories, concepts and topics to apply to SC/PR planning. Activities:</p>\n<ol>\n<li>Working with a client (role play with tutor as the client). Discussing the importance of context in strategic communication.</li>\n<li>Practising with real life examples/illustrations that can be applied to some concepts.</li>\n</ol>\n<p><br/></p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 3 Tutorial</strong>",
            "topic_description": "Week 3 Tutorial Continue practicing A1: How to understand theories, concepts and topics to apply to SC/PR planning. Activities: Working with a client (role play with tutor as the client). Discussing the importance of context in strategic communication. Practising with real life examples/illustrations that can be applied to some concepts.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4 Lecture: Planning, SA &amp; Research - Client Briefs 2</strong><br><p>Overview of Research Methods in strategic communication. </p>\n<p><strong>Client briefs 2 - IMPORTANT TO ATTEND.</strong></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 4 Lecture: Planning, SA &amp; Research - Client Briefs 2</strong>",
            "topic_description": "Week 4 Lecture: Planning, SA & Research - Client Briefs 2 Overview of Research Methods in strategic communication. Client briefs 2 - IMPORTANT TO ATTEND.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4 Tutorial</strong><br><p>Working with the brief: The issue. Drafting the Problem Statement. Discussing Assignment 2, Situation Analysis and Research Proposal.</p>\n<p>Tutorial Activities:</p>\n<ul>\n<li>Q&amp;As about A1 (writing tasks start the following week).</li>\n<li>Working with Client Briefs: Draft Problem Statement.</li>\n<li>Forming groups. Discussing Group work and its importance towards Assignments 2 to 4 (house rules).</li>\n</ul></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 4 Tutorial</strong>",
            "topic_description": "Week 4 Tutorial Working with the brief: The issue. Drafting the Problem Statement. Discussing Assignment 2, Situation Analysis and Research Proposal. Tutorial Activities: Q&As about A1 (writing tasks start the following week). Working with Client Briefs: Draft Problem Statement. Forming groups. Discussing Group work and its importance towards Assignments 2 to 4 (house rules).",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5 Lecture: Expanding on Research Strategy &amp; Methods - First Writing Task 1</strong><br><p>The lecture will expand on research strategy and a variety of research methods used in strategic communication/PR (offline/online). </p>\n<p><strong>First in-Class Writing Task (Assignment 1).</strong></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 5 Lecture: Expanding on Research Strategy &amp; Methods - First Writing Task 1</strong>",
            "topic_description": "Week 5 Lecture: Expanding on Research Strategy & Methods - First Writing Task 1 The lecture will expand on research strategy and a variety of research methods used in strategic communication/PR (offline/online). First in-Class Writing Task (Assignment 1).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5 Tutorial</strong><br><p>Continue prepping A2, Forming groups (final opportunity) and deciding clients.</p>\n<p>Activities:</p>\n<ul>\n<li>Form groups and decide their client to work on Situation Analysis and Research proposal for that client.</li>\n<li>Applying PEST and SWOT to the client's issue.</li>\n<li>Selecting some secondary (reports, statistics), and possible primary research methods (survey, interviews, textual analysis).</li>\n</ul></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 5 Tutorial</strong>",
            "topic_description": "Week 5 Tutorial Continue prepping A2, Forming groups (final opportunity) and deciding clients. Activities: Form groups and decide their client to work on Situation Analysis and Research proposal for that client. Applying PEST and SWOT to the client's issue. Selecting some secondary (reports, statistics), and possible primary research methods (survey, interviews, textual analysis).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6 Lecture: Continuing the Planning process - Goals, Publics, Holistic Strategy - Second in-Class Writing Task (Assignment 1)</strong><br><p>Continuing the Planning process. Goals, Publics, Holistic Strategy. Final prepping and Q&amp;As for assignment 2 (Situation Analysis and Research Proposal due 2 April).</p>\n<p><strong>Second in-Class Writing Task (Assignment 1).</strong></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 6 Lecture: Continuing the Planning process - Goals, Publics, Holistic Strategy - Second in-Class Writing Task (Assignment 1)</strong>",
            "topic_description": "Week 6 Lecture: Continuing the Planning process - Goals, Publics, Holistic Strategy - Second in-Class Writing Task (Assignment 1) Continuing the Planning process. Goals, Publics, Holistic Strategy. Final prepping and Q&As for assignment 2 (Situation Analysis and Research Proposal due 2 April). Second in-Class Writing Task (Assignment 1).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6: NO TUTORIALS - Study week to finalise A2</strong><br><p>NO TUTORIALS - Study week for finalising Assignment 2.</p></br></p></div></td>",
            "topic_title": "<strong>Week 6: NO TUTORIALS - Study week to finalise A2</strong>",
            "topic_description": "Week 6: NO TUTORIALS - Study week to finalise A2 NO TUTORIALS - Study week for finalising Assignment 2.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid-sem break(06 Apr - 12 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MID-SEMESTER BREAK</strong><br/></p></div></td>",
            "topic_title": "<strong>MID-SEMESTER BREAK</strong>",
            "topic_description": "MID-SEMESTER BREAK",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7 Lecture: Strategising - Third Writing Task</strong><br><p>Advancing on the planning and strategising process: SMART Objectives - Other types of Objectives. Intro to Messaging. </p>\n<p><strong>Third in-Class Writing Task.</strong></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 7 Lecture: Strategising - Third Writing Task</strong>",
            "topic_description": "Week 7 Lecture: Strategising - Third Writing Task Advancing on the planning and strategising process: SMART Objectives - Other types of Objectives. Intro to Messaging. Third in-Class Writing Task.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7 Tutorial</strong><br><p>Workshopping goals, publics/audiences/stakeholders, and holistic strategy: Prepping for assignment 3 (conducting research and writing research findings report).</p>\n<p>Activities:</p>\n<ul>\n<li>Practicing SMART Objectives (targeted to stakeholders).</li>\n<li>Comparing AI Objectives with Human Objectives. Critical discussion on this issue (pros and cons).</li>\n</ul></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 7 Tutorial</strong>",
            "topic_description": "Week 7 Tutorial Workshopping goals, publics/audiences/stakeholders, and holistic strategy: Prepping for assignment 3 (conducting research and writing research findings report). Activities: Practicing SMART Objectives (targeted to stakeholders). Comparing AI Objectives with Human Objectives. Critical discussion on this issue (pros and cons).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8 Lecture: Communication strategies and tactics</strong><br><p>Refining messaging. Introduction to Action and Communication strategies and Tactics. Q&amp;As assignment 3. </p>\n<p><strong>Industry Guest Lecturer on messaging and campaign strategy: Ms. Lisa Nixon, Managing Director BBS Communication.  </strong></p>\n<p><br/></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 8 Lecture: Communication strategies and tactics</strong>",
            "topic_description": "Week 8 Lecture: Communication strategies and tactics Refining messaging. Introduction to Action and Communication strategies and Tactics. Q&As assignment 3. Industry Guest Lecturer on messaging and campaign strategy: Ms. Lisa Nixon, Managing Director BBS Communication.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8 Tutorial</strong><br><p>Workshopping the Planning process (cont.): From Goals and Holistic Strategy to Messaging, Publics and SMART Objectives. Continue prepping for assignment 3, Practicing how to analyse findings and apply to the brief.</p>\n<p>Activities:</p>\n<ul>\n<li>Crafting the main message(s).</li>\n<li>Main elements of the campaign plan - Joining the dots.</li>\n</ul></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 8 Tutorial</strong>",
            "topic_description": "Week 8 Tutorial Workshopping the Planning process (cont.): From Goals and Holistic Strategy to Messaging, Publics and SMART Objectives. Continue prepping for assignment 3, Practicing how to analyse findings and apply to the brief. Activities: Crafting the main message(s). Main elements of the campaign plan - Joining the dots.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9 Lecture: Finalising design of Effective Strategies and Tactics - Fourth Writing Task</strong><br/><p>Final Q&amp;As A3: How to apply the findings go the campaign (A4). Using preliminary findings (if possible) to draft, for example, your main message for your campaign. Justifying why this message will be effective among the key publics - Wrapping up effective strategies, ethical and culturally aware strategies and tactics for the campaign. Possible industry guest lecturer on influencer tactics (TBA). Introduction to Logistics.</p>\n<p><strong>Fourth In-Class Writing Task. Please attend.</strong></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 9 Lecture: Finalising design of Effective Strategies and Tactics - Fourth Writing Task</strong>",
            "topic_description": "Week 9 Lecture: Finalising design of Effective Strategies and Tactics - Fourth Writing Task Final Q&As A3: How to apply the findings go the campaign (A4). Using preliminary findings (if possible) to draft, for example, your main message for your campaign. Justifying why this message will be effective among the key publics - Wrapping up effective strategies, ethical and culturally aware strategies and tactics for the campaign. Possible industry guest lecturer on influencer tactics (TBA). Introduction to Logistics. Fourth In-Class Writing Task. Please attend.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9: NO TUTORIAL - Study week to finalise A3</strong><br/><p>No tutorials this week to give your group time and space to finalise the research, and write the Research Findings Report (A3).</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 9: NO TUTORIAL - Study week to finalise A3</strong>",
            "topic_description": "Week 9: NO TUTORIAL - Study week to finalise A3 No tutorials this week to give your group time and space to finalise the research, and write the Research Findings Report (A3).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10(04 May - 10 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10 Lecture: Logistics - Fifth In-Class Writing Task.</strong><br/><p>Starting with campaign Logistics. Intro to evaluation methods (if time) Prepping for assignment 4. Last Q&amp;As for assignment 3. </p>\n<p><strong>Fifth In-Class Writing Task. Please attend.</strong></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 10 Lecture: Logistics - Fifth In-Class Writing Task.</strong>",
            "topic_description": "Week 10 Lecture: Logistics - Fifth In-Class Writing Task. Starting with campaign Logistics. Intro to evaluation methods (if time) Prepping for assignment 4. Last Q&As for assignment 3. Fifth In-Class Writing Task. Please attend.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10(04 May - 10 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10 Tutorial</strong><br/><p>Workshopping and deciding strategies and tactics for your selected clients. What are the most suitable communication tools you can use to help you client? What is your 'star' tactic? Cases, exercises. Prepping for assignment 4. </p>\n<p>Activities:</p>\n<ul>\n<li>Selecting strategy(ies) and some tactics.</li>\n<li>groups propose mock \"star tactic\" and discuss in class.</li>\n<li>Compare and display in class AI strategies (prompted by some groups in the tutorials), with human strategies, critically discuss quality and results in each case.</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 10 Tutorial</strong>",
            "topic_description": "Week 10 Tutorial Workshopping and deciding strategies and tactics for your selected clients. What are the most suitable communication tools you can use to help you client? What is your 'star' tactic? Cases, exercises. Prepping for assignment 4. Activities: Selecting strategy(ies) and some tactics. groups propose mock \"star tactic\" and discuss in class. Compare and display in class AI strategies (prompted by some groups in the tutorials), with human strategies, critically discuss quality and results in each case.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11 Lecture: Finalising Logistics - Evaluation Methods 1 - The Pitch - Sixth In Class Writing Task</strong><br/><p>Finalising logistics. Explaining the importance of Evaluation Methods and their types. Barcelona Principles. Selecting and presenting evaluation methods. The Pitch. </p>\n<p><strong>Sixth In Class Writing Task.</strong></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 11 Lecture: Finalising Logistics - Evaluation Methods 1 - The Pitch - Sixth In Class Writing Task</strong>",
            "topic_description": "Week 11 Lecture: Finalising Logistics - Evaluation Methods 1 - The Pitch - Sixth In Class Writing Task Finalising logistics. Explaining the importance of Evaluation Methods and their types. Barcelona Principles. Selecting and presenting evaluation methods. The Pitch. Sixth In Class Writing Task.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11 Tutorial</strong><br/><p>Workshopping tactics - Prepping assignment 4. Putting together the campaign, strategies and tactics for the clients (activity).</p>\n<p>Evaluating A1 (reflective activity)</p>\n<p>Evaluating group work with your tutors (benefits and challenges).</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 11 Tutorial</strong>",
            "topic_description": "Week 11 Tutorial Workshopping tactics - Prepping assignment 4. Putting together the campaign, strategies and tactics for the clients (activity). Evaluating A1 (reflective activity) Evaluating group work with your tutors (benefits and challenges).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12(18 May - 24 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12 Lecture: Communication Fields &amp; Ethical Practice - Campaign elements review - Seventh In-Class Writing Task</strong><br/><p>Communication Fields &amp; Ethical Practice - Review and final Q&amp;As about assignment 4 and the pitch. </p>\n<p><strong>Seventh In-Class Writing Task.</strong></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 12 Lecture: Communication Fields &amp; Ethical Practice - Campaign elements review - Seventh In-Class Writing Task</strong>",
            "topic_description": "Week 12 Lecture: Communication Fields & Ethical Practice - Campaign elements review - Seventh In-Class Writing Task Communication Fields & Ethical Practice - Review and final Q&As about assignment 4 and the pitch. Seventh In-Class Writing Task.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12(18 May - 24 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12 Tutorial</strong><br/><p>Workshopping the overall plan - Activity:</p>\n<ul>\n<li>Producing the best Pitch for your clients (and tutors) - The pitches will take place in tutorials in week 13. Pitching house rules.</li>\n<li>Role Play (pitching to the client as consultants).</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 12 Tutorial</strong>",
            "topic_description": "Week 12 Tutorial Workshopping the overall plan - Activity: Producing the best Pitch for your clients (and tutors) - The pitches will take place in tutorials in week 13. Pitching house rules. Role Play (pitching to the client as consultants).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13(25 May - 31 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13 Lecture: Eighth Writing Task - Some pitches may be presented in the last lecture upon consultation - Critical reflection on learning experience </strong><br/><p><strong>Eighth WrittenTask. Please attend.</strong></p>\n<p>Upon request, some groups/students might pitch their campaign plans during lecture time in week 13 (provided they have a well-supported reason) - Final reflection on COMU7301 Learning Experience.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 13 Lecture: Eighth Writing Task - Some pitches may be presented in the last lecture upon consultation - Critical reflection on learning experience </strong>",
            "topic_description": "Week 13 Lecture: Eighth Writing Task - Some pitches may be presented in the last lecture upon consultation - Critical reflection on learning experience Eighth WrittenTask. Please attend. Upon request, some groups/students might pitch their campaign plans during lecture time in week 13 (provided they have a well-supported reason) - Final reflection on COMU7301 Learning Experience.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13(25 May - 31 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13 Tutorial: Pitching your campaign plan</strong><br/><p><strong>THE PITCH (8-10 mins per group, including feedback): Students will pitch their campaign plans and 'star' tactic ideas to receive feedback from the tutors. </strong>Bring a slide or two to the class. The pitch may receive up to 8 pts that will form part of the final assignment's grade (the Campaign Plan). The pitch will be brief (recorded, please indicate in writing if your do not wish to be recorded). More information on Blackboard. </p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 13 Tutorial: Pitching your campaign plan</strong>",
            "topic_description": "Week 13 Tutorial: Pitching your campaign plan THE PITCH (8-10 mins per group, including feedback): Students will pitch their campaign plans and 'star' tactic ideas to receive feedback from the tutors. Bring a slide or two to the class. The pitch may receive up to 8 pts that will form part of the final assignment's grade (the Campaign Plan). The pitch will be brief (recorded, please indicate in writing if your do not wish to be recorded). More information on Blackboard.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}