{
    "course_title": "Teaching English 1",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC3710-20832-7620",
    "full_course_code": "EDUC3710-20832-7620",
    "course_code": "EDUC3710",
    "class_code": "20832",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate knowledge and understanding of learning, teaching, and assessment strategies and their application in teaching the primary school English Curriculum and literacy in ways that enhance inclusive participation of all students including those from diverse backgrounds (linguistic, cultural, religious, and socioeconomic). (1.3, 2.1, 2.2, 2.3, 2.5, 3.1, 3.3, 5.1)"
        },
        {
            "number": "LO2.",
            "description": "Identify teaching strategies that include verbal and non-verbal communication strategies and resources (e.g., quality literature, ICTs) that support inclusive student participation and engagement in primary English classroom activities and learning. (3.3, 3.4, 3.5, 4.1)"
        },
        {
            "number": "LO3.",
            "description": "Demonstrate the capacity to effectively engage in assessment moderation and interpret student assessment data to: evaluate student learning; provide timely and appropriate student feedback; and modify future teaching practices to improve student learning. (5.2, 5.3, 5.4)"
        },
        {
            "number": "LO4.",
            "description": "Demonstrate clear, fluent, and coherent communication skills consistent with personal, professional, and academic conventions."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Assessing and Teaching Children's Writing",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>50% 2000 word equivalent </dd>",
            "due_date": "<dd><p> 17/04/2026 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Essay/ Critique, Product/ Design",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assignment will enable you to develop your knowledge of teaching and assessing writing. While this is an independent task, you will engage in a moderation process with a partner for part of the assignment. The task is split into three parts.</p>\n<p><strong>Part A: Assessing writing</strong></p>\n<p>·      To begin, you and your partner will select a sample of a primary school student’s writing as listed on Blackboard. Your sample may be an imaginative, informative, or persuasive text, and written in the context of a subject other than English (CC 2.4 – assessed). You should have the same sample as your partner if possible.</p>\n<p>·      Separately from your partner, analyse your selected writing sample for its macro (structural) and micro (linguistic) choices. Drawing on information taught in the course and the <em>Australian Curriculum: English</em>, write annotations that identify strengths and weaknesses in the writing sample.</p>\n<p>·      Prepare a short piece of written feedback for the student who wrote your writing sample, including positive comments and areas for improvement. Also, include a statement about the purpose of timely and appropriate feedback to students.</p>\n<p><strong>Part B: Moderation</strong></p>\n<p>·      You and your partner will then moderate each other’s analysis, annotations, and student feedback. You may wish to change and improve your work in response to the moderation.</p>\n<p>·      Keep a record of your discussions and draw on this to write a brief explanation about what your moderation process involved, and how it supported your judgements of student learning.</p>\n<p><strong>Part C: Planning and assessing a writing activity</strong></p>\n<p>·      Using your analysed student writing sample from Part A, identify one macro (structural) or micro (linguistic) choice that could be improved the student’s writing and plan a suitable activity aimed at a small group of students with similar needs.</p>\n<p>·      You will plan to explicitly teach a small group writing activity based on your identified macro or micro choice for improvement in the context of a subject other than English (CC 2.4 – assessed).</p>\n<p>·      Select one Content Description from your student’s year level in the <em>Australian Curriculum: English</em> that relates to your identified choice for improvement.</p>\n<p>·      Select a mentor text to support your writing activity.</p>\n<p>·      For your writing activity, include:</p>\n<p>1.    One or more achievable yet challenging learning goal(s), communicated through learning intentions and success criteria in student-friendly language.</p>\n<p>2.    A description of how you will explicitly teach your identified macro (structural) or micro (linguistic) writing choice using the teaching and learning cycle, supported by your selected mentor text, and other appropriate resources including effective use of Information and Communication Technology. Your writing activity should include modelling and scaffolding processes that support how a student’s brain learns. Ensure your teaching strategies cater for the needs of students from diverse backgrounds.</p>\n<p><em>This assignment is considered the equivalent of a 2,000-word essay.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit the assessment electronically via the assignment link on the course website. By submitting your assignment, you are certifying that it is your original work and that is has not been previously submitted for assessment in any other course at university (unless resubmission is part of the requirements for the course assessment). Always keep a copy of your submitted assignment and download a submission receipt.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "2.\tQuality literature in-class examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>50% 2000-word equivalent </dd>",
            "due_date": "<dd><p> 22/05/2026 10:00 am</p></dd>",
            "learning_objectives": "L01, L02",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The in-class examination involves a series of written questions based on the content covered in our module on children’s literature. At the start of the exam, you will be read a picturebook (revealed at the start of the exam) and given access to select pages from it in the exam booklet. You will be asked questions that allow you to demonstrate your knowledge and understanding of key literature concepts including the text’s ideological messages (i.e., historical, social, cultural contexts), the use of literary concepts (i.e., character, theme, plot, point of view, and setting), and the use of semiotic tools to communicate meanings in the images. Questions will be short answer. Marks are earned through demonstrating correct answers to these questions.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>This assessment is completed in the Week 12 lecture. In the event of disruption during the semester that prevents the scheduled assessment event occurring as planned, the assessment will be changed to an alternative form. The timing of the assessment may also be impacted.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction</strong><br/><p><em>Language, literacy, and culture; Introduction to the Australian Curriculum: English</em>: This week introduces the course and explores crucial aspects of language, literacy, and literature together with the Australian Curriculum: English.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Introduction</strong>",
            "topic_description": "Introduction Language, literacy, and culture; Introduction to the Australian Curriculum: English : This week introduces the course and explores crucial aspects of language, literacy, and literature together with the Australian Curriculum: English.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 2(02 Mar - 08 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Contemporary literacy theories</strong><br/><p><em>Four resources model; Writing rope; SFL/Genre pedagogy; Multiliteracies; Critical literacy:</em> This week introduces the Four Resources Model and the Writing Rope: useful theories that bring together well-known perspectives on literacy learning. Preservice teachers are also introduced the notion of Discourses with a capital D to support preservice teachers to think deeply about the realities of learning any new topic in a context like a school, and how school students are prepared in different ways to engage in literacy learning experiences by their backgrounds and social groups.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Contemporary literacy theories</strong>",
            "topic_description": "Contemporary literacy theories Four resources model; Writing rope; SFL/Genre pedagogy; Multiliteracies; Critical literacy: This week introduces the Four Resources Model and the Writing Rope: useful theories that bring together well-known perspectives on literacy learning. Preservice teachers are also introduced the notion of Discourses with a capital D to support preservice teachers to think deeply about the realities of learning any new topic in a context like a school, and how school students are prepared in different ways to engage in literacy learning experiences by their backgrounds and social groups.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Writing 1</strong><br/><p><em>Overview of writing; Grammar 1:</em> This week, preservice teachers are introduced to writing as a key literate practice in Australian primary schools. They learn about the importance of writing for educational, professional, and social success, but also its complexity. Preservice teachers are also taught how to design summative assessment tools to assess the grammatical features of texts with reference to the <em>Australian Curriculum: English</em> achievement standards and content descriptions and examples of student writing to gain an understanding of the level of mastery attained (CC 2.2.3 – taught).</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Writing 1</strong>",
            "topic_description": "Writing 1 Overview of writing; Grammar 1: This week, preservice teachers are introduced to writing as a key literate practice in Australian primary schools. They learn about the importance of writing for educational, professional, and social success, but also its complexity. Preservice teachers are also taught how to design summative assessment tools to assess the grammatical features of texts with reference to the Australian Curriculum: English achievement standards and content descriptions and examples of student writing to gain an understanding of the level of mastery attained (CC 2.2.3 – taught).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Writing 2</strong><br/><p><em>Grammar 2: </em>Continuing the focus on grammatical choices that make up written texts, this week's lecture introduces several additional grammar tools for developing ideas beyond simple sentences, for evaluating phenomena through language, and for creating cohesive and logically structured texts.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Writing 2</strong>",
            "topic_description": "Writing 2 Grammar 2: Continuing the focus on grammatical choices that make up written texts, this week's lecture introduces several additional grammar tools for developing ideas beyond simple sentences, for evaluating phenomena through language, and for creating cohesive and logically structured texts.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Writing 3</strong><br/><p><em>Teaching written genres; Structural features (stages, phases):</em> The lecture teaches students the most common written genres they will be expected to teach explicitly in all content areas of primary school (i.e., narratives, literary descriptions, news stories, five types of reports, simple procedures, procedural recounts, four types of explanations, expositions, discussions, and responses) (CC 2.4.3 – taught). Preservice teachers are also taught how to design summative assessment tools to assess the structural features of a range of written genres that are introduced across the primary school years (CC 2.2.3 – taught).</p>\n<p>Preservice teachers work in small groups to summatively assess the structural features of texts written by Year 2 and Year 5 students and write annotations based on the relevant <em>Australian Curriculum: English</em> achievement standards and content descriptions for those year levels to explain the level of mastery gained (CC 2.3.3 – practised).</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Writing 3</strong>",
            "topic_description": "Writing 3 Teaching written genres; Structural features (stages, phases): The lecture teaches students the most common written genres they will be expected to teach explicitly in all content areas of primary school (i.e., narratives, literary descriptions, news stories, five types of reports, simple procedures, procedural recounts, four types of explanations, expositions, discussions, and responses) (CC 2.4.3 – taught). Preservice teachers are also taught how to design summative assessment tools to assess the structural features of a range of written genres that are introduced across the primary school years (CC 2.2.3 – taught). Preservice teachers work in small groups to summatively assess the structural features of texts written by Year 2 and Year 5 students and write annotations based on the relevant Australian Curriculum: English achievement standards and content descriptions for those year levels to explain the level of mastery gained (CC 2.3.3 – practised).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Writing 4</strong><br/><p><em>Teaching and assessing writing:</em> The lecture teaches how the principles of explicit instruction can be applied to the teaching of writing in all content areas of the curriculum through the teaching learning cycle (CC 2.4.3 – taught). The lecture explains how effective writing instruction involves teachers deconstructing mentor texts to make explicit writing choices and learn that as students are prepared to take on more responsibility for the writing, worked examples can be replaced with more challenging peer and/or independent writing tasks. (CC 1.3.3 – taught).</p>\n<p>In the tutorial, preservice teachers engage in a comparative judgement task where they draw on their new understandings of explicit instruction and the teaching learning cycle to compare the quality of two explicit writing activities created by different teachers. Preservice teachers explain how one teacher’s lesson is more aligned with the principles of explicit instruction and supportive of how student brains learn (CC 2.4.3 – practised). Then, preservice teachers work in table groups to collaboratively plan their own explicit writing lessons. Each group presents and receives feedback on their plans and worked examples (CC 1.3.3 – practiced).</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Writing 4</strong>",
            "topic_description": "Writing 4 Teaching and assessing writing: The lecture teaches how the principles of explicit instruction can be applied to the teaching of writing in all content areas of the curriculum through the teaching learning cycle (CC 2.4.3 – taught). The lecture explains how effective writing instruction involves teachers deconstructing mentor texts to make explicit writing choices and learn that as students are prepared to take on more responsibility for the writing, worked examples can be replaced with more challenging peer and/or independent writing tasks. (CC 1.3.3 – taught). In the tutorial, preservice teachers engage in a comparative judgement task where they draw on their new understandings of explicit instruction and the teaching learning cycle to compare the quality of two explicit writing activities created by different teachers. Preservice teachers explain how one teacher’s lesson is more aligned with the principles of explicit instruction and supportive of how student brains learn (CC 2.4.3 – practised). Then, preservice teachers work in table groups to collaboratively plan their own explicit writing lessons. Each group presents and receives feedback on their plans and worked examples (CC 1.3.3 – practiced).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Mid-sem break(06 Apr - 12 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-semester break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-semester break</strong>",
            "topic_description": "Mid-semester break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Writing 5</strong><br/><p><em>Paragraphing; Punctuation; Handwriting and keyboarding: </em>This week concludes the module on writing with an exploration of several mechanics of writing (i.e., secretarial skills) including punctuation, paragraphing, handwriting, and keyboarding. Preservice teachers also learn about and practiise engaging children in writing creatively.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Writing 5</strong>",
            "topic_description": "Writing 5 Paragraphing; Punctuation; Handwriting and keyboarding: This week concludes the module on writing with an exploration of several mechanics of writing (i.e., secretarial skills) including punctuation, paragraphing, handwriting, and keyboarding. Preservice teachers also learn about and practiise engaging children in writing creatively.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Children's literature 1</strong><br/><p><em>Overview of children's literature; Ideological meanings; Semiotics: </em>This week begins the final module on the teaching and learning of children's literature. The lecture presents an overview of children's literature, the place of literature in the Australian Curriculum: English, and a variety of semiotic tools that enable teachers to unpack and create visual meanings in images with children in classrooms.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Children's literature 1</strong>",
            "topic_description": "Children's literature 1 Overview of children's literature; Ideological meanings; Semiotics: This week begins the final module on the teaching and learning of children's literature. The lecture presents an overview of children's literature, the place of literature in the Australian Curriculum: English, and a variety of semiotic tools that enable teachers to unpack and create visual meanings in images with children in classrooms.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Children's literature 2</strong><br/><p><em>Features of literary texts: </em>This week focuses on five important literary concepts when exploring and creating literature with children, including character, plot, theme, setting, and point of view.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Children's literature 2</strong>",
            "topic_description": "Children's literature 2 Features of literary texts: This week focuses on five important literary concepts when exploring and creating literature with children, including character, plot, theme, setting, and point of view.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 10(04 May - 10 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Children's literature 3</strong><br/><p><em>Multimodality; Multicultural children's literature: </em>The content this week introduces two additional aspects of children's literature to prepare preservice teachers to teach this important part of the <em>Australian Curriculum: English</em>. The lecture and tutorial focus on multimodality and multicultural literature.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Children's literature 3</strong>",
            "topic_description": "Children's literature 3 Multimodality; Multicultural children's literature: The content this week introduces two additional aspects of children's literature to prepare preservice teachers to teach this important part of the Australian Curriculum: English . The lecture and tutorial focus on multimodality and multicultural literature.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Children's literature 4</strong><br/><p><em>Genres of children's literature; Poetry: </em>This week's lecture is split in two, with the first half focusing on literary genres taught in primary schools from Prep to Year 6, and the second half focusing on the features and forms of poetry. This week is all about communicating creatively and powerfully.</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Children's literature 4</strong>",
            "topic_description": "Children's literature 4 Genres of children's literature; Poetry: This week's lecture is split in two, with the first half focusing on literary genres taught in primary schools from Prep to Year 6, and the second half focusing on the features and forms of poetry. This week is all about communicating creatively and powerfully.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 12(18 May - 24 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Quality literature in-class examination</strong><br/><p><em>Assessment task 2: </em>Assessment task 2 (Quality literature in-class examination) will be held during the Week 12 lecture.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Quality literature in-class examination</strong>",
            "topic_description": "Quality literature in-class examination Assessment task 2: Assessment task 2 (Quality literature in-class examination) will be held during the Week 12 lecture.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 13(25 May - 31 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Conclusion and review</strong><br/><p><em>Reflection on course content: </em>This week, preservice teachers review the course content and engage in a novel task that requires them to draw on many aspects of the course to solve a problem.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Conclusion and review</strong>",
            "topic_description": "Conclusion and review Reflection on course content: This week, preservice teachers review the course content and engage in a novel task that requires them to draw on many aspects of the course to solve a problem.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        }
    ]
}