{
    "course_title": "An Introduction to the Science of Learning in Practice",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC7079-21591-7620",
    "full_course_code": "EDUC7079-21591-7620",
    "course_code": "EDUC7079",
    "class_code": "21591",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Reflect upon and explain how the science of learning informs their own learning and/or practice"
        },
        {
            "number": "LO2.",
            "description": "Assess the value and relevance of the science of learning principles to their own and others’ learning and wellbeing"
        },
        {
            "number": "LO3.",
            "description": "Design contextually relevant applications of the science of learning to address an authentic problem of practice"
        },
        {
            "number": "LO4.",
            "description": "Critique and collate a variety of educational resources that evidence the science of learning principles and research"
        },
        {
            "number": "LO5.",
            "description": "Review literature and communicate findings to a wider audience"
        },
        {
            "number": "LO6.",
            "description": "Implement science of learning principles into meaningful applied contexts"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Annotated Bibliography",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30% 1500-2000 words </dd>",
            "due_date": "<dd><p> 2/04/2026 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>The Aim of the Assessment:  </strong></p>\n<p><strong>a)   </strong>To curate an AI-supported annotated bibliography of quality Science of Learning literature that explains a learning concept of practical relevance. </p>\n<p><strong>b)  </strong>Synthesise insights from the selected sources to create an accessible, every-day language explanation of a selected learning construct and its role in learning.</p>\n<p><strong>SEE TASK SHEET FOR FULL TASK DETAILS</strong></p>\n<p><br/></p>\n<p><strong>Task Outline:</strong></p>\n<p><strong>Step 1: Select the learning construct or concept as your focus</strong></p>\n<p>From the list below, select a learning construct or concept of relevance to you and your teaching, learning, or working context, then briefly explain which construct you have selected and why you have selected this as the focus for your annotated bibliography:</p>\n<p>Emotions                 Curiosity                  Creativity                Confusion    Attention                 Memory                    Engagement           Motivation     </p>\n<p>Anxiety/ Stress         Multitasking            Neuromyths            Neuroplasticity Metacognition           Executive Functions          </p>\n<p>Self-Regulated Learning                         Social Shared Regulated Learning         </p>\n<p><strong>Step 2: Compile potential sources: </strong>Using an AI tool such as Elicit (or similar), develop a prompt and generate a list of relevant sources (max. 50) that could be reviewed for inclusion in your bibliography. Include these sources in a Table in the Appendix of your submission (not included in word count).</p>\n<p><strong>Step 3: </strong> <strong>Curate Annotated Bibliography.</strong> <strong>(approx. 100 words per resource)<em>: </em></strong>Review the identified sources and curate an annotated bibliography of the best 6-8 QUALITY sources from your list of relevant sources. Use AI to assist you in annotating each of the selected sources, including the following for each source (can be in dot-points):</p>\n<p>a)   <strong>Full Citation</strong>: This should be in APA 7 (Not included in word count).</p>\n<p>b)   <strong>Aims/ Research Questions and/ or Research Problem or Focus: </strong>Outline of the aims/ questions of the article/ research.</p>\n<p>c)   <strong>Description of the methodology (for research articles)</strong>:<strong> </strong>This should include a brief description of the research methods used including details of participants, research design, measures, analysis.</p>\n<p>d)   <strong>Summary of Main Ideas/ Findings/ Arguments</strong>: A brief overview of the main findings or arguments presented in the source</p>\n<p>e)   You must include the AI prompts that you use to generate your bibliography (include in Appendix – not included in word count).</p>\n<p><strong>Step 4: Read and revise each AI-generated annotation</strong> to check for accuracy and relevance to your inquiry question. This means thoroughly and critically reading and engaging in full each of the resources you have curated for inclusion in your annotated bibliography.</p>\n<p><strong>Step 5: Evaluation and Justification (approx. 150 words per resource)</strong>. Once your bibliography is generated, you need to (<strong>without</strong> the assistance of AI):</p>\n<p>-         <strong>Evaluate the quality and reliability</strong> of the sources and <strong>justify the inclusion</strong> of each source in your final annotated bibliography (i.e. provide a rationale for why it is a valuable resource in relation to selected focus).</p>\n<p><strong>Step 6: Synthesis (approx. 100 words). </strong>Draw on the sources and their content to compose a brief synthesised lay-person explanation of your selected construct and its role in learning.</p>\n<p><strong>Step 7: Reflection (approx. 100 words). </strong>Reflect on your personal learning about the topic and about sourcing quality literature through completing this task. This may include a critical reflection of gaps in your own knowledge and understanding of concepts or methodological processes that have been addressed in the literature included in your bibliography. </p>\n<p><strong><em> </em></strong></p>\n<p><strong>Presentation</strong></p>\n<p>The presentation of your Annotated Bibliography can be in a format that is relevant and useful to you but must address all parts of the task as outlined above.</p>\n<p>No more than 3 resources can be from the EDUC7079 Reading List.</p>\n<p>This task will be assessed on the quality and relevance of the curated resources to your context and inquiry question, on the quality of the critical evaluations and justifications for the source’s inclusion in your curated list, and on your personal reflections of learning in this task (see Criteria Sheet for details). </p>\n<p><strong>Please see Task Sheet for full details.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via TurnItIn</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Leading the Science of Learning in Practice",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>35% 1500-2000 words or equivalent </dd>",
            "due_date": "<dd><p> 4/05/2026 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Essay/ Critique, Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>The Aim of the Assessment: </strong>to present a response to a stimulus question that informs others about the contributions that the learning sciences can make to support school or organisational leader decision making. </p>\n<p><br/></p>\n<p><strong>The Task:</strong> </p>\n<p>In this task you are required to draw on resources and readings from within this course and additional resources to form a response to a stimulus question about leading the Science of Learning in either educational or workplace learning contexts. The purpose of your response is to inform your audience about the contributions that the Science of Learning can make to support school or organisational leader decision making. In the interests of authenticity, the intended audience will be simulated as a school or organisational leadership team, which allows for direct transfer of this assessment task to the practice of professional learning and capability improvement within schools or other organisations. ions.</p>\n<p><strong>Guiding question</strong></p>\n<p><strong><em>How can insights from the Science of Learning make us better leaders of learning in our organisations?</em></strong></p>\n<p>Drawing upon research, use the following sub questions to develop your response.:</p>\n<ul>\n<li><strong>Learning Context: </strong>Describe your context in which this task is being situated. This might be a school, educational, training, or workplace learning context, but it must be specific to you. Describe whose learning you are leading in this context – it does not have to be in a formal leadership role (students, peers, teachers, trainers, others).</li>\n<li><strong>Rationale:</strong> What is a learning need or challenge in this context that you would like to lead positive change in?  Why could it be beneficial to you as a learning leader to engage with research from the Science of Learning to understand and address the identified learning need or challenge?</li>\n<li><strong>Framing Problems: </strong>How can the Science of Learning help you as a learning leader to frame this and other learning challenges or problems in your educational or workplace contexts?</li>\n<li><strong>Reviewing Evidence: </strong>How can you as a learning leader draw upon the Science of Learning to review evidence in the literature and in your context?</li>\n<li><strong>Taking action:</strong> How can you as a learning leaders use a Science of Learning approach to take action and lead learning in your team/ class/ organisation?</li>\n</ul>\n<p><br/></p>\n<p><strong>SEE TASK SHEET FOR FULL DETAILS OF THE TASK</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via TurnItIn</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Professional Reflection and Application",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>35% 1500-2000 words </dd>",
            "due_date": "<dd><p>Presentation 25/05/2026 - 29/05/2026</p>\n<p>Written Summary - Due 2pm 29/05/2026</p>\n<p>\n</p><p>Students will need to schedule a presentation time in Week 13 with the Course Coordinator.</p>\n<p>Written Summary must be submitted via TurnItIn.</p></dd>",
            "learning_objectives": null,
            "mode": "Oral, Product/ Artefact/ Multimedia, Written",
            "category": "Presentation, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>The Aim of the Assessment: </strong>To reflect on the key learnings across the course and present a final reflection on the implications of the Science of Learning for your own professional learning and your practice.</p>\n<p><strong>SEE TASK SHEET FOR FULL DETAILS</strong></p>\n<p><strong>The Task:</strong> Metacognition – the knowledge about and regulation of one’s own cognitive abilities when learning (Flavell, 1979; Veenman et al., 2006)– is fundamental to effective learning in all contexts. Throughout this course, you have been invited to reflect on your learning through a range of metacognitive and meta-learning tasks: identifying your learning needs, applying strategies informed by principles of the Science of Learning, and evaluating their impact. You have also been encouraged to consider ways to apply your understanding of the Science of Learning to support learning in others. Assessment 3 requires you to share how you have applied the Science of Learning into your own practice in your own learning or in how you have supported the learning of others (e.g.: learners in your classrooms or workplaces). and how it has evolved and draw upon this to consider ways to translate the Science of Learning into your professional practice, now or in the future.</p>\n<p>In this task you are required to respond to the following:</p>\n<p>1.   Reflect on key ideas from the course and describe one overarching Science of Learning principle and related strategy that has resonated with you as a learner, teacher, trainer, and/or as a leader of learning. Define/ explain the principle and/ or strategy, drawing on relevant literature explored in the course.</p>\n<p>2.   What learning need or challenge is the principle or strategy intended to address in your context? How did you identify this challenge through the meta-learning and reflection tasks across the semester? Refer to evidence from the Science of Learning literature to explain the connection between the learning need and the related principle and/ or strategy.</p>\n<p>3.   Explain how you have applied this principle and/ or strategy into your practice, identifying what some of the implementation or mobilisation challenges have been, and how you have overcome or considered these. Refer to the meta-learning and reflection tasks across the semester in your response.</p>\n<p>4.   Describe how you have evaluated the impact (gathered evidence) of the above principle or strategy in your learning context (refer to Module 4 in particular).</p>\n<p>5.   How has your understanding of the Science of Learning and its application to practice evolved over the course?</p>\n<p>6.   How could you draw upon the Science of Learning to sustain <em>your</em> professional growth and learning beyond this course?</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>·        The task is to be presented as a <strong>live online presentation to and discussion with</strong> the Course Coordinator. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 1 - Introduction to the SoL in Practice</strong><br><p>Students will be introduced to the Science of Learning in Practice, including some key overarching principles from the field and the science underpinning them. We will explore current definitions of the Science of Learning. They will be introduced to the purpose and value of meta-learning and reflective tasks, and provided with an overview of the course and assessments.</p></br></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Module 1 - Introduction to the SoL in Practice</strong>",
            "topic_description": "Module 1 - Introduction to the SoL in Practice Students will be introduced to the Science of Learning in Practice, including some key overarching principles from the field and the science underpinning them. We will explore current definitions of the Science of Learning. They will be introduced to the purpose and value of meta-learning and reflective tasks, and provided with an overview of the course and assessments.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(02 Mar - 08 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 1: The factors involved in how people learn</strong><br><p>WEEK 2: In the second week of Module 2, students will have the chance to develop their understanding of the science of learning research that underpins our understanding of how people learn and the factors that affect learning. We will draw from research across the key disciplines of the science of learning and explore learning in educational and workplace contexts.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Module 1: The factors involved in how people learn</strong>",
            "topic_description": "Module 1: The factors involved in how people learn WEEK 2: In the second week of Module 2, students will have the chance to develop their understanding of the science of learning research that underpins our understanding of how people learn and the factors that affect learning. We will draw from research across the key disciplines of the science of learning and explore learning in educational and workplace contexts.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 1: Applying the SoL into practice</strong><br><p>WEEK 3: In the final week of Module 1 students will focus on some important principles of the science of learning and how these can be applied into practice, and consider these within wider holistic learning frameworks in different learning contexts including educational and workplace environments.</p></br></p></div></td>",
            "topic_title": "<strong>Module 1: Applying the SoL into practice</strong>",
            "topic_description": "Module 1: Applying the SoL into practice WEEK 3: In the final week of Module 1 students will focus on some important principles of the science of learning and how these can be applied into practice, and consider these within wider holistic learning frameworks in different learning contexts including educational and workplace environments.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 2: Diving Deep into the SoL</strong><br><p>WEEK 4: Module 2 will focus on building deep understanding in individually identified topics within the Science of Learning. Students will identify a focus area of particular interest for individual exploration and develop skills in critically reviewing multi and interdisciplinary research.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Module 2: Diving Deep into the SoL</strong>",
            "topic_description": "Module 2: Diving Deep into the SoL WEEK 4: Module 2 will focus on building deep understanding in individually identified topics within the Science of Learning. Students will identify a focus area of particular interest for individual exploration and develop skills in critically reviewing multi and interdisciplinary research.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 2: Diving Deep into the SoL</strong><br><p>WEEK 5: This week students will continue developing skills in sourcing, evaluating and annotating quality resources relevant to their Science of Learning focus area.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Module 2: Diving Deep into the SoL</strong>",
            "topic_description": "Module 2: Diving Deep into the SoL WEEK 5: This week students will continue developing skills in sourcing, evaluating and annotating quality resources relevant to their Science of Learning focus area.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 2: Diving Deep into the SoL</strong><br><p>WEEK 6: In this final week of Module 2 students will be developing their skills in the evaluation of sources and how these can be communicated in a way that is useful for an educational context. There will be a focus on completing Assessment 1 and some links to reflective questions in Assessment 3.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Module 2: Diving Deep into the SoL</strong>",
            "topic_description": "Module 2: Diving Deep into the SoL WEEK 6: In this final week of Module 2 students will be developing their skills in the evaluation of sources and how these can be communicated in a way that is useful for an educational context. There will be a focus on completing Assessment 1 and some links to reflective questions in Assessment 3.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Mid-sem break(06 Apr - 12 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-Semester break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-Semester break</strong>",
            "topic_description": "Mid-Semester break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 3: Leading the SoL in Practice</strong><br><p>WEEK 7: This week we will explore current models of leadership in educational and workplace contexts, and how selected models of learning leadership fit with principles from the Science of Learning. We will also explore one of the fundamentals of learning leadership in the Science of Learning - problem framing. This week provides the context for Assessment 2 by examining leadership within the lens of the Science of Learning.</p></br></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Module 3: Leading the SoL in Practice</strong>",
            "topic_description": "Module 3: Leading the SoL in Practice WEEK 7: This week we will explore current models of leadership in educational and workplace contexts, and how selected models of learning leadership fit with principles from the Science of Learning. We will also explore one of the fundamentals of learning leadership in the Science of Learning - problem framing. This week provides the context for Assessment 2 by examining leadership within the lens of the Science of Learning.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 3: Leading the SoL in Practice</strong><br><p>WEEK 8: This week we will examine how learning leaders can be informed by principles of the Science of Learning when they take action. We will explore some useful frameworks for leading learning in educational and workplace contexts, with explicit links made to Assessment 2.</p>\n<p><br/></p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Module 3: Leading the SoL in Practice</strong>",
            "topic_description": "Module 3: Leading the SoL in Practice WEEK 8: This week we will examine how learning leaders can be informed by principles of the Science of Learning when they take action. We will explore some useful frameworks for leading learning in educational and workplace contexts, with explicit links made to Assessment 2.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Independent Study Week - Week 9</strong><br><p>Independent Study Week</p></br></p></div></td>",
            "topic_title": "<strong>Independent Study Week - Week 9</strong>",
            "topic_description": "Independent Study Week - Week 9 Independent Study Week",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(04 May - 10 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 4: Applying the SoL in Practice</strong><br><p>Week 10: To start Module 4, we will take a close look at some key principles of the Science of Learning and consider how these can be implemented and evaluated in our own contexts as learners and leaders of learning. This workshop has direct connections to Assessment 3. </p></br></p></div></td>",
            "topic_title": "<strong>Module 4: Applying the SoL in Practice</strong>",
            "topic_description": "Module 4: Applying the SoL in Practice Week 10: To start Module 4, we will take a close look at some key principles of the Science of Learning and consider how these can be implemented and evaluated in our own contexts as learners and leaders of learning. This workshop has direct connections to Assessment 3.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 4: Evaluating the SoL in practice</strong><br/><p>WEEK 11: This week we will delve deeper into the barriers and enablers for mobilising science of learning research into real-world practice.</p></p></div></td>",
            "topic_title": "<strong>Module 4: Evaluating the SoL in practice</strong>",
            "topic_description": "Module 4: Evaluating the SoL in practice WEEK 11: This week we will delve deeper into the barriers and enablers for mobilising science of learning research into real-world practice.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(18 May - 24 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 4: Evaluating the SoL in practice</strong><br/><p>WEEK 12: This week we will take a look at some common ways in which research in the science of learning is conducted, and do a quick tour of some methodologies and analysis techniques that are frequently utilised in science of learning research. The aim of this week will be to build up student knowledge of common qualitative and quantitative methods so as to continue to develop individual efficacy around how to critically engage with and mobilise knowledge into your own context.</p>\n<p><br/></p></p></div></td>",
            "topic_title": "<strong>Module 4: Evaluating the SoL in practice</strong>",
            "topic_description": "Module 4: Evaluating the SoL in practice WEEK 12: This week we will take a look at some common ways in which research in the science of learning is conducted, and do a quick tour of some methodologies and analysis techniques that are frequently utilised in science of learning research. The aim of this week will be to build up student knowledge of common qualitative and quantitative methods so as to continue to develop individual efficacy around how to critically engage with and mobilise knowledge into your own context.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(25 May - 31 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The SoL in Practice - a reflection</strong><br><p>WEEK 13: The final week of the course will synthesise the 4 modules and key ideas from each. It will also be an opportunity to share ideas and engage in dialogue with peers about how the key learnings can be applied in practice.</p></br></p></div></td>",
            "topic_title": "<strong>The SoL in Practice - a reflection</strong>",
            "topic_description": "The SoL in Practice - a reflection WEEK 13: The final week of the course will synthesise the 4 modules and key ideas from each. It will also be an opportunity to share ideas and engage in dialogue with peers about how the key learnings can be applied in practice.",
            "learning_outcomes": []
        }
    ]
}