{
    "course_title": "Food Process Engineering I",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/FOOD3023-20757-7620",
    "full_course_code": "FOOD3023-20757-7620",
    "course_code": "FOOD3023",
    "class_code": "20757",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Apply the fundamental principles of thermodynamics, units and dimensions, and the theory of fluid mechanics in practical situations in food engineering."
        },
        {
            "number": "LO2.",
            "description": "Apply the basics of heat and mass transfer in the use of different techniques in food processing."
        },
        {
            "number": "LO3.",
            "description": "Describe the concepts of phase and state transitions in foods, food freezing, interfacial phenomena in food to the structure and properties of food materials."
        },
        {
            "number": "LO4.",
            "description": "Evaluate separation processes, resources sustainability, control processes and instruments used in food processing."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate problem-solving skills and critical thinking by correctly evaluating problems, performing necessary calculations, and assessing practical situations in food engineering."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "In-semester Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>35%</dd>",
            "due_date": "<dd><p> 13/04/2026 - 17/04/2026</p>\n<p>\n</p><p>See Timetable for Venue details.</p></dd>",
            "learning_objectives": "L01, L02",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment will evaluate students on their theoretical knowledge from Modules 1 to 5, covering content from both lectures and tutorials.</p>\n<ul>\n<li>The In-Semester exam consists of 6-8 questions, including:</li>\n<li>2 to 3 open-ended questions</li>\n<li>The remaining questions will be numerical exercises</li>\n</ul>\n<p>The exam will be an on-campus exam, at a scheduled on-campus session.</p>\n<p>Have your UQ student ID card available for all your exams. Students enrolled in Internal delivery must attend the exam in-person. </p>\n<p><br/></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Presentation (poster style)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 26/05/2026 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L05",
            "mode": "Oral",
            "category": "Presentation, Poster",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment covers <strong>Modules 1 to 12</strong> and evaluates students on <strong>teamwork</strong> (group of 3) and their <strong>practical understanding</strong> of key course concepts.</p>\n<p><strong>Group selection:</strong></p>\n<p>Students will be asked to select their partner within the first three weeks of the course. Details of the selection process will be provided on Blackboard. If assistance is required, please contact the course coordinator. After this period, the coordinator will assign any remaining students to groups.</p>\n<p><strong>Assessment Details:</strong></p>\n<p>Students must <strong>create a poster</strong> and <strong>record an oral presentation</strong> (at most 10 minutes) following this structure:</p>\n<ul>\n<li><strong>Introduction, Experimental Setup, Main Results, Discussion, and Conclusion.</strong></li>\n<li>The assessment focuses on <strong>home-based experiments</strong>, introduced during one of the tutorials.</li>\n<li>Experiments will be conducted in <strong>groups of three</strong>, and the final mark will be <strong>shared equally among all group members</strong>.</li>\n<li><strong>No written report is required.</strong></li>\n</ul>\n<p><strong>Marking criteria:</strong></p>\n<p><strong>Clarity of Speech (25%)</strong></p>\n<p>This criterion assesses how clearly, confidently, and engagingly the presenters communicate. Every group member must contribute to the presentation, ensuring that their explanations are coherent and well-paced. The presenters should use appropriate volume, enunciate clearly, and articulate scientific concepts in a way that is accessible to the audience. A strong emphasis should be placed on making complex ideas understandable, with explanations that build logically on one another.</p>\n<p><strong>Content (40%)</strong></p>\n<p>This section evaluates the depth of understanding demonstrated by the group in presenting the homemade experiment. A key aspect of this is the selection of proper references. The group should make use of relevant and credible sources to support the scientific theory and methodology behind the experiment. This includes citing textbooks, journal articles, or other credible online resources to substantiate their theoretical claims and experimental decisions.</p>\n<p>Another important consideration is the accurate application of the appropriate scientific theory and the explanation of any relevant calculations. The group should demonstrate a clear understanding of how the theory applies to their experiment and how the data is interpreted. The methodology and observations must also be clearly articulated, detailing the experimental setup and procedure, including the identification of variables and control measures. Thoughtful observations regarding the experiment should be discussed, and any adjustments made during the process should be noted.</p>\n<p>The use of graphs, charts, or plots is another critical component. These should be generated to visually represent data, trends, or relationships observed in the experiment. The plots must be accurately labeled and interpreted to support key points and conclusions. The group should also reflect on the relevance of their results, discussing their significance in relation to the original hypothesis or research question. Well-reasoned conclusions should be drawn from the data, and the group should explain why their results matter in a broader scientific context.</p>\n<p><strong>Style and Layout (20%)</strong></p>\n<p>This criterion focuses on the visual quality and organization of the presentation. Clear and well-lit photos of the homemade experimental setup are essential, as are any additional images or diagrams that clarify the methodology or results. These images should be strategically chosen to enhance the audience’s understanding of the experiment.</p>\n<p>The effective use of visuals, such as diagrams, graphs, and charts, is crucial. These should not overwhelm the presentation but should serve to clarify complex ideas or data. The slide design should be clean and professional, with clear text, consistent fonts, and appropriate color contrast. Text should be legible, with concise bullet points or statements, and the slides should not be overcrowded with information. The overall flow of the presentation must be logical and easy to follow, moving smoothly from the introduction to the methodology, results, and conclusions.</p>\n<p><strong>Critical Point of View (15%)</strong></p>\n<p>This section evaluates the group's ability to think analytically and critically about the experiment. The group should provide a thorough explanation of the outcomes, including clear reasons for why certain results occurred, whether as expected or unexpectedly. This shows an understanding of the experimental process and the scientific principles at play.</p>\n<p>The group should also acknowledge any limitations or sources of error in the experiment, such as measurement inaccuracies or external factors, and discuss how these might have impacted the results. If the results deviated from expectations, the group should provide a thoughtful analysis of why this might have happened, considering possible experimental flaws or other influencing factors. Lastly, the group should suggest practical improvements for future iterations of the experiment, such as changes to the design, equipment, or methodology. This demonstrates the group’s ability to think constructively and problem-solve based on their findings.</p>\n<p><strong>AI use:</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use Artificial Intelligence (AI) and/or Machine Translation (MT) tools, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which AI or MT will provide only limited support and guidance. </p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. </p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. </p>\n<p>The use of AI or MT must be referenced appropriately. Please see assessment guidelines in blackboard course site for specific instructions. </p>\n<p><strong>Peer review:</strong></p>\n<p>The assessment will be peer reviewed</p>\n<p><strong>ID assessment:</strong></p>\n<p>Please show your ID at the beginning of your talk</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission Instructions:</strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "End of Semester Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>45%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>6/06/2026 - 20/06/2026</p></dd>",
            "learning_objectives": "L03, L04",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The end of semester examination will assess content from Modules 6 to 12.</p>\n<ul>\n<li>The exam consists of 7-8 questions, including:</li>\n<li>2 to 3 open-ended questions</li>\n<li>The remaining questions will be numerical exercises</li>\n</ul>\n<p><br/></p>\n<p>The exam will be an on-campus exam. Have your UQ student ID card available for all your exams.  </p>\n<p>Students enrolled in In Person delivery must attend the exam in-person.</p>\n<p><br/></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(23 Feb - 31 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lectures</strong><br><p>Explanation of the following subjects: material properties, thermodynamics, mass and energy balance, fluid mechanics, heat transfer, mass transfer, psychrometry, sustainable processes, refrigeration, dehydration, and evaporation systems, sustainability, and instrument control.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Lectures</strong>",
            "topic_description": "Lectures Explanation of the following subjects: material properties, thermodynamics, mass and energy balance, fluid mechanics, heat transfer, mass transfer, psychrometry, sustainable processes, refrigeration, dehydration, and evaporation systems, sustainability, and instrument control.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(23 Feb - 31 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial</strong><br><p>Development of exercises on the following subjects: material properties, thermodynamics, mass and energy balance, fluid mechanics, heat transfer, mass transfer, psychrometry, sustainable processes, refrigeration, dehydration, and evaporation systems, sustainability, and instrument control.</p></br></p><p><strong>Learning outcomes:</strong> L05</p></div></td>",
            "topic_title": "<strong>Tutorial</strong>",
            "topic_description": "Tutorial Development of exercises on the following subjects: material properties, thermodynamics, mass and energy balance, fluid mechanics, heat transfer, mass transfer, psychrometry, sustainable processes, refrigeration, dehydration, and evaporation systems, sustainability, and instrument control.",
            "learning_outcomes": [
                "L05"
            ]
        }
    ]
}