{
    "course_title": "Food Process Engineering I",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/FOOD7123-21627-7620",
    "full_course_code": "FOOD7123-21627-7620",
    "course_code": "FOOD7123",
    "class_code": "21627",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Apply advanced principles of thermodynamics, units and dimensions, and fluid mechanics in practical situations in food engineering."
        },
        {
            "number": "LO2.",
            "description": "Utilize in-depth knowledge of heat and mass transfer to evaluate and enhance techniques used in food processing and preservation."
        },
        {
            "number": "LO3.",
            "description": "Analyse the roles of phase and state transitions, food freezing, and interfacial phenomena in influencing the structure and properties of food materials."
        },
        {
            "number": "LO4.",
            "description": "Evaluate separation processes, resource sustainability, and control systems, proposing improvements to enhance efficiency and sustainability in food processing."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate advanced problem-solving skills and critical thinking by analysing complex scenarios, performing precise calculations, and developing practical and innovative solutions in food engineering."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "In-semester Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 13/04/2026 - 17/04/2026</p>\n<p>\n</p><p>See Timetable for Venue details.</p></dd>",
            "learning_objectives": "L01, L02",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment will evaluate students on their theoretical knowledge from Modules 1 to 5, covering content from both lectures and tutorials.</p>\n<ul>\n<li>The in-semester exam consists of 8 questions, including:</li>\n<li>2 to 3 open-ended questions</li>\n<li>The remaining questions will be numerical exercises</li>\n</ul>\n<p>The exam will be an on-campus exam, at a scheduled on-campus session. Have your UQ student ID card available for all your exams. Students enrolled in Internal delivery must attend the exam in-person. </p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Presentation (Poster style) and Report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 26/05/2026 2:00 pm</p></dd>",
            "learning_objectives": "L02, L03, L05",
            "mode": "Oral, Written",
            "category": "Paper/ Report/ Annotation, Presentation, Poster",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment covers <strong>Modules 1 to 12</strong> and evaluates students on <strong>teamwork</strong> (group of 2) and their <strong>practical understanding</strong> of key course concepts.</p>\n<p><strong>Group selection:</strong></p>\n<p>Students will be asked to select their partner within the first three weeks of the course. Details of the selection process will be provided on Blackboard. If assistance is required, please contact the course coordinator. After this period, the coordinator will assign any remaining students to groups.</p>\n<p><strong>Assessment Structure:</strong></p>\n<p><strong>1.     Poster formatted Presentation:</strong></p>\n<p>Students must <strong>create a poster</strong> and <strong>record an oral presentation</strong> (at most 10 minutes) following this structure:</p>\n<ul>\n<li><strong>Introduction, Experimental Setup, Main Results, Discussion, Conclusion, and References</strong>.</li>\n</ul>\n<p><strong>2.     Written Report:</strong></p>\n<ul>\n<li>In addition to the poster presentation, students must submit a <strong>written report</strong> providing a <strong>publication format narrative</strong> of their work.</li>\n<li>The report should be a maximum of <strong>4 A4 pages</strong>.</li>\n</ul>\n<p><br/></p>\n<p><strong>Main Topics &amp; Group Work:</strong></p>\n<ul>\n<li>The assessment will focus on <strong>home-based experiments</strong>, introduced during <strong>one of the tutorials</strong>.</li>\n<li>Experiments will be conducted in <strong>groups</strong>, and the final mark will be <strong>shared equally among group members</strong>.</li>\n</ul>\n<p><br/></p>\n<p><strong>Marking criteria for the poster:</strong></p>\n<p><strong>Clarity of Speech (10%)</strong></p>\n<p>This criterion evaluates how clearly, confidently, and engagingly each presenter communicates. All team members must contribute verbally, ensuring their speech is clear, articulate, and well-paced. The presenters should maintain a professional tone and engage the audience by delivering the material in a manner that fosters understanding. The ability to explain complex concepts in an accessible and compelling way is essential at this level.</p>\n<p><strong>Content (35%)</strong></p>\n<p>The content section assesses the depth of understanding demonstrated by the team regarding the homemade experiment. It begins with the scientific principles behind the experiment, which should be explained thoroughly, showing the team’s grasp of the relevant theories and concepts. The procedure followed in the experiment should be clearly outlined, including a detailed discussion of the experimental design, controls, and variables. The group should also emphasize the relevance of their results, linking the findings to the original research question or hypothesis. A critical analysis of how these results contribute to the broader scientific field is expected. Furthermore, the team must demonstrate advanced interpretation skills by analyzing experimental data in depth, including any quantitative analysis, and providing a thoughtful synthesis of the results.</p>\n<p><strong>Style and Layout (10%)</strong></p>\n<p>The style and layout focus on the visual quality and organization of the presentation. The presentation should feature high-quality, clear images and photos of the experimental setup, ensuring that these visuals directly support the explanations being made. The design of the slides should be professional, with consistent formatting, legible fonts, and a well-thought-out color scheme that enhances readability. The slides should follow a logical flow, with each section building on the previous one to create a cohesive and understandable narrative. Overall, the visual appeal of the presentation should be engaging, ensuring that information is presented clearly and efficiently, without overcrowding the slides.</p>\n<p><strong>Critical Perspective (10%)</strong></p>\n<p>This criterion measures the ability to think critically about the experiment. The group should be able to explain why certain outcomes occurred, both expected and unexpected, demonstrating a deep analytical understanding of the experimental process. Acknowledging limitations and potential sources of error is crucial, as this shows an awareness of the experiment's constraints and an understanding of how these factors could impact the results. The group should also provide a thoughtful interpretation of any unexpected results, offering possible causes and exploring alternative explanations. Additionally, suggestions for meaningful improvements or adjustments to the experimental design should be provided, demonstrating the ability to problem-solve and refine experimental methodology.</p>\n<p><strong>Referencing (5%)</strong></p>\n<p>The referencing section assesses the correct and consistent use of scientific references. The group should integrate relevant scientific literature to support the background theory, the experimental methods, and the interpretation of results. All references must follow an appropriate citation style (e.g., APA, MLA, Chicago) both for in-text citations and in the bibliography. Proper integration of sources is critical, as it demonstrates the group’s ability to engage with existing research and support their arguments with credible external sources. Accurate referencing is a key indicator of scholarly rigor and attention to detail.</p>\n<p><br/></p>\n<p><strong>Marking criteria for the report:</strong></p>\n<p><strong>Content (20%)</strong></p>\n<p>The content of the report will be evaluated based on the depth and rigor of the scientific analysis and the accuracy of the experimental methodology. The report should begin with a comprehensive introduction to the topic, outlining the theoretical framework and the research question. This section should demonstrate a high level of understanding of the scientific principles that underlie the experiment, including the theoretical background relevant to the topic.</p>\n<p>The methodology section should provide a clear, detailed, and accurate description of the experimental design. This includes an in-depth explanation of the materials, procedures, and equipment used, allowing for replication. It is essential that the experimental setup, including any controls and variables, be well-documented, with clear justifications for the choices made.</p>\n<p>The results section should feature accurate and comprehensive calculations. Each step of the calculation process must be clearly explained, with all assumptions, units, and formulas used outlined in detail. Calculations should be presented logically, with appropriate data handling and analysis techniques applied to the raw data. This section must include relevant graphs, tables, and charts to support the interpretation of the data. Each graph or chart should be properly labeled, with clear titles, axes, and legends where necessary, and the data should be interpreted and analyzed critically.</p>\n<p>The discussion should provide a detailed interpretation of the results. The report should analyze the data in the context of the research question, drawing on the theory discussed in the introduction. It should also critically evaluate the limitations of the experiment, including any sources of error, and propose how the experiment could be improved in future iterations. Any unexpected results should be carefully discussed, with possible explanations provided based on the data and theoretical understanding.</p>\n<p>Finally, the conclusion should succinctly summarize the key findings of the experiment, indicating their significance in relation to the original hypothesis or research question.</p>\n<p><strong>Style and Layout (5%)</strong></p>\n<p>The style and layout of the report should adhere to a professional publication format, suitable for submission in an academic or scientific journal. The report should be well-organized, with a clear and logical structure that is easy to navigate.</p>\n<p>High-quality images, diagrams, and figures should be incorporated throughout the report to visually support the text. These visuals should be clear, relevant, and of high resolution. Photos of experimental setups should be included where appropriate, with adequate labeling and captions. Diagrams should be clearly labeled, and tables should present data in a structured and easy-to-understand manner. The inclusion of relevant charts and graphs is essential for the presentation of data, but care should be taken to avoid cluttered visuals.</p>\n<p>The text should be formatted according to the appropriate academic standards, with consistent font usage, spacing, and alignment. Sections should be clearly marked with appropriate headings (e.g., Introduction, Methodology, Results, Discussion, Conclusion). The overall flow of the report should be logical, ensuring that the reader can follow the argument from one section to the next.</p>\n<p>The report should also include an abstract at the beginning, offering a brief summary of the objectives, methods, key results, and conclusions. The language should be formal, precise, and free of jargon or colloquialisms.</p>\n<p><strong>Referencing (5%)</strong></p>\n<p>The referencing in the report must adhere to the correct academic citation style (e.g., APA, MLA, Chicago), both for in-text citations and the reference list. The report should include appropriate citations to credible sources, particularly for the theoretical background and methodology, showing an engagement with relevant literature. All sources of external data, theories, and methodologies must be cited, with the full details included in the reference list at the end of the report.</p>\n<p>The referencing should be consistent and accurate, with all cited works properly formatted according to the chosen citation style. This demonstrates the ability to incorporate and acknowledge prior research, which is critical for academic credibility. Proper citation of sources is essential for avoiding plagiarism and ensuring the report meets scholarly standards.</p>\n<p><strong>AI use:</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use Artificial Intelligence (AI) and/or Machine Translation (MT) tools, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which AI or MT will provide only limited support and guidance. </p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. </p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. </p>\n<p>The use of AI or MT must be referenced appropriately. Please see assessment guidelines in blackboard course site for specific instructions.</p>\n<p><strong>Peer review:</strong></p>\n<p>The assessment will be peer reviewed</p>\n<p><strong>ID assessment:</strong></p>\n<p>Please show your ID at the beginning of your talk</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission Instructions:</strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "End of Semester Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>6/06/2026 - 20/06/2026</p></dd>",
            "learning_objectives": "L03, L04",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The end of semester examination will assess course material from Modules 6 to 12.</p>\n<ul>\n<li>The exam consists of 8 questions, including:</li>\n<li>2 to 3 open-ended questions</li>\n<li>The remaining questions will be numerical exercises</li>\n</ul>\n<p><br/></p>\n<p>The exam will be an on-campus exam. Have your UQ student ID card available for all your exams.  </p>\n<p>Students enrolled in In Person delivery must attend the exam in-person. </p>\n<p><br/></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(23 Feb - 31 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lectures</strong><br><p>Explanation of the following subjects: material properties, thermodynamics, mass and energy balance, fluid mechanics, heat transfer, mass transfer, psychrometry, sustainable processes, refrigeration, dehydration, and evaporation systems, sustainability, and instrument control.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Lectures</strong>",
            "topic_description": "Lectures Explanation of the following subjects: material properties, thermodynamics, mass and energy balance, fluid mechanics, heat transfer, mass transfer, psychrometry, sustainable processes, refrigeration, dehydration, and evaporation systems, sustainability, and instrument control.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(23 Feb - 31 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorials</strong><br><p>Development of exercises on the following subjects: material properties, thermodynamics, mass and energy balance, fluid mechanics, heat transfer, mass transfer, psychrometry, sustainable processes, refrigeration, dehydration, and evaporation systems, sustainability, and instrument control.</p></br></p><p><strong>Learning outcomes:</strong> L05</p></div></td>",
            "topic_title": "<strong>Tutorials</strong>",
            "topic_description": "Tutorials Development of exercises on the following subjects: material properties, thermodynamics, mass and energy balance, fluid mechanics, heat transfer, mass transfer, psychrometry, sustainable processes, refrigeration, dehydration, and evaporation systems, sustainability, and instrument control.",
            "learning_outcomes": [
                "L05"
            ]
        }
    ]
}