{
    "course_title": "Principles of Food Preservation",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/FOOD7011-20613-7620",
    "full_course_code": "FOOD7011-20613-7620",
    "course_code": "FOOD7011",
    "class_code": "20613",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "illustrate the principles of food preservation by thermal and non-thermal processing including the limitations thereof."
        },
        {
            "number": "LO2.",
            "description": "illustrate the principles of food preservation by concentration and dehydration processing including the limitations thereof."
        },
        {
            "number": "LO3.",
            "description": "illustrate the principles of food preservation by packaging, fermentation, preservatives and Hurdle technology including the limitations thereof."
        },
        {
            "number": "LO4.",
            "description": "demonstrate core practical skills in food preservation using laboratory techniques and undertake experiments in food preservation which require both qualitative and quantitative outcomes."
        },
        {
            "number": "LO5.",
            "description": "illustrate comprehensive knowledge of advanced methods of thermal and non-thermal food preservation methods."
        },
        {
            "number": "LO6.",
            "description": "process material and to critically analyse and integrate information from a wide range of sources and effectively use appropriate information and communication technologies."
        },
        {
            "number": "LO7.",
            "description": "interact effectively with others and work towards a common outcome."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Practical Lab notebook",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p>Formative laboratory practical workbook (Weighted 0%, Pass/Fail) 27/03/2026 2:00 pm</p>\n<p>Final laboratory practical workbook (Weighted 25%) 1/05/2026 2:00 pm</p>\n<p>\n</p><p>Refer to additional course grading information for practical attendance requirements.</p></dd>",
            "learning_objectives": "L04, L06, L07",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Notebook/ Logbook",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will keep one practical lab notebook, electronically provided by the Lab coordinator <em>via</em> Ultra. A formative practical lab workbook will be written up based on data and results collected during the practical session on topic 1. The formative practical lab workbook weighs 0% and students can utilise the feedback given to improve their end of semester practical lab book submission. Final practical lab workbook will be written based on the data and results collected during the rest of the practical sessions.</p>\n<p>Students are required to attend the practical week as well as follow-up week(s) to complete a practical. To obtain a grade for a particular practical class students must attend and complete the associated exercises. If students do not attend a practical class and its follow up activities, or do not provide evidence of the attendance (i.e. signing attendance sheet), the written report for that particular practical will not be marked/graded.</p>\n<p><strong>Absence from a Practical Session </strong></p>\n<p>If you are unable to complete your timetabled practical session because of circumstances beyond your control (e.g., illness) you must <a href=\"https://studenthub.uq.edu.au/form.aspx?id=5913956\">submit a practical absence request</a> immediately accompanied by acceptable supporting documentation.  </p>\n<p>A list of acceptable reasons and required supporting documentation is found at <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension?p=1\">https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension?p=1#1</a>  </p>\n<p>Your request must be submitted prior to or on the day of the missed practical. The submission link can be found in the Learning Resources (Blackboard Original) or Course Resources (Blackboard Ultra) folder in your course Blackboard site.  </p>\n<ul>\n<li>If there is an associated assessment item, you must submit the relevant assessment item by the due date. If the reason for your absence impacts your ability to meet the due date, you must apply for an extension of assessment due date.  </li>\n<li>If you require access to restricted online resources such as videos to complete your assessment, you must contact the course coordinator to get access to the online resources.  </li>\n</ul>\n<p>Requests without the correct supporting documentation may not be approved. If the reason for your absence is not approved, you will be considered absent from that practical session.  </p>\n<p>It is your responsibility to submit an application and provide correct documentation.  </p>\n<p>If you require further assistance, please do not hesitate to contact the School - <a href=\"mailto:agriculture@enquire.uq.edu.au\">agriculture@enquire.uq.edu.au</a>. </p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use Artificial Intelligence (AI) and/or Machine Translation (MT) tools, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which AI or MT will provide only limited support and guidance. </p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. </p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. </p>\n<p>The use of AI or MT must be referenced appropriately. Please see assessment guidelines in blackboard course site for specific instructions. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Turnitin submission details:</strong>  </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Oral Seminar - Advanced Food Preservation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 18/05/2026 - 22/05/2026</p>\n<p>\n</p><p>Date and time to be confirmed.</p>\n<p>The details about the assessment will be discussed further during tutorials. </p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment item will be developed in student groups. Students will self-enroll into a group of their choice, after which each group will be randomly assigned a topic related to advanced preservation technique. The groups are expected to discuss their assigned topic during tutorial. At an allocated timeslot towards the end of the semester, each group will present their work in person. All group members are required to participate in the presentation and must attend the allocated presentation time. Non-attendance constitute grounds for zero mark. </p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use Artificial Intelligence (AI) and/or Machine Translation (MT) tools, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which AI or MT will provide only limited support and guidance. </p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. </p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. </p>\n<p>The use of AI or MT must be referenced appropriately. Please see assessment guidelines in blackboard course site for specific instructions. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>This assessment is to be presented in person during a timetabled session.  Additionally, a copy of the group presentation must be submitted to the course's Ultra site before the scheduled time for the oral presentation.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "End of Semester Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>6/06/2026 - 20/06/2026</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The exam will be an on-campus exam. Have your UQ student ID card available for all your exams.</p>\n<p>Students must attend the exam in person.</p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 12(23 Feb - 24 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorials </strong><br><p>This course will teach about advanced preservation techniques through tutorials. The tutorial series consists of an introduction to advanced preservation techniques followed by group work whereby the students are required to design a preservation plan for a chosen commodity using advanced preservation technologies and compare them to the traditional preservation technologies. </p></br></p><p><strong>Sub-activity:</strong> Discussions about advanced food preservation techniques. The tutorials provide opportunities for extensive student engagement. During tutorials, students are expected to actively contribute to the discussions and subsequently group works.</p></div></td>",
            "topic_title": "<strong>Tutorials </strong>",
            "topic_description": "Tutorials This course will teach about advanced preservation techniques through tutorials. The tutorial series consists of an introduction to advanced preservation techniques followed by group work whereby the students are required to design a preservation plan for a chosen commodity using advanced preservation technologies and compare them to the traditional preservation technologies. Sub-activity: Discussions about advanced food preservation techniques. The tutorials provide opportunities for extensive student engagement. During tutorials, students are expected to actively contribute to the discussions and subsequently group works.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(23 Feb - 31 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lectures</strong><br><p>Lectures are delivered as Modules to develop a knowledge and understanding of various methods of food preservation such as heating, cooling, freezing, drying of foods. The lectures also cover the principles and comprehensive knowledge of fermentation, food packaging, preservatives and Hurdle technology as means of food preservation. All modules are delivered by Dr Elisabeth Prabawati.</p></br></p><p><strong>Sub-activity:</strong> Principles and applications of various food preservation techniques. Limitation of those techniques.</p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Lectures</strong>",
            "topic_description": "Lectures Lectures are delivered as Modules to develop a knowledge and understanding of various methods of food preservation such as heating, cooling, freezing, drying of foods. The lectures also cover the principles and comprehensive knowledge of fermentation, food packaging, preservatives and Hurdle technology as means of food preservation. All modules are delivered by Dr Elisabeth Prabawati. Sub-activity: Principles and applications of various food preservation techniques. Limitation of those techniques.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 12(02 Mar - 24 May)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Laboratory Practicals</strong><br><p>The laboratory experiments are a tool for you to combine both the theoretical and practical knowledge covered in this course. Each experiment relates to a particular topic covered in the lectures. In addition, you will acquire skills in the communication of your laboratory data through keeping a detailed experimental results workbook and the submission thereof.</p></br></p><p><strong>Sub-activity:</strong> Hands on experience in the laboratory to further understanding of the principle of several food preservation techniques covered in the lectures.</p><p><strong>Learning outcomes:</strong> L04, L06, L07</p></div></td>",
            "topic_title": "<strong>Laboratory Practicals</strong>",
            "topic_description": "Laboratory Practicals The laboratory experiments are a tool for you to combine both the theoretical and practical knowledge covered in this course. Each experiment relates to a particular topic covered in the lectures. In addition, you will acquire skills in the communication of your laboratory data through keeping a detailed experimental results workbook and the submission thereof. Sub-activity: Hands on experience in the laboratory to further understanding of the principle of several food preservation techniques covered in the lectures.",
            "learning_outcomes": [
                "L04",
                "L06",
                "L07"
            ]
        }
    ]
}