{
    "course_title": "Major Practicum (Exercise and Sports Science)",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/HMST4314-21017-7620",
    "full_course_code": "HMST4314-21017-7620",
    "course_code": "HMST4314",
    "class_code": "21017",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (27/01/2026 - 10/07/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate the skills and competencies required to work competently and confidently with low to moderate risk clients; and recognise the need for referral to other related professionals when appropriate. As described within the scope of practice by Exercise and Sport Science Australia (ESSA) for Exercise Science (400 hours minimum)"
        },
        {
            "number": "LO2.",
            "description": "Demonstrate professional conduct that is sensitive to client diversity and equity and is consistent with the ESSA Code of Professional Conduct and Ethical Practice"
        },
        {
            "number": "LO3.",
            "description": "Develop scientific rationale for professional decision making and service delivery, appropriate time management and ability to work collaboratively, and independently (as appropriate)"
        },
        {
            "number": "LO4.",
            "description": "Demonstrate the ability to use research skills to critically evaluate specific areas of assessment, client centered interventions and/or education to determine whether research evidence indicates that current practice should be maintained or modified"
        },
        {
            "number": "LO5.",
            "description": "Demonstrate effective written and oral communication skills relevant to the profession"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Logbooks",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>  Pass/Fail </dd>",
            "due_date": "<dd><p>Logbooks are to be submitted twice throughout the semester:</p>\n<p><strong>First Submission</strong></p>\n<p>Due 5:00pm, end of week 2 of placement.</p>\n<p><strong>Second Submission</strong></p>\n<p>Due 5:00pm, 10 business days after the last day of placement.</p></dd>",
            "learning_objectives": "L01, L02, L04, L05",
            "mode": "Written",
            "category": "Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>To meet HMST4314 requirements during your placement, students must maintain a logbook documenting all practicum hours completed during placement. A minimum of 400 hours of practicum is required across a range of sports science activities to demonstrate competency in assessment, analysis, programming, and delivery.</p>\n<p>Practicum hours must be completed across multiple sports science disciplines, with at least 120 hours involving direct service delivery to athletes or sport science service users. The remaining hours may include assessment, program design, data collection, analysis, reporting, or other activities.</p>\n<p>As part of your course requirements, you must set three practicum goals that reflect areas you want to develop within your scope of practice. Your progress toward these goals will be reviewed at mid-placement and end-placement with your placement supervisor.</p>\n<p><strong>Accredited Sports Scientist (ASpS)</strong>: If you will be seeking ASpS membership after graduating, you will need to ensure you complete your placement under an appropriate supervisor and site, and ensure that you are completing relevant activities within the ASpS scope of practice.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission via ePortfolio</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Professional Attributes Assessments",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>  Pass/Fail </dd>",
            "due_date": "<dd><p><strong>Self-Assessment and Intermediate Supervisor Assessment: </strong>Upon Accrual of 200 placement hours.</p>\n<p><strong>Final Supervisor Assessment:</strong> Upon accrual of 400 placement hours.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Activity/ Performance",
            "category": "Performance",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Throughout your placement, you will complete three key assessments designed to support your professional development and evaluate your performance:</p>\n<p><strong>Assessment Structure</strong></p>\n<p>All assessment (Self-Assessment, Intermediate Supervisor Assessment, and Final Supervisor Assessment) are evaluated using a consistent Likert scale:</p>\n<ul>\n<li>Not Meeting Expectations</li>\n<li>Development Required</li>\n<li>Meeting Expectations</li>\n<li>Exceeds Expectations </li>\n</ul>\n<p>Each assessment is based on the following eight Professional Attributes:</p>\n<ol>\n<li>Professionalism</li>\n<li>Client facing skills</li>\n<li>Collaboration and reflective practice</li>\n<li>Technical skills/knowledge</li>\n<li>Exercise prescription</li>\n<li>Exercise delivery</li>\n</ol>\n<p><strong>Self-Assessment</strong></p>\n<p>As student practitioners on practicum, you are required to critically reflect on your performance and self-assess your developing capabilities. This self-assessment supports your development as a reflective practitioner, a key capability embedded within the ESSA Professional Practice Standards. You will assess yourself against the ESSA Professional Standards based on your experiences from the first half of your placement.</p>\n<p>This self-assessment must be completed immediately prior to your supervisor completing the Intermediate Professional Attributes Assessment, ensuring that both you and your supervisor review your perceived performance at the same point in the placement and use this as a basis for discussion of strengths, progress, and areas for development.</p>\n<p>This task is assessed by the University on a Pass/Fail basis. A Pass is awarded when the student meaningfully engages with the tool by providing accurate self-ratings and thoughtful, reflective commentary for each standard. A Fail is awarded when the submission is incomplete, superficial, or does not demonstrate genuine self-evaluation against the professional attributes.</p>\n<p><strong>Intermediate Supervisor Assessment</strong></p>\n<p>As student practitioners on practicum, you are required to receive structured feedback on your developing professional capabilities. At the mid-point of your placement, your supervisor will assess your performance against the ESSA Professional Standards and provide ratings and commentary based on your progress to date.</p>\n<p>This assessment mirrors the structure of your self-assessment but is completed by your supervisor, who will rate your performance using the same four-point scale. The purpose of this assessment is to support your development as a reflective practitioner, guide professional growth, and identify strengths and areas requiring further improvement during the remainder of your placement. </p>\n<p>The supervisor’s ratings do not contribute directly to your course grade; however, receiving a rating of \"Development Required\" or \"Does Not Meet Expectations\" in any Standards requires the student and supervisor to work together to develop a plan to support progress and ensure the student can meet expectations by the end of the placement.</p>\n<p><strong>Final Supervisor Assessment</strong></p>\n<p>As student practitioners on practicum, you are required to demonstrate competency across the ESSA Professional Standards by the completion of your placement. At the end of your placement, your supervisor will conduct a Final Professional Attributes Assessment to evaluate your overall performance and readiness for professional practice.</p>\n<p>This final assessment provides an opportunity for you and your supervisor to review your performance, acknowledge strengths, identify any remaining areas for development, and confirm that you have met the minimum professional competency required for successful course completion.</p>\n<p>The assessment must be completed on your final day of placement or within five (5) days of finishing, ensuring your supervisor evaluates your most recent and complete performance across the placement. Unlike the mid-placement assessment, the final supervisor assessment is summative and contributes to your overall course result. To pass the placement, you must meet or exceed expectations in all Standards.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Self and Supervisor Intermediate assessments</strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Sports Science Practicum Project",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>  Pass/Fail </dd>",
            "due_date": "<dd><p>Upon accrual of 400 placement hours</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Practicum Project provides an opportunity for you to demonstrate applied professional learning during placement by contributing an educational resource relevant to your practicum context. This task is designed to evidence your ability to identify a practice-relevant need, apply sports science knowledge appropriately, and communicate information in a professional and accessible manner.</p>\n<p>During your practicum, you are required to identify a practice-relevant need within your placement setting and develop one applied educational resource that is relevant to the discipline of Sports Science and appropriate to the context of your placement. You are expected to propose your project idea(s) to your practicum supervisor for discussion and approval. The final educational resource should be informed by your placement experience and developed by you, with consultation from your practicum supervisor, with the aim of supporting clients, athletes, staff, students, or service delivery at the practicum site.</p>\n<p><strong>NOTE</strong>: Regardless of the number of sites with which you undertake placement, students will be required to submit ONE project for formal assessment. In the case where additional site(s) require you undertake a ‘project’ in order to complete their experience, these projects will not be assessed as part of this course.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission via ePortfolio.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Record of Student Engagement (ROSE) Form",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>  Pass/Fail </dd>",
            "due_date": "<dd><p>Obtain your practicum supervisor's signature and submit to ePortfolio within 10 business days after the completion of your placement. Your ROSE form cannot be finalised without a valid practicum supervisor signature within the valid timeframe.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>To demonstrate that you have met the ESSA Practicum Standards during your placement, you are required to complete and submit a Record of Student Engagement Form. This form is an ESSA requirement used to verify your practicum hours and document your engagement in activities appropriate to your enrolled practicum pathway (Exercise Science, Exercise Physiology, or Sport Science).</p>\n<p>The Record of Student Engagement provides a structured summary of the activities you undertook during placement, drawing on evidence contained in your practicum logbooks, and a reflective account of how your placement contributed to the development of the ESSA professional attributes required for accreditation.</p>\n<p>The Record of Student Engagement must be completed using the ESSA-approved template that corresponds to your practicum pathway and must be reviewed and signed by your practicum supervisor. The submission timeframe ensures compliance with ESSA submission requirements.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission via ePortfolio</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>400-Hour Practicum</strong><br/><p>Students complete a minimum of 400 placement hours in an appropriate setting to develop an integrated understanding of the of exercise science OR sports science scopes of practice, their domains, and sub-disciplines.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>400-Hour Practicum</strong>",
            "topic_description": "400-Hour Practicum Students complete a minimum of 400 placement hours in an appropriate setting to develop an integrated understanding of the of exercise science OR sports science scopes of practice, their domains, and sub-disciplines.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}