{
    "course_title": "Family Law",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/LAWS5121-20044-7620",
    "full_course_code": "LAWS5121-20044-7620",
    "course_code": "LAWS5121",
    "class_code": "20044",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate a sound knowledge of both the law relating to the breakdown of marriages and de facto relationships and of the means for resolving disputes in relation to children, property division and maintenance."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate knowledge of the legal institutions relevant to the practise of family law in Australia."
        },
        {
            "number": "LO3.",
            "description": "Demonstrate advanced written skills in the resolution of problems that arise in the context of family law."
        },
        {
            "number": "LO4.",
            "description": "Recognise the relationship between family law matters and those of other jurisdictions and areas of legal practice."
        },
        {
            "number": "LO5.",
            "description": "Critically analyse facts and provide solutions to theoretical and practical questions arising from the study of family law."
        },
        {
            "number": "LO6.",
            "description": "Situate family law within a broader social science context, recognising the influence of other disciplines (including psychology, gender and race studies and economics) on the theory and practice of family law."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Fact sheet and legal advice",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 1/04/2026 2:00 pm</p></dd>",
            "learning_objectives": "L02, L03, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>In this assessment, students will be required to prepare a fact sheet on an area of law and an accompanying short advice to the client. The topic and fact scenario will be provided by course coordinator in week 1. The task requires students to prepare:</p>\n<ol>\n<li>a Fact Sheet an aspect of family law in a manner that is legally accurate but also comprehensible to lay litigants. The objective is to produce a one-page document to provide to any client; AND</li>\n<li>a brief 1 page letter of advice to this client which refers to the fact sheet and relates it to a specific fact scenario provided. </li>\n</ol>\n<p>The purpose of this assessment is to demonstrate a clear understanding of a discrete aspect of family law and to develop an ability to communicate key principles to non-lawyers, as well as develop problem-solving skills in applying the legal principle to a factual situation to provide understandable advice. All legal practice, and particularly family law, relies on the ability to communicate well with the client.</p>\n<p>The Fact Sheet will be assessed based on how it conveys accurate, easily-understood and useful guidance to individuals navigating the family law system. It must provide coverage of the specified topic but students should consider how much detail is needed for a fact sheet. Examples of real fact sheets in family law will be provided for guidance but there is no specified form or template, except that it must contain at least one (no more than three) embedded link to a useful and publicly accessible resource. The fact sheet can, but does not have to, contain images or other visual elements. It must be on 1 side A4 page in no less than 12 point font.</p>\n<p> The accompanying legal memo will be assessed based on its accuracy, clarity and persuasiveness in identifying and applying the relevant legal principles and case law to the specific facts. It must be on 1 side A4 page in no less than 12 point font. </p>\n<p> Assessment criteria including a rubric for each element of this assessment are available on Blackboard. </p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. A declaration sheet must be completed and submitted with this assessment item.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=145\">Student Code of Conduct</a>. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments must be submitted electronically via the submission link on the course Blackboard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Making a parliamentary inquiry submission as a legal organisation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 6/05/2026 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Activity/ Performance, Written",
            "category": "Paper/ Report/ Annotation, Presentation, Role play/ Simulation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This is a group assessment task. By week 4 (seminar 3) you will be assigned to groups of 4-5. You will be given opportunities for group formation during seminars, and you may choose your own members or will be allocated to a group. This assessment has two elements:</p>\n<p><strong>Part 1</strong></p>\n<p>Your group must first decide (from a list provided) what sort of legal organisation you are (ie. law firm, community legal centre) and its usual type of clients. As this firm, your group must write a submission to a Commonwealth Senate Inquiry considering a reference to consider recent and proposed amendments to the <em>Family Law Act 1975</em>. Your group can choose which aspects of the terms of reference to respond to which might be influenced by the type of law firm you create. You will be expected to undertake research to contribute to your submission and to provide some (fictional) reference to experiences and impacts on the organisation's clients and wider legal ramifications, as well as a brief explanation of the firm you have created. It is expected that recommendations supporting or opposing/changing amendments are made.</p>\n<p>The word limit is 2000 words, inclusive of headings but not including footnotes (although footnotes should contain referencing material only and should not contain substantive text). The 2000 word limit is a firm limit. 10% of the student's final grade will be deducted for every 100 words or part thereof in excess of the limit. Students should state the final word count of their response on the front page of their submission.</p>\n<p><strong>Part 2</strong></p>\n<p>Your group must conduct a video recorded discussion about the submission. Each member of the group is expected to speak and be audible in the recording. Groups can decide to role play as a firm discussion but are not required to do so. The time limit of the recorded firm discussion should be no longer than 10 minutes.</p>\n<p>Both the written submission and recording should be uploaded by the due date.</p>\n<p><strong><em>Group input</em></strong></p>\n<p>All group members must contribute to selecting, researching, and writing the submission, and participate in the recorded discussion. Every group member will receive the same mark, unless a case is made otherwise. Resources to support your group work will be provided on the course BlackBoard and discussed in class.</p>\n<p>This assessment task develops students' abilities to work in teams as in legal practice and demonstrate a developed understanding and critical awareness of specific family law issues, as informed by the content of the course and further independent study.</p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. A declaration sheet must be completed and submitted with this assessment item. A failure to reference generative AI or MT use may constitute student misconduct under the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=145\">Student Code of Conduct</a>.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments must be submitted electronically via the submission link on the course Blackboard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "End-of-semester Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>6/06/2026 - 20/06/2026</p></dd>",
            "learning_objectives": "L01, L02, L03, L05",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The end-of-semester exam will be an open book exam.</p>\n<p>The exam will be worth 40% of the final mark.</p>\n<p>The material covered in the end-of-semester exam will be the course content from weeks 1, 2, 4 and 7-11. There will be two questions.</p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=145\">Student Code of Conduct</a>.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 12(23 Feb - 24 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lectures</strong><br><p>A lecture covering key legislative sections, legal principles and procedures is delivered in weeks 1-9 and 11-12 (ie. no weeks 10 or 13 lectures).</p>\n<p>Lecture topics are:</p>\n<p>Online recordings available on Blackboard: Introduction: situating family law within the wider social and legal context and the constitutional framework (available prior to week 1)</p>\n<p>Week 1: Dispute resolution in family law </p>\n<p>Week 2: Marriage and de facto relationships, nullity and divorce/ termination of de facto relationships</p>\n<p>Week 3: Parentage </p>\n<p>Week 4: Family violence, child abuse and the impact on family proceedings (parenting and property)</p>\n<p>Week 5: Children - determining best interests of the child and parenting orders</p>\n<p>Week 6: Children - relocation and international child abduction, child support and child maintenance</p>\n<p>Week 7: Financial support of spousal and de facto partners</p>\n<p>Week 8: Property - what constitutes property, contributions, jurisdiction and property proceedings framework</p>\n<p>Week 9: Property proceedings - exercising discretion and alteration of property interests</p>\n<p>Week 11: Property proceedings - orders, financial agreements, superannuation and injunctions</p>\n<p>Week 12: Revision - review key concepts, provisions and issues canvassed throughout the course</p></br></p><p><strong>Learning outcomes:</strong> L01, L04, L06</p></div></td>",
            "topic_title": "<strong>Lectures</strong>",
            "topic_description": "Lectures A lecture covering key legislative sections, legal principles and procedures is delivered in weeks 1-9 and 11-12 (ie. no weeks 10 or 13 lectures). Lecture topics are: Online recordings available on Blackboard: Introduction: situating family law within the wider social and legal context and the constitutional framework (available prior to week 1) Week 1: Dispute resolution in family law Week 2: Marriage and de facto relationships, nullity and divorce/ termination of de facto relationships Week 3: Parentage Week 4: Family violence, child abuse and the impact on family proceedings (parenting and property) Week 5: Children - determining best interests of the child and parenting orders Week 6: Children - relocation and international child abduction, child support and child maintenance Week 7: Financial support of spousal and de facto partners Week 8: Property - what constitutes property, contributions, jurisdiction and property proceedings framework Week 9: Property proceedings - exercising discretion and alteration of property interests Week 11: Property proceedings - orders, financial agreements, superannuation and injunctions Week 12: Revision - review key concepts, provisions and issues canvassed throughout the course",
            "learning_outcomes": [
                "L01",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 5(02 Mar - 29 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop</strong><br><p>Workshops will consolidate and deepen key legal concepts covered in lectures and from student independent reading. Workshops are structured around student engagement with family breakdown scenarios applying relevant rules and procedures to the facts. Each week, students are expected to participate in class and group discussion. In some weeks, students will be asked to engage in role-playing activities which provide development of legal skills including developing and showing empathy for clients and resolving disputes in ways that are safe and/or maintain relationships.</p>\n<p>On Blackboard, there are key resources, such as weekly prescribed textbook readings, cases and/or articles; short videos and online resources, for students to engage with before each class. Students’ preparation and reflection outside the classroom is an important aspect of learning in this subject. Family law has a complex and detailed regulatory regime and voluminous case law, as well as a unique jurisdiction of dispute resolution. While this introductory level course cannot consider all aspects of the regime, it does expect students to undertake independent study to enable them to understand the many core legal principles and practices and come to class ready to enhance and apply this understanding. The course also importantly considers scholarly debates about what is the best approach to governing family relationships or where there might be gaps in the law in addressing harms. Students are expected to read materials which consider these debates/critiques and apply them to class discussions as well as assessment.</p>\n<p>The topics to be considered in the first 5 workshops follow the order of the lectures (the week later).</p>\n<p>Workshop 1 (week 2): What is a family? How should the law relate to families? What are the key sources of family law? What are the jurisdictional limits? How are family disputes or Family breakdown resolved?</p>\n<p>Workshop 2 (week 3): Marriage formalities and determining a de facto relationship; end of a relationship- divorce/ termination of de facto relationships; nullity</p>\n<p>Workshop 3 (week 4): Parentage: who are parents? Assisted conception and surrogacy. Why does it matter who is the legal parent? This week will also consider First Nations' perspectives on kinship and families.</p>\n<p>Workshop 4 (week 5): How family courts deal with family violence (procedures, definitions); child abuse in family law and intersection with state protection.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Workshop</strong>",
            "topic_description": "Workshop Workshops will consolidate and deepen key legal concepts covered in lectures and from student independent reading. Workshops are structured around student engagement with family breakdown scenarios applying relevant rules and procedures to the facts. Each week, students are expected to participate in class and group discussion. In some weeks, students will be asked to engage in role-playing activities which provide development of legal skills including developing and showing empathy for clients and resolving disputes in ways that are safe and/or maintain relationships. On Blackboard, there are key resources, such as weekly prescribed textbook readings, cases and/or articles; short videos and online resources, for students to engage with before each class. Students’ preparation and reflection outside the classroom is an important aspect of learning in this subject. Family law has a complex and detailed regulatory regime and voluminous case law, as well as a unique jurisdiction of dispute resolution. While this introductory level course cannot consider all aspects of the regime, it does expect students to undertake independent study to enable them to understand the many core legal principles and practices and come to class ready to enhance and apply this understanding. The course also importantly considers scholarly debates about what is the best approach to governing family relationships or where there might be gaps in the law in addressing harms. Students are expected to read materials which consider these debates/critiques and apply them to class discussions as well as assessment. The topics to be considered in the first 5 workshops follow the order of the lectures (the week later). Workshop 1 (week 2): What is a family? How should the law relate to families? What are the key sources of family law? What are the jurisdictional limits? How are family disputes or Family breakdown resolved? Workshop 2 (week 3): Marriage formalities and determining a de facto relationship; end of a relationship- divorce/ termination of de facto relationships; nullity Workshop 3 (week 4): Parentage: who are parents? Assisted conception and surrogacy. Why does it matter who is the legal parent? This week will also consider First Nations' perspectives on kinship and families. Workshop 4 (week 5): How family courts deal with family violence (procedures, definitions); child abuse in family law and intersection with state protection.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 7 To Week 9(13 Apr - 03 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop</strong><br><p>As above, workshops will consolidate and deepen key legal concepts covered in lectures and from student independent reading. Workshops are structured around student engagement with family breakdown scenarios applying relevant rules and procedures to the facts. Each week, students are expected to participate in class and group discussion. In some weeks, students will be asked to engage in role-playing activities which provide development of legal skills including developing and showing empathy for clients and resolving disputes in ways that are safe and/or maintain relationships. From week 7 students will be provided with an opportunity to work through scenarios and essay style questions.</p>\n<p>The topics to be considered in workshops from week 7-9 are:</p>\n<p>Workshop 5 (week 7): understanding proceedings relating to children; best interests considerations and parenting orders</p>\n<p>Workshop 6 (week 8): continuing discussion of parenting orders, focus on relocation and international child abduction</p>\n<p>Workshop 7 (week 9): Financial support of children (child support and maintenance) and support of spousal and de facto partners</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Workshop</strong>",
            "topic_description": "Workshop As above, workshops will consolidate and deepen key legal concepts covered in lectures and from student independent reading. Workshops are structured around student engagement with family breakdown scenarios applying relevant rules and procedures to the facts. Each week, students are expected to participate in class and group discussion. In some weeks, students will be asked to engage in role-playing activities which provide development of legal skills including developing and showing empathy for clients and resolving disputes in ways that are safe and/or maintain relationships. From week 7 students will be provided with an opportunity to work through scenarios and essay style questions. The topics to be considered in workshops from week 7-9 are: Workshop 5 (week 7): understanding proceedings relating to children; best interests considerations and parenting orders Workshop 6 (week 8): continuing discussion of parenting orders, focus on relocation and international child abduction Workshop 7 (week 9): Financial support of children (child support and maintenance) and support of spousal and de facto partners",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 11 To Week 13(11 May - 31 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop</strong><br><p>As above, workshops will consolidate and deepen key legal concepts covered in lectures and from student independent reading. Workshops are structured around student engagement with family breakdown scenarios applying relevant rules and procedures to the facts. Each week, students are expected to participate in class and group discussion. In some weeks, students will be asked to engage in role-playing activities which provide development of legal skills including developing and showing empathy for clients and resolving disputes in ways that are safe and/or maintain relationships. Students will be provided with an opportunity to work through scenarios and essay style questions.</p>\n<p>Workshop 8 (week 11): Property - understanding the legislative framework; what counts as property or contributions? Jurisdiction to make property alterations and dispute resolution</p>\n<p>Workshop 9 (week 12): How the court exercises its discretion for alteration of property interests (and applying spousal maintenance principles)</p>\n<p>Workshop 10 (week 13): Continuing alteration of property interests; overview of power to make orders and injunctions and financial agreements; revising the course</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Workshop</strong>",
            "topic_description": "Workshop As above, workshops will consolidate and deepen key legal concepts covered in lectures and from student independent reading. Workshops are structured around student engagement with family breakdown scenarios applying relevant rules and procedures to the facts. Each week, students are expected to participate in class and group discussion. In some weeks, students will be asked to engage in role-playing activities which provide development of legal skills including developing and showing empathy for clients and resolving disputes in ways that are safe and/or maintain relationships. Students will be provided with an opportunity to work through scenarios and essay style questions. Workshop 8 (week 11): Property - understanding the legislative framework; what counts as property or contributions? Jurisdiction to make property alterations and dispute resolution Workshop 9 (week 12): How the court exercises its discretion for alteration of property interests (and applying spousal maintenance principles) Workshop 10 (week 13): Continuing alteration of property interests; overview of power to make orders and injunctions and financial agreements; revising the course",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        }
    ]
}