{
    "course_title": "Current Issues in International Law (Public)",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/LAWS7724-20079-7620",
    "full_course_code": "LAWS7724-20079-7620",
    "course_code": "LAWS7724",
    "class_code": "20079",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Critically analyse the international legal framework governing the rights of persons with disabilities, including the Convention on the Rights of Persons with Disabilities (CRPD) and related instruments."
        },
        {
            "number": "LO2.",
            "description": "Evaluate the role and influence of international bodies (e.g., UN CRPD Committee, World Bank, and WHO) in shaping disability-inclusive policies and legal norms globally."
        },
        {
            "number": "LO3.",
            "description": "Interpret and apply principles of international disability law to complex, real-world scenarios, including cross-border and comparative contexts."
        },
        {
            "number": "LO4.",
            "description": "Assess the interaction between international disability law and other areas of international law (e.g., human rights, development, trade), identifying synergies and tensions."
        },
        {
            "number": "LO5.",
            "description": "Critique implementation challenges faced by States Parties, particularly in the Global South, and propose legally sound strategies for compliance and enforcement."
        },
        {
            "number": "LO6.",
            "description": "Conduct independent, advanced legal research on international disability law, using authoritative sources and applying rigorous academic standards."
        },
        {
            "number": "LO7.",
            "description": "Communicate sophisticated legal arguments effectively in written and oral form, demonstrating clarity, precision, and adherence to scholarly conventions."
        },
        {
            "number": "LO8.",
            "description": "Reflect on ethical and policy dimensions of disability rights in international law, including issues of equality, participation, and intersectionality."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Research Assignment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>50% - 3750 words </dd>",
            "due_date": "<dd><p> 20/04/2026 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L06, L07",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Coverage:</strong> Content from the first four seminars</p>\n<p><strong>Topic Selection: </strong>Students will be provided with suggested topics. Alternatively, students may propose their own topic, subject to approval by the Unit Coordinator.</p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=145\">Student Code of Conduct</a> .</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments must be submitted electronically in Word document via TurnItIn on 'Online Submission of Assignments' folder on the course Blackboard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "End-of-semester Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>6/06/2026 - 20/06/2026</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L08",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This examination consists of two compulsory problem-based questions. All candidates are required to attempt both questions.</p>\n<p>The exam will be conducted via <strong>Inspera Assessment</strong>. Inspera is a cloud based assessment platform providing additional functionality to complement the existing suite of digital learning tools at UQ. For more information about Inspera Assessment and to see what the interface looks like, please see <a href=\"https://web.library.uq.edu.au/library-services/it/assessments-inspera\">https://elearning.uq.edu.au/student-guides-ultra/inspera-assessment-ultra-student</a> and try out the Inspera demo test. Remember, Inspera is a university-wide platform, so there may be some question types in the demo test that are not relevant to your discipline. Further information will be provided in the Blackboard site during the semester, and a practice opportunity will be available.</p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=145\">Student Code of Conduct</a>.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Seminar 1</strong><br/><p>Norms and the Convention on the Rights of Persons with Disabilities: Introduction to competing notions of disability; the enthusing of “nothing about us without us” in the CRPD drafting and monitoring; treaty monitoring mechanisms.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L08</p></div></td>",
            "topic_title": "<strong>Seminar 1</strong>",
            "topic_description": "Seminar 1 Norms and the Convention on the Rights of Persons with Disabilities: Introduction to competing notions of disability; the enthusing of “nothing about us without us” in the CRPD drafting and monitoring; treaty monitoring mechanisms.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L08"
            ]
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Seminar 2</strong><br/><p>Intersectionality and education: disability and intersectionality- the interaction between the CRPD and human rights on children, Indigenous people, and women; a case study on education- K-12 through to tertiary.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L08</p></div></td>",
            "topic_title": "<strong>Seminar 2</strong>",
            "topic_description": "Seminar 2 Intersectionality and education: disability and intersectionality- the interaction between the CRPD and human rights on children, Indigenous people, and women; a case study on education- K-12 through to tertiary.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L08"
            ]
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Seminar 3</strong><br/><p>Development: Development verses human rights; The impact of the CRPD’s International Cooperation article; national development strategies; the World Bank and the Sustainable Development Goals – now and what next?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L08</p></div></td>",
            "topic_title": "<strong>Seminar 3</strong>",
            "topic_description": "Seminar 3 Development: Development verses human rights; The impact of the CRPD’s International Cooperation article; national development strategies; the World Bank and the Sustainable Development Goals – now and what next?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L08"
            ]
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Seminar 4</strong><br/><p>Health: universal right to health or a right to health services?; conflicts between the CRPD and global health norms; concurrence between the CRPD and the World Health Organization on social determinants of health and community-based-rehabilitation.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L08</p></div></td>",
            "topic_title": "<strong>Seminar 4</strong>",
            "topic_description": "Seminar 4 Health: universal right to health or a right to health services?; conflicts between the CRPD and global health norms; concurrence between the CRPD and the World Health Organization on social determinants of health and community-based-rehabilitation.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L08"
            ]
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Seminar 5</strong><br/><p>Risk: Humanitarian law and disability human rights law; international norms on access to water, sanitation and hygiene; international climate change and disability.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L08</p></div></td>",
            "topic_title": "<strong>Seminar 5</strong>",
            "topic_description": "Seminar 5 Risk: Humanitarian law and disability human rights law; international norms on access to water, sanitation and hygiene; international climate change and disability.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L08"
            ]
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Seminar 6</strong><br/><p> Deinstitutionalisation: Deinstitutionalisation – not just a change of address but a need to change society; institutionalisation, group homes and the Disability Royal Commission verses doing deinstitutionalisation without sufficient resourcing and community-wide inclusion; housing, social security, services and more.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L08</p></div></td>",
            "topic_title": "<strong>Seminar 6</strong>",
            "topic_description": "Seminar 6 Deinstitutionalisation: Deinstitutionalisation – not just a change of address but a need to change society; institutionalisation, group homes and the Disability Royal Commission verses doing deinstitutionalisation without sufficient resourcing and community-wide inclusion; housing, social security, services and more.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L08"
            ]
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Seminar 7</strong><br/><p>Realising legal capacity: access to courts and to justice; guardianship and denying the disability voice verses how to realize universal legal capacity; supported decision making and the role of the State, charities and families.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L08</p></div></td>",
            "topic_title": "<strong>Seminar 7</strong>",
            "topic_description": "Seminar 7 Realising legal capacity: access to courts and to justice; guardianship and denying the disability voice verses how to realize universal legal capacity; supported decision making and the role of the State, charities and families.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L08"
            ]
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Seminar 8</strong><br/><p>Information: data, the interaction between disability rights to access information and global intellectual property laws; emerging technologies: rights to information communication technologies and artificial intelligence.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L08</p></div></td>",
            "topic_title": "<strong>Seminar 8</strong>",
            "topic_description": "Seminar 8 Information: data, the interaction between disability rights to access information and global intellectual property laws; emerging technologies: rights to information communication technologies and artificial intelligence.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L08"
            ]
        }
    ]
}