{
    "course_title": "Sustainable Food Supply Chains",
    "study_period": "Sem 1 2026",
    "location": "External",
    "attendance": "Online",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MGTS3968-20771-7620",
    "full_course_code": "MGTS3968-20771-7620",
    "course_code": "MGTS3968",
    "class_code": "20771",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Describe the key features of agrifood supply chains."
        },
        {
            "number": "LO2.",
            "description": "Analyse critically the concepts that underpin the formation and operation of agrifood supply chains."
        },
        {
            "number": "LO3.",
            "description": "Assess the factors that enhance and hinder the performance of stakeholders in agrifood supply chains."
        },
        {
            "number": "LO4.",
            "description": "Evaluate supply chain management activities and approaches across whole chains."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate comprehensive knowledge of agrifood supply chain principles and their application."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Sequential Reports 1 & 2",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>50% Combination of weighting from Assessment 1 (25%) and Assessment 2 (25%) </dd>",
            "due_date": "<dd><p>Assessment 1 13/04/2026 2:00 pm</p>\n<p>Assessment 2 18/05/2026 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The two coursework assignments are designed to develop progressively deeper analysis, moving from supply chain context and segment-level analysis to whole-of-chain evaluation and strategic synthesis.</p>\n<p><br/></p>\n<p><strong>Assignment 1: Agrifood Supply Chain Context and Single-Segment Analysis (25%)</strong></p>\n<p>This assignment requires students to analyse an agrifood supply chain by situating it within its broader production, market, and consumption context, and by undertaking an in-depth analysis of one segment of the supply chain (upstream, midstream, or downstream). Students will select a generic food product produced in Australia, define the boundary of a specific supply chain for that product, and describe key product and supply chain characteristics. The task requires construction of a supply chain diagram identifying major actors, activities, and product transformations, supported by basic marketing margin analysis. Students will then critically analyse the activities, opportunities, and threats facing actors within a selected supply chain segment, applying relevant agrifood supply chain concepts. This assignment develops foundational skills in supply chain mapping, contextual analysis, and segment-level evaluation, and provides the analytical basis for subsequent whole-of-chain assessment later in the course.</p>\n<p>Learning outcomes assessed: LO1, LO2, LO3</p>\n<p><br/></p>\n<p><strong>Assignment 2: Whole-of-Chain Evaluation and Strategy (25%)</strong></p>\n<p>This assignment requires students to undertake a whole-of-chain evaluation of an agrifood supply chain, building on the contextual and segment-level analysis developed earlier in the course. Using the same supply chain examined in Assignment 1, students will evaluate supply chain management approaches across the entire chain, including assessment of coordination, uncertainty, and buyer–supplier relationships. The task requires students to analyse whether the chain operates according to lean, agile, or alternative management logics; to categorise the chain using established demand and supply uncertainty frameworks; and to assess implications for resilience and performance. Students will also examine dominant selling arrangements and buyer–supplier relationships across different chain segments, and evaluate one significant supply chain–focused opportunity with the potential to improve value creation, efficiency, or resilience across the chain. This evaluation will include consideration of costs and benefits for actors in different segments and implications for power dynamics within the supply chain. This assignment emphasises synthesis, evaluation, and strategic reasoning at the whole-of-chain level and serves as the capstone coursework task prior to the final examination.</p>\n<p>Learning outcomes assessed: LO2, LO3, LO4</p>\n<p> </p>\n<p>Both tasks should be submitted to Turnitin via blackboard.</p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. </p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. </p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. The use of AI or MT must be referenced appropriately. Please see assessment guidelines in blackboard course site for specific instructions. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your Assessment task, in Blackboard, via the Turnitin link by the submission deadline. You should also retain an electronic copy of every piece of assessment you submit.  </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Final Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>6/06/2026 - 20/06/2026</p></dd>",
            "learning_objectives": "L05",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The final examination assesses students’ comprehensive understanding of agrifood supply chain principles and their <strong>ability to apply, integrate, and evaluate these principles when analysing agrifood supply chain issues and scenarios</strong>. Students will be required to demonstrate structured reasoning and justified judgement, drawing on concepts and frameworks developed across the course.</p>\n<p>The examination is a closed-book, invigilated examination. Have your UQ student ID card available for all your exams.  </p>\n<p>Students enrolled in External delivery must attend the exam in-person, either on campus OR at an approved off-campus venue as organized with UQ Examinations. Students who live within a 200km radius of the campus will be expected to attend campus for the exam. </p>\n<p>UQ Examinations will contact students directly to confirm arrangements. Please ensure to check your UQ student email account regularly throughout semester as One reminder will be sent and students who fail to nominate an exam centre and will be automatically assigned to sit their exam on campus. Late nominations will not be accepted. Please ensure you update your semester address in Si-net at the start of the semester to accurately reflect where you are residing. </p>\n<p>The Casio FX-82 model calculator is the accepted calculator at UQ where calculators are permitted. You don't need an approved sticker for it. Details about approved calculators, including how to have one approved is here: <a href=\"https://my.uq.edu.au/services/manage-my-program/exams-and-assessment/sitting-exam/calculators-in-exams/approved-non-approved-calculators\">Approved and non-approved calculators - my.UQ - University of Queensland</a></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(23 Feb - 31 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workhop series</strong><br><p>The course is delivered through a structured workshop series designed to support a learning-centred approach to understanding agrifood supply chains. Workshops emphasise active engagement with applied concepts through case-based discussion, guided analytical exercises, and structured opportunities for formative feedback. This format enables students to work iteratively with real agrifood supply chain examples, practise supply chain mapping, segment-level analysis, and whole-of-chain evaluation, and receive feedback that supports the progressive development of analytical and evaluative skills. Workshops provide a forum for students to apply theoretical frameworks to concrete supply chain scenarios, compare alternative management approaches, and develop reasoned judgements about performance, coordination, risk, and resilience. By foregrounding discussion, application, and guided practice rather than content transmission alone, the workshop series scaffolds the capabilities assessed in coursework and prepares students for integrative, applied reasoning under exam conditions, while supporting diverse learning pathways and sustained engagement with complex supply chain problems.</p></br></p><p><strong>Sub-activity:</strong> Concepts and characteristics of food systems and agrifood supply chains; Applying chain mapping, and interconnections between system and chain actors and activities; Marketing margins, stakeholders and share of margin to chain actors; Structure, conduct, and performance; Chain sustainability, within the context of stakeholder theory; Supply chain management and assessing buyer-seller relationships; Common supply chain management issues; Risk and resilience and identifying identify risks associated with vertically integrated farming and product manufacturing; Assessing options to manage risks across a supply chain with limited information; Values-based agrifood supply chains and assessing different broker models, the concept of dignity pricing, and equitable returns across a supply chain; Market structure, market power, and the role of policy; Comparison of marketing margins and antitrust concerns across contexts;</p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Workhop series</strong>",
            "topic_description": "Workhop series The course is delivered through a structured workshop series designed to support a learning-centred approach to understanding agrifood supply chains. Workshops emphasise active engagement with applied concepts through case-based discussion, guided analytical exercises, and structured opportunities for formative feedback. This format enables students to work iteratively with real agrifood supply chain examples, practise supply chain mapping, segment-level analysis, and whole-of-chain evaluation, and receive feedback that supports the progressive development of analytical and evaluative skills. Workshops provide a forum for students to apply theoretical frameworks to concrete supply chain scenarios, compare alternative management approaches, and develop reasoned judgements about performance, coordination, risk, and resilience. By foregrounding discussion, application, and guided practice rather than content transmission alone, the workshop series scaffolds the capabilities assessed in coursework and prepares students for integrative, applied reasoning under exam conditions, while supporting diverse learning pathways and sustained engagement with complex supply chain problems. Sub-activity: Concepts and characteristics of food systems and agrifood supply chains; Applying chain mapping, and interconnections between system and chain actors and activities; Marketing margins, stakeholders and share of margin to chain actors; Structure, conduct, and performance; Chain sustainability, within the context of stakeholder theory; Supply chain management and assessing buyer-seller relationships; Common supply chain management issues; Risk and resilience and identifying identify risks associated with vertically integrated farming and product manufacturing; Assessing options to manage risks across a supply chain with limited information; Values-based agrifood supply chains and assessing different broker models, the concept of dignity pricing, and equitable returns across a supply chain; Market structure, market power, and the role of policy; Comparison of marketing margins and antitrust concerns across contexts;",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}