{
    "course_title": "Clinical Midwifery Practice 5",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MIDW3102-20995-7620",
    "full_course_code": "MIDW3102-20995-7620",
    "course_code": "MIDW3102",
    "class_code": "20995",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (12/01/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Critique the evidence of the impact of continuity of care on outcomes for mothers and babies."
        },
        {
            "number": "LO2.",
            "description": "Prioritise effective relationships when working in partnership with women and families during continuity of care experiences that involves collaborative midwifery practice, utilising effective communication and digital technologies."
        },
        {
            "number": "LO3.",
            "description": "Evaluate the legal and professional responsibilities of the midwifery student as part of the multidisciplinary team when caring for women and families in the continuity of care experiences."
        },
        {
            "number": "LO4.",
            "description": "Prioritise the practice skills required to provide safe woman centred care including monitoring, assessment, and effective communication in the context of all midwifery practice experiences."
        },
        {
            "number": "LO5.",
            "description": "Reflect on the midwifery student’s role in all midwifery practice experiences and the positive impact this can have on health and well-being of mothers and babies."
        },
        {
            "number": "LO6.",
            "description": "Develop interprofessional practice skills in conflict management and collaborative leadership and enhance skills in role clarification, team functioning, interprofessional communication, client-centred care."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Clinical Placement Preparation and Development",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> NGP </dd>",
            "due_date": "<dd><p>To be completed halfway (approx. 80 hours) through your clinical placement.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Activity/ Performance, Written",
            "category": "Placement, Practical/ Demonstration, Portfolio, Quiz, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment task comprises of <strong>three (3) parts </strong>which will examine and extend your preparedness and development of clinical placement.</p>\n<p><strong>Part 1. </strong></p>\n<p>This assessment comprises of <strong>two (2) parts</strong> and requires the student to undertake online assessments on medication rights and drug calculations.</p>\n<p>To pass this assessment students must achieve 100% in both assessment tasks and is to be completed by week one (1) of commencement of clinical practice.</p>\n<p><strong>Part 2.</strong></p>\n<p>Demonstration of knowledge and reflective practice through Observed Clinical Practice and Feedback submissions.</p>\n<p><strong>Part 3.</strong></p>\n<p>Demonstrated capability in clinical practice commensurate with the MIDW3102 Course Learning Outcomes evidenced by completion and submission of the Australian Midwifery Standards Assessment Tool (AMSAT). </p>\n<p><em>Please access the task description in the Blackboard site for more detailed information.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students are required to upload and submit their completed medication safety certificates to the link under Assessment in the MIDW3102 Blackboard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Clinical Placement Completion",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> NGP </dd>",
            "due_date": "<dd><p>The due date for these assessments will be when the student is close to the completion of 160 hours of clinical placement.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Activity/ Performance, Written",
            "category": "Placement, Practical/ Demonstration, Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment requires you to demonstrate successful completion of clinical placement. Final year midwifery students' practice should align with the Midwife Standards for Practice (NMBA, 2018), learning outcomes and identified goals for the semester.  There are <strong>three (3) parts</strong> to this assessment:</p>\n<p><strong>Part 1.</strong> <strong>Demonstration of performance, knowledge and reflective practice through the Observed Clinical Practice and Feedback submissions.</strong></p>\n<p><strong>Part 2. Completion and upload of Midwifery Practice Experiences. </strong></p>\n<p>Students are required to complete and have verified/signed off the following midwifery practice experiences, which are dependent on your clinical placement:</p>\n<ul>\n<li>40 midwifery practice experiences</li>\n</ul>\n<p>Students are required to recruit and commence the following amount of COCEs which includes upload of consent forms in Myprogress ePAD.</p>\n<ul>\n<li>At least two (2) women</li>\n</ul>\n<p><strong>Part 3. Demonstrated capability in clinical practice commensurate with the MIDW3102 Course Learning Objectives evidenced by completion and submission of the Australian Midwifery Standards Assessment Tool (AMSAT).  </strong></p>\n<p><em>Please access the task description in the Blackboard site for more detailed information.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students are to submit their Final AMSAT form via their ePAD, and MPEs and CoCe will be submitted at the time of completion, <strong>in a live environment</strong>, via their ePAD with the midwife verification.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>Full criteria for each grade is available in the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">Assessment Procedure</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "IPCP Curriculum Assessment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd> Pass/Fail (Must Pass) </dd>",
            "due_date": "<dd><p>Two weeks after last allocated tutorial session, check blackboard.</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Please refer to the assessment information on Learn.UQ for the assessment due date for your team. This is a team assessment. Teams will be assigned during your first tutorial. There are two (2) parts to this assessment:</p>\n<p><strong>Part One</strong> requires you to complete a poster and will draw on the online and face-to-face content from Modules 4 and 5 and the knowledge and skills you developed from Modules 1 to 3. You will present your poster for peer feedback in Module 6.</p>\n<p><strong>Part Two</strong> involves creating a 3-minute video and will draw on the online and face-to-face content from Modules 4, 5 and 6 and the knowledge and skills you developed from Modules 1 to 3.</p>\n<p>You will have the opportunity to begin work on each part of the assessment with your team during tutorials and will be expected to spend additional time with your team to complete each task. </p>\n<p>Teams will need to submit both parts of your assessment in the Assessment tab on the IPCP Learn.UQ course site. Additional information regarding submission will be provided on the IPCP Learn.UQ course site. </p>\n<p>Please refer to the assessment information on Learn.UQ for further details and requirements for the assessment. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Online submission via Blackboard. </p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>Full criteria for each grade is available in the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">Assessment Procedure</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Interprofessional Collaborative Practice Modules (Thursday/Friday)</strong><br><p>There are three modules that consist of on-line preparation and face-to-face in class learning activities. </p>\n<p>In Module Four, you will develop knowledge and skills to identify and manage conflict in healthcare teams.</p>\n<p>In Modules Five and Six you will expand your skills to communicate assertively in your team and advocate for your client applying your interprofessional practice skills.</p>\n<p>You will work in small teams in the tutorial groups with your peers from: Dentistry, Exercise Physiology, Midwifery, Nursing, Occupational Therapy, Pharmacy, Physiotherapy, Social Work and Speech Pathology. You will work in your team to engage in a range of learning activities to develop your knowledge and skills to help prepare you for working in teams when caring for clients.</p></br></p></div></td>",
            "topic_title": "<strong>Interprofessional Collaborative Practice Modules (Thursday/Friday)</strong>",
            "topic_description": "Interprofessional Collaborative Practice Modules (Thursday/Friday) There are three modules that consist of on-line preparation and face-to-face in class learning activities. In Module Four, you will develop knowledge and skills to identify and manage conflict in healthcare teams. In Modules Five and Six you will expand your skills to communicate assertively in your team and advocate for your client applying your interprofessional practice skills. You will work in small teams in the tutorial groups with your peers from: Dentistry, Exercise Physiology, Midwifery, Nursing, Occupational Therapy, Pharmacy, Physiotherapy, Social Work and Speech Pathology. You will work in your team to engage in a range of learning activities to develop your knowledge and skills to help prepare you for working in teams when caring for clients.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 18(19 Jan - 31 May)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Clinical Practice</strong><br><p>Clinical practice attendance at your allocated clinical practice hospital. Completion of 160 hours of clinical practice is compulsory.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Clinical Practice</strong>",
            "topic_description": "Clinical Practice Clinical practice attendance at your allocated clinical practice hospital. Completion of 160 hours of clinical practice is compulsory.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 1(19 Jan - 25 Jan)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction to Course - early starters</strong><br><p>This lecture will provide students with the information to commence and complete their semester practice requirements as they work towards developing their midwifery practice and completing their midwifery practice experiences.  This session is for students starting their clinical placement before Week 1 of the semester.</p></br></p><p><strong>Learning outcomes:</strong> L03, L05</p></div></td>",
            "topic_title": "<strong>Introduction to Course - early starters</strong>",
            "topic_description": "Introduction to Course - early starters This lecture will provide students with the information to commence and complete their semester practice requirements as they work towards developing their midwifery practice and completing their midwifery practice experiences.  This session is for students starting their clinical placement before Week 1 of the semester.",
            "learning_outcomes": [
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5(16 Feb - 22 Feb)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Perineal suturing workshop</strong><br/><p>Students will learn and practice the skill of perineal suturing using innovative technologies. Students will be allocated to one workshop on the 20/2 or the 23/2. See Blackboard for further information and schedule.</p></p><p><strong>Learning outcomes:</strong> L04, L05</p></div></td>",
            "topic_title": "<strong>Perineal suturing workshop</strong>",
            "topic_description": "Perineal suturing workshop Students will learn and practice the skill of perineal suturing using innovative technologies. Students will be allocated to one workshop on the 20/2 or the 23/2. See Blackboard for further information and schedule.",
            "learning_outcomes": [
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6(23 Feb - 01 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Repeated Introduction to Course</strong><br/><p>This lecture will provide students with the information to commence and complete their semester practice requirements as they work towards developing their midwifery practice and completing their midwifery practice experiences.  See timetable for date and time. </p></p><p><strong>Learning outcomes:</strong> L03, L05</p></div></td>",
            "topic_title": "<strong>Repeated Introduction to Course</strong>",
            "topic_description": "Repeated Introduction to Course This lecture will provide students with the information to commence and complete their semester practice requirements as they work towards developing their midwifery practice and completing their midwifery practice experiences.  See timetable for date and time.",
            "learning_outcomes": [
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 7 To Week 16(02 Mar - 17 May)",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Midwifery Practice Consultation</strong><br><p>These sessions will provide additional support and activities for students to share their clinical practice experiences, work through practice issues,  to apply to their midwifery practice for future practice development.  See timetable for weeks, dates, and times.</p></br></p><p><strong>Learning outcomes:</strong> L03, L05</p></div></td>",
            "topic_title": "<strong>Midwifery Practice Consultation</strong>",
            "topic_description": "Midwifery Practice Consultation These sessions will provide additional support and activities for students to share their clinical practice experiences, work through practice issues,  to apply to their midwifery practice for future practice development.  See timetable for weeks, dates, and times.",
            "learning_outcomes": [
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13(20 Apr - 26 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Employability</strong><br/><p>Communicating your Employability - this session will assist students with writing CVs, cover letters, and selection criteria responses. </p></p><p><strong>Learning outcomes:</strong> L03, L05</p></div></td>",
            "topic_title": "<strong>Employability</strong>",
            "topic_description": "Employability Communicating your Employability - this session will assist students with writing CVs, cover letters, and selection criteria responses.",
            "learning_outcomes": [
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 17(18 May - 24 May)",
            "activity_type": "Symposium",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Graduate Programs and Employability Opportunities</strong><br/><p>This symposium invites representatives from Hospital Health Services (HHS) and key organisations to provide students with information relating to graduate opportunities and registration.  See Blackboard for further information, date and time. </p></p><p><strong>Learning outcomes:</strong> L02</p></div></td>",
            "topic_title": "<strong>Graduate Programs and Employability Opportunities</strong>",
            "topic_description": "Graduate Programs and Employability Opportunities This symposium invites representatives from Hospital Health Services (HHS) and key organisations to provide students with information relating to graduate opportunities and registration.  See Blackboard for further information, date and time.",
            "learning_outcomes": [
                "L02"
            ]
        }
    ]
}