{
    "course_title": "Clinical Midwifery Practice 3",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MIDW2103-21113-7620",
    "full_course_code": "MIDW2103-21113-7620",
    "course_code": "MIDW2103",
    "class_code": "21113",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (16/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Apply reflective practice to identify goals and self-evaluate progress in ongoing resilience and professional development, appropriately selecting and utilising healthcare evidence and feedback to ensure capability for practice in multiple settings."
        },
        {
            "number": "LO2.",
            "description": "As a novice student, act with initiative and judgement in planning, problem solving and decision making in paraprofessional practice setting, adhering to requirements defined by Nursing and Midwifery Board of Australia's Professional Standards."
        },
        {
            "number": "LO3.",
            "description": "Utilise effective communication and digital skills to make a clear and coherent presentation of knowledge and ideas with some intellectual independence."
        },
        {
            "number": "LO4.",
            "description": "Commence to effectively plan, implement and evaluate midwifery care that respects and acknowledges the values of women, individuals and their family of different cultures and backgrounds, while maintaining the principles of confidentiality."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate and consolidate effective time management, clinical reasoning and professional judgement to deliver woman centred care, that can be utilised in global environments."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Clinical Practice Preparation and Development",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> NGP </dd>",
            "due_date": "<dd><p>Assessment includes: MedSafe online test; clinical skills x 2, MPE/CoCEs in progress and AMSAT.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Activity/ Performance",
            "category": "Performance, Placement, Quiz, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment consists of four [4] parts:</p>\n<ol>\n<li>MedSafe online calculation quiz with 100% pass score, due by end of week 1 of placement.</li>\n<li>Clinical skills - To independently and competently perform <strong>skills x 2</strong>, with feedback from midwifery staff and a reflective self-evaluation of own performance, due by mid-point of placement (approx. 60hrs).</li>\n<li>Midwifery practice experiences (MPEs/CoCEs) in <strong>progress</strong> of achieving a total of <strong>40 x MPEs</strong> (including <strong>CoCEs x 2</strong>) to be verified at mid-point of placement.</li>\n<li>AMSAT due by mid-point of placement, to obtain feedback from midwifery facilitator/educator.</li>\n</ol>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit MedSafe certificate by the due date to Blackboard and complete clinical skills, and MPEs/CoCEs, AMSAT in ePAD.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": null,
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Clinical Practice Completion",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> NGP </dd>",
            "due_date": "<dd><p>Assessment includes: MPEs x 40 (inclusive of CoCEs x 2), clinical skills x 3; AMSAT and 120 hours placement completion.</p>\n<p>Completion of placement may extend beyond week 12 if appropriate.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Activity/ Performance",
            "category": "Performance, Placement, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment consists of four [4] parts. </p>\n<ol>\n<li>Clinical skills - To independently and competently perform <strong>skills x 3</strong>, with feedback from midwifery staff and a reflective self-evaluation of own performance, due by the end of placement (160hrs).</li>\n<li>Midwifery practice experiences (MPEs/CoCEs) with attainment of total of <strong>40 x MPEs (including CoCEs x 2) </strong>to be verified at end of placement.</li>\n<li>AMSAT due by end of placement, to obtain a satisfactory pass of competency in placement from midwifery facilitator/educator.</li>\n<li>Placement hours to be completed at a total of <strong>120 hours</strong>.</li>\n</ol>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>All clinical skills and MPEs must to be signed by a registered practitioner in ePAD.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": null,
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Objective Structured Clinical Examination (OSCE)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> NGP </dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>6/06/2026 - 20/06/2026</p>\n<p>\n</p><p>This practical skill exam will require the student to demonstrate theoretical knowledge, clinical confidence, and competence in demonstration of a skill chosen from the course content, in a simulated classroom environment.  The individual exam dates will be confirmed by the Course Coordinator.</p></dd>",
            "learning_objectives": "L03, L04",
            "mode": "Activity/ Performance",
            "category": "Practical/ Demonstration, Role play/ Simulation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This is a demonstration of skill competence in a simulated classroom setting, under exam conditions. Each student will be allocated a day and time slot as per the schedule on the Blackboard course site, <em>not</em> precisely when the published Examination timetable states (the published timetable shows only the earliest day/time for the OSCE).</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MIDW2103 Clinical Practice 3 Placement </strong><br><p>Clinical practice at teaching hospital/location. Placement may be integrated int the semester or in a block at the end of the semester. Details of dates &amp; times will vary depending on placement hospital. Further information can be obtained from the practice education team. Completion of all clinical practice shifts (120hrs) is compulsory.</p>\n<p><strong>Compliance Statement</strong></p>\n<p>It is expected that students have successfully completed all requirements for this course. Students are responsible for meeting all pre-placement mandatory requirements before the start of Semester 1 (21/2/2025). Failure to comply with these requirements will result in no clinical placement allocation. Students who receive written notification of failure to comply with pre-placement and mandatory requirements will be required to address these by the end of week 3 of semester 1. If students do not meet the final compliance deadlines by the end of week 3, they will no longer be eligible to undertaken clinical placement and no further clinical placement allocation will occur. In these instances students are advised to withdraw from the course before the census date.</p>\n<p><strong>Unsafe practice during clinical placement: </strong></p>\n<p>A decision of unsafe clinical performance is made when a student's performance places a woman/person/family, staff members, themselves, or fellow students at risk. If students practice in a way that is deemed unsafe or breaches the relevant scope of practice during their clinical placement they will be asked to leave the placement and a meet with the Course Coordinator and Program Lead.</p>\n<p><strong>Professional manner during clinical placement:</strong></p>\n<p>Students must always conduct themselves professionally during professional placement. Unprofessional behaviour may lead to a learning support plan, immediate removal from the clinical placement, or termination of the placement. This could result in non-academic misconduct and a failing grade in the associated subject.</p>\n<p><strong>Scope of Practice</strong></p>\n<p>Students must adhere to the course Scope of Practice at all times while on clinical placement. This requirement addresses the skills appropriate to perform safely and students will be removed from placement or risk failing the course if working outside their scope. Please refer to the guidelines in the Nursing &amp; Midwifery Practice Education (Clinical Placements) Blackboard site (<a href=\"https://learn.uq.edu.au/ultra/organizations/_191449_1/cl/outline\">HABS0836</a>).</p>\n<p><strong>Social Media</strong></p>\n<p>Students are prohibited from posting any images of patients, clinical venues, or clinical documentation on social media. Students should also refrain from making comments related to clinical placement, UQ, or clinical venues that may violate University or institutional policies or guidelines or bring UQ into disrepute. Failure to comply with this policy will result in removal of the student(s) from placement, and/or a failing grade for this course.</p>\n<p>See guidelines section below for links to appropriate documents.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>MIDW2103 Clinical Practice 3 Placement </strong>",
            "topic_description": "MIDW2103 Clinical Practice 3 Placement Clinical practice at teaching hospital/location. Placement may be integrated int the semester or in a block at the end of the semester. Details of dates & times will vary depending on placement hospital. Further information can be obtained from the practice education team. Completion of all clinical practice shifts (120hrs) is compulsory. Compliance Statement It is expected that students have successfully completed all requirements for this course. Students are responsible for meeting all pre-placement mandatory requirements before the start of Semester 1 (21/2/2025). Failure to comply with these requirements will result in no clinical placement allocation. Students who receive written notification of failure to comply with pre-placement and mandatory requirements will be required to address these by the end of week 3 of semester 1. If students do not meet the final compliance deadlines by the end of week 3, they will no longer be eligible to undertaken clinical placement and no further clinical placement allocation will occur. In these instances students are advised to withdraw from the course before the census date. Unsafe practice during clinical placement: A decision of unsafe clinical performance is made when a student's performance places a woman/person/family, staff members, themselves, or fellow students at risk. If students practice in a way that is deemed unsafe or breaches the relevant scope of practice during their clinical placement they will be asked to leave the placement and a meet with the Course Coordinator and Program Lead. Professional manner during clinical placement: Students must always conduct themselves professionally during professional placement. Unprofessional behaviour may lead to a learning support plan, immediate removal from the clinical placement, or termination of the placement. This could result in non-academic misconduct and a failing grade in the associated subject. Scope of Practice Students must adhere to the course Scope of Practice at all times while on clinical placement. This requirement addresses the skills appropriate to perform safely and students will be removed from placement or risk failing the course if working outside their scope. Please refer to the guidelines in the Nursing & Midwifery Practice Education (Clinical Placements) Blackboard site ( HABS0836 ). Social Media Students are prohibited from posting any images of patients, clinical venues, or clinical documentation on social media. Students should also refrain from making comments related to clinical placement, UQ, or clinical venues that may violate University or institutional policies or guidelines or bring UQ into disrepute. Failure to comply with this policy will result in removal of the student(s) from placement, and/or a failing grade for this course. See guidelines section below for links to appropriate documents.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introductory Lecture</strong><br><p>This lecture will identification the specific clinical practice requirements of the course, including Midwifery Practice Experiences (MPE), with Continuity of Care (CoCE) for this semester. All associated assessments will be discussed, including MedSafe and the OSCE. </p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L05</p></div></td>",
            "topic_title": "<strong>Introductory Lecture</strong>",
            "topic_description": "Introductory Lecture This lecture will identification the specific clinical practice requirements of the course, including Midwifery Practice Experiences (MPE), with Continuity of Care (CoCE) for this semester. All associated assessments will be discussed, including MedSafe and the OSCE.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L05"
            ]
        },
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MyProgress ePAD Lecture with Intro lecture</strong><br/><p>Update on the ePortfolio platform Myprogress ePAD which will be used to record all MPEs and CoCEs completed throughout the semester and program. Attendance is essential to successfully navigate ePAD.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>MyProgress ePAD Lecture with Intro lecture</strong>",
            "topic_description": "MyProgress ePAD Lecture with Intro lecture Update on the ePortfolio platform Myprogress ePAD which will be used to record all MPEs and CoCEs completed throughout the semester and program. Attendance is essential to successfully navigate ePAD.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 12(02 Mar - 24 May)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Clinical Based Learning (CBL classes and online modules)</strong><br><p>CBL (Case-Based Learning) classes are held on alternate weeks 2; 4; 6; 8; 10; 12 and allow for the development of clinical skills and evidence-based practice in a simulated learning environment.</p>\n<p>· Preparation for each session is required so students understand the clinical theory and principles that support the practical components of clinical practice. Prior to attending CBL, students must complete the assigned readings, engage in course learning activities, including self-directed modules, and reflect on clinical practice.</p>\n<p>· Each session is structured to support student learning and master the clinical skills required to provide care in the clinical settings. Students must actively participate in skills practice, discussions, and identification of learning needs while receiving feedback from CBL Lecturers and peers.</p>\n<p>· Attendance is mandatory for all CBL sessions. </p>\n<p><strong>Absenteeism from CBL</strong></p>\n<p>Students who miss CBL sessions due to exceptional circumstances, may be unable to achieve the required scope of practice, resulting in a fail grade. In the event of multiple absences from CBL classes, missing 20% or more of CBL sessions (2 or more CBLs), will result in the inability to meet the course objectives and the safe scope of practice required for clinical placement. Such students will receive a failing grade for the course. We strongly encourage students enrolling in this course to consider their ability to meet the requirements. If unable to do so, it is advisable to seek academic advice and consider withdrawing from the course before the census date. Students who miss a CBL session must notify the Course Coordinator as soon as possible. Students must follow-up by emailing a completed Absenteeism Form (available on the course Blackboard site) and supporting evidence, i.e. medical certificate / statutory declaration, within 48 hours of the missed CBL class. Please refer to my.UQ for a list of the acceptable reasons for absence from class.</p>\n<p><strong>Makeup for absence from CBL</strong></p>\n<p>Absence from a CBL session will require the student to attend a makeup CBL session. Upon receipt of the appropriate documentation you will be notified by the Course Coordinator of a time and location for your make-up CBL. Tardiness will require an explanation.</p>\n<p><strong>Uniform</strong></p>\n<p>Students are required to adhere to UQ NMSW nursing/midwifery uniform requirements when attending CBLs. Students do not meet the uniform policy requirements will not be permitted to attend a class and will marked as absent. </p></br></p><p><strong>Learning outcomes:</strong> L02, L04, L05</p></div></td>",
            "topic_title": "<strong>Clinical Based Learning (CBL classes and online modules)</strong>",
            "topic_description": "Clinical Based Learning (CBL classes and online modules) CBL (Case-Based Learning) classes are held on alternate weeks 2; 4; 6; 8; 10; 12 and allow for the development of clinical skills and evidence-based practice in a simulated learning environment. · Preparation for each session is required so students understand the clinical theory and principles that support the practical components of clinical practice. Prior to attending CBL, students must complete the assigned readings, engage in course learning activities, including self-directed modules, and reflect on clinical practice. · Each session is structured to support student learning and master the clinical skills required to provide care in the clinical settings. Students must actively participate in skills practice, discussions, and identification of learning needs while receiving feedback from CBL Lecturers and peers. · Attendance is mandatory for all CBL sessions. Absenteeism from CBL Students who miss CBL sessions due to exceptional circumstances, may be unable to achieve the required scope of practice, resulting in a fail grade. In the event of multiple absences from CBL classes, missing 20% or more of CBL sessions (2 or more CBLs), will result in the inability to meet the course objectives and the safe scope of practice required for clinical placement. Such students will receive a failing grade for the course. We strongly encourage students enrolling in this course to consider their ability to meet the requirements. If unable to do so, it is advisable to seek academic advice and consider withdrawing from the course before the census date. Students who miss a CBL session must notify the Course Coordinator as soon as possible. Students must follow-up by emailing a completed Absenteeism Form (available on the course Blackboard site) and supporting evidence, i.e. medical certificate / statutory declaration, within 48 hours of the missed CBL class. Please refer to my.UQ for a list of the acceptable reasons for absence from class. Makeup for absence from CBL Absence from a CBL session will require the student to attend a makeup CBL session. Upon receipt of the appropriate documentation you will be notified by the Course Coordinator of a time and location for your make-up CBL. Tardiness will require an explanation. Uniform Students are required to adhere to UQ NMSW nursing/midwifery uniform requirements when attending CBLs. Students do not meet the uniform policy requirements will not be permitted to attend a class and will marked as absent.",
            "learning_outcomes": [
                "L02",
                "L04",
                "L05"
            ]
        }
    ]
}