{
    "course_title": "QUM Research Focussed Placement",
    "study_period": "Sem 1 2026",
    "location": "Dutton Park",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/PHRM4071-21170-7620",
    "full_course_code": "PHRM4071-21170-7620",
    "course_code": "PHRM4071",
    "class_code": "21170",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (26/01/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Apply the ideals and principles of Quality Use of Medicines (QUM) to contribute to health outcomes."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate reflective practice, professional competence, interpersonal skills, and expertise; including the development of learning plans for experiential placements."
        },
        {
            "number": "LO3.",
            "description": "Develop and conduct a QUM research project that relates to the needs of the placement site."
        },
        {
            "number": "LO4.",
            "description": "Demonstrate written and oral professional communication skills."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Ethics and Project Approval Application",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 20/02/2026 5:00 pm</p>\n<p>\n</p><p>Submission will be available from the commencement of the placement period.</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Permission to conduct a QUM Research Project must be sought by application to the School of Pharmacy and Pharmaceutical Sciences using the <strong>QUM Ethics and Project Outline form</strong> available on Learn.UQ under <strong>Assessment - QUM Ethics and Project Approval</strong>.</p>\n<p>If approval from a Human Research Ethics Committee is required, this is to be obtained by the placement site; however, approval to commence the project is granted by the PHRM4071 Course Coordinator and this project approval is a compulsory component of the research project placement. The application must be submitted as soon as possible after commencement of the placement, and <strong>at the latest, prior to the end of Week 2 of the placement period. </strong></p>\n<p><strong>The research project cannot commence until the Course Coordinator indicates approval on the PHRM4071 Learn.UQ site. If no approval is indicated, then the project cannot commence and marks for the project approval, report, and presentation will be zero. Data collection can only begin AFTER the project has received approval from the School.</strong> </p>\n<p>The marking criteria/rubric for this assessment task is available on Learn.UQ.</p>\n<p><em>This task has been designed to be challenging, authentic and complex. Successful completion of the assessment will require students to critically engage in specific contexts and tasks for which AI will provide only limited support and guidance. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI tools.</em> </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The QUM Ethics and Project Outline form is to be submitted in Blackboard via the QUM Ethics &amp; Project Approval folder in the Assessment section of the menu bar.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Placement Participation, Entrustable Professional Activities (EPA) Reflection and Individual Learning Plan (ILP)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail  </dd>",
            "due_date": "<dd><p> 27/03/2026 5:00 pm</p>\n<p>\n</p><p>Other placement timeframes must be approved by the Course Coordinator.</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance, Written",
            "category": "Participation/ Student contribution, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This is a 6-week QUM research-focussed placement course.</p>\n<ul>\n<li>Each student should attend their QUM Research placement for 6 consecutive weeks, 4 days per week and gain at least 180 hours of workplace contact, commencing two weeks prior to Week 1 of Semester and concluding at the end of Week 4 of Semester.</li>\n<li>Each student must contact their placement Preceptor TWO weeks prior to the start of the placement to confirm their attendance for the placement period and to make arrangements for meeting on the first day. If you have contacted the site and do not receive a reply, please contact the Course Coordinator for advice.</li>\n<li>The start and finish times for each placement day will depend on the workplace and collegiate negotiations. If the placement includes a public holiday relevant to that placement site, the students are expected to attend/not attend the placement site in accordance with usual practice at that site e.g. if the facility is not open during the public holiday, then students do not attend AND that time is included within the 180 hours.</li>\n<li>Any attendance problems or placement absences are to be discussed with the Course Coordinator PRIOR to any planned absences or as soon as possible in the case of prolonged absence (&gt; 3 days). </li>\n<li>In the case of illness, students are NOT expected to attend their placement and should inform their preceptor. Absences should be recorded in InPlace within 24 hours of your absence (<a href=\"https://uq.pressbooks.pub/bachelor-pharmacy-placement-handbook/chapter/record-an-absence-in-inplace/\">instructions here</a>). Students away from their placement site for greater than TWO days due to illness (i.e. on the third day) should obtain a medical certificate and provide this to the School and their preceptor. </li>\n<li>Irrespective of medical certificates, any cumulative absence over the 6-week period longer than 3 days must be immediately brought to the attention of the Course Coordinator.</li>\n<li>With the permission of the workplace and preceptor, students may be allowed to have library days away from the placement site; however, a maximum of 2 library days per placement are allowed and these days must be spent on quality project activities (not at another workplace). There is no requirement that a library day will be granted by the workplace - some sites will not allow this time away. Students are expected to be at the placement site a minimum of four days per week unless the absence has the approval of the site and the Course Coordinator.</li>\n</ul>\n<p><br/></p>\n<h4>Entrustable Professional Activities (EPAs)</h4>\n<p>During the placement experience, students will have the opportunity to undertake or be involved in a range of different activities (in addition to their QUM research project) to help facilitate their learning and build their clinical and professional skills. </p>\n<p>To help further facilitate more structured and specific feedback during the placement, students are required to undertake a minimum of <strong>TWO</strong> Entrustable Professional Activities (EPAs) that are relevant to the placement site and the student’s individual learning goals. Students can choose 2 relevant EPAs from the following list:</p>\n<ul>\n<li>Best Possible Medication History</li>\n<li>Medication Chart Review</li>\n<li>Patient Education</li>\n<li>Resolving a Medication Related Problem</li>\n<li>Assessment of Inhaler Technique and Counselling</li>\n<li>Oral Anticoagulant Education</li>\n<li>Teamwork and Collaboration</li>\n<li>Data Collection and Management</li>\n</ul>\n<p>Students are required to submit a <strong>statement of justification</strong> for their choice of EPAs with their EPA self-assessment via the ePortfolio. This should just be a short paragraph to provide an explanation of why you have chosen the particular EPAs and why they are relevant to your learning.</p>\n<p><strong>Students who are at non-clinical or non-patient facing sites can undertake the 'Teamwork and Collaboration' and 'Data Collection and Management' EPAs.</strong></p>\n<p><strong>Students who attend their placements at Queensland Health facilities may choose to use the QH EPAs where available or appropriate. This should be under the discretion of the placement preceptor. The QH EPA templates can be accessed under the Entrustable Professional Activities contents tab.</strong></p>\n<h4>Student Self-Assessment (for submission to PRECEPTOR)</h4>\n<p>Towards the end of the placement period, students will take time to reflect on their own performance during the specific EPAs they have chosen to undertake and complete a Student Self-Assessment for each EPA via the ePortfolio. Clear and simple submission instructions are available on the ePortfolio - please read and follow these instructions carefully for submission of the Student Self-Assessment for EACH EPA undertaken. Submission of the Student Self-Assessment for each EPA via the ePortfolio to the student's preceptor will trigger an email link to be sent to the preceptor, allowing the preceptor to complete the final entrustment level for each EPA and provide any relevant feedback. </p>\n<p>Students should arrange a time to meet with their preceptor at the end of the placement period for a formal feedback session, to discuss their own self-assessment and the preceptor's feedback. During the session, the preceptor will complete the final entrustment level for each of the EPAs undertaken by the student and provide specific and relevant feedback to the student on their performance, focusing on key areas the student is performing well and key areas that require further development. The student and preceptor should also discuss 2-3 specific actions for the student's future development. </p>\n<h4>Student Reflection and Individual Learning Plan (ILP) - for Submission to Course Coordinator (Jane Lee)</h4>\n<p>After the placement period is complete, students are required to complete their Reflection and Individual Learning Plan (ILP) for submission via ePortfolio, based on the feedback they have received from their preceptor or other colleagues at the placement site, the entrustment levels assigned for each EPA undertaken and the action plan discussed during the final feedback session with the preceptor. </p>\n<h5>Student Reflection</h5>\n<p>This should be uploaded as a WORD.doc file in ePortfolio. The maximum word count for the student reflection is 500 words. Students can use the SEAL reflection method if they wish, but can also follow a more generalised structure to reflect on their overall experience in undertaking the chosen EPAs during their placement. It is important for students to focus on their learnings, linking actions to their future development. Students can include references or attachments where necessary/appropriate to support their reflection. Further information on reflection can be found on this useful link: <a href=\"https://reflection.ed.ac.uk/reflectors-toolkit\">https://reflection.ed.ac.uk/reflectors-toolkit</a>. </p>\n<h5>Individual Learning Plan (ILP)</h5>\n<p>The ePortfolio provides clear instructions and a template for students to complete their ILP based on their performance in undertaking the EPAs and feedback from their preceptor during their placement. Students should complete each of the relevant boxes in the template prior to submission. </p>\n<p>The final Reflection and ILP should be submitted via the ePortfolio by<strong> 5pm Friday 27th March 2026.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission: </strong>The EPA self-reflection and the ILP should be completed via ePortfolio. Once the student has submitted the EPA <strong>self-reflection</strong>, this will trigger an email to be sent to the preceptor with a link to complete the student's final EPA assessment via ePortfolio.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of FAIL if this assessment is submitted late without an approved extension.</p>",
            "additional_info": "<p>This should be uploaded as a WORD.doc file in ePortfolio. The maximum word count for the student reflection is 500 words. Students can use the SEAL reflection method if they wish, but can also follow a more generalised structure to reflect on their overall experience in undertaking the chosen EPAs during their placement. It is important for students to focus on their learnings, linking actions to their future development. Students can include references or attachments where necessary/appropriate to support their reflection. Further information on reflection can be found on this useful link: <a href=\"https://reflection.ed.ac.uk/reflectors-toolkit\">https://reflection.ed.ac.uk/reflectors-toolkit</a>. </p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Final QUM Research Project Written Report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>45%</dd>",
            "due_date": "<dd><p> 13/04/2026 5:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The <strong>QUM Research Project written report</strong> should be submitted in the format of a JOURNAL ARTICLE, structured to promote clarity and ease of reading. QUM Research Projects may be quantitative or qualitative in nature, and students are encouraged to read widely around the published literature relevant to their project, and format their journal article in a style consistent with published work in their field. </p>\n<p>The report should be a maximum of 2000 words and students should <strong>follow the report structure outlined on the course Learn.UQ (Blackboard) site</strong>. The marking criteria/rubric for this assessment task is available on the course Learn.UQ (Blackboard) site.</p>\n<p><em>This task has been designed to be challenging, authentic and complex. Successful completion of the assessment will require students to critically engage in specific contexts and tasks for which generative AI will provide only limited support and guidance. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI tools. </em> </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission is via Turnitin at the link for Project Reports in Learn.UQ in the Assessment folder.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "QUM Research Project Digital Poster Presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>35%</dd>",
            "due_date": "<dd><p> 5/05/2026 5:00 pm</p>\n<p>\n</p><p><strong>Digital poster upload: </strong>05/05/26</p>\n<p><strong>Poster presentation: </strong>during the PHRM4071 Tutorials in Weeks 10-13 of Semester. Schedule will be posted on the Learn.UQ course site by Week 9 of Semester.</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Digital Poster Oral Presentations will take place during the designated PHRM4071 tutorial times during Weeks 10 - 13 of Semester. Students are required to sign on a tutorial session or else they will be allocated to a session by the HMBS Timetabling Team. The timetable for tutorial attendance and presentations will be available on the Learn.UQ course site prior to the end of Week 9 of Semester. </p>\n<p><strong>All digital posters should be uploaded to the Learn.UQ site by Tuesday 5th May, 2026, regardless of the student's presentation date.</strong></p>\n<p>Students will be required to design and create a two-slide Digital Poster which will be presented in a 5-minute oral presentation + ~2 minutes questions. Students are encouraged to present their projects creatively and consider the key points of information they wish to present. <strong>Further instructions for poster slides and guidelines for the oral presentation are available on the course Learn.UQ (Blackboard) site.</strong></p>\n<p>You are required to sign an attendance record at your designated tutorial and absences will require a medical certificate or prior approval by the Course Coordinator. </p>\n<p>The Digital Poster Oral Presentation will be recorded and retained as per university policy. The recording will be stored in a secure manner and will only be accessed if required for the purposes of moderation of marking; provision of feedback to the student; and/or re-marking following a successful re-mark application.</p>\n<p>The marking criteria/rubric for this assessment task is available on Learn.UQ.</p>\n<p><em>This task has been designed to be challenging, authentic and complex. Successful completion of the assessment will require students to critically engage in specific contexts and tasks for which generative AI will provide only limited support and guidance. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI tools.</em> </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Digital posters should be uploaded as a<strong> PDF file </strong>at Learn.UQ under the Assessment folder (Digital Poster Submission). </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Not scheduled",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Online Module - Introduction to Pharmacy Research </strong><br><p>The online module will cover pharmacy research basics, including performing a literature review, developing research questions/methods and research writing. Please ensure you complete this online module prior to commencing your placement. It should take approximately 45 minutes to 1 hour.</p>\n<p>The link to complete the H5P module is available in the contents of the course Learn.UQ (Blackboard) site under <strong>Course Resources</strong>.</p></br></p></div></td>",
            "topic_title": "<strong>Online Module - Introduction to Pharmacy Research </strong>",
            "topic_description": "Online Module - Introduction to Pharmacy Research The online module will cover pharmacy research basics, including performing a literature review, developing research questions/methods and research writing. Please ensure you complete this online module prior to commencing your placement. It should take approximately 45 minutes to 1 hour. The link to complete the H5P module is available in the contents of the course Learn.UQ (Blackboard) site under Course Resources .",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 1(26 Jan - 01 Feb)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Online Introductory Lecture</strong><br><p>The Course Coordinator will provide a course introduction and an overview of placement and assessment expectations. The online lecture will be held approximately two weeks before placements commence. See Blackboard announcements for the Zoom link.</p>\n<p>The lecture will be held on <strong>Wednesday 28th January 9am</strong> (Zoom link on PHRM4071 Blackboard page).</p></br></p></div></td>",
            "topic_title": "<strong>Online Introductory Lecture</strong>",
            "topic_description": "Online Introductory Lecture The Course Coordinator will provide a course introduction and an overview of placement and assessment expectations. The online lecture will be held approximately two weeks before placements commence. See Blackboard announcements for the Zoom link. The lecture will be held on Wednesday 28th January 9am (Zoom link on PHRM4071 Blackboard page).",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 3 To Week 8(09 Feb - 22 Mar)",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>QUM Research Project-focussed Placement</strong><br><p>A supervised placement in an experiential placement site that promotes the ideals and principles of Quality Use of Medicines (QUM). </p>\n<p>The timeframe = at least 180 hours over 6 weeks, 4 days per week, commencing 2 weeks prior to Week 1 of the semester. </p>\n<p>Any change to this timeframe must be discussed with the Course Coordinator and approved prior to the placement. </p>\n<p>The student must contact the Preceptor for their placement at least 2 weeks prior to the start of the placement. </p>\n<p>During the experiential placement, students choose to participate in a minimum of TWO EPAs from a suite of EPAs provided, based on the context of their placement.</p>\n<p>These may be done as a one-off or there may be multiple opportunities to conduct these activities under observation by the preceptor. </p></br></p></div></td>",
            "topic_title": "<strong>QUM Research Project-focussed Placement</strong>",
            "topic_description": "QUM Research Project-focussed Placement A supervised placement in an experiential placement site that promotes the ideals and principles of Quality Use of Medicines (QUM). The timeframe = at least 180 hours over 6 weeks, 4 days per week, commencing 2 weeks prior to Week 1 of the semester. Any change to this timeframe must be discussed with the Course Coordinator and approved prior to the placement. The student must contact the Preceptor for their placement at least 2 weeks prior to the start of the placement. During the experiential placement, students choose to participate in a minimum of TWO EPAs from a suite of EPAs provided, based on the context of their placement. These may be done as a one-off or there may be multiple opportunities to conduct these activities under observation by the preceptor.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 14 To Week 17(04 May - 31 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Digital Poster Oral Presentation Tutorials</strong><br><p>Presentation Tutorial: Students will be required to prepare and present a two-slide Digital Poster that summarises the findings from their QUM project (5 minutes speaking time + ~2 minutes questions). Presentation timetables will be listed on Learn.UQ prior to scheduled tutorials. </p>\n<p>*All Digital Posters to be uploaded onto Learn.UQ by the date specified on Learn.UQ regardless of presentation date/time. </p>\n<ul>\n<li>Tutorials will be scheduled on <strong>Wednesday 6th May, Wednesday 13th May, Wednesday 20th and Wednesday 27th May 2026.</strong> </li>\n<li>There will be a morning session from <strong>9am - 12noon</strong>, and an afternoon session from <strong>1pm - 4pm</strong> scheduled each week. </li>\n<li>Please check the allocations on the timetable carefully to ensure you attend your allocated session.</li>\n<li>Students are welcome and encouraged to attend other sessions to support their peers.</li>\n</ul></br></p></div></td>",
            "topic_title": "<strong>Digital Poster Oral Presentation Tutorials</strong>",
            "topic_description": "Digital Poster Oral Presentation Tutorials Presentation Tutorial: Students will be required to prepare and present a two-slide Digital Poster that summarises the findings from their QUM project (5 minutes speaking time + ~2 minutes questions). Presentation timetables will be listed on Learn.UQ prior to scheduled tutorials. *All Digital Posters to be uploaded onto Learn.UQ by the date specified on Learn.UQ regardless of presentation date/time. Tutorials will be scheduled on Wednesday 6th May, Wednesday 13th May, Wednesday 20th and Wednesday 27th May 2026. There will be a morning session from 9am - 12noon , and an afternoon session from 1pm - 4pm scheduled each week. Please check the allocations on the timetable carefully to ensure you attend your allocated session. Students are welcome and encouraged to attend other sessions to support their peers.",
            "learning_outcomes": []
        }
    ]
}