{
    "course_title": "Policy Design and Implementation",
    "study_period": "Sem 1 2026",
    "location": "External",
    "attendance": "Online",
    "url": "https://course-profiles.uq.edu.au/course-profiles/POLS7116-20194-7620",
    "full_course_code": "POLS7116-20194-7620",
    "course_code": "POLS7116",
    "class_code": "20194",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Identify key design and implementation challenges facing contemporary governments and policy actors."
        },
        {
            "number": "LO2.",
            "description": "Explain theories of policy design and implementation and apply them to scenarios across multiple policy areas."
        },
        {
            "number": "LO3.",
            "description": "Critically evaluate policy processes and identify causes of implementation success and failure."
        },
        {
            "number": "LO4.",
            "description": "Formulate and communicate realistic plans for policy implementation, paying attention to political conditions and state capacity."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "5 x policy reflections",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p>Submissions are due either at the completion of class (Option 1) or 7 days after the seminar (Option 2).  2/03/2026 - 25/05/2026</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>In preparation for <strong>five </strong>of the twelve course seminars, students are to find a document, report, media article or other source of evidence that is relevant to their chosen policy for the Implementation Plan assignment.</p>\n<p>Following the seminar, students will complete a short reflection, discussing a) the relevance of their chosen document or article to the ideas and themes discussed in the preceding seminar and b) the key points they have learned from preparation for and participation in the seminar.</p>\n<p>For instance, in the week on 'Managing Partners and Contracts' (Week 9), students may identify a media article that describes a failure by a private company delivering health services on behalf of government. A good response might draw links between discussion of risks of contracting in the seminar and some specific aspects of the case.</p>\n<p><strong>Option 1: For students attending the live classes via Zoom</strong></p>\n<p>You will have 15 minutes to complete your reflection following the seminar. Each reflection is worth <strong>4 marks</strong>.</p>\n<p><strong>Option 2: For students watching seminar recordings in their own time</strong></p>\n<p>Part A (10 marks)</p>\n<p>Reflections will be due one week following the conclusion of the relevant seminar. Each reflection is worth 2 marks. A total of five reflections need to be completed across the semester (if you complete more than five, the best five will be graded). Reflections should be approximately 200 words in length.</p>\n<p>Part B (10 marks):</p>\n<p>You will also be required to schedule a short meeting (not more than 10 minutes) with the course coordinator to discuss your submissions. The coordinator will ask you questions based on three of the five submissions. Your responses should demonstrate knowledge of the chosen week's material and its relationship to your chosen case study. The meeting will be held online and recorded for the purposes of appeal.</p>\n<p><strong>Use of Artificial Intelligence: </strong>Students completing Option 1 will not be able to use Artificial Intelligence (AI) and/or Machine Translation (MT) technologies as part of their in-class response. However, they may use such tools as part of their preparation for the seminar. Students completion Option 2 may use AI/MT tools, as part of their written submissions, but not during the meeting with the course coordinator. Any usage of AI tools should be clearly acknowledged at the conclusion of the written reflection. Note that even where students may use AI/MT tools, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments for this course will be submitted electronically via Blackboard and using <em>Turnitin</em>.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Stakeholder engagement",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40% (preparation &amp; participation - 20%; engagement report – 1500 words, 20%) </dd>",
            "due_date": "<dd><p> 16/04/2026 5:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance, Written",
            "category": "Participation/ Student contribution, Role play/ Simulation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>In our Week 6 class time, we will be holding mock stakeholder engagement exercises based around a real world policy challenge (to be chosen in early classes). Students will be allocated into groups, with each student representing a type of stakeholder (e.g. key interest groups, impacted citizens).</p>\n<p><strong>Note that (online) attendance in Week 6 is strongly encouraged (week beginning 30 March).</strong> However, if you are unable to attend class, an alternative form of participation will be arranged with the course coordinator.</p>\n<p>There will be two assessable components of this exercise:</p>\n<p>1) Preparation and participation (20%)</p>\n<ul>\n<li>Each group will be required to hold a short meeting prior to the class to discuss their approach to the policy problem and to ensure that they collectively represent diverse perspectives. This meeting should be recorded via Zoom, with a link provided to the course coordinator for review.</li>\n<li>Each student's participation in the stakeholder engagement exercise will be evaluated relative to criteria provided on the course Blackboard. This includes a short survey to be completed at end of the class.</li>\n</ul>\n<p>2) Engagement report (20%) - 1500 words</p>\n<ul>\n<li>Based on the discussions had during the engagement exercise, as well as the responses to the survey completed at the end of the class, students are required to produce a report intended to inform government policy design and implementation.</li>\n</ul>\n<p>You may use Artificial Intelligence tools (AI) in preparing for and completing the written component of this assignment – specifically Microsoft Copilot. You will not be able to use such tools during the in-class engagement exercise, as this will be conducted without access to devices. In addition, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. You will need to provide a statement outlining your usage of AI tools as part of your final submission. A failure to reference generative AI use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>Further information on the stakeholder exercise, allocated roles and requirements for the engagement report will all be provided via the course Blackboard.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments for this course will be submitted electronically via Blackboard and using <em>Turnitin</em>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Implementation plan",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40% (2200 words + Program Logic Model + response to feedback) </dd>",
            "due_date": "<dd><p> 21/05/2026 5:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Poster",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Addressing the same policy issue focused on in the Policy Reflections, your task is to develop a detailed implementation plan for your chosen policy intervention. This plan should address: key instruments, timing of actions, roles of actors and organisations, required resources, risk mitigation strategies and proposed evaluation methods.</p>\n<p>The Plan will also include a Program Logic Model, which will outline the your understanding of the problem, key objectives and actions. A template will be provided for you to complete this aspect of the assignment. </p>\n<ul>\n<li><strong>Important</strong>: you will be required to present your Logic Model to a classmate in Week 9, who will offer verbal feedback on your proposal. You should also send it to your course coordinator via email for review prior to the Week 9 class. You will then include a brief covering letter to your report (no more than one page) describing how you responded to the feedback received. To receive marks for this section of the assignment, you must present your Logic Model in Week 9. If you are unable to make it to class in Week 9 for a valid reason (e.g. due to illness), an alternative can be arranged with the course coordinator. </li>\n</ul>\n<p>A more detailed outline of the required structure and assessment criteria will be provided via the course Blackboard.</p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p><strong>Oral hurdle</strong></p>\n<p>The implementation plan is accompanied by a pass/fail hurdle to ensure that the learning objectives have been achieved. Following submission, students will discuss their assignment with the course coordinators (usually for no more than 10 minutes). These will occur during Week 13 of the course.</p>\n<p>The oral response will be recorded for purposes of appeal. The oral response forms no part of the grade or marking process.</p>\n<p>If the marker is satisfied that the learning objectives have been met, then the essay will be marked.</p>\n<p>If the marker is not satisfied, then student receives a fail for the task, and an overall grade of 3 (marginal fail) or less for the course. Students who receive an overall grade of 3 in the Course are eligible to apply for a supplementary assessment (see <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">Assessment Procedure</a>– Section 3 Part J).</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments for this course will be submitted electronically via Blackboard and using <em>Turnitin</em>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Public governance and human-centred design</strong><br><p>In Week 1, we introduce cutting-edge perspectives on the design of public policies and question whether 'design thinking' approaches from other disciples (e.g. urban design and software development) can be translated to public governance and service delivery. </p></br></p></div></td>",
            "topic_title": "<strong>Public governance and human-centred design</strong>",
            "topic_description": "Public governance and human-centred design In Week 1, we introduce cutting-edge perspectives on the design of public policies and question whether 'design thinking' approaches from other disciples (e.g. urban design and software development) can be translated to public governance and service delivery.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(02 Mar - 08 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Service delivery and shaping behaviour </strong><br/><p>We assess some of the key challenges facing policy designers, specifically in a) delivering effective services and b) accounting for and shaping citizen behaviour. For example, to what extent, and in which domains, should citizens be able to exercise 'choice'? Under which circumstances might state coercion be appropriate, or even necessary? And how might public service delivery impact on citizen trust?</p></p></div></td>",
            "topic_title": "<strong>Service delivery and shaping behaviour </strong>",
            "topic_description": "Service delivery and shaping behaviour We assess some of the key challenges facing policy designers, specifically in a) delivering effective services and b) accounting for and shaping citizen behaviour. For example, to what extent, and in which domains, should citizens be able to exercise 'choice'? Under which circumstances might state coercion be appropriate, or even necessary? And how might public service delivery impact on citizen trust?",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Citizens and stakeholder engagement</strong><br/><p>In Week 3, we turn to the participatory dimensions of design and implementation. This week, we will investigate the most common and less-intensive forms of community and stakeholder engagement. We will also begin our preparations for the stakeholder engagement exercise and assessment in Week 6.</p></p></div></td>",
            "topic_title": "<strong>Citizens and stakeholder engagement</strong>",
            "topic_description": "Citizens and stakeholder engagement In Week 3, we turn to the participatory dimensions of design and implementation. This week, we will investigate the most common and less-intensive forms of community and stakeholder engagement. We will also begin our preparations for the stakeholder engagement exercise and assessment in Week 6.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Collaboration and co-design</strong><br/><p>While the methods of engagement discussed in Week 3 are useful, for citizens and communities, engagement can often feel cursory. For this reason, recent years have seen increasing attention and excitement around deeper forms of participation and collaboration, like \"co-design\". In Week 4, we consider the benefits and challenges of these methods, and discuss where, when and how they might to improve policymaking and generate support and legitimacy among key groups.</p></p></div></td>",
            "topic_title": "<strong>Collaboration and co-design</strong>",
            "topic_description": "Collaboration and co-design While the methods of engagement discussed in Week 3 are useful, for citizens and communities, engagement can often feel cursory. For this reason, recent years have seen increasing attention and excitement around deeper forms of participation and collaboration, like \"co-design\". In Week 4, we consider the benefits and challenges of these methods, and discuss where, when and how they might to improve policymaking and generate support and legitimacy among key groups.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Instruments, capacities and designing for effectiveness</strong><br/><p>Government have a range of tools at their disposal, including financial resources, organisations, information campaigns and various forms of punishment. This week, we look at the promises and pitfalls of these tools and discuss how policy designers should go about ensuring that policies are operationally feasible, effective and politically supported. </p></p></div></td>",
            "topic_title": "<strong>Instruments, capacities and designing for effectiveness</strong>",
            "topic_description": "Instruments, capacities and designing for effectiveness Government have a range of tools at their disposal, including financial resources, organisations, information campaigns and various forms of punishment. This week, we look at the promises and pitfalls of these tools and discuss how policy designers should go about ensuring that policies are operationally feasible, effective and politically supported.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Stakeholder engagement exercise</strong><br/><p>Week 6 is dedicated to a stakeholder engagement exercise. Students will take on the roles of various stakeholders impacted by a real-world policy and work together to voice concerns and develop solutions. The discussion and related submissions will form the basis of on our key assessments.</p></p></div></td>",
            "topic_title": "<strong>Stakeholder engagement exercise</strong>",
            "topic_description": "Stakeholder engagement exercise Week 6 is dedicated to a stakeholder engagement exercise. Students will take on the roles of various stakeholders impacted by a real-world policy and work together to voice concerns and develop solutions. The discussion and related submissions will form the basis of on our key assessments.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid-sem break(06 Apr - 12 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>SEMESTER BREAK</strong><br/></p></div></td>",
            "topic_title": "<strong>SEMESTER BREAK</strong>",
            "topic_description": "SEMESTER BREAK",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Budgets and fiscal constraints</strong><br/><p>Budget conditions are a major factor shaping, and particularly constraining, contemporary policy design. How do policy designers adapt to demands for budget savings? What are the longer-term consequences of budget 'austerity'? And are there really widespread inefficiencies to be found? We will discuss these issues particularly in the context of service delivery, such as in health and welfare programs. </p></p></div></td>",
            "topic_title": "<strong>Budgets and fiscal constraints</strong>",
            "topic_description": "Budgets and fiscal constraints Budget conditions are a major factor shaping, and particularly constraining, contemporary policy design. How do policy designers adapt to demands for budget savings? What are the longer-term consequences of budget 'austerity'? And are there really widespread inefficiencies to be found? We will discuss these issues particularly in the context of service delivery, such as in health and welfare programs.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Implementation: the agency, the street-level and the long-term.</strong><br/><p>For the rest of the course, we focus more closely on implementation. Rather than as separate and distinct 'stage' of the policy process, we discuss implementation as a key consideration of design itself. We also consider what 'top-down' and 'bottom-up' approaches have to offer in helping us understand how implementation happens and the role that implementers play in maintaining key policy functions beyond short-term political cycles.</p></p></div></td>",
            "topic_title": "<strong>Implementation: the agency, the street-level and the long-term.</strong>",
            "topic_description": "Implementation: the agency, the street-level and the long-term. For the rest of the course, we focus more closely on implementation. Rather than as separate and distinct 'stage' of the policy process, we discuss implementation as a key consideration of design itself. We also consider what 'top-down' and 'bottom-up' approaches have to offer in helping us understand how implementation happens and the role that implementers play in maintaining key policy functions beyond short-term political cycles.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Managing partners and contracts</strong><br/><p>In the 21st century, many public services and programs are delivered by organisations outside of government, including by for-profit companies. Managing these relationships and contracts has therefore become a key dimension of public service work. However, critics have often raised concerns about effectiveness, fairness and value-for-money in the contracting of public services. How can we ensure that contracting processes are competitive and transparent? And to what extent can governments hold providers to account for the services they deliver?</p>\n<p>In Week 9, we will also hold a feedback session for the final assignment. Make sure you have developed a Logic Model for your proposed intervention and are ready to explain it to a partner.</p></p></div></td>",
            "topic_title": "<strong>Managing partners and contracts</strong>",
            "topic_description": "Managing partners and contracts In the 21st century, many public services and programs are delivered by organisations outside of government, including by for-profit companies. Managing these relationships and contracts has therefore become a key dimension of public service work. However, critics have often raised concerns about effectiveness, fairness and value-for-money in the contracting of public services. How can we ensure that contracting processes are competitive and transparent? And to what extent can governments hold providers to account for the services they deliver? In Week 9, we will also hold a feedback session for the final assignment. Make sure you have developed a Logic Model for your proposed intervention and are ready to explain it to a partner.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(04 May - 10 May)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>NO CLASS</strong><br/><p>Use this week to work on your final assignment, building on the feedback you received in Week 9.</p></p></div></td>",
            "topic_title": "<strong>NO CLASS</strong>",
            "topic_description": "NO CLASS Use this week to work on your final assignment, building on the feedback you received in Week 9.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Community control and self-determination</strong><br/><p>For our penultimate class, we consider the concept of 'self-determination', particularly as it relates to Indigenous Peoples in Australia. Self-determination poses challenges to traditional understandings and practices of design of implementation and entails (to varying degrees) a shifting of authority and agency away from the state to specific communities. This week's material will examine how self-determination differs from even more participatory approaches like co-design and how instruments like treaties may reshape policymaking, while also discussing the broader political factors that have sometimes limited the scope of self-determination. </p></p></div></td>",
            "topic_title": "<strong>Community control and self-determination</strong>",
            "topic_description": "Community control and self-determination For our penultimate class, we consider the concept of 'self-determination', particularly as it relates to Indigenous Peoples in Australia. Self-determination poses challenges to traditional understandings and practices of design of implementation and entails (to varying degrees) a shifting of authority and agency away from the state to specific communities. This week's material will examine how self-determination differs from even more participatory approaches like co-design and how instruments like treaties may reshape policymaking, while also discussing the broader political factors that have sometimes limited the scope of self-determination.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(18 May - 24 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Digital transformation</strong><br/><p>Digital technology is now central to all aspects of public policy and services delivery, from health records, to taxation, to driving licenses and environmental regulation. How can governments manage the challenges of digital transformation, which include concerns around privacy and algorithmic biases? And what separates successful digitisation of public services from the infamous disasters?</p></p></div></td>",
            "topic_title": "<strong>Digital transformation</strong>",
            "topic_description": "Digital transformation Digital technology is now central to all aspects of public policy and services delivery, from health records, to taxation, to driving licenses and environmental regulation. How can governments manage the challenges of digital transformation, which include concerns around privacy and algorithmic biases? And what separates successful digitisation of public services from the infamous disasters?",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(25 May - 31 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Critical perspectives on design and implementation</strong><br/><p>In the final week of the course, we recap key themes and consider more critical perspectives on policy design. In particular, how do ensure that 'design thinking' does not ignore the broader political factors that shape the boundaries of the possible.</p></p></div></td>",
            "topic_title": "<strong>Critical perspectives on design and implementation</strong>",
            "topic_description": "Critical perspectives on design and implementation In the final week of the course, we recap key themes and consider more critical perspectives on policy design. In particular, how do ensure that 'design thinking' does not ignore the broader political factors that shape the boundaries of the possible.",
            "learning_outcomes": []
        }
    ]
}