{
    "course_title": "Security and Development",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/POLS7325-21962-7620",
    "full_course_code": "POLS7325-21962-7620",
    "course_code": "POLS7325",
    "class_code": "21962",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Appreciate the complex and dynamic interplay between development and security in global politics."
        },
        {
            "number": "LO2.",
            "description": "Critically analyse social and political challenges around the security-development nexus at project and policy levels."
        },
        {
            "number": "LO3.",
            "description": "Critically evaluate policy and doctrinal responses to the merging of security and development."
        },
        {
            "number": "LO4.",
            "description": "Critically examine and analyse case examples of security and development."
        },
        {
            "number": "LO5.",
            "description": "Reconstruct and critically evaluate competing approaches to the link between security and development."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "In-Class Quizzes",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 26/03/2026</p>\n<p> 16/04/2026</p>\n<p> 7/05/2026</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>We will have <strong>three short quizzes</strong> (10% each) during the semester, completed <strong>in class</strong>. These quizzes are designed to help you consolidate and review what you have been learning, and to give you an opportunity to develop your critical thinking and academic writing skills ahead of the final essay.</p>\n<p><strong>What the quizzes cover: </strong>Each quiz will focus on the lectures, discussions, and key concepts from the classes immediately preceding the quiz. To prepare, you should review your class notes, slides, assigned readings, and any materials used in those sessions.</p>\n<p><strong>When they happen and what they assess:</strong></p>\n<ul>\n<li><strong>Quiz 1 10% (Week 5):</strong> covers <strong>Weeks 2–4</strong></li>\n<li><strong>Quiz 2 10% (Week 7): </strong>covers <strong>Weeks 5–6</strong></li>\n<li><strong>Quiz 3 10% (Week 10):</strong> covers <strong>Weeks 7–9</strong></li>\n</ul>\n<p><strong>Quiz format:</strong></p>\n<ul>\n<li>Quizzes are pen-and-paper (handwritten), closed-book, closed-note, and completed during class time.</li>\n<li>On the day, you will receive a set of question options</li>\n<li>You will choose ONE question and write your response within the allotted time</li>\n</ul>\n<p><strong>What we are assessing: </strong>Your answer should demonstrate critical analysis (engaging with concepts and arguments from the topic of your choice), a critical reflection showing your own reasoning and interpretation in relation to course debates, and a clear, well-structured response.</p>\n<p>You do not need to provide formal or detailed references in quiz answers. However, if you draw on a specific idea or argument from a particular thinker or author, you should mention their name.</p>\n<p><strong>Time: </strong>You will have 40 minutes to complete the quiz.</p>\n<p><em>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>N/A</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Reflection (1000 to 1200 words)",
            "special_indicators": [],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 22/04/2026 4:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Reflection Assignment in <em>Security &amp; Development</em> is designed to give you the opportunity to engage critically and personally with the course material, drawing on your experiences, insights, and questions developed during the first part of the semester. The reflection should address material from <strong>Weeks 1 to 4</strong>, but it should be presented as a single, coherent narrative rather than a week-by-week summary. </p>\n<p>In writing your reflection, focus on what has been particularly significant, thought-provoking, or challenging for you. Across Weeks 1–5, we establish key preliminaries for thinking about how <em>security</em> and <em>development</em> are defined, who (or what) is taken as the referent of security and development, and why it matters to critically examine the assumptions built into dominant approaches. A strong reflection will show how your thinking evolved as you engaged with different accounts of the security–development relationship, and as we examined Modernization Theory as a highly influential framework that links security and development to state integrity/capacity and liberal-capitalist developmental pathways. It is expected to go beyond description by critically reflecting on <em>how</em> ideas work: for example, what kinds of “security,” and “development” are made thinkable through Modernization Theory, and what is left out or misrepresented; how critiques of Modernization Theory foreground questions of inequality and insecurity; and what analytical and substantive implications follow from those critiques. </p>\n<p>Rather than offering a general summary of seminars or readings, concentrate on elements that resonated with you personally—ideas that challenged your assumptions, raised unresolved questions, or opened up new directions for inquiry. One productive way to structure your reflection is to identify one or two key problems/tensions, formulate the questions that emerged for you, and consider how competing conceptualisations shape what counts as a political response. </p>\n<p>Concluding your reflection with questions that remain open for you is a powerful way to demonstrate critical engagement and contribute to the learning-feedback loop that this assignment is intended to foster. Where relevant, you should cite and reference sources appropriately, using a consistent academic style.</p>\n<p>Since the word count range is already specified, <strong>no leeway of +/- 10% is allowed.</strong></p>\n<p><em>This task has been designed to be challenging, authentic, and complex. Whilst students may use Artificial Intelligence (AI) and/or Machine Translation (MT) technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</em></p>\n<p><em>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submissions independent of AI and MT tools.</em></p>\n<p><em>All instances of AI or MT must be referenced or acknowledged. Failure to reference the use of generative AI or MT may be considered student misconduct under the Student Code of Conduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Please see Task Description.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Essay",
            "special_indicators": [],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 29/05/2026 2:00 pm</p>\n<p>\n</p><p>Draft to be completed two weeks before the due date.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Length: </strong>3000-3200 words</p>\n<p><strong>Weight: </strong>50%</p>\n<p><strong>Description: </strong></p>\n<p>You will write a 3000-3200-word argumentative research essay on one question you choose from the list provided in Week 7.</p>\n<p>For your essay, you have to engage with the required as well as recommended readings for POLS7325, in addition to any other academic input you find in your research. Your essay should be written as a well-integrated and consistently argued analysis that engages with the topic in the context of how it is explored and discussed in our course. Avoid serializing self-contained paragraphs, and make sure you reference appropriately throughout, especially with regard to providing full details (including page numbers) where you cite or refer to specific points in your sources.</p>\n<p><strong>Presentation: </strong>Your essay must be typed (1.5-line-spaced), fully referenced, and include a reference list. You are required to use the author-date in-text referencing system.</p>\n<p>Please note that submissions must be made via the designated Turnitin Link (Blackboard), using Word encoding (.doc or .docx extensions); .pdf files are <em>not </em>accepted.</p>\n<p>The essay should demonstrate a high standard of grammar, spelling, and general presentation and conform to the standards set out in the School of Political Science and International Studies Essay Guide. </p>\n<p>Since the word count range is already specified, <strong>no leeway of +/- 10% is allowed</strong>.</p>\n<p><em>This task has been designed to be challenging, authentic, and complex. Whilst students may use Artificial Intelligence (AI) and/or Machine Translation (MT) technologies, successful completion of the assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</em></p>\n<p><em>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submissions, independent of AI and MT tools.</em></p>\n<p><em>All instances of AI or MT must be referenced or acknowledged. Failure to reference the use of generative AI or MT may be considered student misconduct under the Student Code of Conduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Please see Task Description.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Welcome and Introduction to the Course</strong><br/><p>We will establish some preliminaries on how to think about the relationship between security and development.</p>\n<p>Questions that will help us open this topic include:</p>\n<p>Who is the referent of security and development? For instance, are they states or peoples or both?</p>\n<p>What changes and why, depending on how we conceptualize security and development?</p>\n<p>Why should we critically engage with underlying assumptions of approaches to security and development?</p>\n<p>How are insecurities and inequalities thought of in relation to security and development?</p></p><p><strong>Learning outcomes:</strong> L01, L05</p></div></td>",
            "topic_title": "<strong>Welcome and Introduction to the Course</strong>",
            "topic_description": "Welcome and Introduction to the Course We will establish some preliminaries on how to think about the relationship between security and development. Questions that will help us open this topic include: Who is the referent of security and development? For instance, are they states or peoples or both? What changes and why, depending on how we conceptualize security and development? Why should we critically engage with underlying assumptions of approaches to security and development? How are insecurities and inequalities thought of in relation to security and development?",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        },
        {
            "learning_period": "Week 2(02 Mar - 08 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Security &amp; Development: An overview </strong><br/><p>In this session, we introduce and engage with two different accounts of security and development.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Security &amp; Development: An overview </strong>",
            "topic_description": "Security & Development: An overview In this session, we introduce and engage with two different accounts of security and development.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Development and Security: Modernization Theory</strong><br/><p>This session focuses on how security and development are linked in the contemporary context, and considers how this aligns with premises of Modernisation Theory (MT). MT is a liberal political ideology of development and security that has been highly influential throughout the post-1945 era. MT considers the integrity and capacity of the Estateto be central to achieving and maintaining both security and development, while emphasizing that the latter is to be realised through frameworks oriented to liberal capitalism. Our objective is to identify and critically examine these assumptions about security and development.</p>\n<p>In this first of two sessions on MT and its legacies, we focus more on the conceptual and analytical aspects of MT, as well as the global political context in which it emerged.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Development and Security: Modernization Theory</strong>",
            "topic_description": "Development and Security: Modernization Theory This session focuses on how security and development are linked in the contemporary context, and considers how this aligns with premises of Modernisation Theory (MT). MT is a liberal political ideology of development and security that has been highly influential throughout the post-1945 era. MT considers the integrity and capacity of the Estateto be central to achieving and maintaining both security and development, while emphasizing that the latter is to be realised through frameworks oriented to liberal capitalism. Our objective is to identify and critically examine these assumptions about security and development. In this first of two sessions on MT and its legacies, we focus more on the conceptual and analytical aspects of MT, as well as the global political context in which it emerged.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Inequality and Insecurity: The Critique of Modernization Theory</strong><br/><p>In today's session, we critically interrogate the premises and implications of how MT frames and determines 'order', 'security', and 'development'.</p>\n<p>What issues, problems, or interests are misrepresented or disarticulated in MT?</p>\n<p>What analytical and substantive implications does the critique of MT entail?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Inequality and Insecurity: The Critique of Modernization Theory</strong>",
            "topic_description": "Inequality and Insecurity: The Critique of Modernization Theory In today's session, we critically interrogate the premises and implications of how MT frames and determines 'order', 'security', and 'development'. What issues, problems, or interests are misrepresented or disarticulated in MT? What analytical and substantive implications does the critique of MT entail?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In/securities and Colonialism</strong><br/><p>What can we learn about security and development from anti-colonial struggles?</p>\n<p>In this session, we will deepen our understanding of the significance of colonialism and its legacies for security and development. In this session, we will examine how experiences of insecurities and violence of colonialism were reflected upon by those subject to it and consider what alternatives to the colonial order were imagined as possible futures. What can we learn from anti-colonial struggles that aimed to overcome violence of colonial logics of (in)security and development?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>In/securities and Colonialism</strong>",
            "topic_description": "In/securities and Colonialism What can we learn about security and development from anti-colonial struggles? In this session, we will deepen our understanding of the significance of colonialism and its legacies for security and development. In this session, we will examine how experiences of insecurities and violence of colonialism were reflected upon by those subject to it and consider what alternatives to the colonial order were imagined as possible futures. What can we learn from anti-colonial struggles that aimed to overcome violence of colonial logics of (in)security and development?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The security-development nexus: 'fragile states'</strong><br/><p>In this session, we will examine in some detail an example at the forefront of the contemporary security-development nexus: 'fragile states'. Our task is to understand how state fragility is conceptualised and 'measured' through a complex mix of performance indicators in the fields of security and development. A close look at the practices of scoring states according to their development and security performances will allow us to discuss the problems and implications these entail.</p>\n<p>This dominant framing of security and development has been contested, including from postcolonial perspectives that emphasize the importance of critical historical analytical frameworks. Core points of contention between the mainstream and critics concern appropriate methods of analysis and normative commitments. We will draw on examples to substantiate our discussion.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>The security-development nexus: 'fragile states'</strong>",
            "topic_description": "The security-development nexus: 'fragile states' In this session, we will examine in some detail an example at the forefront of the contemporary security-development nexus: 'fragile states'. Our task is to understand how state fragility is conceptualised and 'measured' through a complex mix of performance indicators in the fields of security and development. A close look at the practices of scoring states according to their development and security performances will allow us to discuss the problems and implications these entail. This dominant framing of security and development has been contested, including from postcolonial perspectives that emphasize the importance of critical historical analytical frameworks. Core points of contention between the mainstream and critics concern appropriate methods of analysis and normative commitments. We will draw on examples to substantiate our discussion.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Mid-sem break(06 Apr - 12 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MID-SEMESTER BREAK</strong><br/><p>NO SEMINAR THIS WEEK</p></p></div></td>",
            "topic_title": "<strong>MID-SEMESTER BREAK</strong>",
            "topic_description": "MID-SEMESTER BREAK NO SEMINAR THIS WEEK",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Human Security and Development</strong><br/><p>To what extent is Human Security an alternative approach to security and development?</p>\n<p>In the context of the end of the Cold War, Modernisation Theoretic premises appeared to be in decline in both approaches to security and to development. In international relations as well as at the level of international institutions more generally, Human Security (HS) as an approach to \"security and development\" emerged in the 1980s. From its early days, HS focused on individuals as the key referent of security and development, thereby bringing questions of poverty and inequality to the forefront of analyses of insecurities. According to some analysts, however, the original critical outlook of HS has been gradually abandoned in favour of aligning it more closely with dominant and more conventional approaches to security and development. We will examine the debates this has generated and consider how, in light of those debates, we ought to evaluate the United Nations Human Security Unit's approach to the linking of \"freedom from want\" and \"freedom from fear\" (otherwise presented in terms of \"protection\" and \"empowerment\").</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Human Security and Development</strong>",
            "topic_description": "Human Security and Development To what extent is Human Security an alternative approach to security and development? In the context of the end of the Cold War, Modernisation Theoretic premises appeared to be in decline in both approaches to security and to development. In international relations as well as at the level of international institutions more generally, Human Security (HS) as an approach to \"security and development\" emerged in the 1980s. From its early days, HS focused on individuals as the key referent of security and development, thereby bringing questions of poverty and inequality to the forefront of analyses of insecurities. According to some analysts, however, the original critical outlook of HS has been gradually abandoned in favour of aligning it more closely with dominant and more conventional approaches to security and development. We will examine the debates this has generated and consider how, in light of those debates, we ought to evaluate the United Nations Human Security Unit's approach to the linking of \"freedom from want\" and \"freedom from fear\" (otherwise presented in terms of \"protection\" and \"empowerment\").",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Extractivism and development</strong><br/><p>Mining for minerals has been at the centre of many contemporary conflicts, and has obvious linkages with development, not least because resource extraction is often promoted as a key component of development policies aimed at advancing a developing nation up the \"ladder\". In this session, we will focus on examples that illustrate the practices around the extraction of and trade in 'conflict minerals'. We will identify key actors and agents involved, including the ecological impact and the implications of the latter for livelihoods of local communities.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Extractivism and development</strong>",
            "topic_description": "Extractivism and development Mining for minerals has been at the centre of many contemporary conflicts, and has obvious linkages with development, not least because resource extraction is often promoted as a key component of development policies aimed at advancing a developing nation up the \"ladder\". In this session, we will focus on examples that illustrate the practices around the extraction of and trade in 'conflict minerals'. We will identify key actors and agents involved, including the ecological impact and the implications of the latter for livelihoods of local communities.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Borders and migration, in/security and development</strong><br/><p>In this seminar, we will examine the relationship between development, poverty, and migrations. We will also examine implications of the policing of borders in relation to development and insecurities by drawing on case examples; we focus, for instance, on questions of who stands to benefit from linkages between 'border force' and penal labour, look at examples of agencies and corporations involved, and consider the implications of the denial of protection to those conceived as 'aliens'. How do borders connect peoples' fate, and what justifications are given for suppressing or denying these connections?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Borders and migration, in/security and development</strong>",
            "topic_description": "Borders and migration, in/security and development In this seminar, we will examine the relationship between development, poverty, and migrations. We will also examine implications of the policing of borders in relation to development and insecurities by drawing on case examples; we focus, for instance, on questions of who stands to benefit from linkages between 'border force' and penal labour, look at examples of agencies and corporations involved, and consider the implications of the denial of protection to those conceived as 'aliens'. How do borders connect peoples' fate, and what justifications are given for suppressing or denying these connections?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 10(04 May - 10 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Independent Study and Quiz</strong><br/><p>This week, we will have the quiz in the first hour, and the second hour is 'Independent Study ' to provide you with extra time to focus on your essay.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Independent Study and Quiz</strong>",
            "topic_description": "Independent Study and Quiz This week, we will have the quiz in the first hour, and the second hour is 'Independent Study ' to provide you with extra time to focus on your essay.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Authoritarian Populism</strong><br/><p>Over the past decades, there has been a growing body of research on the link between neoliberal development and tendencies towards authoritarian rule in countries in the North and the South. This dynamic has also been identified in terms of neoliberal populism and also 'racist populism'. This week, we explore debates through examples, identifying differences and similarities, and how such a rule is justified.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Authoritarian Populism</strong>",
            "topic_description": "Authoritarian Populism Over the past decades, there has been a growing body of research on the link between neoliberal development and tendencies towards authoritarian rule in countries in the North and the South. This dynamic has also been identified in terms of neoliberal populism and also 'racist populism'. This week, we explore debates through examples, identifying differences and similarities, and how such a rule is justified.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 12(18 May - 24 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Development 'revolutionaries': Zapatismo</strong><br/><p>This topic examines the example of Zapatismo, one instance of the \"development revolutions\" of the twentieth (and twenty-first) century. As an indigenous armed struggle against the Mexican state, the ideology of Zapatismo has been explicitly political and aimed at countering colonial practices of discrimination and marginalisation as well as neoliberal politics of development. The Zapatistas have been studied for their specific approach to democratic practices of governance, their discipline and political consciousness-raising, as well as their practices of resistance.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Development 'revolutionaries': Zapatismo</strong>",
            "topic_description": "Development 'revolutionaries': Zapatismo This topic examines the example of Zapatismo, one instance of the \"development revolutions\" of the twentieth (and twenty-first) century. As an indigenous armed struggle against the Mexican state, the ideology of Zapatismo has been explicitly political and aimed at countering colonial practices of discrimination and marginalisation as well as neoliberal politics of development. The Zapatistas have been studied for their specific approach to democratic practices of governance, their discipline and political consciousness-raising, as well as their practices of resistance.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13(25 May - 31 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Security and development: wrap-up &amp; outlook</strong><br/><p>In this final session, we will discuss lessons learnt and consider the outlook for taking these forward. What progress have we made analytically, and why is that important?</p>\n<p>The link between theory and practice will be revisited, along with its implications for practical political transformations.</p></p><p><strong>Learning outcomes:</strong> L01, L05</p></div></td>",
            "topic_title": "<strong>Security and development: wrap-up &amp; outlook</strong>",
            "topic_description": "Security and development: wrap-up & outlook In this final session, we will discuss lessons learnt and consider the outlook for taking these forward. What progress have we made analytically, and why is that important? The link between theory and practice will be revisited, along with its implications for practical political transformations.",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        }
    ]
}