{
    "course_title": "International Relations of the Asia- Pacific",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/POLS7208-21953-7620",
    "full_course_code": "POLS7208-21953-7620",
    "course_code": "POLS7208",
    "class_code": "21953",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand the major economic, political and strategic forces influencing the Asia-Pacific region"
        },
        {
            "number": "LO2.",
            "description": "Critically evaluate competing perspectives on the Asia-Pacific"
        },
        {
            "number": "LO3.",
            "description": "Critically apply theoretical concepts to the politics of the Asia-Pacific"
        },
        {
            "number": "LO4.",
            "description": "Understand contemporary domestic and international relations in the Asia-Pacific"
        },
        {
            "number": "LO5.",
            "description": "Critically assess, and articulate a response to the Asia-Pacifics distinctive political practices and intra-regional relations"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Seminar Reflections",
            "special_indicators": [],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 20/03/2026 2:00 pm</p>\n<p> 8/05/2026 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Participation/ Student contribution, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will be required to submit two (2) Seminar Reflections during the Period from Week 2 - to Week 10.</p>\n<p>Students are expected to participate in seminar/workshop discussions and come prepared having done all the required readings and preparation activities for the tasks outlined in the course instance for each week.</p>\n<p>20% of marks will be allocated to two Seminar Checkpoint Reflections (800 words each) - the first one is to be submitted by Friday 20th March, 2pm and the second one on Friday 8th May, 2pm.</p>\n<p>These reflections should be directly related to in-class discussions and debates on the set-readings. Further details are provided on the POLS7208 Blackboard site.</p>\n<p>Queries on the above, should be directed to Course Coordinator, Dr Melissa Curley in the first instance at m.curley@uq.edu.au</p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>Students who are unwell or have extenuating circumstances for non-attendance to conduct their seminar reflections can email the Course Coordinator Dr Melissa Curley (m.curley@uq.edu.au) with medical or other documentation.</p>\n<p><strong>PLEASE NOTE</strong>: Students who cannot <strong>regularly attend the</strong> 12 noon 2pm Tuesday time slot in person should reconsider their enrolment in this class.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments for this course will be submitted electronically via Blackboard and using <em>Turnitin</em>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Research Project/Strategic Update",
            "special_indicators": [],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 15/05/2026 2:00 pm</p></dd>",
            "learning_objectives": "L02, L03, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Major Research Paper</strong></p>\n<p><strong>Topic Selection</strong></p>\n<p>Students are required to research and submit a <strong>Research Report/Strategic Update Report </strong>from a choice of topics provided by the Course Coordinator [4,000 words, not including references]. Further details will be made available on Blackboard. The report will involve conducting an analysis of events and developments in the Asia-Pacific region for a specific 12 month period on a specific topic, drawing upon a range of primary and secondary sources.</p>\n<p>This assessment requirement to engage with the scholarly literature on the topic, in addition to empirical facts and developments. Students are encouraged to choose a topic that will extend and deepen their existing knowledge base. If you have experience in the region, or have studied the Asia-Pacific before, you will get more out of the course if you research and write on topics outside your existing knowledge base.</p>\n<p><strong>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments for this course will be submitted electronically via Blackboard and using <em>Turnitin</em>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "End of Semester Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>6/06/2026 - 20/06/2026</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will be required to sit an end of semester exam of two hours in length which will cover the contents of the course, focussing on the major themes of the seminars and debates/themes in the set readings. The exam will comprise of five short answer questions and one longer essay response.</p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1: Course Introduction</strong><br/><p>The introductory seminar will provide an overview of the main topics covered in the course, the assessment tasks and expectations. I review the different types of terms used to refer to the Asia-Pacific, including 'East Asia' and 'Indo-Pacific' and what the course does not cover. I introduce the key themes including: history context, foreign and security policies, connections between domestic and foreign policies, regime type, processes of democratisation and authoritarian rule emergent in the region, and the discussion about 'multipolarity'.</p>\n<p><strong>Discussion Focus</strong></p>\n<p>Introductions and ice-breaking exercise.</p>\n<p>What are the most pressing foreign policy and security concerns facing the Asia-Pacific region, from your perspective?</p>\n<p>What do you 'know' and 'not know' about Asia-Pacific IR?</p>\n<p>Who are we as a learning cohort?</p>\n<p>Dr. Melissa Curley</p></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Week 1: Course Introduction</strong>",
            "topic_description": "Week 1: Course Introduction The introductory seminar will provide an overview of the main topics covered in the course, the assessment tasks and expectations. I review the different types of terms used to refer to the Asia-Pacific, including 'East Asia' and 'Indo-Pacific' and what the course does not cover. I introduce the key themes including: history context, foreign and security policies, connections between domestic and foreign policies, regime type, processes of democratisation and authoritarian rule emergent in the region, and the discussion about 'multipolarity'. Discussion Focus Introductions and ice-breaking exercise. What are the most pressing foreign policy and security concerns facing the Asia-Pacific region, from your perspective? What do you 'know' and 'not know' about Asia-Pacific IR? Who are we as a learning cohort? Dr. Melissa Curley",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 2(02 Mar - 08 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2: The Historical Context of Asia's Regional Order</strong><br/><p>This Guest Lecture with Assoc. Prof. Patrick Jory, Lecturer in Asian History, UQ School of Philosophical and Historical Enquiry (HAPI), explores the historical context of Asia from the 17th Century onwards (17th C to 1945), focussing on the Chinese Tributary state system, geographical, social-cultural differences between pre-colonial societies in Northeast Asia and Southeast Asia, and the western colonial expansion into East and Southeast Asia and its impact. The impact of Japanese imperialism is also briefly mentioned up until 1945, but we also discuss the <em>historical context of 'Asian Order'</em> in light of recent debates about the decline role of the US and rise of multi-polarity.</p>\n<p><strong>Guest Lecturer:</strong> <a href=\"https://hpi.uq.edu.au/profile/371/patrick-jory\">Assoc. Prof. Patrick Jory</a> , Lecturer in Asian History, UQ School of Philosophical and Historical Enquiry (HAPI)</p></p></div></td>",
            "topic_title": "<strong>Week 2: The Historical Context of Asia's Regional Order</strong>",
            "topic_description": "Week 2: The Historical Context of Asia's Regional Order This Guest Lecture with Assoc. Prof. Patrick Jory, Lecturer in Asian History, UQ School of Philosophical and Historical Enquiry (HAPI), explores the historical context of Asia from the 17th Century onwards (17th C to 1945), focussing on the Chinese Tributary state system, geographical, social-cultural differences between pre-colonial societies in Northeast Asia and Southeast Asia, and the western colonial expansion into East and Southeast Asia and its impact. The impact of Japanese imperialism is also briefly mentioned up until 1945, but we also discuss the historical context of 'Asian Order' in light of recent debates about the decline role of the US and rise of multi-polarity. Guest Lecturer: Assoc. Prof. Patrick Jory , Lecturer in Asian History, UQ School of Philosophical and Historical Enquiry (HAPI)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3: Power, Order &amp; Hegemony: The role of the US</strong><br/><p>This seminar explores the concepts of power, order and hegemony in the context of Asia-Pacific, and introduces some of the key debates about regional power shifts in the region. It reviews the United States' role in East Asian Security post 1945 (<em>'Hubs and Spokes'</em> alliance system), relations with China, and alliance politics between South Korea and Japan. We review the Trump Administration 2.0, and its policy-agenda towards the Asia-Pacific, vis-a-vis other regional national security concerns.</p>\n<p>Dr. Melissa Curley</p>\n<p><strong>Discussion Questions</strong></p>\n<p>Why did the US Hubs-and Spokes Alliance system within East Asian states emerge in the post World War 2 era? Do you agree with Izumikawa's explanation (see Izumikawa 2020).</p>\n<p>What are the future challenges for the 'Hubs-and-Spokes' system looking forward?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Week 3: Power, Order &amp; Hegemony: The role of the US</strong>",
            "topic_description": "Week 3: Power, Order & Hegemony: The role of the US This seminar explores the concepts of power, order and hegemony in the context of Asia-Pacific, and introduces some of the key debates about regional power shifts in the region. It reviews the United States' role in East Asian Security post 1945 ( 'Hubs and Spokes' alliance system), relations with China, and alliance politics between South Korea and Japan. We review the Trump Administration 2.0, and its policy-agenda towards the Asia-Pacific, vis-a-vis other regional national security concerns. Dr. Melissa Curley Discussion Questions Why did the US Hubs-and Spokes Alliance system within East Asian states emerge in the post World War 2 era? Do you agree with Izumikawa's explanation (see Izumikawa 2020). What are the future challenges for the 'Hubs-and-Spokes' system looking forward?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4: Japan - Becoming 'a Normal Country'?</strong><br/><p>This seminar explores post-1945 Japan and the nexus between domestic politics and foreign/security policies in the context of the Japan-US alliance. We look at the debate surrounding Japan's security and defence policies and the issue of constitutional reform of the so-called Peace Clause (Article 9). We explore the likelihood that Japan may 'normalise' its defence policies in the future, in light of China's rise, a more aggressive North Korean regime, and the risk of abandonment from the US. China-Japan relations are discussed in the context of historical events which continue to impact contemporary East-Asian relations.</p>\n<p><strong>Discussion Questions:</strong></p>\n<p>How is Japan adjusting its security and defence policies in light of China's growing military strength and vis-a-vis the Japan-US alliance? (see Heginbotham et. al. 2023).</p>\n<p>Is Japan still a 'pacifist' nation?</p>\n<p>Dr Melissa Curley</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 4: Japan - Becoming 'a Normal Country'?</strong>",
            "topic_description": "Week 4: Japan - Becoming 'a Normal Country'? This seminar explores post-1945 Japan and the nexus between domestic politics and foreign/security policies in the context of the Japan-US alliance. We look at the debate surrounding Japan's security and defence policies and the issue of constitutional reform of the so-called Peace Clause (Article 9). We explore the likelihood that Japan may 'normalise' its defence policies in the future, in light of China's rise, a more aggressive North Korean regime, and the risk of abandonment from the US. China-Japan relations are discussed in the context of historical events which continue to impact contemporary East-Asian relations. Discussion Questions: How is Japan adjusting its security and defence policies in light of China's growing military strength and vis-a-vis the Japan-US alliance? (see Heginbotham et. al. 2023). Is Japan still a 'pacifist' nation? Dr Melissa Curley",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5: Foreign Policy of the People's Republic of China (PRC)</strong><br/><p>This seminar introduces key aspects of China's foreign and security policy as it relates to the Asia-Pacific, and its relations with other key regional states. We focus on foreign policy under Xi Jingping. We cover China's Belt and Road initiative, China's position on the South China Sea and Taiwan, and discuss growing concerns in the region about China's foreign policy and geo-strategic goals.</p>\n<p>Dr Melissa Curley</p>\n<p><strong>Discussion Focus:</strong></p>\n<p>What are the core objectives of Chinese Foreign Policy in the Asia-Pacific region since Xi Jinping became President in 2013?</p>\n<p>China-US relations under Trump 2.0: trends and ways forward?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 5: Foreign Policy of the People's Republic of China (PRC)</strong>",
            "topic_description": "Week 5: Foreign Policy of the People's Republic of China (PRC) This seminar introduces key aspects of China's foreign and security policy as it relates to the Asia-Pacific, and its relations with other key regional states. We focus on foreign policy under Xi Jingping. We cover China's Belt and Road initiative, China's position on the South China Sea and Taiwan, and discuss growing concerns in the region about China's foreign policy and geo-strategic goals. Dr Melissa Curley Discussion Focus: What are the core objectives of Chinese Foreign Policy in the Asia-Pacific region since Xi Jinping became President in 2013? China-US relations under Trump 2.0: trends and ways forward?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6: North Korean Regime and Regional Security</strong><br/><p>In this week's seminar, we explore the foreign and security goals of North Korea as well as the security dilemmas and biases in interpreting policy approaches towards the Korean Peninsular. We review major recent policy positions of South Korea, North Korea, the US, China and Japan, as well as discuss proliferation risks and future possible scenarios.</p>\n<p><strong>Discussion Questions</strong></p>\n<p>Is CVID (Complete, Verifiable, Irreversible, Denuclearisation) a realistic policy approach to advocate on the Korean Peninsular anymore?</p>\n<p>What are the prevailing political discourses and practices that inform 'knowledge' about security on the Korean Peninsula? (see Bleiker 2019)</p>\n<p>What key impediments do you see to greater peace and reconciliation between North and South Korea?</p>\n<p>Dr Melissa Curley</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Week 6: North Korean Regime and Regional Security</strong>",
            "topic_description": "Week 6: North Korean Regime and Regional Security In this week's seminar, we explore the foreign and security goals of North Korea as well as the security dilemmas and biases in interpreting policy approaches towards the Korean Peninsular. We review major recent policy positions of South Korea, North Korea, the US, China and Japan, as well as discuss proliferation risks and future possible scenarios. Discussion Questions Is CVID (Complete, Verifiable, Irreversible, Denuclearisation) a realistic policy approach to advocate on the Korean Peninsular anymore? What are the prevailing political discourses and practices that inform 'knowledge' about security on the Korean Peninsula? (see Bleiker 2019) What key impediments do you see to greater peace and reconciliation between North and South Korea? Dr Melissa Curley",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Mid-sem break(06 Apr - 12 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-Semester break (6-10 April)</strong><br/><p>No lectures this week</p></p></div></td>",
            "topic_title": "<strong>Mid-Semester break (6-10 April)</strong>",
            "topic_description": "Mid-Semester break (6-10 April) No lectures this week",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7: Introduction to Southeast Asia and ASEAN (Reading Week)</strong><br/><p>This seminar is dedicated to a reading week to focus on self-led learning on the emergence of ASEAN and some introductory readings on post-colonial Southeast Asia. </p>\n<p>These readings explore the formation and development of the Association of Southeast Asian Nations (ASEAN) as well as the post-colonial context and the transition to democracy for some of its member states. The seminar cover important highlights in ASEAN's evolution including membership expansion, major agreements and treaties which form the basis of ASEAN as a regional institution (e.g. ASEAN+3 mechanism, ASEAN Regional Forum (ARF) and East Asian Summit)</p>\n<p><strong>Reading Focus:</strong></p>\n<p>What were some of the key legacies of colonial rule for post independent Southeast Asian states?</p>\n<p>What is the 'ASEAN Way' and what role does it play in the functioning of ASEAN as an institution? </p>\n<p>The utility of Asia-Pacific Regionalism. How have IR scholars - particularly those interested in regional institutionalism and its role in peace and stability - assessed ASEAN centered regionalism?</p>\n<p>Dr Melissa Curley</p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Week 7: Introduction to Southeast Asia and ASEAN (Reading Week)</strong>",
            "topic_description": "Week 7: Introduction to Southeast Asia and ASEAN (Reading Week) This seminar is dedicated to a reading week to focus on self-led learning on the emergence of ASEAN and some introductory readings on post-colonial Southeast Asia. These readings explore the formation and development of the Association of Southeast Asian Nations (ASEAN) as well as the post-colonial context and the transition to democracy for some of its member states. The seminar cover important highlights in ASEAN's evolution including membership expansion, major agreements and treaties which form the basis of ASEAN as a regional institution (e.g. ASEAN+3 mechanism, ASEAN Regional Forum (ARF) and East Asian Summit) Reading Focus: What were some of the key legacies of colonial rule for post independent Southeast Asian states? What is the 'ASEAN Way' and what role does it play in the functioning of ASEAN as an institution? The utility of Asia-Pacific Regionalism. How have IR scholars - particularly those interested in regional institutionalism and its role in peace and stability - assessed ASEAN centered regionalism? Dr Melissa Curley",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8: Indonesia: ASEAN's Middle Power?</strong><br/><p>This session focuses on Indonesia - the largest ASEAN state - and arguably one of Australia's most important bi-lateral relationships.This week is set against the backdrop of the post-colonial emergence of the modern state of Indonesia. Background reading will familiarize you with key moments in history including the Suharto New Order Period and the transition to democracy in the early 2000's.</p>\n<p>We reflect on Australia-Indonesia bilateral relations, the outcome of the 2024 Indonesian National Election, and foreign policy directions of the new Prabowo administration. Students are encouraged to share their own views on Indonesia's future role in ASEAN and consider the major factors driving contemporary Indonesian foreign policy.</p>\n<p>Panel discussion with Australian and Indonesia scholars/commentators (to be confirmed)</p>\n<p><strong>Discussion Focus</strong></p>\n<p>Can Indonesia play a greater role as ASEAN's 'Middle Power' as the regional security order in the Indo-Pacific evolves? (See Abbondanza 2022)</p>\n<p>Australia-Indonesia defence and security outlooks: patterns of convergence and divergence.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Week 8: Indonesia: ASEAN's Middle Power?</strong>",
            "topic_description": "Week 8: Indonesia: ASEAN's Middle Power? This session focuses on Indonesia - the largest ASEAN state - and arguably one of Australia's most important bi-lateral relationships.This week is set against the backdrop of the post-colonial emergence of the modern state of Indonesia. Background reading will familiarize you with key moments in history including the Suharto New Order Period and the transition to democracy in the early 2000's. We reflect on Australia-Indonesia bilateral relations, the outcome of the 2024 Indonesian National Election, and foreign policy directions of the new Prabowo administration. Students are encouraged to share their own views on Indonesia's future role in ASEAN and consider the major factors driving contemporary Indonesian foreign policy. Panel discussion with Australian and Indonesia scholars/commentators (to be confirmed) Discussion Focus Can Indonesia play a greater role as ASEAN's 'Middle Power' as the regional security order in the Indo-Pacific evolves? (See Abbondanza 2022) Australia-Indonesia defence and security outlooks: patterns of convergence and divergence.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9: India as an 'Indo-Pacific' Power</strong><br/><p>In this session we explore the emergence of India as an 'Asia-Pacific'/'Indo-Pacific' power. In recent years India has expanded its strategic relationships with key regional states, including Japan, Australia and the US, and continues to explore trade and economic opportunities for the burgeoning Indian economy. We explore the strategic drivers of India's foreign policy in the region and its involvement with bilateral, multilateral (ASEAN) and <em>adhoc</em> security architecture such as the 'Quad' with Australia, Japan and the US.</p>\n<p><strong>Discussion Questions</strong></p>\n<p>What are the strategic drivers of India's foreign policy in the region?</p>\n<p>What strategies has India used to manage its multifaceted relationships in the 'Indo-Pacific'?</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Week 9: India as an 'Indo-Pacific' Power</strong>",
            "topic_description": "Week 9: India as an 'Indo-Pacific' Power In this session we explore the emergence of India as an 'Asia-Pacific'/'Indo-Pacific' power. In recent years India has expanded its strategic relationships with key regional states, including Japan, Australia and the US, and continues to explore trade and economic opportunities for the burgeoning Indian economy. We explore the strategic drivers of India's foreign policy in the region and its involvement with bilateral, multilateral (ASEAN) and adhoc security architecture such as the 'Quad' with Australia, Japan and the US. Discussion Questions What are the strategic drivers of India's foreign policy in the region? What strategies has India used to manage its multifaceted relationships in the 'Indo-Pacific'?",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 10(04 May - 10 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10: Regional Security in Southeast Asia. Case Study: The South China Sea</strong><br/><p>In this interaction session, we explore regional security cooperation in Southeast Asia via a case study on the <strong>South China Sea</strong> (or the <strong>West Philippine Sea</strong>) maritime dispute. Core discussion questions will include the role of ASEAN, bi-lateral security cooperation between claimant states, and role of other states external to the region (including the US, India, Australia and the US).</p>\n<p><strong>Discussion Questions</strong></p>\n<p>What role can ASEAN play in regional security dialogue on issues of geo-strategic significance like the South China Sea. Is its relevance (i.e 'ASEAN Centrality') waning?</p>\n<p>Outline China's policy position on the 9 dash line? How does China justify its claims of maritime sovereignty over the South China Sea?</p>\n<p>Evaluate the policy options available to resolve - or ameliorate - maritime disputes in the South China Sea.</p></p><p><strong>Learning outcomes:</strong> L01, L05</p></div></td>",
            "topic_title": "<strong>Week 10: Regional Security in Southeast Asia. Case Study: The South China Sea</strong>",
            "topic_description": "Week 10: Regional Security in Southeast Asia. Case Study: The South China Sea In this interaction session, we explore regional security cooperation in Southeast Asia via a case study on the South China Sea (or the West Philippine Sea ) maritime dispute. Core discussion questions will include the role of ASEAN, bi-lateral security cooperation between claimant states, and role of other states external to the region (including the US, India, Australia and the US). Discussion Questions What role can ASEAN play in regional security dialogue on issues of geo-strategic significance like the South China Sea. Is its relevance (i.e 'ASEAN Centrality') waning? Outline China's policy position on the 9 dash line? How does China justify its claims of maritime sovereignty over the South China Sea? Evaluate the policy options available to resolve - or ameliorate - maritime disputes in the South China Sea.",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11: Non-Traditional Security Issues: Climate Change and migration in the Pacific</strong><br/><p>As argued by Ramsay et. al. (2023), '<em>climate change is an existential threat for Pacific Island countries that can lead to the risk of displacement and migration for families and communities across the region.This ‘forced’ migration means the loss of ancestral homelands, unique and lasting ties to land, and vital cultural identities.'</em> </p>\n<p>In Weeks 11 and 12 we focus on non-traditional security issues via the lens of human mobility. In Week 11 we briefly review the emergence of non-traditional security issues into International Relations theory and practice, and then explore the  issue of <strong>climate induced migration</strong> in the Pacific Islands. </p>\n<p>Dr Melissa Curley</p>\n<p><strong>Discussion Focus:</strong></p>\n<p>How is climate change impacting on the livelihoods and patterns of human movement in the Pacific Islands. What strategies are Pacific Island States using to advocate for regional and global action to curb climate change?</p>\n<p>How are communities, civil society, states and international organisations and institutions responding to this crisis? [Borders, territoriality, immigration, citizenship, livelihoods, identity, culture, land].</p>\n<p>Case studies of 'force climate migrants' - impact on their lives, families and connection to land.</p></p><p><strong>Learning outcomes:</strong> L01, L05</p></div></td>",
            "topic_title": "<strong>Week 11: Non-Traditional Security Issues: Climate Change and migration in the Pacific</strong>",
            "topic_description": "Week 11: Non-Traditional Security Issues: Climate Change and migration in the Pacific As argued by Ramsay et. al. (2023), ' climate change is an existential threat for Pacific Island countries that can lead to the risk of displacement and migration for families and communities across the region.This ‘forced’ migration means the loss of ancestral homelands, unique and lasting ties to land, and vital cultural identities.' In Weeks 11 and 12 we focus on non-traditional security issues via the lens of human mobility. In Week 11 we briefly review the emergence of non-traditional security issues into International Relations theory and practice, and then explore the  issue of climate induced migration in the Pacific Islands. Dr Melissa Curley Discussion Focus: How is climate change impacting on the livelihoods and patterns of human movement in the Pacific Islands. What strategies are Pacific Island States using to advocate for regional and global action to curb climate change? How are communities, civil society, states and international organisations and institutions responding to this crisis? [Borders, territoriality, immigration, citizenship, livelihoods, identity, culture, land]. Case studies of 'force climate migrants' - impact on their lives, families and connection to land.",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        },
        {
            "learning_period": "Week 12(18 May - 24 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12: Non-Traditional Security Issues: Case Study of Atrocities against Rohingya people</strong><br/><p>In Week 12 we continue our focus on migration and explore the intersections between trafficking in persons and transnational organised crime, and norms of protection for asylum seekers, refugees, and victims of TIP and migrant smuggling. Drawing from a case study of the Rohingya peoples, who have fled violence against them in Myanmar, we explore how INGOs, states and communities try to combat this complex multi-jurisdictional issue - and advocate for justice for atrocities committed.</p>\n<p>We also explore the current case brought by Gambia in 2019 in the International Court of Justice (ICJ), accusing the Myanmar state of genocide (part of crimes against humanity) after ethnic cleansing of Rohingya in 2017 onwards. Rohingya people fled Myanmar to Bangladesh where over 1.1 million refugees remain today, mostly in Cox's Bazaar refugee camp. Recent cuts to USAID have severely cut funding to this camp as well as many other humanitarian and health/development programmes in Southeast Asia.</p>\n<p><strong>Discussion Questions/Activities:</strong></p>\n<p>Connections between atrocity crimes/violence and trafficking in persons/migrant smuggling</p>\n<p>ASEAN responses to trafficking of Rohingya (State based and ASEAN based)</p>\n<p>Combatting TIP in Southeast Asia: law enforcement and criminal law.</p>\n<p><br/></p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 12: Non-Traditional Security Issues: Case Study of Atrocities against Rohingya people</strong>",
            "topic_description": "Week 12: Non-Traditional Security Issues: Case Study of Atrocities against Rohingya people In Week 12 we continue our focus on migration and explore the intersections between trafficking in persons and transnational organised crime, and norms of protection for asylum seekers, refugees, and victims of TIP and migrant smuggling. Drawing from a case study of the Rohingya peoples, who have fled violence against them in Myanmar, we explore how INGOs, states and communities try to combat this complex multi-jurisdictional issue - and advocate for justice for atrocities committed. We also explore the current case brought by Gambia in 2019 in the International Court of Justice (ICJ), accusing the Myanmar state of genocide (part of crimes against humanity) after ethnic cleansing of Rohingya in 2017 onwards. Rohingya people fled Myanmar to Bangladesh where over 1.1 million refugees remain today, mostly in Cox's Bazaar refugee camp. Recent cuts to USAID have severely cut funding to this camp as well as many other humanitarian and health/development programmes in Southeast Asia. Discussion Questions/Activities: Connections between atrocity crimes/violence and trafficking in persons/migrant smuggling ASEAN responses to trafficking of Rohingya (State based and ASEAN based) Combatting TIP in Southeast Asia: law enforcement and criminal law.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13(25 May - 31 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13. Conclusion and Exam Preparation</strong><br><p>IR scholars agree that Asia-Pacific regional order is changing. This seminar concludes the course with a discussion of potential 'regional futures'. We review themes of order, power and the future role of the US and China in the region, human rights, protection of citizens, and regional collaboration via civil society networks. Our final session will be a interactive discussion on what are the determinants of that change and how can actors in the region manage it peacefully?</p>\n<p><strong>Discussion Focus:</strong></p>\n<p>We complete and discuss a <strong>'Roses, Buds and Thorns' </strong>exercise allowing students to reflect on the opportunities and challenges facing IR in the region, from their perspective. Details and instructions will be emailed to students in Week 12. Students should post their response (300 words) to the 'Roses, Buds and Thorns' exercise on POLS7208 UQ Padlet page <em>prior to the final seminar.</em></p>\n<p>Exam Preparation - Guidance and tips to prepare for the end of semester exam.</p>\n<p>Dr Melissa Curley</p></br></p><p><strong>Learning outcomes:</strong> L02, L05</p></div></td>",
            "topic_title": "<strong>Week 13. Conclusion and Exam Preparation</strong>",
            "topic_description": "Week 13. Conclusion and Exam Preparation IR scholars agree that Asia-Pacific regional order is changing. This seminar concludes the course with a discussion of potential 'regional futures'. We review themes of order, power and the future role of the US and China in the region, human rights, protection of citizens, and regional collaboration via civil society networks. Our final session will be a interactive discussion on what are the determinants of that change and how can actors in the region manage it peacefully? Discussion Focus: We complete and discuss a 'Roses, Buds and Thorns' exercise allowing students to reflect on the opportunities and challenges facing IR in the region, from their perspective. Details and instructions will be emailed to students in Week 12. Students should post their response (300 words) to the 'Roses, Buds and Thorns' exercise on POLS7208 UQ Padlet page prior to the final seminar. Exam Preparation - Guidance and tips to prepare for the end of semester exam. Dr Melissa Curley",
            "learning_outcomes": [
                "L02",
                "L05"
            ]
        }
    ]
}