{
    "course_title": "Global Security",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/POLS2209-21473-7620",
    "full_course_code": "POLS2209-21473-7620",
    "course_code": "POLS2209",
    "class_code": "21473",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Critically analyse learning materials, interrogating their assumptions and limitations"
        },
        {
            "number": "LO2.",
            "description": "Apply methods and theories of security to understand and/or examine contemporary issues"
        },
        {
            "number": "LO3.",
            "description": "Examine contemporary security issues in global politics and develop innovative analyses and solutions to those issues"
        },
        {
            "number": "LO4.",
            "description": "Demonstrate an understanding and appreciation of the cultural context in which course materials and disciplinary debates take place, and awareness of alternative (Indigenous and post-colonial) perspectives to dominant approaches to the study of security."
        },
        {
            "number": "LO5.",
            "description": "Wield intellectual tools and develop skills that will make you more competitive in your future professional activities in a variety of fields and positions."
        },
        {
            "number": "LO6.",
            "description": "Understand, and comply with, the norms of scholarly writing and academic conduct."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Weekly Quizzes (14 marks based on 7 weekly quiz scores)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>14%</dd>",
            "due_date": "<dd><p> 4/03/2026 - 20/05/2026</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>There will be ten (10) written quizzes held in the workshop beginning in Week 2 and concluding in Week 12 on the following dates: March 4, 11, 18 and 25; April 15, 22, 29; and May 6, 13 and 20.</p>\n<p>In each of these teaching weeks, students will have 10 minutes to answer four short answer/multiple-choice questions based on a combination of required readings and PowerPoint slides provided in advance of each week. Each question is worth 0.5 marks each, amounting to two (2) marks available each teaching week. Examples of the form of question will be made available on Blackboard and discussed in Week 1.</p>\n<p>Students will not be allowed to use books, computers, phones or any written material during the quiz. As responses to quiz questions are either correct or incorrect, no rubric/criteria for this assessment is available on Blackboard.</p>\n<p><em>Please note that the time the quiz is offered vary from week to week, but it will usually occur at the conclusion of the teaching activity for that week.</em></p>\n<p>There are 10 (ten) opportunities to take the quiz, but you only need to do it 7 (seven) times, forming 14% of your grade. If you do more than 7 quizzes, we will select your top 7 results. This means that you can miss up to three quizzes without a penalty. <em>Please note that there are </em>NO <em>opportunities to re-take individual quizzes and no alternative assessment available except in the very specific circumstances outlined below. </em>If you do more than 7 quizzes, you can improve your grade as we will take your top results. Also note that the last quiz is held in Week 12, so please do plan accordingly.</p>\n<p><strong>Alternative Assessment</strong></p>\n<p>If you have a Student Access Plan that applies to the quiz, please contact Matt ASAP.</p>\n<p>The quizzes are scheduled to take 10 minutes in order to provide extra time for any student who requires that extra time in a Disability Action Plan. If your Student Access Plan requires you to have additional extra time, please get in touch as soon as possible to discuss alternatives.</p>\n<p>If a student has a genuine (documented) reason they have been unable to attend the workshop on 7 occasions, a make up test will be offered late in the semester. You are NOT eligible for the make-up quiz if you:</p>\n<ul>\n<li>miss a week or two because you are sick (you can miss up to three quizzes with no loss of grades)</li>\n<li>don't plan ahead and miss too many quizzes early in the semester</li>\n</ul>\n<p>The make-up quiz is <em>only </em>available to students who have a genuine, documented reason for missing more than three teaching activities in which a quiz is scheduled. Reasons may include work commitments that cannot be altered; sudden/serious illness that requires a lengthy absence; or another documented reason for a lengthy absence.</p>\n<p>To be eligible for alternative assessment, you must contact Matt by FRIDAY 22 MAY with your documentation.</p>\n<p>There will be <em>one</em> make-up test offered, with students given plenty of notice of the date.</p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Quizzes will be handed out during the relevant teaching week, then collected after the 10 minute deadline has passed.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>All exams will be collected promptly at the end of the 10 minutes allocated.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Crisis Briefing (1000 words)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 26/03/2026 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This piece of assessment (maximum 1000 words AND 2 pages excluding bibliography) requires students to identify an existing security ‘crisis’ in world politics, and to provide a briefing document that outlines the nature of the crisis, its urgency, the appropriate response and responders, and why this constitutes a <em>security</em> crisis. This briefing, similar to reports developed by organizations such as the International Crisis Group, should clearly target relevant stakeholders to articulate a clear and compelling case for action in response to an ongoing security crisis. Examples are available on Blackboard.</p>\n<p>This briefing should be set in the present, must contain no in-text references (a separate bibliography is to be provided), and should be no more than 1000 words in length or 2 pages in length (excluding the bibliography, which should begin on p3). If the version visible on Blackboard (excluding bibliography) is longer than either 1100 words OR 2 pages you will be penalised (10%- 2.5 marks). You are also required to adhere to a particular template, with suggested word limits applying to each. This template is below, also evident in the examples on Blackboard.</p>\n<p>Template</p>\n<ol>\n<li>What is the issue (no more than 100 words): what is the crisis?</li>\n<li>Why is this urgent (no more than 100 words): why does this issue require the immediate attention of particular stakeholders (whether national decision-makers or the international community more broadly)?</li>\n<li>Who should act (no more than 100 words): which actors specifically are you calling on to respond to this crisis?</li>\n<li>What should be done (no more than 100 words): what exactly are you asking the above actors to do?</li>\n<li>How is this a ‘security’ crisis (no more than 100 words): make it clear how this connects to the course content by being clear about why this can be viewed as an issue of security.</li>\n<li>Overview (no more than 500 words): this is your opportunity to outline all of the above at length, giving more background and detail to areas of the briefing that might have been missed in the briefer summary at the start.</li>\n</ol>\n<p>A criteria sheet is available on Blackboard, an example briefing is also available on Blackboard. Students should also consult briefs produced by the <a href=\"https://www.crisisgroup.org/latest-updates/briefing\">(International) Crisis Group</a></p>\n<p>Crisis Briefings are to be submitted electronically through Turnitin by 2pm on Thursday, 26th March.</p>\n<p>No in-text referencing or footnotes are required for this piece of assessment, and should be avoided to ensure consistency with the assessment type (see the example on Blackboard).</p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Please submit your Crisis Briefing via the link provided on Blackboard (under Assessment).</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Research Essay (2000 words)",
            "special_indicators": [],
            "weighting": "<dd>31%</dd>",
            "due_date": "<dd><p> 22/05/2026 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Each student will write a research essay of 2000 words due at 2pm on Friday 22nd May. A list of essay questions are available on Blackboard, or students may choose a topic of their own with approval from the course coordinator by 22nd April - one month prior to the essay deadline.</p>\n<p>A full list of marking criteria is available on Blackboard, but as a general guide the essay should attempt to develop a clear argument in response to the question, one supported by significant engagement with literature on that topic. The course outline’s recommended readings should provide some guidance for reading material relevant to your topic, and all essays must draw on at least 3 sources from the course recommended reading list - failure to do so will incur a 20% (6 marks) penalty. The essay should also attempt to engage at some level with theories and conceptual frameworks associated with security in international relations, although the extent of engagement depends on the question chosen. Finally, students should acknowledge and engage with counter-arguments to maximize the strength of their conclusions.</p>\n<p>Assignments must be typed (1.5 spaced), fully referenced and include a reference list (not a bibliography). All assignments submitted are to be the original and individual work of the student submitting them. The assignment must be submitted electronically through Turnitin in Word form (not PDF). Penalties will apply for late submissions (10% per day) and excessive variation from the set word limit - more than 10% variation from the word limit will result in a penalty of 10%.</p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit your Essay via the link provided on Blackboard (under Assessment), specifying your chosen question (e.g. Q2 Theory).</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Final Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>6/06/2026 - 20/06/2026</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The final piece of assessment for this course will be a central exam conducted in the central exam period.</p>\n<p>Students will have 2 hours to complete the exam. Students will be required to answer two questions in essay form. Students will be required to complete one question from Part A of the exam question list and the other from Part B. The topics covered in Part A correspond approximately with the workshops in the first half of the course (from 'Introduction' to 'Great Power Security Politics'), while the topics covered in Part B correspond with the workshops in the second half of the course (from 'Global Security Governance' to 'The Future of Security and War'). Students will choose one of 6 possible questions from Part A and one of 6 possible questions from Part B.</p>\n<p>Each of the two questions will be worth 15 marks. The maximum score for the exam will be 30 marks.</p>\n<p>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 1: Introduction</strong><br><ul>\n<li>What is Security?</li>\n<li>What to expect from this course</li>\n<li>Administrative Introduction</li>\n</ul></br></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Workshop 1: Introduction</strong>",
            "topic_description": "Workshop 1: Introduction What is Security? What to expect from this course Administrative Introduction",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 2(02 Mar - 08 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 2: Theories of Global Security</strong><br><p>Traditional Security</p>\n<ul>\n<li>Realism</li>\n<li>Liberalism</li>\n</ul>\n<p>Critical Security</p>\n<ul>\n<li>Constructivism</li>\n<li>Critical Theories</li>\n</ul>\n<p>Discussion Points:</p>\n<ul>\n<li>What are the key differences between traditional and critical approaches to security?</li>\n<li>What are the strengths and weaknesses of different theoretical approaches to security?</li>\n<li>Which security approaches best capture the dynamics of global security?</li>\n</ul>\n<p>Quiz 1</p></br></p></div></td>",
            "topic_title": "<strong>Workshop 2: Theories of Global Security</strong>",
            "topic_description": "Workshop 2: Theories of Global Security Traditional Security Realism Liberalism Critical Security Constructivism Critical Theories Discussion Points: What are the key differences between traditional and critical approaches to security? What are the strengths and weaknesses of different theoretical approaches to security? Which security approaches best capture the dynamics of global security? Quiz 1",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 3: Clausewitz &amp; the Changing Nature of War</strong><br><ul>\n<li>Clausewitz on War</li>\n<li>Classical Thought on War</li>\n<li>New Wars and Spectator Sport Wars</li>\n<li>Revolution in Military Affairs</li>\n<li>Cyberwar</li>\n<li>Privatization of war</li>\n</ul>\n<p>Discussion Points:</p>\n<ul>\n<li>What are Clausewitz's central claims about strategy and warfare?</li>\n<li>Do these claims apply in the context of the changing nature of warfare?</li>\n<li>What are the most important changes to warfare?</li>\n</ul>\n<p>Quiz 2</p></br></p></div></td>",
            "topic_title": "<strong>Workshop 3: Clausewitz &amp; the Changing Nature of War</strong>",
            "topic_description": "Workshop 3: Clausewitz & the Changing Nature of War Clausewitz on War Classical Thought on War New Wars and Spectator Sport Wars Revolution in Military Affairs Cyberwar Privatization of war Discussion Points: What are Clausewitz's central claims about strategy and warfare? Do these claims apply in the context of the changing nature of warfare? What are the most important changes to warfare? Quiz 2",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 4: Causes of War</strong><br/><ul>\n<li>War and the Levels of Analysis</li>\n<li>Regime Type: Democratic Peace Thesis</li>\n<li>Identity: Clash of Civilizations</li>\n<li>Resources: Arms Trade</li>\n</ul>\n<p>Discussion Points:</p>\n<ul>\n<li>What are the key drivers of conflict?</li>\n<li>Why do democracies not tend to go to war with each other?</li>\n<li>How compelling is Huntington's 'clash of civilisations' thesis?</li>\n<li>Is the arms trade a contributor to war?</li>\n</ul>\n<p>Preparing your Crisis Briefing</p>\n<p>Quiz 3</p></p></div></td>",
            "topic_title": "<strong>Workshop 4: Causes of War</strong>",
            "topic_description": "Workshop 4: Causes of War War and the Levels of Analysis Regime Type: Democratic Peace Thesis Identity: Clash of Civilizations Resources: Arms Trade Discussion Points: What are the key drivers of conflict? Why do democracies not tend to go to war with each other? How compelling is Huntington's 'clash of civilisations' thesis? Is the arms trade a contributor to war? Preparing your Crisis Briefing Quiz 3",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 5: The Use and Threat of Force</strong><br/><ul>\n<li>Effectiveness of War</li>\n<li>Effectiveness of Deterrence</li>\n<li>Coercive Diplomacy</li>\n<li>Security Dilemma and Perception</li>\n<li>Nonviolence</li>\n</ul>\n<p>Discussion Points</p>\n<ul>\n<li>Is war a rational exercise?</li>\n<li>When and how does coercive diplomacy work?</li>\n<li>Is the security dilemma an inevitable feature of world politics?</li>\n<li>How do we overcome the problems of perception?</li>\n<li>Is nonviolence a more appropriate and effective form of political struggle?</li>\n</ul>\n<p>Quiz 4</p></p></div></td>",
            "topic_title": "<strong>Workshop 5: The Use and Threat of Force</strong>",
            "topic_description": "Workshop 5: The Use and Threat of Force Effectiveness of War Effectiveness of Deterrence Coercive Diplomacy Security Dilemma and Perception Nonviolence Discussion Points Is war a rational exercise? When and how does coercive diplomacy work? Is the security dilemma an inevitable feature of world politics? How do we overcome the problems of perception? Is nonviolence a more appropriate and effective form of political struggle? Quiz 4",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>No classes</strong><br/></p></div></td>",
            "topic_title": "<strong>No classes</strong>",
            "topic_description": "No classes",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid-sem break(06 Apr - 12 Apr)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-Semester Break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-Semester Break</strong>",
            "topic_description": "Mid-Semester Break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 6: Great Power Security Politics</strong><br/><ul>\n<li>America in Decline?</li>\n<li>Rising China?</li>\n<li>Resurgent Russia?</li>\n<li>Case Studies: Ukraine War, Syria War, South China Sea</li>\n</ul>\n<p>Possible Topics for Discussion:</p>\n<ul>\n<li>Is the US still hegemonic? Is Trump a game-changer for US foreign policy and global security?</li>\n<li>Will China rise peacefully?</li>\n<li>Is Russia under Putin resurgent?</li>\n<li>Was Syria a proxy war?</li>\n<li>How do you solve a problem like (North) Korea?</li>\n</ul>\n<p>Quiz 5</p></p></div></td>",
            "topic_title": "<strong>Workshop 6: Great Power Security Politics</strong>",
            "topic_description": "Workshop 6: Great Power Security Politics America in Decline? Rising China? Resurgent Russia? Case Studies: Ukraine War, Syria War, South China Sea Possible Topics for Discussion: Is the US still hegemonic? Is Trump a game-changer for US foreign policy and global security? Will China rise peacefully? Is Russia under Putin resurgent? Was Syria a proxy war? How do you solve a problem like (North) Korea? Quiz 5",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 7: Global Security Governance</strong><br/><ul>\n<li>Just War, Laws of War</li>\n<li>United Nations</li>\n<li>Regional (security) organizations</li>\n<li>Peace operations</li>\n<li>Responsibility to Protect (R2P)</li>\n</ul>\n<p>Discussion Points:</p>\n<ul>\n<li>Do norms and rules of war constrain the use of force?</li>\n<li>What are the key challenges facing peace operations?</li>\n<li>How significant is R2P in redefining sovereignty and international security? - Is the UN effective in maintaining international peace and security?</li>\n<li>Are regional organizations significant security actors?</li>\n</ul>\n<p>Quiz 6</p></p></div></td>",
            "topic_title": "<strong>Workshop 7: Global Security Governance</strong>",
            "topic_description": "Workshop 7: Global Security Governance Just War, Laws of War United Nations Regional (security) organizations Peace operations Responsibility to Protect (R2P) Discussion Points: Do norms and rules of war constrain the use of force? What are the key challenges facing peace operations? How significant is R2P in redefining sovereignty and international security? - Is the UN effective in maintaining international peace and security? Are regional organizations significant security actors? Quiz 6",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 8: Intrastate War</strong><br/><ul>\n<li>Intrastate War</li>\n<li>Ethnic Conflict</li>\n<li>New Wars</li>\n<li>State Fragility, State Failure</li>\n</ul>\n<p>Discussion Points</p>\n<ul>\n<li>What are the major causes of intrastate war?</li>\n<li>Is there such a thing as 'ethnic' conflict?</li>\n<li>How significant is the threat of fragile or failing states? To whom?</li>\n</ul>\n<p>Quiz 7</p></p></div></td>",
            "topic_title": "<strong>Workshop 8: Intrastate War</strong>",
            "topic_description": "Workshop 8: Intrastate War Intrastate War Ethnic Conflict New Wars State Fragility, State Failure Discussion Points What are the major causes of intrastate war? Is there such a thing as 'ethnic' conflict? How significant is the threat of fragile or failing states? To whom? Quiz 7",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(04 May - 10 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 9: Terrorism and Insurgency</strong><br/><ul>\n<li>Terrorism</li>\n<li>Counter-terror and the War on Terror</li>\n<li>Insurgency</li>\n<li>Counter-insurgency</li>\n</ul>\n<p>Discussion Points:</p>\n<ul>\n<li>How significant is the threat of terrorism?</li>\n<li>Is the War on Terror over?</li>\n<li>What does successful counter-insurgency look like?</li>\n</ul>\n<p>Quiz 8</p></p></div></td>",
            "topic_title": "<strong>Workshop 9: Terrorism and Insurgency</strong>",
            "topic_description": "Workshop 9: Terrorism and Insurgency Terrorism Counter-terror and the War on Terror Insurgency Counter-insurgency Discussion Points: How significant is the threat of terrorism? Is the War on Terror over? What does successful counter-insurgency look like? Quiz 8",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 10: Security in the Anthropocene</strong><br/><ul>\n<li>Anthropocene and planetary security</li>\n<li>Nuclear Weapons</li>\n<li>Environmental Change</li>\n<li>Climate Change</li>\n</ul>\n<p>Discussion Points</p>\n<ul>\n<li>Is the Anthropocene a game-changer for IR and security?</li>\n<li>Are nuclear weapons a source of security or a threat to it?</li>\n<li>Is climate change the ultimate existential threat?</li>\n</ul>\n<p>Quiz 9</p></p></div></td>",
            "topic_title": "<strong>Workshop 10: Security in the Anthropocene</strong>",
            "topic_description": "Workshop 10: Security in the Anthropocene Anthropocene and planetary security Nuclear Weapons Environmental Change Climate Change Discussion Points Is the Anthropocene a game-changer for IR and security? Are nuclear weapons a source of security or a threat to it? Is climate change the ultimate existential threat? Quiz 9",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(18 May - 24 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 11: Securitization and the 'New' Security Agenda</strong><br/><ul>\n<li>Securitization</li>\n<li>Human Security</li>\n<li>Poverty</li>\n<li>Disease</li>\n<li>Women, Peace and Security</li>\n</ul>\n<p>Discussion Points:</p>\n<ul>\n<li>Has the security agenda been redefined?</li>\n<li>Should security be expanded to include non-military threats?</li>\n<li>Have issues like disease been securitized?</li>\n<li>Should security be defined in terms of 'human security'?</li>\n</ul>\n<p>Quiz 10</p></p></div></td>",
            "topic_title": "<strong>Workshop 11: Securitization and the 'New' Security Agenda</strong>",
            "topic_description": "Workshop 11: Securitization and the 'New' Security Agenda Securitization Human Security Poverty Disease Women, Peace and Security Discussion Points: Has the security agenda been redefined? Should security be expanded to include non-military threats? Have issues like disease been securitized? Should security be defined in terms of 'human security'? Quiz 10",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(25 May - 31 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 12: Review/ The Future of Security and War</strong><br/><ul>\n<li>Review of the Course</li>\n<li>Exam Preparation</li>\n<li>The Future of Security</li>\n<li>Course Evaluation</li>\n</ul></p></div></td>",
            "topic_title": "<strong>Workshop 12: Review/ The Future of Security and War</strong>",
            "topic_description": "Workshop 12: Review/ The Future of Security and War Review of the Course Exam Preparation The Future of Security Course Evaluation",
            "learning_outcomes": []
        }
    ]
}