{
    "course_title": "Portfolio & Synthesis",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SLAT7852-20878-7620",
    "full_course_code": "SLAT7852-20878-7620",
    "course_code": "SLAT7852",
    "class_code": "20878",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand and interpret the challenges in real-world employment."
        },
        {
            "number": "LO2.",
            "description": "Identify your strengths and develop strategies to develop own professional attributes and transferable skills."
        },
        {
            "number": "LO3.",
            "description": "Compose digitally-curated evidence and evaluate strengths towards meeting a niche in the job market."
        },
        {
            "number": "LO4.",
            "description": "Collaborate with peers and value the importance of teamwork."
        },
        {
            "number": "LO5.",
            "description": "Engage with representatives in language-related industries to obtain work-related knowledge and skills."
        },
        {
            "number": "LO6.",
            "description": "Synthesise resources and articulate a developing professional identity as a language professional."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "MY CAREER ADVISER",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> PASS or FAIL </dd>",
            "due_date": "<dd><p> 2/03/2026 - 29/05/2026</p>\n<p>\n</p><p>WEEKLY</p>\n<p>Participation tracking will begin from WEEK 2 and end at 4:00pm on Friday of WEEK 13.</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Participation/ Student contribution",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>My Career Adviser (MCA) is a self-paced learning platform. MCA contains a wide range of resources and activities that will help you establish a competitive foundation for future professional career choices. Students are recommended to complete each module fortnightly.</p>\n<p><strong>Important</strong></p>\n<ul>\n<li>There are four online modules: Get Started, Find Opportunities, Unpack Your Learning, and Next Step. The modules are designed to be completed in sequence, and students are advised to complete each module fortnightly.</li>\n<li>Each module takes two to four hours to complete, depending on the content covered.</li>\n<li>Participation tracking will begin from Week 2 and end at 4:00pm on Friday of Week 13. Activities completed after this time will not count towards your online participation score.</li>\n</ul>\n<p><strong>Marking Criteria (Hurdle requirement of this assessment)</strong></p>\n<p>The grading for the My Career Adviser assessment is as follows.</p>\n<ul>\n<li>To be awarded a <strong>PASS</strong> for this assessment activity, students <strong>must complete 85% or more of the online activities.</strong></li>\n<li>An online activity completion rate of less than 85% will result in a FAIL grade for the SLAT7852 course.</li>\n</ul>\n<p><strong>__________________________________________________________________________________</strong></p>\n<p><strong>Statement on use of generative Artificial Intelligence (AI) &amp; Machine Translation (MT)</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission, independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>All activities completed on My Career Adviser (MCA) are undertaken via a self-paced online learning platform.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "DIGITAL CAREER PORTFOLIO",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40% (10% Cover Letter, 15% 2. Personal Value Proposition, 15% STAR Response to Selection Criteria) </dd>",
            "due_date": "<dd><p>PART 1 - WEEK 3 - 13/03/2026 4:00 pm</p>\n<p>PART 2 - WEEK 5 - 27/03/2026 4:00 pm</p>\n<p>PART 3 - WEEK 7 - 17/04/2026 4:00 pm</p>\n<p>\n</p><p>4pm, Friday of designated weeks. </p>\n<p>Each part of the submission must include the handwritten work completed in class.</p></dd>",
            "learning_objectives": null,
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You will develop a <strong>digital career ePortfolio</strong> using <strong>Adobe Express</strong> or <strong>Wix</strong>. If you already maintain a <strong>blog or vlog</strong>, you are encouraged to use your existing platform to develop this ePortfolio.</p>\n<p>This assessment provides an opportunity to build a digital career portfolio and establish a foundation for future employment in the field of <strong>Applied Linguistics</strong>. Through completion of the ePortfolio, you will be able to:</p>\n<ul>\n<li>Articulate achievements and professional strengths, including professional attributes and transferable skills and knowledge</li>\n<li>Curate and showcase learning experiences by identifying and presenting professional strengths</li>\n<li>Create a personal webpage to promote your professional practice and career goals in a chosen future field</li>\n</ul>\n<p>This assessment consists of <strong>three parts</strong>, each of which is submitted and assessed <strong>separately</strong>:</p>\n<ul>\n<li>Part 1: 10%</li>\n<li>Part 2: 15%</li>\n<li>Part 3: 15%</li>\n<li>(<strong>Total: 40%)</strong></li>\n</ul>\n<p>You may choose to develop the ePortfolio as:</p>\n<ul>\n<li>A <strong>single, integrated portfolio</strong>, or</li>\n<li><strong>Three distinct sections</strong>, developed progressively across the semester.</li>\n</ul>\n<p>You are encouraged to take responsibility for your own learning and to demonstrate creativity appropriate to your role as a developing language professional.</p>\n<p><strong>Submission Requirements</strong></p>\n<p>Each part of the submission must include the <strong>handwritten work completed in class</strong>. This handwritten work must be included in the ePortfolio as evidence of progress and provided in one of the following ways:</p>\n<ul>\n<li>Uploaded directly to the ePortfolio (as scanned copies or clear photographs), or</li>\n<li>Included as a clearly labelled hyperlink within the ePortfolio that links to the relevant file.</li>\n</ul>\n<p>If the handwritten work is <strong>not included</strong> in the ePortfolio submission, the assessment will be awarded a mark of <strong>zero (0)</strong>.</p>\n<p><strong>__________________________________________________________________________________</strong></p>\n<p><strong>PART 1 – Digital career portfolio: Cover letter (10%)</strong></p>\n<p><strong>Due date: Friday Week 3</strong></p>\n<p><strong>Word limit: Approximately 400 words</strong></p>\n<p><strong>Submission: Blackboard</strong></p>\n<p><strong>Task Description</strong></p>\n<p>In <strong>Part 1</strong> of this assessment, you will select <strong>one job advertisement</strong> from the <em>Job Advertisement</em> folder on Blackboard and submit a <strong>cover letter</strong> tailored to the chosen position.</p>\n<p>Your cover letter must:</p>\n<ul>\n<li>Identify <strong>three key strengths</strong>, and</li>\n<li><strong>Critically justify</strong> why you are a strong candidate for the position.</li>\n</ul>\n<p>In developing your cover letter, you may consider the following guiding questions:</p>\n<ul>\n<li>Which knowledge, attributes, or skills are you seeking to communicate?</li>\n<li>Which assessment items and/or courses within the MA program best represent your strengths?</li>\n<li>How do your current professional knowledge and skills align with the requirements of the advertised position?</li>\n</ul>\n<p>You are encouraged to review the <em>Get Started</em> module in <strong>My Career Adviser</strong> to support your preparation for this task.</p>\n<p>A copy of the <strong>handwritten Activity 2: Create Your Cover Letter</strong>, completed in class, <strong>must be included</strong> in the ePortfolio as part of this submission.</p>\n<p><strong>The intended audience for this component of the digital career portfolio is a professional audience.</strong></p>\n<p><strong>__________________________________________________________________________________</strong></p>\n<p><strong>PART 2 – Digital career portfolio: Personal Value Proposition (15%)</strong></p>\n<p><strong>Due date: Friday Week 5</strong></p>\n<p><strong>Word limit: Approximately 500 words</strong></p>\n<p><strong>Submission: Blackboard</strong></p>\n<p><strong>Task description</strong></p>\n<p>In <strong>Part 2</strong> of this assessment, you will reflect on your learning achievements and professional strengths to develop a <strong>Personal Value Proposition (PVP)</strong>.</p>\n<p>A Personal Value Proposition articulates the <strong>unique future value</strong> you will bring to an organisation. In this task, you will present a PVP that clearly communicates your distinctive capabilities, experiences, and values as an emerging professional in the field of Applied Linguistics.</p>\n<p>You are encouraged to use <strong>metaphors or analogies</strong> to make your Personal Value Proposition engaging and accessible to a professional audience.</p>\n<p>Your Personal Value Proposition must describe your:</p>\n<ul>\n<li>Key strengths, experiences, and professional capabilities</li>\n<li>Passions and values relevant to your intended career pathway</li>\n<li>Capacity to address specific problems or needs within a professional context</li>\n<li>Distinctive benefits or contributions you would bring to an organisation</li>\n</ul>\n<p>In developing your Personal Value Proposition, you may find it helpful to consider the following guiding questions:</p>\n<ul>\n<li>What are your core strengths, passions, and values?</li>\n<li>What problems can you solve that distinguish you from other candidates?</li>\n<li>What benefits do you offer that are particularly valuable or compelling?</li>\n</ul>\n<p>You are encouraged to review the <em>Find Opportunities</em> module in <strong>My Career Adviser</strong> to support your preparation for this task.</p>\n<p>A copy of the <strong>handwritten Personal Value Proposition Worksheet</strong>, completed in class, <strong>must be included</strong> in the ePortfolio as part of this submission.</p>\n<p><strong>The intended audience for this component of the digital career portfolio is a professional audience.</strong></p>\n<p><strong>__________________________________________________________________________________</strong></p>\n<p><strong>PART 3 – Digital career portfolio: STAR response to selection criteria (15%)</strong></p>\n<p><strong>Due date: Friday Week 7</strong></p>\n<p><strong>Word limit: Approximately 600 words (excluding reflection)</strong></p>\n<p><strong>Submission: Blackboard</strong></p>\n<p><strong>Task Description</strong></p>\n<p><strong>Part 3</strong> of this assessment consists of <strong>two components: Part 3(a) and Part 3(b)</strong>. Both components must be submitted for Part 3 to be considered complete.</p>\n<p>In <strong>Part 3 (a)</strong> of this assessment, you will refer to the <strong>same job advertisement selected in Part 1</strong> from the <em>Job Advertisement</em> folder on Blackboard and submit a <strong>response to the selection criteria</strong> for that position.</p>\n<p>Your response must follow the <strong>STAR method</strong> (Situation, Task, Action, Result) and draw on relevant academic, professional, and/or experiential examples to demonstrate your suitability for the role.</p>\n<p>In preparing your STAR responses, you may consider the following guiding questions:</p>\n<ul>\n<li>What relevant real-life examples can you draw on?</li>\n<li>What unique abilities or strengths do you bring to the role?</li>\n<li>How have you applied your skills in authentic or real-world contexts?</li>\n<li>What represents your most significant professional or academic achievement to date?</li>\n</ul>\n<p>You are encouraged to review the <em>Unpack Your Learning</em> module in <strong>My Career Adviser</strong> to support your preparation for this task.</p>\n<p><strong>Part 3 (b)</strong> <strong>Reflection on Learning</strong></p>\n<p><strong>Write a reflection of no more than 200 words</strong> that addresses your learning and professional development across the portfolio process.</p>\n<p>In your reflection, you must consider:</p>\n<ul>\n<li>What you have learnt from in-class interactions,</li>\n<li>Which feedback most influenced the development of your digital career portfolio, and</li>\n<li>What you will seek to improve as a novice language professional in the near future, and why.</li>\n</ul>\n<p>This reflective response is a <strong>mandatory component</strong> of Part 3. Submissions that do <strong>not</strong> include this reflection will be <strong>considered incomplete and will not be marked</strong>.</p>\n<p><strong>Submission Requirements</strong></p>\n<p>Failure to submit both components, Part 3(a) and Part 3(b), will result in Part 3 being deemed incomplete and not marked.</p>\n<p>A copy of the<strong> handwritten “Developing Your Own STAR Bank: Common Interview Questions”</strong> activity, completed in class, <strong>must be included</strong> in the ePortfolio as part of this submission.</p>\n<p><strong>The intended audience for this component of the digital career portfolio is a professional audience.</strong></p>\n<p><strong>__________________________________________________________________________________</strong></p>\n<p><strong>Statement on use of generative Artificial Intelligence (AI) &amp; Machine Translation (MT)</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit an Adobe Express, WiX or your own Blog or Vlog link via Blackboard using SLAT7852 Digital Career Portfolio Coversheet</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "LINKEDIN ARTICLE",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 8/05/2026 4:00 pm</p>\n<p>\n</p><p>4pm, Friday WEEK 10</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Due date: Friday Week 10</strong></p>\n<p><strong>Word limit: 1500 words (maximum)</strong></p>\n<p><strong>Submission: Turnitin</strong></p>\n<p>This assessment builds on reflective work completed earlier in the semester and is designed to support the development and consolidation of your professional identity as an emerging language professional.</p>\n<p>In the <strong>Week 1 workshop</strong>, you wrote a <em>Letter to Yourself</em> addressing the following questions:</p>\n<ul>\n<li>What kind of language professional do you want to be?</li>\n<li>What do you want others to know about you as a professional?</li>\n<li>How might you develop a professional reputation?</li>\n</ul>\n<p>In <strong>Week 9</strong>, this letter will be returned to you during class and will serve as a reflective point of reference for this assessment.</p>\n<p><strong>Note:</strong> If you did not attend the Week 1 workshop and/or did not submit a letter, you are still required to complete the LinkedIn article without reference to this document.</p>\n<p>This assessment consists of <strong>two compulsory parts</strong>:</p>\n<ul>\n<li><strong>Part A: LinkedIn Article (25%)</strong></li>\n<li><strong>Part B: LinkedIn Post (5%)</strong></li>\n</ul>\n<p>The assessment will be considered <strong>incomplete</strong> until <strong>both Part A and Part B</strong> are submitted in accordance with the instructions below.</p>\n<p><strong>_________________________________________________________________________________</strong></p>\n<p><strong>Part A: LinkedIn Article (25%)</strong></p>\n<p><strong>Part 1: Professional Identity (approximately 600 words)</strong></p>\n<p>In this section, you will:</p>\n<ul>\n<li>Identify your selected niche within the field of Applied Linguistics, and</li>\n<li>Explain how your strengths as a graduate position you to meet the requirements of this professional area.</li>\n</ul>\n<p>You must craft or refine a Professional Identity statement that clearly articulates who you are as a professional and the unique value you bring to the industry.</p>\n<p>You should reflect on your learning journey across the MA program by discussing the processes and products involved in completing key assessment items in your courses. These reflections must be explicitly connected to the UQ Graduate Attributes.</p>\n<p><strong>Part 2 Gap Analysis and Professional Development (approximately 600 words)</strong></p>\n<p>Building on Part 1, this section requires you to respond to your <em>Letter to Yourself</em> through a <strong>gap analysis</strong> that compares:</p>\n<ul>\n<li>Your current professional position, and</li>\n<li>Where you aim to be in your future career.</li>\n</ul>\n<p>You must identify the steps required to bridge this gap and reflect on how your understanding of your professional future has evolved throughout your MA program.</p>\n<p>In this section, consider:</p>\n<ul>\n<li>How your goals, values, or aspirations have changed, and</li>\n<li>The concrete actions you can take to enhance your employability and build a meaningful career within your chosen sector of the Applied Linguistics industry.</li>\n</ul>\n<p>This part of the task is worth 25 marks (out of 30).</p>\n<p><strong>PART B: LinkedIn post (5%)</strong></p>\n<p>You must publish a <strong>summary version</strong> of your LinkedIn article from Part A as a <strong>LinkedIn post</strong> of <strong>no more than 300 words</strong> on your personal LinkedIn page.</p>\n<p>Your post <strong>must include all of the following hashtags</strong>:</p>\n<ul>\n<li>#SLAT7852PortfolioandSynthesis</li>\n<li>#AppliedLinguistics</li>\n<li>#UniversityofQueensland</li>\n<li>#Employability</li>\n<li>#ePortfolio</li>\n</ul>\n<p>You must take a <strong>screenshot</strong> of the published LinkedIn post and <strong>attach it to the end of your Part A article</strong> at the time of submission.</p>\n<p>This part of the task is worth 5 marks (out of 30).</p>\n<p><strong>Important </strong></p>\n<p>Both <strong>Part A and Part B</strong> must be submitted <strong>together</strong> and in accordance with the instructions above to be considered <strong>submitted for marking</strong>.</p>\n<p><strong>Reminder</strong></p>\n<p>The purpose of this assessment is to <strong>reflect on and consolidate your professional identity</strong> as a developing language professional. In completing this task, you should:</p>\n<ul>\n<li>Refer to assessment items across your MA program to demonstrate professional competence,</li>\n<li>Explicitly incorporate the <strong>UQ Graduate Attributes</strong>, and</li>\n<li>Write for a <strong>global professional audience</strong>, with a particular interest in Applied Linguistics.</li>\n</ul>\n<p>This assessment can be completed in a perfunctory manner, or it can serve as a meaningful professional artefact with potential impact on your future career. The quality of your engagement will shape the value you gain from the task.</p>\n<p><strong>_________________________________________________________________________________</strong></p>\n<p><strong>Statement on use of generative Artificial Intelligence (AI) &amp; Machine Translation (MT)</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit online via Turnitin</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "MINI CONFERENCE: INDUSTRY ‘SHOW AND TELL’",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 28/05/2026</p>\n<p>\n</p><p>WEEK 13</p>\n<p>Global Change Institute (Seminar Room 275)</p></dd>",
            "learning_objectives": null,
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Group Presentation</strong></p>\n<p><strong>Due: Thursday Week 13</strong></p>\n<p><strong>Time: 15 min followed by a 3 min Q&amp;A</strong></p>\n<p><strong>Location: Global Change Institute</strong> (Seminar Room 275)</p>\n<p>In this assessment, you will work collaboratively in a group to deliver a <strong>15-minute presentation </strong>at a mini-conference in Week 13. The presentation will be followed by a 3-minute question-and-answer session.</p>\n<p>Students will form groups of four to five members. Group membership must be recorded on the shared document on Blackboard. Where necessary, tutors may assign students to groups to ensure equitable participation.</p>\n<p><strong>*Groups must be formed by Week 3. Any students not in a group by this deadline will be allocated to a group at the discretion of the teaching team.</strong></p>\n<p><strong>Suggested topics</strong></p>\n<ul>\n<li>TESOL Onshore [EAL]</li>\n<li>TESOL Offshore </li>\n<li>Learning Design </li>\n<li>AI </li>\n<li>Research and further studies</li>\n</ul>\n<p>Groups are encouraged to explore a <strong>specific sub-topic</strong> within their chosen industry area to allow for deeper investigation and analysis.</p>\n<p><strong>Industry Engagement and Interview</strong></p>\n<p><strong>Within your group, you will first discuss:</strong></p>\n<ul>\n<li>Why you are interested in your chosen industry sector, and</li>\n<li>What would you like to learn more about within that sector?</li>\n</ul>\n<p>Based on this discussion, your group will identify <strong>one company, organisation, or institution</strong> relevant to your chosen industry area. You will then <strong>contact and interview a representative</strong> from that organisation.</p>\n<p>A list of potential interviewees is provided on Blackboard; however, groups are encouraged to identify alternative organisations aligned with their interests.</p>\n<p>To avoid duplication, groups must register their chosen organisation with their tutor by Week 3 for approval.</p>\n<p>The interview should be completed by <strong>Week 10 at the latest</strong>, allowing sufficient time for analysis and preparation of the mini-conference presentation.</p>\n<p><strong>Presentation Content</strong></p>\n<p><strong>Your group presentation must synthesise:</strong></p>\n<ul>\n<li>Insights gained from the industry interview, and</li>\n<li>Knowledge developed across your MA program.</li>\n</ul>\n<p>The presentation should address the following four areas:</p>\n<ol>\n<li>The <strong>history</strong> of your selected industry topic</li>\n<li>The <strong>current industry landscape</strong></li>\n<li><strong>The future direction</strong> of the industry, from your perspective</li>\n<li>What you, as <strong>graduates</strong>, can contribute to this industry in the future</li>\n</ol>\n<p><strong>Abstract Submission (Required)</strong></p>\n<p><strong>Each group must submit:</strong></p>\n<ul>\n<li>A <strong>200-word abstract</strong>, and</li>\n<li><strong>One photograph</strong> featuring the interviewee and group members (where appropriate)</li>\n</ul>\n<p>These must be uploaded to the <strong>shared Word document</strong> provided in the <em>Assessment 4</em> folder on Blackboard by <strong>Friday of Week 11</strong> for inclusion in the mini-conference program.</p>\n<p><strong>Suggested Timeline</strong></p>\n<ul>\n<li><strong>Week 3:</strong> Confirm group membership on the shared Blackboard document</li>\n<li><strong>Week 5:</strong> Discuss and finalise a specific topic or sub-topic</li>\n<li><strong>Week 7:</strong> Contact industry representative and confirm interview time</li>\n<li><strong>Week 9:</strong> Complete industry interview with industry representative</li>\n<li><strong>Week 11:</strong> Finalise and upload 200-word abstract and photograph, and Upload the interview recordings and PowerPoint slides on Blackboard <strong>by Friday of Week 11 at the latest</strong></li>\n<li><strong>Week 13:</strong> Present at the mini-conference</li>\n</ul>\n<p><strong>Responsibilities</strong></p>\n<p><strong>It is the responsibility of each group to:</strong></p>\n<ul>\n<li>organise meetings outside class time,</li>\n<li>coordinate communication with industry representatives, and</li>\n<li>manage preparation for the mini-conference presentation.</li>\n</ul>\n<p><strong>Reminder</strong></p>\n<ul>\n<li>The <strong>company, organisation, or institution</strong> selected by your group must be <strong>appropriate and relevant for all group members</strong>, as the task is intended to provide meaningful <strong>networking opportunities</strong> for those interested in the chosen industry sector.</li>\n<li>This task involves more than delivering a basic group presentation. <strong>All group members are expected to actively participate and contribute</strong> to the planning, preparation, and delivery of the presentation. As this is a <strong>group assessment</strong>, <strong>all members will receive the same mark</strong> for this assessment item.</li>\n<li>You are expected to apply the <strong>theoretical knowledge, critical thinking, and collaborative skills</strong> developed across your MA program in completing this assessment.</li>\n<li>Guidance on effective group work, including strategies for collaboration and managing group dynamics, is available via the University of Queensland’s Study Skills resources: <a href=\"https://my.uq.edu.au/information-and-services/student-support/study-skills/group-work\">https://my.uq.edu.au/information-and-services/student-support/study-skills/group-work</a></li>\n</ul>\n<p><br/></p>\n<p><strong>__________________________________________________________________________________</strong></p>\n<p><strong>Statement on use of generative Artificial Intelligence (AI) &amp; Machine Translation (MT)</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Suggested Timeline for this assessment</strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 1: Course Introduction</strong><br><p>Introduction to the career pathways of Applied Linguists</p></br></p></div></td>",
            "topic_title": "<strong>Workshop 1: Course Introduction</strong>",
            "topic_description": "Workshop 1: Course Introduction Introduction to the career pathways of Applied Linguists",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(02 Mar - 08 Mar)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>My Career Advisor Online: Get Started</strong><br/><p>My Career Adviser (MCA) is a self-paced learning platform and students are recommended to complete each module fortnightly.</p></p></div></td>",
            "topic_title": "<strong>My Career Advisor Online: Get Started</strong>",
            "topic_description": "My Career Advisor Online: Get Started My Career Adviser (MCA) is a self-paced learning platform and students are recommended to complete each module fortnightly.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 2: TESOL in Australia</strong><br/><p>Creating a professional development learning plan</p></p></div></td>",
            "topic_title": "<strong>Workshop 2: TESOL in Australia</strong>",
            "topic_description": "Workshop 2: TESOL in Australia Creating a professional development learning plan",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>My Career Advisor Online: Find Opportunities</strong><br/><p>My Career Adviser (MCA) is a self-paced learning platform and students are recommended to complete each module fortnightly.</p></p></div></td>",
            "topic_title": "<strong>My Career Advisor Online: Find Opportunities</strong>",
            "topic_description": "My Career Advisor Online: Find Opportunities My Career Adviser (MCA) is a self-paced learning platform and students are recommended to complete each module fortnightly.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 3: TESOL Offshore</strong><br/><p>Creating culturally sustaining practices and a job search bank</p>\n<p><br/></p></p></div></td>",
            "topic_title": "<strong>Workshop 3: TESOL Offshore</strong>",
            "topic_description": "Workshop 3: TESOL Offshore Creating culturally sustaining practices and a job search bank",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>My Career Advisor Online: Unpack Your Learning </strong><br><p>My Career Adviser (MCA) is a self-paced learning platform and students are recommended to complete each module fortnightly.</p></br></p></div></td>",
            "topic_title": "<strong>My Career Advisor Online: Unpack Your Learning </strong>",
            "topic_description": "My Career Advisor Online: Unpack Your Learning My Career Adviser (MCA) is a self-paced learning platform and students are recommended to complete each module fortnightly.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 4: Learning Design</strong><br/><p>Creating an online profile and networking profile</p></p></div></td>",
            "topic_title": "<strong>Workshop 4: Learning Design</strong>",
            "topic_description": "Workshop 4: Learning Design Creating an online profile and networking profile",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Digital Networking, Identity and LinkedIn</strong><br/></p></div></td>",
            "topic_title": "<strong>Digital Networking, Identity and LinkedIn</strong>",
            "topic_description": "Digital Networking, Identity and LinkedIn",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 5: Artificial Intelligence </strong><br/><p>Debating the role of Artificial Intelligence in professional development and career advancement.</p></p></div></td>",
            "topic_title": "<strong>Workshop 5: Artificial Intelligence </strong>",
            "topic_description": "Workshop 5: Artificial Intelligence Debating the role of Artificial Intelligence in professional development and career advancement.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(04 May - 10 May)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>My Career Advisor Online: Next Setp</strong><br/><p>My Career Adviser (MCA) is a self-paced learning platform and students are recommended to complete each module fortnightly.</p></p></div></td>",
            "topic_title": "<strong>My Career Advisor Online: Next Setp</strong>",
            "topic_description": "My Career Advisor Online: Next Setp My Career Adviser (MCA) is a self-paced learning platform and students are recommended to complete each module fortnightly.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop 6: Research and Further  Studies</strong><br/><p>The role of research and professional development in a profession.</p>\n<p><br/></p></p></div></td>",
            "topic_title": "<strong>Workshop 6: Research and Further  Studies</strong>",
            "topic_description": "Workshop 6: Research and Further  Studies The role of research and professional development in a profession.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(18 May - 24 May)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Preparation: Mini Conference Presentation </strong><br><p>Discussing and finalising the program for the mini conference.</p></br></p></div></td>",
            "topic_title": "<strong>Preparation: Mini Conference Presentation </strong>",
            "topic_description": "Preparation: Mini Conference Presentation Discussing and finalising the program for the mini conference.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(25 May - 31 May)",
            "activity_type": "Symposium",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Final Week: Mini Conference Presentation </strong><br/><p>A 15 min group presentation followed by a 3 min Q&amp;A</p></p></div></td>",
            "topic_title": "<strong>Final Week: Mini Conference Presentation </strong>",
            "topic_description": "Final Week: Mini Conference Presentation A 15 min group presentation followed by a 3 min Q&A",
            "learning_outcomes": []
        }
    ]
}