{
    "course_title": "Text Analysis and Corpus Linguistics",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SLAT7829-21604-7620",
    "full_course_code": "SLAT7829-21604-7620",
    "course_code": "SLAT7829",
    "class_code": "21604",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Describe and explain how language is used in different contexts"
        },
        {
            "number": "LO2.",
            "description": "Understanding of concepts and methods in text analysis and corpus linguistics"
        },
        {
            "number": "LO3.",
            "description": "Effectively apply the concepts and theories studied in the course to the analysis of language data (texts)"
        },
        {
            "number": "LO4.",
            "description": "Practically apply text analysis and corpus linguistics methods"
        },
        {
            "number": "LO5.",
            "description": "Critically evaluate analyses of language data"
        },
        {
            "number": "LO6.",
            "description": "Identify differences between learners and native speakers of English"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Corpus Linguistics Learning Journal",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 16/03/2026 1:00 pm</p>\n<p> 23/03/2026 1:00 pm</p>\n<p> 30/03/2026 1:00 pm</p>\n<p> 13/04/2026 1:00 pm</p>\n<p> 20/04/2026 1:00 pm</p>\n<p> 27/04/2026 1:00 pm</p>\n<p> 5/05/2026 1:00 pm</p>\n<p> 11/05/2026 1:00 pm</p>\n<p> 18/05/2026 1:00 pm</p>\n<p> 25/05/2026 1:00 pm</p>\n<p>\n</p><p>1pm, Monday WEEKS 4-13</p></dd>",
            "learning_objectives": "L01, L02",
            "mode": "Written",
            "category": "Essay/ Critique, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Corpus Linguistics Learning Journal is a reflective assessment designed to support your ongoing engagement with course content and to encourage the gradual development of your understanding of corpus linguistics concepts and methods. Across the semester, you are required to submit five short reflective journal entries, each based on a selected session of the course. Each entry should be between 100 and 200 words in length and is worth 4 per cent of the final grade, contributing a total of 20 per cent.</p>\n<p>PURPOSE</p>\n<p>The purpose of this assessment is to promote regular reflection on your learning and to help you connect theoretical content and methodological instruction to your own developing corpus-based research interests. Through these short reflections, you will consolidate your understanding of corpus linguistic approaches, identify areas of uncertainty, and explore how specific methods may be applied in corpus-based research projects, including your own.</p>\n<p>CONTENT</p>\n<p>Each journal entry should reflect on your learning from a particular session and address relevant aspects of your experience. You may consider what you learned about corpus linguistics during that session, which corpus methods or analytical techniques were introduced, what aspects you found challenging or unclear, and how the content or methods discussed could be applied to a corpus-based project. Not all prompts need to be addressed in every entry; rather, entries should demonstrate thoughtful and meaningful engagement with the session content.</p>\n<p>STATEMENT ON AI &amp; MT</p>\n<p><em>This task has been designed to be challenging, authentic and complex. Successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. Whilst students may use generative Artificial Intelligence (AI) tools and/or Machine Translation (MT) technologies to support the language of their responses, such use must be </em><a href=\"https://guides.library.uq.edu.au/tools-and-techniques/ai-student-hub/ai-for-assessment\"><em>appropriately acknowledged or referenced in line with UQ’s academic integrity expectations</em></a><em>. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Over the course of the semester, students need to submit five Corpus Linguistics Learning Journal entries. Journal entries must be submitted as text responses via Blackboard. The entries must be submitted on the <strong>Monday of the following week by 1pm</strong>. For example, the Journal entry for Week 3 must be submitted by Monday 1pm of Week 4. You will be able to submit your journal entries for sessions between Weeks 3 and 12.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Project Proposal Presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 7/05/2026 4:00 pm</p>\n<p>\n</p><p>4pm, Thursday WEEK 10</p></dd>",
            "learning_objectives": "L01, L02, L03, L05",
            "mode": "Activity/ Performance, Oral",
            "category": "Performance, Presentation, Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Project Proposal Presentation requires you to submit a recorded video presentation (10 minutes long, max. 100 MB) in which you outline a proposed corpus-based research project in Applied Linguistics. The task is designed to support you in developing a coherent, feasible, and theoretically motivated research project and to provide you with formative feedback prior to the submission of the final written research report.</p>\n<p>PURPOSE</p>\n<p>This assessment evaluates your ability to articulate and justify a corpus-based research proposal. You are expected to demonstrate an understanding of relevant theories and research in Applied Linguistics, to clearly formulate research questions, and to justify your choice of corpus data and methodological approach. The focus of this task is on what you intend to do and why, rather than on completed analysis or results.</p>\n<p>CONTENT &amp; STRUCTURE</p>\n<p>Your presentation should introduce the research topic and explain its relevance within Applied Linguistics, providing a brief overview of the structure of the presentation. You should then situate your study within relevant literature by discussing key concepts, theoretical frameworks, and prior research, demonstrating an understanding of how your project is motivated by existing work. Clear and well-justified research questions should be presented and linked to the literature. You should describe the corpus data you intend to use, including relevant details such as corpus composition, size, and mode, and explain the methodological approach and analytical tools you plan to employ. The presentation should conclude with a critical evaluation of the proposed study, including its potential contributions, feasibility, and limitations. All cited sources must be presented in APA 7 format.</p>\n<p>ASSESSMENT CRITERIA</p>\n<p>Assessment criteria and performance standards are detailed in the marking rubric.</p>\n<p>STATEMENT ON AI &amp; MT</p>\n<p><em>This task has been designed to be challenging, authentic and complex. Whilst students may use generative Artificial Intelligence (AI) tools and/or Machine Translation (MT) technologies to support their presentation, such use must be </em><a href=\"https://guides.library.uq.edu.au/tools-and-techniques/ai-student-hub/ai-for-assessment\"><em>appropriately acknowledged or referenced in line with UQ’s academic integrity expectations</em></a><em>. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You are required to submit a recorded video presentation of <strong>no more than ten minutes, </strong>with a ten per cent allowance. Any content exceeding eleven minutes will not be assessed. Your face must be visible throughout the presentation to ensure clear communication and identity verification. The use of Zoom screen sharing is strongly recommended to support clear and professional delivery. The submitted recording must not exceed 100 MB in file size and it must be submitted via TurnitIn as a single file (only the recording - no slides).</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Research Project Write-Up",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 28/05/2026 4:00 pm</p>\n<p>\n</p><p>4pm, Thursday WEEK 13</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Research Project Write-Up requires you to submit a 2,000 word written report (excluding references and appendices) presenting an original corpus-based research study in Applied Linguistics. This task represents the culmination of your learning in the course and provides an opportunity to demonstrate your ability to design, conduct, analyze, and critically evaluate a corpus-based investigation.</p>\n<p>PURPOSE</p>\n<p>This assessment evaluates your ability to define and motivate a research problem, engage critically with relevant theory and literature, select and justify appropriate corpus data and methods, conduct and interpret corpus analyses, and present your findings in a clear, well-structured, and academically appropriate manner.</p>\n<p>STRUCTURE</p>\n<p>The report should begin with an introduction that defines the research topic, describes the phenomenon under investigation, justifies the relevance of the study within Applied Linguistics, and outlines the structure of the report. This should be followed by a literature review that presents and synthesizes relevant research, demonstrates theoretical understanding, and motivates clearly defined research questions or hypotheses. The data and methodology section should describe the corpus data used, justify the data and methodological choices, and explain analytical procedures and tools. The results section should present the findings clearly using text, tables, and figures where appropriate. The discussion and conclusion should address the research questions, relate the findings to existing literature, and critically evaluate the strengths, limitations, and contributions of the study. A complete reference list in APA 7 format must be provided, and supplementary materials such as code, regular expressions, or extended tables may be included in an appendix.</p>\n<p>ASSESSMENT CRITERIA</p>\n<p>Detailed marking criteria are available via Blackboard.</p>\n<p>STATEMENT ON AI &amp; MT</p>\n<p><em>This task has been designed to be challenging, authentic and complex. Whilst students may use generative Artificial Intelligence (AI) tools and/or Machine Translation (MT) technologies to support their preparation, such use must be </em><a href=\"https://guides.library.uq.edu.au/tools-and-techniques/ai-student-hub/ai-for-assessment\"><em>appropriately acknowledged or referenced in line with UQ’s academic integrity expectations</em></a><em>. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</em>  <em>Successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. </em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The Research Project Write-Up must be submitted via Turnitin as a single docx or pdf file. The written report must not exceed 2,000 words, excluding references and the appendix, and must adhere to APA 7 formatting and referencing conventions. The report should be written in academic English and structured logically and coherently according to the format outlined in the Task Description.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(23 Feb - 31 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial: Corpus Linguistics and Text Analysis</strong><br><p>How to design and build a corpus?</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Tutorial: Corpus Linguistics and Text Analysis</strong>",
            "topic_description": "Tutorial: Corpus Linguistics and Text Analysis How to design and build a corpus?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(23 Feb - 31 May)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Recorded Lecture: Corpus Linguistics and Text Analysis</strong><br/><p>Weekly lecture content consists of pre-recorded hour-long lectures that are uploaded to Blackboard one week before the scheduled week.ﾠ Students are expected to watch the recorded lecture content before taking the Online Study Tasks for the respective week and before attending the tutorials.</p></p><p><strong>Learning outcomes:</strong> L02, L05, L06</p></div></td>",
            "topic_title": "<strong>Recorded Lecture: Corpus Linguistics and Text Analysis</strong>",
            "topic_description": "Recorded Lecture: Corpus Linguistics and Text Analysis Weekly lecture content consists of pre-recorded hour-long lectures that are uploaded to Blackboard one week before the scheduled week.ﾠ Students are expected to watch the recorded lecture content before taking the Online Study Tasks for the respective week and before attending the tutorials.",
            "learning_outcomes": [
                "L02",
                "L05",
                "L06"
            ]
        }
    ]
}