{
    "course_title": "Introduction to Social Research",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SOCY2019-21498-7620",
    "full_course_code": "SOCY2019-21498-7620",
    "course_code": "SOCY2019",
    "class_code": "21498",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Design methodologically coherent research across all stages of the research process"
        },
        {
            "number": "LO2.",
            "description": "Demonstrate a growing capacity to undertake research with Indigenous peoples and communities guided by Indigenous values and priorities"
        },
        {
            "number": "LO3.",
            "description": "Make ethical choices in the design and conduct of social research"
        },
        {
            "number": "LO4.",
            "description": "Apply and transfer social research skills in a variety of contexts and domains"
        },
        {
            "number": "LO5.",
            "description": "Demonstrate critical use and appraisal of Gen. AI in the research process"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Assignment 1 Problem Statement",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30% 800 words </dd>",
            "due_date": "<dd><p> 1/04/2026 2:00 pm</p>\n<p>\n</p><p>Submit via Course Blackboard Ultra (TurnItIn).</p></dd>",
            "learning_objectives": "L04, L05",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Paper/ Report/ Annotation, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The goal of this piece of assessment is to learn the concept of a problem statement, how to formulate research questions and observe the use of AI in research. Identifying a research topic, writing it up in the form of a problem statement, explaining why the issue is research worthy and formulating workable research questions are the first set of skills that researchers need. Learning about the ethical use of AI and the impact it might have on research is also integral to the future of social inquiry. If you prefer not to use Gen AI, please see an alternative option for assessment in the Notes section below.</p>\n<p>There are four parts to this assignment:</p>\n<p><em>1. Select your topic and test out Gen AI (not in word count)</em></p>\n<p>Identify a suitable research topic that interests you (note, this topic will also be used in Assignment 2, Article Review). Experiment with producing a problem statement and research questions using any Gen AI tool. If you are new to Gen AI, consider using ChatGPT since a user guide has been provided for you on Blackboard Ultra. Using whatever prompts you like, see how close you can get to generating a quality research problem and research questions that relate to your chosen topic. </p>\n<p>What you want Gen AI to produce is: 1) a problem statement on your selected topic including 4-7 academic references; 2) two research questions that logically connect to the problem statement. Your final problem statement and research questions should total 350 words, so take this into account.</p>\n<p>Paste all prompts and the Gen AI output into “Part 1” of your assignment. This is not included in your word count.</p>\n<p><em>2. Critically assess the Gen AI’s problem statement and RQs (350 words)</em></p>\n<p>Your next task is to critically assess the problem statement that Gen AI has produced. In 300 words, review the problem statement and research questions and evaluate the quality of the output according to the criteria of responsible and ethical AI use (as learned in class). Consider the following issues (identified in the course learning materials): 1) Relevance; 2) Ethics; 3) Accuracy; 4) Quality. You may use references to assist you.</p>\n<p><em>3. Personal Reflection (100 words)</em></p>\n<p>Write a short personal refection on how you found the experience of using Gen AI for this assignment. Where did you find it useful and what were its shortcomings? What additional work do you now need to do to revise the output so that it works as a research problem statement and strong set of research questions. If you are happy with the problem statement and research questions produced by Gen AI, write why this is the case.</p>\n<p><em>4. Finalise your Problem Statement and RQs (350 words)</em></p>\n<p>Submit a 350 word problem statement (with 4-7 academic references) including two associated research questions. If your critical assessment of the Gen AI output told you that the Gen AI version was insufficient, revise, rewrite or redo the problem statement and research questions as much as you think is necessary to create a quality piece of work. If you feel that Gen AI was unable to produce an acceptable problem statement you may start from the beginning and write your own. If you were happy with the problem statement and research questions produced by Gen AI you may submit them for your assignment exactly as they were outputted. Remember to give your problem statement a title too!</p>\n<p><strong>NOTES: </strong></p>\n<p>The maximum word count for this assignment is 800 words excluding the reference list, appendices, or Gen AI prompts or output. A deviation of 10% of the word count for each section is allowable.</p>\n<p>If you would prefer not to use Gen AI for this task, you may submit an alternative piece of assessment. The amended parts are as follows: 1) critically reflect on your decision not to use Gen AI and the ethics associated with this decision (350 words); 2) write your own problem statement (with 4-7 academic references) and associated research questions (350 words); 3) your personal reflection on the process of undertaking this piece of assessment, including what were the benefits and challenges of not using Gen AI (100 words). </p>\n<p>When preparing your reference list, ensure you use an acknowledged academic referencing system (e.g., APA). The list of referencing styles used at UQ can be found <a href=\"https://guides.library.uq.edu.au/referencing\">here</a>. It does not matter which one you use (although footnotes are not acceptable), as long as the referencing style is consistent.</p>\n<p>You must reference and acknowledge which Gen AI tool(s) you used, every prompt and all associated output. Provide a note if you used an Agent, and how this Agent was set up. Failure to reference externally sourced, non-original work can result in Academic Misconduct. For information on how to cite and acknowledge Gen AI content, see https://guides.library.uq.edu.au/referencing/acknowledging-and-referencing-ai .</p>\n<p>University of Queensland guidelines state: Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. Additional resources are available through <a href=\"https://web.library.uq.edu.au/study-and-learning-support/ai-student-hub\">UQ AI Student Hub</a>.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assessment electronically by the due time, on the due date. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Assignment 2 Article Review",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30% 1,000 words </dd>",
            "due_date": "<dd><p> 5/05/2026 2:00 pm</p>\n<p>\n</p><p>Submit via Course Blackboard Ultra (TurnItIn)</p></dd>",
            "learning_objectives": "L01",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The goal of Assignment 2 is to learn how to identify and assess the methodological coherence of empirical research studies. By ‘methodological coherence’ we mean the extent to which a study's research design, concepts, research questions, data collection methods, and analysis align. Simply put, how well do the different parts of the research study fit together to match what the researchers are trying to find out.</p>\n<p>There are four parts:</p>\n<p><em>1. Select 4 empirical articles</em></p>\n<p>Using your online literature searching skills and UQ databases, select four empirical articles that examine the same topic that you developed for Assignment 1, Problem Statement. Each empirical article should approach your research topic from a different methodological perspective with each one exploring different features of social life relevant to your topic (refer to your class materials to assist you with this task).</p>\n<p>The chosen empirical articles can be journal articles or book chapters but must be empirical works, meaning they use primary or secondary data sources (interviews, surveys, etc.) to examine specific research questions or hypotheses. Articles limited to a literature review or systematic reviews are not adequate. We recommend choosing, where possible, at least one non-Western empirical article (see details in notes section below).</p>\n<p><em>2. Provide your Problem statement (not in word count)</em></p>\n<p>Paste your title and problem statement from Assignment 1 into the start of Assignment 2. This not part of the word count and does not need to be revised. If revising the problem statement and/or research questions makes the completion of Assignment 2 easier, moderate edits may be undertaken (this will not be graded).</p>\n<p><em>3. Article Review (1000 words)</em></p>\n<p>Write a critical review of the methodological coherence of each empirical article separately, comprising roughly 250 words per article. Reflect on the following:</p>\n<ol>\n<li>What, specifically, does each paper focus on in the context of your chosen topic?</li>\n<li>What are the aims, research questions or hypotheses of the study?</li>\n<li>What concepts are being used in each article and how are they defined and operationalised?</li>\n<li>What research method(s) does the study use, and how do the methods link to the research aim(s) or question(s) – is this made clear to the reader?</li>\n</ol>\n<p><em>4. Reference List and Appendices (not in word count)</em></p>\n<p>Include a reference list. Be sure to correctly reference where your original problem statement and research questions have been created by Gen AI.</p>\n<p><strong>NOTES:</strong></p>\n<p>The maximum word count for this assignment is 1000 words excluding the reference list or appendices. A deviation of 10% of the word count is allowable.</p>\n<p>When preparing your reference list, ensure you use an acknowledged academic referencing system (e.g., APA). The list of referencing styles used at UQ can be found <a href=\"https://guides.library.uq.edu.au/referencing\">here</a>. It does not matter which one you use (although footnotes are not acceptable), as long as the referencing style is consistent.</p>\n<p>Western forms of knowledge have historically been privileged over Indigenous and other non-Western ways of knowing. Researchers often replicate and reinforce this marginalisation by selecting readings and reference materials written by scholars using Western paradigms and/or that treat Indigenous and other minority groups as objects of research, but not as research partners. It is important to be aware of this bias in your work and to overcome it by actively seeking out and including research materials that highlight the important contribution to scholarship and practice of Indigenous scholars and those working outside the Western paradigm. To this end, you are strongly encouraged to find at least one research article written by authors working beyond a traditional Western paradigm, such as Indigenous or other minority scholars, where relevant to your topic.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of Gen AI. If you rely only on Gen AI outputs for this assignment, you will not develop the skills you need to design methodologically sound research projects that logically connect the research questions, aims and methods. Thus, we ask you to be ethical in your use of Gen AI. For example, write up your responses to each of the sections above, and at most, ask Gen AI to act as an editor or soundboard to improve your argumentation. Many journal articles or book chapters that you will have access to via UQ’s library, will not be fully available to Gen AI platforms (as they are not open-source). Uploading articles that you have downloaded from a university-subscribed database to a Gen AI platform constitutes a breach of copyright.</p>\n<p>Any use of Gen AI for this piece of assessment must be fully referenced and acknowledged, in each instance that it is used. Failure to reference externally sourced, non-original work (e.g. output from Gen AI) can result in Academic Misconduct. For information on how to cite Gen AI content, see <a href=\"https://guides.library.uq.edu.au/referencing/acknowledging-and-referencing-ai\">https://guides.library.uq.edu.au/referencing/acknowledging-and-referencing-ai</a>. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assessment electronically by the due time, on the due date. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Assignment 3 Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>40% approximately 1,000 words </dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>6/06/2026 - 20/06/2026</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The aim of this final assessment is to enable you to demonstrate the research skills that you have acquired across all elements of the research process including research methodologies, research questions, conceptualisation and operationalisation, sampling, recruitment, ethics, and methods.</p>\n<p>The exam will have three parts to it, as follows:</p>\n<p><em>Part 1. </em>Test your understanding – 10 short exercises for you to complete.</p>\n<p><em>Part 2.</em> Apply your skills – 8 short-answer questions based on a research scenario, one of which will be Indigenous-based research. </p>\n<p><em>Part 3. </em>Appraise and improve – you will be given a choice of two research proposals. You are to choose one proposal and identify the methodological and ethical strengths and weaknesses of the proposal and propose improvements.  </p>\n<p><strong>NOTES:</strong></p>\n<p>A sample copy of the exam is available for you to review on the library website. You will also have the opportunity to practice the exam, using the online Inspera platform, during semester.</p>\n<p>You may take one A4 double sided sheet of paper with (handwritten or typed) notes into the exam.</p>\n<p>Students may take a paper copy translation dictionary into the exam.</p>\n<p>The exam time is 3 hours to ensure all students have sufficient time to complete each task.</p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction: the principles of social research</strong><br/></p></div></td>",
            "topic_title": "<strong>Introduction: the principles of social research</strong>",
            "topic_description": "Introduction: the principles of social research",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(02 Mar - 08 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Social World</strong><br/></p><p><strong>Learning outcomes:</strong> L01, L05</p></div></td>",
            "topic_title": "<strong>Social World</strong>",
            "topic_description": "Social World",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Indigenous methodologies</strong><br/></p><p><strong>Learning outcomes:</strong> L02, L04</p></div></td>",
            "topic_title": "<strong>Indigenous methodologies</strong>",
            "topic_description": "Indigenous methodologies",
            "learning_outcomes": [
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction and the Social World</strong><br/><p>This tutorial explores the concepts of positionality and methodology, examining how researchers' positions shape their research approaches.</p></p><p><strong>Learning outcomes:</strong> L01, L05</p></div></td>",
            "topic_title": "<strong>Introduction and the Social World</strong>",
            "topic_description": "Introduction and the Social World This tutorial explores the concepts of positionality and methodology, examining how researchers' positions shape their research approaches.",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Research Questions</strong><br/></p><p><strong>Learning outcomes:</strong> L01, L04, L05</p></div></td>",
            "topic_title": "<strong>Research Questions</strong>",
            "topic_description": "Research Questions",
            "learning_outcomes": [
                "L01",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Conceptualisation and Operationalisation</strong><br/></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Conceptualisation and Operationalisation</strong>",
            "topic_description": "Conceptualisation and Operationalisation",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Research Design</strong><br/><p>Students will explore how to formulate research questions and engage with co-design methodologies.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Research Design</strong>",
            "topic_description": "Research Design Students will explore how to formulate research questions and engage with co-design methodologies.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Sampling</strong><br/><p>Due to the public holiday (Good Friday), there is no lecture this week. Students are expected to engage with learning materials on the Extend platform. This topic will be addressed briefly in a subsequent lecture</p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Sampling</strong>",
            "topic_description": "Sampling Due to the public holiday (Good Friday), there is no lecture this week. Students are expected to engage with learning materials on the Extend platform. This topic will be addressed briefly in a subsequent lecture",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ethics</strong><br/></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Ethics</strong>",
            "topic_description": "Ethics",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Conceptualisation and Operationalisation </strong><br/><p>This tutorial will explore conceptualisation and operationalisation of research and sampling techniques.</p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Conceptualisation and Operationalisation </strong>",
            "topic_description": "Conceptualisation and Operationalisation This tutorial will explore conceptualisation and operationalisation of research and sampling techniques.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Surveys</strong><br/></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Surveys</strong>",
            "topic_description": "Surveys",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Interviews</strong><br/></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Interviews</strong>",
            "topic_description": "Interviews",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Quantitative Methodologies and Ethics</strong><br/><p>This tutorial will explore quantitative research methods and the ethical principles that guide quantitative research practice.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Quantitative Methodologies and Ethics</strong>",
            "topic_description": "Quantitative Methodologies and Ethics This tutorial will explore quantitative research methods and the ethical principles that guide quantitative research practice.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10(04 May - 10 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Field Research and Observation</strong><br/></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Field Research and Observation</strong>",
            "topic_description": "Field Research and Observation",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Administrative and Naturally Occurring Data </strong><br/></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Administrative and Naturally Occurring Data </strong>",
            "topic_description": "Administrative and Naturally Occurring Data",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Qualitative Methodologies and Ethics</strong><br/><p>This tutorial introduces students to qualitative methodologies and ethical considerations in qualitative research.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Qualitative Methodologies and Ethics</strong>",
            "topic_description": "Qualitative Methodologies and Ethics This tutorial introduces students to qualitative methodologies and ethical considerations in qualitative research.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12(18 May - 24 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Revision</strong><br/><p>This revision lecture reviews the major topics covered in the course, including research design, Indigenous methodologies, ethical considerations, and key data collection methods such as surveys, interviews, observation, and analysis of administrative and naturally occurring data. Time will be made available for questions and clarification. </p></p></div></td>",
            "topic_title": "<strong>Revision</strong>",
            "topic_description": "Revision This revision lecture reviews the major topics covered in the course, including research design, Indigenous methodologies, ethical considerations, and key data collection methods such as surveys, interviews, observation, and analysis of administrative and naturally occurring data. Time will be made available for questions and clarification.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(25 May - 31 May)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Exam Preparation</strong><br/><p>This lecture focuses on exam preparation. Students will review the example exam available on the Inspera platform, receive tips and strategies for exam success, and work through additional practice exam questions in groups.</p></p></div></td>",
            "topic_title": "<strong>Exam Preparation</strong>",
            "topic_description": "Exam Preparation This lecture focuses on exam preparation. Students will review the example exam available on the Inspera platform, receive tips and strategies for exam success, and work through additional practice exam questions in groups.",
            "learning_outcomes": []
        }
    ]
}