{
    "course_title": "Society, Challenges and Solutions: Introduction to the Social Sciences",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SOSC1000-21502-7620",
    "full_course_code": "SOSC1000-21502-7620",
    "course_code": "SOSC1000",
    "class_code": "21502",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Analyse human actions, issues, and social phenomena using major social science concepts, methods, and cross-cultural perspectives."
        },
        {
            "number": "LO2.",
            "description": "Evaluate how social structures shape individual and collective experiences across diverse cultural and global contexts."
        },
        {
            "number": "LO3.",
            "description": "Critically assess scholarly social science sources and construct evidence-based arguments using systematic empirical inquiry."
        },
        {
            "number": "LO4.",
            "description": "Communicate complex social science ideas effectively through collaborative work, presentations, and academic writing that integrates textual and visual materials."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Mini quizzes",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>10% allocated across two separate quizzes (i.e., 5% each) </dd>",
            "due_date": "<dd><p>This is mini quiz #1 out of 2 (due by end week 2) 6/03/2026 5:00 pm</p>\n<p>This is mini quiz #2 out of 2 (due by end week 4) 20/03/2026 5:00 pm</p>\n<p>\n</p><p>Due in two parts (end of weeks 2 and 4)</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>These short quizzes are designed to help you check your understanding of the key concepts, theories, and thinkers covered in the foundational module 1 content. Each quiz contains a series of multi-choice and similar questions, with a combined overall weight of 10% (5% per quiz). </p>\n<p>The quizzes are a learning tool to help reinforce your understanding of the material. When you answer a question, you'll receive immediate feedback that explains why your answer is correct or incorrect. If you get a question wrong, the feedback will guide you back to the relevant concepts and sections of the readings so you can strengthen your understanding.</p>\n<p><strong>Please note, to ensure fairness to all, each student will only have one opportunity to complete each of the two quizzes. Once you log into the quiz, you must complete and submit it in that sitting (and before the final due date). </strong></p>\n<p>Take your time with each question -- the quiz is not timed (as long as you submit before the due date/time) - and use the feedback as a guide for your learning. These quizzes are here to support your understanding, not to catch you out!</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assessment electronically by the due time, on the due date. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Rewrite (and reframe) the headlines",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>45% 600 words </dd>",
            "due_date": "<dd><p> 2/04/2026 3:00 pm</p>\n<p>\n</p><p>This assignment will be completed in class, during our week 6 seminar, which runs from 12noon to 3pm.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Essay/ Critique, Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Australian Journalists Code of Ethics states, \"Journalists describe society to itself\". But it is also true that news headlines deeply affect our interpretations and understandings of social issues and are, therefore, active in creating social meaning. Australian journalist, Jane Gilmore, began a <strong>'Fixed It' campaign</strong> to rewrite what she saw as unfair and partial news headlines about violence against women. For this assignment, students will take a similar approach to Gilmore, using Carol Bacchi's 'What's the Problem Represented to Be' ('WPR') framework to guide their analysis.</p>\n<p><strong>The task: </strong></p>\n<p><strong>During the in-class assessment session</strong>, you will be provided with a newspaper headline that you have not seen before, which concerns a social issue. You will have <strong>90 minutes</strong> to complete this task under supervised conditions.</p>\n<p>You are required to answer <strong>four short-answer questions</strong> (up to 150 words each / 600 words):</p>\n<p><strong>Question 1:</strong> What is the 'problem' represented to be in this headline?</p>\n<p><strong>Question 2: </strong>What assumptions underpin this 'problem' representation?</p>\n<p><strong>Question 3:</strong> What is left unproblematic or silenced in this headline and why might this matter?</p>\n<p><strong>Question 4:</strong> Considering an alternative way to frame this 'problem', rewrite the headline to reflect a fairer and fuller framing of the social issue. Briefly explain/justify your rewritten headline.</p>\n<p>This task tests your ability to apply the WPR framework to analyse media framing, identify underlying assumptions and silences in social problem representations, and think critically about alternative framings of social issues.</p>\n<p><strong>What you can bring: </strong></p>\n<ul>\n<li><strong>Any hard-copy notes you wish</strong>, but these must be printed or handwritten.</li>\n<li>You must <strong>handwrite</strong> your response - no computers, phones, or internet-connected devices are permitted.</li>\n</ul>\n<p><strong>What will be provided: </strong></p>\n<ul>\n<li>The newspaper headline for analysis</li>\n<li>Blank paper for your written response</li>\n</ul>\n<p><strong>Use of generative artificial intelligence (AI):</strong> This is a supervised in-class assessment completed by hand. The use of any AI technologies, mobile phones, computers, or internet-connected devices during the assessment is strictly prohibited and will constitute academic misconduct under the Student Code of Conduct.</p>\n<p>Marking criteria and rubrics will be made available in the 'Assessment' folder in Blackboard Ultra for this course.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment by the due time, on the due date. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "'Know where you are': group presentation & essay",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>45% 2000 word group essay + 5-6 min group presentation </dd>",
            "due_date": "<dd><p> 29/05/2026 2:00 pm</p>\n<p>\n</p><p>Part A - Oral presentation component: Students will present during the seminars in weeks 10-13 (a roster will be released early in the semester).</p>\n<p>Part B - Written submission: Friday of week 13 (by 2pm)</p>\n<p><br/></p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Oral, Written",
            "category": "Essay/ Critique, Presentation, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong><em>Acknowledgement</em></strong><em>: This assignment was developed collaboratively by a previous SOSC1000 Student Staff Partnerships (SSP) team, which consisted of former SOSC1000 students Lillian Dullat, Ned Binnie, Nejmere Cody, Sarah Donaldson, and UQ staff, Dr Zoe Staines and A/Prof Gerhard Hoffstaedter. Particular thanks go to Lillian Dullat, whose idea and provocation for students to ‘know where they’re standing’ provided the catalyst for this assignment.</em></p>\n<p><strong>Summary: </strong>This assignment will be undertaken in groups, and consists of two components:</p>\n<ul>\n<li><strong>Part A – Oral presentation component (hurdle, not graded), and </strong></li>\n<li><strong>Part B – Written essay component (graded). </strong></li>\n</ul>\n<p><strong><em>Each student group will deliver </em></strong><em>one</em> oral presentation and<em> one</em> essay (collaboratively drafted).</p>\n<p><strong>Due day/time: </strong></p>\n<ul>\n<li><strong>Part A - Oral presentation component:</strong> Student groups will deliver their presentations in the module 3 lectures (which run during the final seminars in semester weeks 10-13). A presentation schedule will be provided to students at the start of semester, so that each group is clear about when they will need to present. All group members must attend and contribute to the oral presentation component to ensure the hurdle is passed. If there are extenuating circumstances, where one group member cannot attend/co-deliver the oral presentation, the group should reach out to the unit coordinator asap to make an alternative arrangement. </li>\n<li><strong>Part B - Written essay component:</strong> Due by 2pm, Friday 29 May (week 13). All group members must contribute fairly to this aspect of the assignment; this will be monitored in classes across the semester, with teaching staff working directly with groups to ensure an equal and fair contribution, and/or moderate marks accordingly, wherever needed.</li>\n</ul>\n<p><strong>Length: </strong></p>\n<ul>\n<li><strong>Part A – Oral presentation component:</strong> 5-6 minutes per group presentation</li>\n<li><strong>Part B – Written essay component:</strong> 2000 words (+/-10%) - Excluding headings, reference list, and appendix; in-text references <em>are</em> included.</li>\n</ul>\n<p><strong>Weighting: </strong>45% overall (10% for presentation; 35% for written component)</p>\n<p><strong>Topic description: </strong>Space (geographical location and features) and place (social and cultural features) are important concepts in the social sciences. We often frequent locations without thinking too deeply about their geographies, histories, social, and cultural features. This assignment asks you to think more deeply about these aspects of a space/place of your choice, drawing on key concepts from the social sciences learned in SOSC1000.</p>\n<p>In doing so, the assignment aims to:</p>\n<ul>\n<li>increase your familiarity with, and ability to apply, social science thinking and theorising around space and place to a chosen real scenario,</li>\n<li>encourage you to position yourself within space/place, and understand/reflect on how this influences/impacts you, and vice versa,</li>\n<li>understand your positionality in relation to ‘ownership’ and use of space/place, including the unceded sovereignty of First Nations Traditional Owners,</li>\n<li>draw on concepts and theories covered in SOSC1000 to critically reflect on a chosen social issue in relation to your identified space/place (e.g., homelessness, poverty, inequality, racism, sexism, safety, etc.),</li>\n<li>practice your oral presentation skills,</li>\n<li>practice writing critically and reflexively, while also practicing creativity in your use of multimedia to support your reflective/critical writing, and</li>\n<li>encourage the creation of a peer-to-peer community of practice through group work and peer feedback/support in the lead up to assignment submission.</li>\n</ul>\n<p><strong>Mode: </strong>Group mode; each group will collectively deliver an oral presentation <em>and </em>one collaboratively written essay component.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard Ultra for this course. </p>\n<p><strong>Use of generative artificial intelligence (AI): </strong></p>\n<ul>\n<li>Students are welcome to engage with generative AI to assist in developing creative ideas for formatting and delivering their group presentations (Part A). Additional resources are available through <a href=\"https://web.library.uq.edu.au/study-and-learning-support/ai-student-hub\">UQ AI Student Hub</a>.</li>\n<li>In the written essay component (Part B), students can use AI to assist with editing and grammar, but the writing itself should be their own intellectual work completed <strong>without the aid of AI</strong>. Students will be required to declare their use of AI for Part B in the assignment template, which will be available on Blackboard. </li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students will present during the seminars in weeks 10-13 (a roster will be released early in the semester).</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 6(23 Feb - 05 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 1: Introducing the social sciences</strong><br><p><strong>The first module of this course runs from weeks 1-6.</strong></p>\n<p>During this module, we introduce fundamental social science concepts and methods, building towards the submission of our first assessment items, and setting a strong foundation for students' success in the rest of the course.</p>\n<p>After completing this module, students will have a strong understanding of: i) what the social sciences are; ii) key differences between 'traditional' Western and non-Western approaches; iii) how social scientists understand and respond to social issues; iv) social science values and ethics; and v) social science contributions in an ever-changing world.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Module 1: Introducing the social sciences</strong>",
            "topic_description": "Module 1: Introducing the social sciences The first module of this course runs from weeks 1-6. During this module, we introduce fundamental social science concepts and methods, building towards the submission of our first assessment items, and setting a strong foundation for students' success in the rest of the course. After completing this module, students will have a strong understanding of: i) what the social sciences are; ii) key differences between 'traditional' Western and non-Western approaches; iii) how social scientists understand and respond to social issues; iv) social science values and ethics; and v) social science contributions in an ever-changing world.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 7 To Week 8(13 Apr - 26 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 2: Understanding social institutions</strong><br><p><strong>The second module of this course runs from weeks 7-8.</strong></p>\n<p>This module will build on the first part of the course by introducing key social institutions. We take a critical and decolonial perspective to understanding the roles of these key institutions in shaping social norms, including how these have changed over time.</p>\n<p>After completing this module, students will have a strong understanding of: i) the key characteristics of social institutions, including how these change over time; ii) how social institutions shape social norms; and iii) how we can take a critical perspective to understanding how social institutions can create and perpetuate social inequalities on the basis of gender, race, class, ability, and much more.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Module 2: Understanding social institutions</strong>",
            "topic_description": "Module 2: Understanding social institutions The second module of this course runs from weeks 7-8. This module will build on the first part of the course by introducing key social institutions. We take a critical and decolonial perspective to understanding the roles of these key institutions in shaping social norms, including how these have changed over time. After completing this module, students will have a strong understanding of: i) the key characteristics of social institutions, including how these change over time; ii) how social institutions shape social norms; and iii) how we can take a critical perspective to understanding how social institutions can create and perpetuate social inequalities on the basis of gender, race, class, ability, and much more.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 9 To Week 13(27 Apr - 31 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 3: Social science majors</strong><br><p><strong>The third module of this course runs from weeks 9-13.</strong></p>\n<p>The core purpose of this module is to provide students with an overview of the three majors on offer in the Bachelor of Social Science -- i) Development, ii) Environment and Society, and iii) Health and Social Policy. We invite guest lecturers to give students a 'taste' of these different fields of study through a problem-based learning approach. We then complete the module in our final lecture by discussing some key principles to guide students on their journeys through their social science studies and future work.</p>\n<p>After completing this module, students will: i) have a strong understanding of the majors available in the Bachelor of Social Science, thereby informing future study choices; and ii) be able to reflect on what they have learned during the semester, including how it might influence their critical engagement with the world around them, as well as provide a basis for their future studies and careers.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Module 3: Social science majors</strong>",
            "topic_description": "Module 3: Social science majors The third module of this course runs from weeks 9-13. The core purpose of this module is to provide students with an overview of the three majors on offer in the Bachelor of Social Science -- i) Development, ii) Environment and Society, and iii) Health and Social Policy. We invite guest lecturers to give students a 'taste' of these different fields of study through a problem-based learning approach. We then complete the module in our final lecture by discussing some key principles to guide students on their journeys through their social science studies and future work. After completing this module, students will: i) have a strong understanding of the majors available in the Bachelor of Social Science, thereby informing future study choices; and ii) be able to reflect on what they have learned during the semester, including how it might influence their critical engagement with the world around them, as well as provide a basis for their future studies and careers.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}