{
    "course_title": "Clinical Veterinary Elective",
    "study_period": "Sem 1 2026",
    "location": "Gatton",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/VETS5016-20631-7620",
    "full_course_code": "VETS5016-20631-7620",
    "course_code": "VETS5016",
    "class_code": "20631",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (05/01/2026 - 21/11/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate the skills needed to acquire, store and retrieve information at a depth and breadth appropriate for entry into the veterinary profession."
        },
        {
            "number": "LO2.",
            "description": "Apply critical reasoning and make informed judgements."
        },
        {
            "number": "LO3.",
            "description": "Appreciate other cultures, opinions, feelings, emotions and values."
        },
        {
            "number": "LO4.",
            "description": "Communicate effectively by oral, written and electronic means."
        },
        {
            "number": "LO5.",
            "description": "Perform competent clinical examinations and establish relevant differential diagnoses and prognoses, and provide appropriate and ethical treatment and management plans"
        },
        {
            "number": "LO6.",
            "description": "Understand the key concepts of evidence-based medicine, and use a research-based approach to solve clinical and professional problems"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Clinical Elective: Activity Report / Case Log",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p> 9/11/2026 10:00 am</p></dd>",
            "learning_objectives": "L01, L02, L04, L05",
            "mode": "Written",
            "category": "Notebook/ Logbook",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>General information about the Case Log:</strong></p>\n<ul>\n<li>Each student must maintain a current comprehensive log of cases seen during elective placement.</li>\n<li>Students must submit a Case Log of 10 cases with which they have been primarily involved in the first 3 weeks of their elective placement.</li>\n<li>The MyKnowledge Map platform will be used to log the cases, and students will have to follow the template provided.</li>\n<li>Please note it is the student’s responsibility to submit the Case Log to the correct assessor. All Case Logs are to be sent to the course coordinator (Dr Meler); otherwise, the submissions may not be graded, or marking may be significantly delayed if they are not submitted appropriately.</li>\n<li>The template may require adjustment for non-client-facing rotations such as anaesthesia, pathology or abattoir placement. Please talk to your placement supervisor or the course coordinator if in doubt.</li>\n<li>For Public Health, the Case Log will be replaced by a Portfolio, which is to be submitted by email (no later than <strong>10am Monday 9 November 2026</strong>) to the rotation supervisor, Dr Meler.</li>\n<li><strong>The Case Log needs to be fully completed by 10am Monday, 9th November 2026 and submitted through MyKnowledge Map for review.</strong></li>\n</ul>\n<p><br/></p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<ul>\n<li>This assignment will be marked by attributing 1.5 marks per case. The maximum mark that can be obtained is 15. To obtain the maximum mark, students need to submit by the due date and through the <strong>MyKnowledge Map platform </strong>a complete caselog of 10 individual and original cases seen during elective placement. The quality of the reflection and the degree of detail provided, as well as the variety of cases chosen, will be taken into account in the final mark.</li>\n<li>The due date for this assignment is at the beginning of the last week of the elective placement. Students who fail to submit their completed Case Log will receive a mark of 0.</li>\n<li>Students who submit a partially or inappropriately filled Case Log will receive less than 1.5 marks per case, and the mark will be attributed based on the quantity and quality of the information provided.</li>\n<li>Students who do submit other than by MyKnowledge Map will lose TWO (2) marks unless it is due to a documented technical issue at the time of submission.</li>\n</ul>\n<p><br/></p>\n<p><strong>Use of Artificial Intelligence (AI): </strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submitted through <strong>MyKnowledge Map.</strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Clinical Elective: Placement Performance Assessment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p>Online submission on <strong>InPlace </strong>by the Placement Supervisor</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Activity/ Performance",
            "category": "Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>General information about clinical placements</strong>:</p>\n<ul>\n<li>Students will attend FOUR (4) weeks of full-time clinical elective placement as either a UQ internal rotation or an extramural WIL placement. Refer to the Course Description and Additional Timetable Information for details about allocation and confirmation of placements.</li>\n<li>Elective preferences for internal rotations must be submitted via InPlace by <strong>10am Friday, 24th July 2026</strong>. Internal rotations will be allocated by the Course Coordinator. Please consider carefully when submitting your preferences, as allocations are final once published and confirmed in InPlace.</li>\n<li>Students choosing to complete their elective placement as extramural WIL are to source their own placement with an external provider and submit details via InPlace before <strong>10am Friday 7th August 2026</strong>.</li>\n<li>The clinical elective placement must be completed in agreement with the published InPlace schedule, i.e., <strong>19th October - 15th November 2026</strong>. Variations to the InPlace schedule can only be approved by the School of Veterinary Science Chief Examiner via a Deferred Examination Request - see <em>Additional Timetable Information</em> below for more details.</li>\n<li>Assessment of performance is completed by the supervisor in the areas of knowledge base, clinical skills, technical skills, professionalism, and communication, according to guidelines set by the School of Veterinary Science. The assessment request is automatically sent to the industry placement partner in week 3 of the 4-week placement.</li>\n</ul>\n<p><br/></p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<ul>\n<li>Assessment of student performance is submitted through InPlace. Students are asked to remind their supervisor to fill out their assessment by <strong>10am Sunday 15th November 2026</strong> at the latest, as their placement performance assessment is an essential component of their grades.</li>\n<li>Clinical supervisors will receive the request to submit the performance assessment by the end of the third week, and at the latest by the last day of the student's attendance. This is because there is only a very short interval between the last day of placement and grade finalisation.</li>\n<li>Marking and assessment of the student’s performance during the rotation/placement will be carried out via the InPlace online platform following a standardised rubric (available on Blackboard).</li>\n<li>The clinical elective placement will be assessed using the rubric (available on Blackboard), which comprises 5 equally-weighted categories (Knowledge base; Clinical skills; Technical skills; Professional skills and Communication skills). Each category will have three performance levels (0/Does not meet standard; 1/Meets standard; 2/Exceeds standard). Students who score at least a “Meets standard” (an average of &gt; or equal to 1.0) in all categories pass the rotation. Students who score a “Does not meet standard” (an average of &lt;1.0) for any category will be required to undertake a “Formalised additional learning plan” (FALP). <em>See ADDITIONAL COURSE GRADING INFORMATION.</em></li>\n</ul>\n<p><br/></p>\n<p><strong>Use of Artificial Intelligence (AI) </strong></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Online submission on InPlace by the Placement Supervisor by <strong>10am Sunday 15 November 2026. </strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "EBVM: Student details, Topic and Supervisor Confirmation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> P/F </dd>",
            "due_date": "<dd><p> 6/03/2026 10:00 am</p></dd>",
            "learning_objectives": "L01, L03, L04",
            "mode": "Written",
            "category": "Notebook/ Logbook",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Identification of an EBVM primary supervisor, secondary assessor and topic</strong>.</p>\n<p>First assessment piece is the primary advisor's and secondary assessor details form, which will be due by <strong>10am Friday 6th March 2026</strong>. The objective of this P/F assessment is to encourage students to find a supervisor early and to start identifying a broad topic for their EBVM early. It is STRONGLY advised that you start working on the EBVM early in the year and have a plan in place with your supervisor on how to best manage time and deadlines throughout the year. Securing an advisor early is ESSENTIAL for students to manage this task effectively throughout the year and to complete the EBVM aspect of the course successfully. Should you have difficulties securing an EBVM supervisor, please contact the course supervisor at least 2 weeks ahead of the deadline to seek some assistance. Students who do not seek the assistance of the course coordinator prior to the deadline and who have not secured a supervisor by that deadline will still need to submit a form providing evidence of attempts to secure a supervisor to be able to pass this component of the course.</p>\n<p>The form must be completed and submitted by the specified deadline before students may commence work on the systematic review assessment. </p>\n<p><strong>This is a Pass/Fail assessment item. </strong> Unless a student has been granted a valid extension, failure to submit this form by <strong>10am Friday 27th March 2026 </strong>will prevent progression of the EBVM systematic review (i.e. subsequent assessment tasks will not be considered) until this form is submitted.</p>\n<p><strong>Use of Artificial Intelligence (AI) </strong> </p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission will be through <strong>MyKnowledge Map.</strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "EBVM: Project Plan (also called Protocol Form)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 17/04/2026 10:00 am</p></dd>",
            "learning_objectives": "L01, L02, L04, L06",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The second assessment piece is the systematic review Project Plan (Protocol Form), which will be due by <strong>10am Friday 17th April 2026. </strong>This assessment aims at preparing you best to tackle the EBVM task, helping you define your research goal using a PICO question, identify relevant articles through a systematic database search using relevant inclusion criteria and prepare for data collection, setting up your data collection template. The protocol form needs to be reviewed and approved by your supervisor prior to submission.</p>\n<p>This assessment is designed to enable a timely start for the EBVM (systematic review of an intervention in veterinary medicine) assessment by formally linking the student to a supervisor, independent assessor and topic, and to provide initial feedback and support. Students are required to complete the appended form that details their EBVM plan to the nominated supervisor and course coordinator.</p>\n<ul>\n<li>The student must complete and submit this form to their nominated advisor for signature in advance of the due date. The student must then upload an electronic copy of this completed form on the Blackboard site via TurnItIn.</li>\n<li>Please note that this form will be reviewed and assessed by either the course co-coordinator or an epidemiologist. The main aim of this assessment is to provide support and feedback to student relevant to their systematic review.</li>\n</ul>\n<p>Please note that this form will be reviewed and assessed by either the course co-coordinator or an epidemiologist. The main aim of this assessment is to provide support and feedback to student relevant to their systematic review.</p>\n<p>The marking sheet for the Project Plan is available on Blackboard and is different to the EBVM, which has its own distinct marking criteria.</p>\n<p><strong>Use of Artificial Intelligence (AI) </strong> </p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Upload your assessment through the submission point (or Turnitin) in Blackboard Ultra.</strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-4",
            "assessment_title": "EBVM: Supervisor Performance Assessment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p> 31/07/2026 10:00 am</p></dd>",
            "learning_objectives": "L01, L02, L04, L06",
            "mode": "Activity/ Performance",
            "category": "Performance",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The third assessment piece is the EBVM supervisor performance assessment, which will be due at <strong>10am Friday 31st July 2026.</strong></p>\n<p>This form has been added to this course to ensure close collaboration between students and their primary supervisor. Student/advisor interactions are an essential component of the EBVM assignment to achieve high-quality work. Continued collaboration with your advisor, proper time management, progression of the work throughout the year and ethical use of AI will be assessed in the Supervisor assessment form.</p>\n<p>It is recommended that you schedule a meeting ahead of this deadline with your supervisor and that you discuss with them the progression and timeline to send them your latest draft for revision before your submission deadline. At this meeting, your supervisor might ask you questions to test your knowledge of your understanding of the topic and on your approach to the critical appraisal of the review that you have performed. Please remind your supervisor to fill out this form by the due date.</p>\n<p><strong>Use of Artificial Intelligence (AI) </strong></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The form is triggered by the student on <strong>MyKnowledge Map</strong> in the weeks prior to the deadline. The primary supervisor must complete and submit this form on Blackboard by <strong>10am 31 July 2026</strong>. Ideally, the form should be filled out at the time of a meeting organised by the student in the month of July to discuss the topics highlighted in the form. This assessment is not about the marking of the final EBVM essay but on the process of writing and interacting with the literature, AI and supervisor, as well as time management.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-5",
            "assessment_title": "EBVM: Systematic Review of an Intervention",
            "special_indicators": [],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 4/09/2026 10:00 am</p></dd>",
            "learning_objectives": "L01, L02, L04, L06",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The fourth and last assessment piece is the EBVM systematic review essay submission, which will be <strong>10am Friday 4th September 2026 </strong>to allow sufficient time for primary advisors and secondary assessors to mark the essays prior to the start of the elective placements. </p>\n<p><strong>Evidence-Based Veterinary Medicine: Systematic Review of an intervention in veterinary medicine.</strong></p>\n<p>The focus of this report is on a systematic review that pertains to the evaluation of an intervention. In this context, ‘intervention’ refers to a treatment used to prevent, reduce or treat an adverse health outcome or event in animal populations and encompasses strategies such as antimicrobials, biologics and dietary or management manipulation. The report is expected to cover five main elements: a systematic review protocol, a well-articulated clinical/research question, search plan for evidence to help answer the question, a critical evaluation of the evidence, and an interpretation and discussion of the results of the review. You are required to adequately address each section concisely in a structured written report following the conventions of scientific writing.</p>\n<p><strong>Sources of information:</strong></p>\n<ul>\n<li>Key references and other sources of information must be identified (the advisor will assist).</li>\n<li>Voluntary session designed to refresh research skills (including the use of databases and the referencing program Endnote) and to discuss the organisation of the systematic review will be scheduled at the UQ Gatton Library, including using Zoom. Times and venues will be announced via Blackboard. </li>\n<li>Additional sources of information will be posted on the VETS5016 course Blackboard site and the course library website at <a href=\"http://guides.library.uq.edu.au/VETS5016-systematic_reviews\">http://guides.library.uq.edu.au/VETS5016-systematic_reviews</a></li>\n</ul>\n<p><br/></p>\n<p><strong>Criteria &amp; Marking</strong></p>\n<p>Guidelines are available on Blackboard. This assessment critically evaluates the essay on Turnitin.</p>\n<p><strong>Use of Artificial Intelligence (AI) </strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Upload your EBVM Systematic Review assessment through the submission point (or Turnitin) in Blackboard Ultra Assessments folder.</strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeks",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Evidence-based veterinary medicine</strong><br><p>Evidence-based veterinary medicine (Online Research): Systematic review of an intervention: A review of a clearly formulated question that uses systematic and explicit methods to identify, select, and critically appraise relevant research, and to collect and analyse data from the studies that are included in the review. The review will involve a systematic search process to locate studies that address a particular research question, as well as a systematic presentation and synthesis of the characteristics and findings of the results of this search. Criteria for inclusion and exclusion in the review will be objective, explicitly stated and consistently implemented such that the decision to include or exclude particular studies is clear to readers and another researcher using the same criteria would likely make the same decision. This explicit approach aims to minimise bias and allows readers of the review to assess the authors assumptions, procedures, evidence and conclusions, rather than taking the authors conclusions on faith. Specific instructions will be provided in Blackboard. This activity will be submitted through Blackboard Turnitin for marking.</p>\n<p>Readings/Ref: -; Higgins 2011; Thrusfield ch16; Guyatt 2011a; Hopewell 2009; CRD 2009; Dickersin 1994; Kleijnen 2009; O'Connor 2014a</p></br></p><p><strong>Sub-activity:</strong> EBVM Supervisor support</p><p><strong>Learning outcomes:</strong> L01, L02, L04, L06</p></div></td>",
            "topic_title": "<strong>Evidence-based veterinary medicine</strong>",
            "topic_description": "Evidence-based veterinary medicine Evidence-based veterinary medicine (Online Research): Systematic review of an intervention: A review of a clearly formulated question that uses systematic and explicit methods to identify, select, and critically appraise relevant research, and to collect and analyse data from the studies that are included in the review. The review will involve a systematic search process to locate studies that address a particular research question, as well as a systematic presentation and synthesis of the characteristics and findings of the results of this search. Criteria for inclusion and exclusion in the review will be objective, explicitly stated and consistently implemented such that the decision to include or exclude particular studies is clear to readers and another researcher using the same criteria would likely make the same decision. This explicit approach aims to minimise bias and allows readers of the review to assess the authors assumptions, procedures, evidence and conclusions, rather than taking the authors conclusions on faith. Specific instructions will be provided in Blackboard. This activity will be submitted through Blackboard Turnitin for marking. Readings/Ref: -; Higgins 2011; Thrusfield ch16; Guyatt 2011a; Hopewell 2009; CRD 2009; Dickersin 1994; Kleijnen 2009; O'Connor 2014a Sub-activity: EBVM Supervisor support",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>EBVM library session(s)</strong><br><p>EBVM guidance for library search of literature, and EndNote - training provided by the Library.</p></br></p><p><strong>Sub-activity:</strong> Library SDL research</p><p><strong>Learning outcomes:</strong> L01, L02, L06</p></div></td>",
            "topic_title": "<strong>EBVM library session(s)</strong>",
            "topic_description": "EBVM library session(s) EBVM guidance for library search of literature, and EndNote - training provided by the Library. Sub-activity: Library SDL research",
            "learning_outcomes": [
                "L01",
                "L02",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Elective placement</strong><br><p>The clinical elective placement is designed to expand clinical skills and experiences in the student's particular area of interest. Students will attend four weeks of full-time clinical placement and work with clinical practitioners. Activities within each elective placement will be tailored to each student's particular area of interest. Performance will be assessed by the rotation supervisor and submitted through One45.</p></br></p><p><strong>Sub-activity:</strong> Clinical Elective Placement</p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Elective placement</strong>",
            "topic_description": "Elective placement The clinical elective placement is designed to expand clinical skills and experiences in the student's particular area of interest. Students will attend four weeks of full-time clinical placement and work with clinical practitioners. Activities within each elective placement will be tailored to each student's particular area of interest. Performance will be assessed by the rotation supervisor and submitted through One45. Sub-activity: Clinical Elective Placement",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}