{
    "course_title": "Publishing and Professional Practice",
    "study_period": "Sem 1 2026",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/WRIT7015-21465-7620",
    "full_course_code": "WRIT7015-21465-7620",
    "course_code": "WRIT7015",
    "class_code": "21465",
    "semester_code": "7620",
    "semester_details": "Semester 1, 2026 (23/02/2026 - 20/06/2026)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate an understanding of contemporary writing, editing, and publishing‑adjacent industries, including professional communities, events, and career pathways in Australian and global contexts."
        },
        {
            "number": "LO2.",
            "description": "Identify and evaluate strategies for professional engagement and career development, including networking, conference participation, and the use of social media and other industry platforms."
        },
        {
            "number": "LO3.",
            "description": "Apply critical reading and reviewing practices to produce audience‑appropriate responses to published texts, including short‑form reviews for public or professional contexts."
        },
        {
            "number": "LO4.",
            "description": "Research and synthesise information about industry practices, debates, or professional trends, and communicate findings clearly to a specialist or peer audience."
        },
        {
            "number": "LO5.",
            "description": "Communicate professionally and effectively in oral, written, and visual formats, including participation in scholarly or industry‑style forums such as symposia and poster presentations."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Assessment 1 - Video Book Review",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>20% 2 minute video and documents (600-1000 words) </dd>",
            "due_date": "<dd><p> 23/03/2026 4:00 pm</p>\n<p>\n</p><p>Submit <strong>written materials</strong> in one file via <strong>Turnitin through Blackboard.</strong></p>\n<p>Submit <strong>video materials </strong>in one file to <strong>Echo360 through Blackboard.</strong></p></dd>",
            "learning_objectives": null,
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Paper/ Report/ Annotation, Practical/ Demonstration",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>In this assessment, students will create a short‑form digital book review designed for contemporary online audiences. Students will select a book of any genre published in <strong>2025 or 2026</strong> and produce a <strong>two‑minute TikTok‑style video review</strong>, supported by a written script and planning documentation (to be discussed in seminars).</p>\n<p>The project requires students to demonstrate critical engagement with the chosen text while adapting their review to the conventions, affordances and audience expectations of a specific digital platform and audience. Accompanying planning materials will outline the intended platform for publication, target audience, content strategy, hashtags, captions, links, and any relevant promotional or contextual considerations.</p>\n<p>This assessment develops students’ skills in critical reading, audience‑aware writing, digital storytelling and professional communication, and reflects contemporary practices in book reviewing, promotion, and cultural commentary.</p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>TurnItIn Receipts:</strong> </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Assessment 2 - WEP Symposium poster and presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30% Poster presentation/discussion </dd>",
            "due_date": "<dd><p> 19/05/2026 - 26/05/2026</p>\n<p>\n</p><p>Students will be <strong>allocated to presentation groups during the semester</strong>. Groups determine the week in which each student will <strong>present their poster</strong> as part of the symposium.</p>\n<p><strong>Attendance at both symposium weeks is required.</strong></p>\n<p>All students must:</p>\n<ul>\n<li><strong>Present their poster</strong> in their allocated presentation week, and</li>\n<li><strong>Attend and participate</strong> in the other symposium week as an audience member and peer assessor.</li>\n</ul>\n<p><br/></p>\n<p>Attendance at both scheduled symposium sessions—the session in which you <strong>present</strong> and the session in which you act as a <strong>peer assessor</strong>—is mandatory in order to receive a grade for this assessment. The symposium dates are published in the ECP; students must ensure they are available and make the necessary arrangements to attend.</p></dd>",
            "learning_objectives": null,
            "mode": "Oral",
            "category": "Practical/ Demonstration, Poster, Role play/ Simulation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<h3>Assessment Overview</h3>\n<p>This assessment requires students to produce a <strong>professional poster</strong> and deliver an <strong>oral presentation</strong> based on the <strong>recommendations developed in their industry report (assessment three)</strong>. The assessment will be conducted during a scheduled <strong>symposium</strong>, designed to simulate professional and industry-facing presentation contexts such as conferences, briefings, or stakeholder discussions.</p>\n<p>This assessment is classified as a <strong>secure assessment</strong>. Students are required to be present at the symposium class and to demonstrate their own understanding of the work by presenting their ideas, responding to questions, and participating in discussion of classmate's presentations. Students will be <strong>allocated to presentation groups during the semester</strong>. Groups determine the week in which each student will <strong>present their poster</strong> as part of the symposium.</p>\n<p><strong>Attendance at both symposium weeks is required.</strong></p>\n<p>All students must:</p>\n<ul>\n<li><strong>Present their poster</strong> in their allocated presentation week, and</li>\n<li><strong>Attend and participate</strong> in the other symposium week as an audience member and peer assessor.</li>\n</ul>\n<p><br/></p>\n<p>Both presentation and participation form part of the assessment requirements. Failure to attend either week may impact assessment outcomes and will be managed in accordance with University policies on attendance and deferred assessment.</p>\n<p><br/></p>\n<h3>Poster</h3>\n<p>Students will design and produce a <strong>poster</strong> that communicates:</p>\n<ul>\n<li>The issue, challenge, or focus area developed in their report</li>\n<li>Key insights or findings relevant to that issue</li>\n<li>Clear, well-articulated recommendations for practice, change, or career development</li>\n</ul>\n<p><br/></p>\n<p>The poster should be professionally presented and accessible to a broad academic or industry-informed audience. Students are expected to translate their written work into concise, visually organised form suitable for discussion and engagement.</p>\n<p>Details regarding poster size, format, and presentation logistics will be provided during the semester.</p>\n<p><br/></p>\n<h3>Oral Presentation and Discussion</h3>\n<p>Students will deliver an <strong>oral presentation</strong> based on their poster and report recommendations. Rather than focusing on length, the emphasis of the presentation is on students’ ability to:</p>\n<ul>\n<li>Clearly explain the focus of their work</li>\n<li>Justify and articulate their recommendations</li>\n<li>Demonstrate understanding of the research and thinking underpinning those recommendations</li>\n<li>Engage professionally in discussion and respond to questions</li>\n<li>Delivering approripate feedback to peers</li>\n</ul>\n<p><br/></p>\n<p>The presentation and discussion component is central to the secure nature of the assessment, as it requires students to demonstrate preparedness, originality, and ownership of their work.</p>\n<p>This presentation may be recorded for grade moderation purposes. Recordings will be kept securely according to university policies.</p>\n<p><br/></p>\n<h3>Peer Assessment Component</h3>\n<p>This assessment includes a <strong>peer assessment component</strong> conducted during the symposium day. Students will be required to engage with the work of other presenters and provide structured feedback using a supplied online form.</p>\n<p>Peer assessment is designed to support:</p>\n<ul>\n<li>Critical engagement with classmates’ work</li>\n<li>Reflection on effective communication and professional practice</li>\n<li>The development of evaluative judgement</li>\n</ul>\n<p><br/></p>\n<p>Peer feedback will be <strong>criteria‑guided</strong> and focused on the clarity, persuasiveness, and credibility of each presenter’s recommendations. Peer assessment will be used <strong>alongside staff assessment</strong> and may be moderated to ensure fairness and consistency.</p>\n<p>Participation in the peer assessment process is a required part of the symposium activity.</p>\n<p><br/></p>\n<h3>Relationship to Other Assessments and Feedback</h3>\n<p>The poster and presentation function as a formative stage for the final industry report. Feedback generated through audience questions and discussion on the symposium day can be used to inform revisions to the report, including the clarification, strengthening, or reconsideration of recommendations where appropriate.</p>\n<p><br/></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Presentation in class time, posters collected </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>Attendance at both scheduled symposium sessions—the session in which you <strong>present</strong> and the session in which you act as a <strong>peer assessor</strong>—is mandatory in order to receive a grade for this assessment. The symposium dates are published in the ECP; students must ensure they are available and make the necessary arrangements to attend.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Assessment 3 - Portfolio and report",
            "special_indicators": [],
            "weighting": "<dd>50% 10 portfolio items and a report (2000-3000 words) </dd>",
            "due_date": "<dd><p> 10/06/2026</p></dd>",
            "learning_objectives": null,
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Paper/ Report/ Annotation, Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<h3>Assessment Overview</h3>\n<p>This assessment consists of a <strong>portfolio of work</strong> developed across the semester and a <strong>formal industry report</strong>. The portfolio is intentionally open in form and content and is designed to support students working towards a wide range of professional outcomes.</p>\n<p><br/></p>\n<h3>Part A: Portfolio (Ten Pieces)</h3>\n<ul>\n<li>Students will submit <strong>ten portfolio pieces</strong> developed over the semester. Portfolio pieces are developed through weekly <strong>in‑class tasks</strong>, which may be submitted, revised, or adapted to support the final report. Portfolio pieces may take a wide range of forms, depending on the student’s professional interests and these will be discussed in seminars.</li>\n</ul>\n<p><br/></p>\n<p>The portfolio is intended to demonstrate <strong>process, development, and professional thinking</strong>, rather than polish alone. A minimum of 8 pieces need to be submitted to receive a pass or above for this task. If less than 8 pieces are submitted,<strong> the portfolio component of this assessment will receive an automatic grade of 3 (marginal fail) or below.</strong></p>\n<p><br/></p>\n<h3>Part B: Industry Report (2,000–3,000 words)</h3>\n<p>Students will submit a <strong>formal report</strong> that situates their portfolio work within a broader professional or industry context. The report may take one of two approaches.</p>\n<h4>Option 1: Career Pathways Report</h4>\n<p>Students identify their intended professional area and use the report to analyse:</p>\n<ul>\n<li>Employment and career pathways relevant to their interests</li>\n<li>Opportunities for professional development and progression</li>\n<li>Community building, networks, and professional cultures</li>\n<li>Visibility, positioning, and self-presentation within the field</li>\n<li>Structural, ethical, or practical challenges in the industry</li>\n<li>Short- and medium-term professional goals</li>\n</ul>\n<p><br/></p>\n<p>The report should include <strong>practical recommendations</strong> the student can apply to their own portfolio, professional development, and career planning.</p>\n<p><br/></p>\n<h4>Option 2: Industry Issue Analysis and Recommendations</h4>\n<p>Students identify a key issue, challenge, or ongoing conversation within their chosen professional context and:</p>\n<ul>\n<li>Analyse the issue in relation to industry structures or practices</li>\n<li>Consider impacts on workers, organisations, or communities</li>\n<li>Engage with relevant research, policy, or professional discourse</li>\n<li>Make clear, realistic recommendations for change or improvement</li>\n</ul>\n<p>Recommendations may be directed towards organisations, employers, industry bodies, or practitioners and should demonstrate critical and ethical awareness.</p>\n<p><br/></p>\n<h3>Format and Presentation</h3>\n<p>The <strong>portfolio</strong> is <strong>open in format</strong>. You may submit their portfolio in a range of forms appropriate to the range of materials as well as your professional goals and areas of interest. Possible formats include (but are not limited to) a compiled document, a digital or web‑based portfolio, or a curated collection of materials presented in another suitable medium. The specific mode of submission for the portfolio will be discussed with, and approved by, the lecturer to ensure it is appropriate, accessible, and assessable.</p>\n<p>The <strong>report</strong> is a<strong> professional document</strong>. It should be clearly structured, written in an appropriate academic or professional register, and presented in a conventional written format (e.g. a structured report or essay-style document). The report must meet standard expectations for clarity, coherence, referencing, and professional presentation. It follows on from your <strong>Symposium Poster assessment</strong>, and it is suggested that you use feedback received on the day to improve your report.</p>\n<p><br/></p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via TurnItIn through Blackboard</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(23 Feb - 01 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1</strong><br><p>Introduction to the course, assessment structure, and expectations for the semester. Discussion of texts, professional writing contexts, and industry conversations. Please bring a copy of a favourite book and <em>Yellowface</em>. Complete the readings in the Week 1 resources folder.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 1</strong>",
            "topic_description": "Week 1 Introduction to the course, assessment structure, and expectations for the semester. Discussion of texts, professional writing contexts, and industry conversations. Please bring a copy of a favourite book and Yellowface . Complete the readings in the Week 1 resources folder.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 2(02 Mar - 08 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2</strong><br><p>Book reviews &amp; book review culture.</p></br></p></div></td>",
            "topic_title": "<strong>Week 2</strong>",
            "topic_description": "Week 2 Book reviews & book review culture.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(09 Mar - 15 Mar)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3: Work on your videos</strong><br><p>No class: work on your book review videos</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 3: Work on your videos</strong>",
            "topic_description": "Week 3: Work on your videos No class: work on your book review videos",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 4(16 Mar - 22 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4</strong><br><p>The portfolio career of the writer and editor. </p></br></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Week 4</strong>",
            "topic_description": "Week 4 The portfolio career of the writer and editor.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5(23 Mar - 29 Mar)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5</strong><br><p>Challenges and opportunities in writing‑related industries.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 5</strong>",
            "topic_description": "Week 5 Challenges and opportunities in writing‑related industries.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 6(30 Mar - 05 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6</strong><br><p>Physical formats, production processes, and commercial considerations relevant to professional writing contexts.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 6</strong>",
            "topic_description": "Week 6 Physical formats, production processes, and commercial considerations relevant to professional writing contexts.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Mid-sem break(06 Apr - 12 Apr)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MIDSEMESTER BREAK</strong><br/></p></div></td>",
            "topic_title": "<strong>MIDSEMESTER BREAK</strong>",
            "topic_description": "MIDSEMESTER BREAK",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(13 Apr - 19 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7</strong><br><p>Community building in the writing world.</p></br></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Week 7</strong>",
            "topic_description": "Week 7 Community building in the writing world.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8(20 Apr - 26 Apr)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8</strong><br><p>Promotional strategies, audience development, and market positioning for writers and communicators.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Week 8</strong>",
            "topic_description": "Week 8 Promotional strategies, audience development, and market positioning for writers and communicators.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9(27 Apr - 03 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9</strong><br><p>Australian writing and content within international markets, platforms, and cultural contexts.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Week 9</strong>",
            "topic_description": "Week 9 Australian writing and content within international markets, platforms, and cultural contexts.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10(04 May - 10 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10</strong><br><p>How written work is sold, commissioned, distributed, and sustained across a variety of professional contexts. </p></br></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Week 10</strong>",
            "topic_description": "Week 10 How written work is sold, commissioned, distributed, and sustained across a variety of professional contexts.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(11 May - 17 May)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11</strong><br><p>Reflection, professional identity, and future pathways</p></br></p></div></td>",
            "topic_title": "<strong>Week 11</strong>",
            "topic_description": "Week 11 Reflection, professional identity, and future pathways",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(18 May - 24 May)",
            "activity_type": "Symposium",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12</strong><br><p>In-class symposium and presentations tonight. </p></br></p></div></td>",
            "topic_title": "<strong>Week 12</strong>",
            "topic_description": "Week 12 In-class symposium and presentations tonight.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(25 May - 31 May)",
            "activity_type": "Symposium",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13</strong><br><p>In-class symposium and presentations tonight.</p></br></p></div></td>",
            "topic_title": "<strong>Week 13</strong>",
            "topic_description": "Week 13 In-class symposium and presentations tonight.",
            "learning_outcomes": []
        }
    ]
}