{
    "course_title": "Pasture Science & Management",
    "study_period": "Sem 2 2024",
    "location": "Gatton",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/AGRC7051-64571-7460",
    "full_course_code": "AGRC7051-64571-7460",
    "course_code": "AGRC7051",
    "class_code": "64571",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Explain the principles and risks associated with pasture plant introduction and improvement"
        },
        {
            "number": "LO2.",
            "description": "Develop recommendations of suitable pastures for landholders to grow based on their particular circumstances"
        },
        {
            "number": "LO3.",
            "description": "Identify factors affecting yield and ecology of sown pastures under grazing and be able to estimate pasture growth and carrying capacity"
        },
        {
            "number": "LO4.",
            "description": "Compare and analyse different pasture sampling and monitoring techniques"
        },
        {
            "number": "LO5.",
            "description": "Explain the role of pastures in sustainable livestock production and in crop-livestock systems"
        },
        {
            "number": "LO6.",
            "description": "Develop strategies to improve pasture resources in tropical environments and to overcome pasture production issues (e.g. seed production, establishment)"
        },
        {
            "number": "LO7.",
            "description": "Critique available literature on topical issues associated with pasture science and management and formulate key recommendations"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Case study",
            "special_indicators": [],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p> 6/09/2024 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Case Study - 2024</strong></p>\n<p>A landholder near Clifton is wanting to establish an improved pasture in a 60-hectare paddock, for the purpose of fattening beef cattle. For those who do not know where Clifton is, it is a small town in the Darling Downs Region, about 50 km south of Toowoomba and 150 km west of Brisbane.</p>\n<p>The paddock has been cultivated to prepare a favourable seedbed and there are no trees. Using the Pastures Australia Selection Tool (<a href=\"https://keys.lucidcentral.org/keys/v3/pastures/index.htm\">https://keys.lucidcentral.org/keys/v3/pastures/index.htm</a>) make a recommendation on what would be a suitable pasture mix for planting, from a suitability and productivity perspective. The pasture mix should contain two pasture grasses and two legumes. Before making your recommendations double check the website of two pasture seed suppliers (Barenbrug Seeds – see their Tropical Pastures Guide <a href=\"https://barenbrug.com.au/international/brochures-publications\">https://barenbrug.com.au/international/brochures-publications</a>, DLF Seeds <a href=\"https://www.dlfseeds.com.au/products/tropical-subtropical\">https://www.dlfseeds.com.au/products/tropical-subtropical</a><strong> ) </strong>to ensure seeds of the pasture species are commercially available for growing in Australia.</p>\n<p>Consider the following parameters associated with the location and characteristics of the paddock:</p>\n<ul>\n<li>Select Queensland then Condamine region in the Pastures Australia Selection Tool</li>\n<li>Permanent pasture (&gt;5 years)</li>\n<li>Rainfall – 690 mm</li>\n<li>Soil texture – Heavy (Clay, heavy clay)</li>\n<li>Soil pH – Alkaline (&gt; 7.5)</li>\n<li>Soil drainage – Less well drained</li>\n<li>Level of soil salinity – Medium (3-8 dS/m)</li>\n</ul>\n<p>In your response:</p>\n<ul>\n<li>Include an introduction that outlines the benefits of improved pastures (use supporting references) for beef production and highlights the objectives of the exercise.</li>\n<li>In your own words, summarise the unique characteristics of the paddock (i.e. rainfall, soil type etc.), and how you went about shortlisting suitable grasses and legumes.</li>\n<li>Outline how many and which grasses and legumes were identified as suitable for growing in the paddock using the Pasture Australia Selection Tool.</li>\n<li>Name the two improved grasses and two legumes that you are recommending and provide justification as to why you selected them (<em>e.g.</em> ease of establishment, compatibility with each other, nutritional quality). <strong>Note that in the Pasture Australia Selection Tool, shortlisted species highlighted in green are the most suitable, followed by those highlighted in orange</strong>.</li>\n<li>The fact sheets in the Tropical Forages database (<a href=\"https://www.tropicalforages.info/text/intro/index.html\">https://www.tropicalforages.info/text/intro/index.html</a>) are a good source of specific information on individual pasture species and will help with your shortlisting of suitable grasses and legumes.</li>\n<li>Conclude with a brief summary of the objective of the exercise and your key recommendations.</li>\n</ul>\n<p><em>You must reference all sources in text and provide a reference list (recommend using APA 7th referencing style) at the end of your assignment. No marks will be given for copied materials. Word Length should not exceed 1500 words exclusive of references.</em></p>\n<p><strong>Please note: This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</strong></p>\n<p> </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments should be submitted via the Turnitin link in Blackboard by the assigned due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Pasture sampling assignment",
            "special_indicators": [],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 4/10/2024 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Pasture Sampling Exercise 2024</strong></p>\n<p>Students enrolled in the internal mode in Semester 2 will conduct a pasture sampling exercise during a class directed practical. If possible, external students are welcome to attend the sampling practical. Data from the practical will be provided to all students via Blackboard.</p>\n<p><strong>Method</strong></p>\n<p>Students are required to work in small groups to estimate the yield and botanical composition of a pasture using different sampling methods. Specifically, you are required to:</p>\n<ol>\n<li>Sample approximately 20 quadrats (50 cm x 50 cm) per group over the paddock to measure yield and botanical composition using various methods. Use a systematic grid pattern to locate the position of the quadrats. For each quadrat, note the yield score (1-10), rising plate meter measurement, the % of each component by dry weight, and the 1st, 2nd and 3rd dominant species if 3 species are present.</li>\n<li>Determine yield by the visual scoring method. Yield of the pasture can be measured by a visual scoring technique where each of the quadrats is scored between 1 and 10 (1 = lowest yield and 10 = highest yield in the paddock). To calibrate your yield scores, you need to select at least three reference quadrats against which all other quadrats are compared. You should locate the lowest yield in the paddock and give that pasture a yield score of 1 (note: bare ground is equivalent to a yield score of 0). Conversely, locate the highest yield in the paddock and give that pasture a yield score of 10. You should also locate a medium yield location and give a score of 4, 5 or 6 depending on its relative yield compared to the 1 and 10 scores. <strong>Spending time calibrating visual scores as a group is essential for accurate and consistent results.</strong></li>\n<li>Determine yield by the rising plate meter method. Rising plate meters can quickly estimate pasture yield by measuring the height of pasture under the weight of a standard plate (usually 4kg/m2).</li>\n<li>At the end of the sampling exercise, each group will provide yield scores and RPM measurements (only one group) for 10 quadrats that have been located to give a spread of scores from 1 to 10. These quadrats will then be cut to a standard height of 5 cm above ground level, with the herbage from each quadrat to be placed in individual bags.</li>\n<li>Place the paper bags in an oven and dry at 65oC for 48 hours. Weigh each bag, subtracting the weight of the packet so that you have a dry weight, yield score and a rising plate meter measurement for each of the hand-cut quadrats.</li>\n<li>All the data will be combined and provided to all students to undertake calculations of pasture yield, composition and stocking rates.</li>\n</ol>\n<p><strong>Calculations</strong></p>\n<p>Calculations will be discussed in class and will include (a) Determining whether enough samples (i.e. quadrats) were taken to accurately measure the yield of pasture using both the visual score and rising plate methods, (b) quantifying and comparing the yield and botanical composition of the pastures using two techniques, and (3) determining the carrying capacity.</p>\n<p><strong>Report submission</strong></p>\n<ul>\n<li>Report requirements will be discussed in class but require the following sections - Introduction, Adequacy of the sampling regime, Calibration graphs and equations, Mean dry matter yield of the pasture, Botanical composition, Carrying capacity, Conclusion, References.</li>\n<li>Word Length should not exceed 2000 words exclusive of references, graphs, tables and figures. For all references (recommend using APA 7th referencing style), provide a reference list at the end of your report. No marks will be given for copied materials.</li>\n</ul>\n<p><strong>Please note: This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Turnitin: You must submit your Assessment task via the Turnitin link in Blackboard by the submission deadline. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Literature review",
            "special_indicators": [],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 25/10/2024 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Literature review</strong></p>\n<p>Provide a detailed review of literature on 'Different grazing strategies used for livestock production in Australia’.</p>\n<p> Your literature review must:</p>\n<ul>\n<li>Commence with an introduction that describes the importance of grazing pastures appropriately from a productivity and sustainability perspective and outlines the scope of the review (Introduction including scope of review).</li>\n<li>Identify different grazing strategies (e.g. continuous, rotational) that can be utilised for livestock production and describe how they operate (body).</li>\n<li>Compare and contrast the benefits and limitations of the different grazing strategies from a productivity and sustainability perspective (body).</li>\n<li>Conclude with a well-rounded summary, including any gaps in knowledge that could be the focus of future research (conclusions).</li>\n</ul>\n<p>Only use references published from 2000 onwards and while the literature review has an Australian focus, relevant international articles can be utilised if they provide compelling information to support your review.</p>\n<p>You must reference all sources in text and provide a reference list (recommend using APA 7th referencing style) at the end of your assignment. No marks will be given for copied materials. Word Length should not exceed 2500 words exclusive of references.</p>\n<p><strong>Please note: This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Turnitin: You must submit your Assessment task via the Turnitin link in Blackboard by the submission deadline. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Final Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>2/11/2024 - 16/11/2024</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The exam may have questions on any aspect of the course. More details will be given later in the semester using the Blackboard website.</p>\n<p>The exam will be an on-campus exam. Have your UQ student ID card available for all your exams. Students enrolled in Internal delivery must attend the exam in person.</p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": []
}