{
    "course_title": "Anthropology of Current World Issues",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/ANTH1030-63218-7460",
    "full_course_code": "ANTH1030-63218-7460",
    "course_code": "ANTH1030",
    "class_code": "63218",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand key anthropological concepts and methods"
        },
        {
            "number": "LO2.",
            "description": "Think openly and critically about cultural difference and sameness andevaluate the world from a range of perspectives and points of view"
        },
        {
            "number": "LO3.",
            "description": "Synthesize and engage anthropological work on current world issues as experienced in a variety of places by a variety of people"
        },
        {
            "number": "LO4.",
            "description": "Analyse and evaluate current world issues through an anthropological lens"
        },
        {
            "number": "LO5.",
            "description": "Develop critical thinking and communication skills"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "World101x quizzes, participation, project",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 26/07/2024 - 25/10/2024</p>\n<p>\n</p><p>By 2pm on the Friday of each World101X online study week</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>*We will sign up to the MOOC World101x together and discuss the requirements for this assessment item in the first tutorial, so please make sure you are able to attend. Clear instructions will also be posted on blackboard.</strong></p>\n<p><strong>Online Quizzes, participation tabs and online museum project:</strong></p>\n<p>For each online study module, you will complete short, multiple-choice quizzes on edX to test your comprehension of the module's content. These quizzes will be completed and scored through the edX platform.</p>\n<p>You must complete the quiz for each online study module by Friday of the preceding week at 2pm.</p>\n<p>The online study modules will be open at the start of the semester. You will have only one attempt at each quiz; re-tries are not possible. Prior to completing the quiz, please make sure you have a secure internet connection and have updated your internet browser to the latest version.</p>\n<p>You can follow your progress on the edX MOOC site under the 'progress' tab.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. For more information on quizzes, please see the Learn.UQ Assessment website at <a href=\"https://web.library.uq.edu.au/node/1715/4\">https://web.library.uq.edu.au/node/1715/4</a></p>\n<p>If you have any technical problems or questions with regards to online assessment, please visit or contact the UQ Library Ask I.T. Service Helpdesks at <a href=\"https://web.library.uq.edu.au/library-services/it\">https://web.library.uq.edu.au/library-services/it</a></p>\n<p><strong>AI Use:</strong> This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date. These assessments are to be completed via the edX platform.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Museum Project",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>35%</dd>",
            "due_date": "<dd><p> 23/09/2024 12:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>For this project, we want you to reflect on the role of museums, things and material objects more generally, and your perceptions, ideas, and thoughts about how things get categorized, represented and displayed. Think of something that you own that brings you comfort and joy, something that you would hate to lose, something perhaps with a story to tell. Now think of that object in a museum in the future, now existing without its story or its history -- an 'orphan thing' that has come to represent an aspect of your society in the early 21st century.</p>\n<p>Choose ONE object from your own home that is important in some way, and that shows its history, usage and/or significance in some way. Now imagine your object is in a museum 50 years in the future. Attach a label to your object, which will tell someone in 50 years about it, its importance to you, and to the society you live in. The label must be no longer than 100 words. Think critically about the object, its role, and significance, and boil this down to a concise and easy-to-understand label or story. What do you want to tell others and future generations about this object?</p>\n<p>In addition to this label, you will be required to reflect and think critically about some of the issues raised during the course segment on museums and representation in 600 words. For example: What are the broader political and social dynamics around your choice of the object displayed? How do you imagine it might be received, and how might it best be displayed to reveal your intention/s? What do you think are the dynamics at play when museums display objects from the past in general? </p>\n<p>The most visually arresting and highest graded will be displayed in the UQ anthropology museum in a pop-up exhibition at the end of semester.</p>\n<p>This assessment should be structured as follows:</p>\n<ul>\n<li>Power point slide with:</li>\n<li>Title</li>\n<li>Photograph of your object</li>\n<li>Label that describes the object (maximum 100 words)</li>\n</ul>\n<p>On the next slide write your:</p>\n<ul>\n<li>Reflection (600 words)</li>\n</ul>\n<p>We will discuss the format and tips on how to do this in tutorials and provide a basic template for submission on blackboard.</p>\n<p><strong>A note on ChatGPT and other forms of generative AI:</strong></p>\n<p>All assignments for this course are to be researched and written by you. You are to explore the literature, you are to think the ideas, you are to write the sentences, you are to build the argument. I recognise that ChatGPT can be used in a variety of ways in the course of learning about a new topic. Some students, for example, might use ChatGPT as a place to start to begin to learn about a new concept or topic. While this can be helpful, it can also produce results that are highly problematic. We will discuss some of these issues during the course. What I ask of you is this:</p>\n<p>1)    All written assignments are to be researched and written by you.</p>\n<p>2)    If you use ChatGPT as a source of initial inquiry, you: a) acknowledge this in your final submission—in a statement following the conclusion, b) you divulge the questions you asked AI in the course of research, and c) you use the response you receive as a preliminary start only. It is your responsibility to ensure that the information you gather from AI is accurate and timely and I can assure you, from playing around with ChatGPT myself, that this is not always the case. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Media Project",
            "special_indicators": [],
            "weighting": "<dd>35%</dd>",
            "due_date": "<dd><p> 25/10/2024 12:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Project, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The media project is an exercise in taking the anthropological understanding you have gained about a variety of world issues and applying it to a specific case or \"current world issue.\" The media project is about you choosing a particular topic and exploring it anthropologically. Here is how it works:</p>\n<p>1. Choose a current event or issue from the news. This can be something you pick up in the international or local news; it can be something trending on TikTok or twitter; it can be a major issue in your own field of study (for example, engineering, design, or music); or it can be something you observe happening around you, like protests or developments. </p>\n<p>2. Gather at least 4 primary sources, such as news clips, press releases, government reports, videos, photographs, or other information about this event/issue. Depending on your topic, more than 4 sources may be necessary. Unless you are writing on disinformation, all these sources should be from reliable, trustworthy media sources. Consider: what might an anthropologist have to say about this topic? What is anthropological about this particular event or thing in the world? How might you explain this event to someone else by drawing on the perspectives/tools you have learnt in anthropology?</p>\n<p>3. Reflect on how these primary sources resonate with at least 4 peer-review anthropological secondary sources. These can be works we have discussed in class, sources you used for your museum project, or new sources you have found researching. Think about how the particular case might be informed by the theory or argument set forth in these anthropological sources.</p>\n<p>4. From these primary sources, craft your own news piece that brings in an anthropological perspective. This should be between 700-900 words (including captions or comic dialogue), and it can take many different formats: a standard news article, a \"zine\" essay, a radio clip, a video clip, a graphic/comic strip, a series of photos/images/graphs accompanied by relevant text (a visual essay), or something else. You will need to confirm your format with your tutor by mid semester break at the latest. </p>\n<p>5. Write a brief 300-word reflection on how your news piece engages with or speaks to anthropological concepts, theory, or perspectives, i.e., your four secondary sources. This reflection allows you to explain how these anthropological concepts, theories or perspectives have informed your news piece. It is both a tool for checking your own analysis and an opportunity to draw clear connections between primary and secondary sources.</p>\n<p>6. Produce a reference list of all cited primary and secondary anthropological sources. These should be under separate subheadings titled “primary sources” and “secondary sources.” The reference list is NOT part of your word count. Check the UQ Library guides for advice on formatting citations and references for a range of source types: https://web.library.uq.edu.au/research-tools-techniques/referencing-style-guides. </p>\n<p>7. What you will submit is one word document that has three components: 1) the 700-900 word news piece that can take a variety of formats and 2) the 300-word written reflection combined together with 3) a properly formatted citation list with at least 8 sources (4 primary, 4 secondary). You will submit this via Turnitin on Blackboard.</p>\n<p>Even though your project can take different formats, you must demonstrate correct referencing and show that you have drawn upon at least 4 relevant peer-reviewed secondary academic sources and at least 4 primary sources in your writing as indicated by your analysis, reflection, citations, and reference list. We will discuss strategies for working citations into the news piece and for weaving anthropological perspectives into your analysis during tutorials later in the term, as how you approach citations and analysis will vary with different formats. </p>\n<p>In marking your projects, we will be less concerned with whether you demonstrate the correct answer (assuming there is one) than with your presentation of an organised, reasoned, well-researched and well-presented project. Feedback on the media projects will also be provided via Turnitin after all projects have been marked.</p>\n<p>The media project must be properly formatted, using double-spacing and 12 point Times New Roman font, in accordance with the School of Social Science requirements, which can be found here: https://social-science.uq.edu.au/files/1725/EssayWritingGuide_SocSci.pdf. </p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course.</p>\n<p><strong>AI Use: </strong>Artificial Intelligence (AI) provides emerging tools that may support students in completing this assessment task. Students may appropriately use AI in completing this assessment task. Students must clearly reference any use of AI in each instance. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 2(22 Jul - 04 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 1: Introductions</strong><br><p>In this module we introduce the structure of the course and key themes: Anthropological perspectives and concepts for contemporary world issues. We ask: What is an anthropological lens? We discuss culture, modernity, politics and anthropology in contemporary world issues.<br/>\nWe will also discuss the course structure, assessments and course expectations. In tutorial workshops we will meet each other, introduce ourselves and get onto the World101x MOOC, which we will study alongside the course. Make sure you come to lectures and tutorials to be part of the journey and understand expectations and the course structure and dynamics.<br/>\nTutorials start in week 2.</p></br></p></div></td>",
            "topic_title": "<strong>Module 1: Introductions</strong>",
            "topic_description": "Module 1: Introductions In this module we introduce the structure of the course and key themes: Anthropological perspectives and concepts for contemporary world issues. We ask: What is an anthropological lens? We discuss culture, modernity, politics and anthropology in contemporary world issues. We will also discuss the course structure, assessments and course expectations. In tutorial workshops we will meet each other, introduce ourselves and get onto the World101x MOOC, which we will study alongside the course. Make sure you come to lectures and tutorials to be part of the journey and understand expectations and the course structure and dynamics. Tutorials start in week 2.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 3 To Week 4(05 Aug - 18 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 2: Anthropology 101</strong><br><p>We will complete episodes 1 and 2 of World101x and ask: What is anthropology and why is it an important field of study? What is unique about the anthropological approach? Why does the world needs more anthropologists?<br/>\nWe cover some basic ideas and methods of anthropology and discuss the role of anthropology in current world issues.</p></br></p></div></td>",
            "topic_title": "<strong>Module 2: Anthropology 101</strong>",
            "topic_description": "Module 2: Anthropology 101 We will complete episodes 1 and 2 of World101x and ask: What is anthropology and why is it an important field of study? What is unique about the anthropological approach? Why does the world needs more anthropologists? We cover some basic ideas and methods of anthropology and discuss the role of anthropology in current world issues.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 5 To Week 7(19 Aug - 08 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 3: Indigeneity</strong><br><p>In this module we investigate Indigeneity in a global and local context - its meanings, case studies and futures.<br/>\nWe will complete episodes 3-5 in World101x joining UQ academics in the field conducting research with Aboriginal and Torres Strait Islander peoples as well as with Indigenous peoples abroad.</p>\n<p>We also hear from UQ anthropology museum director Michael Aird about his work with photography and the UQ anthropology museum, site for our museum project.</p></br></p></div></td>",
            "topic_title": "<strong>Module 3: Indigeneity</strong>",
            "topic_description": "Module 3: Indigeneity In this module we investigate Indigeneity in a global and local context - its meanings, case studies and futures. We will complete episodes 3-5 in World101x joining UQ academics in the field conducting research with Aboriginal and Torres Strait Islander peoples as well as with Indigenous peoples abroad. We also hear from UQ anthropology museum director Michael Aird about his work with photography and the UQ anthropology museum, site for our museum project.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 8 To Week 11(09 Sep - 13 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 4: Living Within Limits</strong><br><p>Life within limits: Anthropological investigations of structure and agency<br/>\nHow do we live our lives within limits both externally produced and internally maintained. We delve into case studies, such as fracking in Queensland and refugees in Malaysia.<br/>\nWe will explore episodes 6-9 on World101x online and in lectures and tutorials discuss:<br/>\n- Resources: Whose water, whose land, whose rights?<br/>\n- Studying people on the move: Anthropology of migration<br/>\n- 'the economy or our health' - ethnographic learning about people and priorities<br/>\nNOTE: 2/10 is a public holiday, no lecture or tutes that week</p></br></p></div></td>",
            "topic_title": "<strong>Module 4: Living Within Limits</strong>",
            "topic_description": "Module 4: Living Within Limits Life within limits: Anthropological investigations of structure and agency How do we live our lives within limits both externally produced and internally maintained. We delve into case studies, such as fracking in Queensland and refugees in Malaysia. We will explore episodes 6-9 on World101x online and in lectures and tutorials discuss: - Resources: Whose water, whose land, whose rights? - Studying people on the move: Anthropology of migration - 'the economy or our health' - ethnographic learning about people and priorities NOTE: 2/10 is a public holiday, no lecture or tutes that week",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 12 To Week 13(14 Oct - 27 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Conclusions</strong><br><p>Course conclusions and the official opening of the Pop-up exhibition in the UQ Anthropology Museum</p>\n<p>We draw together the various threads of materials we have covered this semester and celebrate the best of the museum projects, in the UQ anthropology museum.</p></br></p></div></td>",
            "topic_title": "<strong>Conclusions</strong>",
            "topic_description": "Conclusions Course conclusions and the official opening of the Pop-up exhibition in the UQ Anthropology Museum We draw together the various threads of materials we have covered this semester and celebrate the best of the museum projects, in the UQ anthropology museum.",
            "learning_outcomes": []
        }
    ]
}