{
    "course_title": "Critical Anthropology & Indigenous Australians",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/ANTH2010-63220-7460",
    "full_course_code": "ANTH2010-63220-7460",
    "course_code": "ANTH2010",
    "class_code": "63220",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate knowledge of the diversity of Indigenous societies in Australia by reference to examples"
        },
        {
            "number": "LO2.",
            "description": "Identify historical and social issues in relation to Indigenous and non-Indigenous relations in Australia"
        },
        {
            "number": "LO3.",
            "description": "Demonstrate an awareness of ethical issues relating to research in Indigenous Australia"
        },
        {
            "number": "LO4.",
            "description": "Identify anthropological approaches in relation to the representation of Indigenous peoples in ethnographic work"
        },
        {
            "number": "LO5.",
            "description": "Discuss and write critically about particular case studies, especially using the required readings"
        },
        {
            "number": "LO6.",
            "description": "Skilfully engage in academic research in the library and with electronic resources"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "750 word reflection",
            "special_indicators": [],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 16/08/2024 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The first assessment is <strong>a short reflection focused on our in-class discussion in week 3 about anthropology and Indigenous Knowledge</strong>. It must be submitted via Turnitin (maximum 750 words, +/- 10%, excluding references), and presented in Times New Roman 12pt font, double line spacing, and include a title, your name, student number, and page numbers. Use APA7 style referencing.</p>\n<p><strong>To successfully complete this assignment make sure you</strong>:</p>\n<p>1) Complete the following Week 3 set readings</p>\n<p>·        Langton, M. (2011). Anthropology, Politics and the Changing World of Aboriginal Australians. <em>Anthropological Forum</em>, 21(1), 1–22. <a href=\"https://doi.org/10.1080/00664677.2011.549447\">https://doi.org/10.1080/00664677.2011.549447</a></p>\n<p>·        Moreton-Robinson, A. (2011). The White Man’s Burden: Patriarchal White Epistemic Violence and Aboriginal Women’s Knowledges within the Academy. <em>Australian Feminist Studies</em>, 26(70), 413–431. https://doi.org/10.1080/08164649.2011.621175</p>\n<p>·        Moses, A. D. (2010). Time, indigeneity, and peoplehood: the postcolony in Australia. <em>Postcolonial Studies</em>, 13(1), 9–32. <a href=\"https://doi.org/10.1080/13688790903490850\">https://doi.org/10.1080/13688790903490850</a></p>\n<p>2) Attend and participate in the Week 3 class discussion on anthropology and Indigenous Knowledge.</p>\n<p>3) On the basis of the readings and class discussion, reflect on the following proposition<em>: </em><em>‘Western knowledge cannot comprehend Indigenous culture and should not try to do so.’</em></p>\n<p>4) Write a reflection  (maximum 750 words, +/- 10%, excluding references), presenting a clear argument in response to the proposition and drawing on anthropological literature and Indigenous scholarship, as well as our in-class discussion.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course.</p>\n<p><strong>AI Use: </strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>You must submit your assignment electronically by the due time, on the due date. </strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Presentation and written submission (750 words)",
            "special_indicators": [],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p>Your written submission is due in the teaching week after your presentation, on Friday at 2 p.m.</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You are required to lead a workshop presentation about a key figure in Australian anthropology and their contribution to understanding Indigenous Australia. Your presentation MUST make reference to literature produced by Indigenous authors as part of a critical assessment of the anthropologist and their scholarship.  </p>\n<p>In addition to your presentation, you are required to submit a 750 word written submission discussing the anthropologist and their scholarship. In addition to contextualising their research with reference to other relevant anthropological literature, your written submission MUST make reference to literature produced by Indigenous authors as part of a critical assessment of the anthropologist and their scholarship. Some examples of Indigenous authors to consider are listed at the following link: https://www.aas.asn.au/first-nations-bibliography. Other Indigenous authors are included in the course readings, and you can find your own references via the UQ Library.</p>\n<p>Topics will be allocated in week 2 of the course. Your options are:</p>\n<p>* Spencer and Gillen and the concept of the Dreaming (week 4)</p>\n<p>* Norman Tindale and the concept of the tribe (week 5)</p>\n<p>* Phyllis Kaberry and gender in Indigenous Australia (week 6) </p>\n<p>* Caroline Tennant-Kelly and the concept of culture (cultural survival/cultural change/culture loss (week 7 and 8, presentations in week 8)</p>\n<p>* William Stanner and concept of self-determination (week 9)</p>\n<p>* Diane Barwick and identity (week 10)</p>\n<p>You should aim for a presentation using Powerpoint slides of approximately 15 minutes in length. You may co-present with a fellow student (or two), in which case you should each talk for approximately 15 minutes for a total of 30 minutes (for two speakers) or 45 minutes (for three speakers). You should also be prepared to answer questions about the topic of your presentation with a view to defending the critical perspective you present.</p>\n<p>Your Powerpoint presentation should include visual material, an introductory slide with the topic and your name, and conclude with a slides that lists your references.</p>\n<p>Your written reflection should be approximately 750 words (+/- 10%, excluding references). You should submit your written submission in the teaching week after your presentation, due Friday 2 p.m., with the final deadline for those presenting in Week 10 on Friday of Week 11 at 2 p.m. Note that if you present in the teaching week prior to mid-semester break, you would submit your written reflection in the following teaching week (i.e., not during mid-semester break).</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course.</p>\n<p><strong>AI Use: </strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>You must submit your assignment electronically by the due time, on the due date. </strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "1500 word review essay",
            "special_indicators": [],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 25/10/2024 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>At the start of semester you will have chosen an ethnography to read from the list provided. </p>\n<p>This assessment requires you to review the ethnography, and use two or more other anthropology references (such as articles, books, or book chapters), to help you write about key questions or arguments raised in the ethnography. Your review must describe the ethnography clearly, identify an argument, and be succinctly and clearly expressed.</p>\n<p><br/></p>\n<p>Your review must:</p>\n<p>1) Describe the ethnography’s content: </p>\n<p>* Who is the anthropologist writing about? </p>\n<p>* Where is their research located? </p>\n<p>* When did they undertake the research? </p>\n<p>* What methodologies did the anthropologist use to gather data?</p>\n<p>2) Describe the book’s central argument: </p>\n<p>*What has the anthropologist found out about the world? </p>\n<p>* What have they considered most interesting about the society or culture they are studying? </p>\n<p>* How do they explain or illustrate their key points?</p>\n<p>3) Raise at least one point of critique in regard to the central argument, using other references to back up your opinion. </p>\n<p>(Note that 'critique' does not mean that you necessarily have to disagree with the author. You may be in agreement with the author, but you must justify this in a way which clearly highlights the strengths or weaknesses of the ethnography. We do not wish to hear unsubstantiated judgements of how “good” or “bad” the book is, but rather a considered critique of the author's contribution to the issues they describe.) </p>\n<p><br/></p>\n<p>Your review must be referenced in APA7 style and presented according to School of Social Science requirements:  <a href=\"https://social-science.uq.edu.au/files/1725/EssayWritingGuide_SocSci.pdf\">https://social-science.uq.edu.au/files/1725/EssayWritingGuide_SocSci.pdf</a> </p>\n<p>It must be presented in Times New Roman size 12 font, and double line spaced. It must include your name, student number, and a title at the top of the first page. </p>\n<p>It should be no longer or shorter than 1500 words (+/- 10% including referencing, but not the reference list). </p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<p><br/></p>\n<p><strong>List of recommended ethnographies - choose one</strong></p>\n<p>Cowlishaw, G. 2008. <em>Blackfellas, whitefellas and the hidden injuries of race.</em> Carlton (Vic.): Blackwell Publishing.</p>\n<p>Hinkson, M. 2021. <em>See How We Roll: Enduring exile between desert and urban Australia. </em>London and Durham: Duke University Press.</p>\n<p>Musharbash, Y. 2008. <em>Yuendumu everyday: contemporary life in remote Aboriginal Australia. </em>Canberra: AIATSIS Press.</p>\n<p>Vincent, E. 2017. <em>'Against Native Title': conflict and creativity in outback Australia. </em>Canberra: AIATSIS Press.</p>\n<p>Rose, D. B. 2024. <em>Dreaming Ecology: nomadics and Indigenous ecological knowledge, Victoria River, Northern Australia</em>. Canberra: ANU E Press.</p>\n<p><br/></p>\n<p>Note: You must choose your ethnography by week 4 of the course and notify the course coordinator during class on 13 August and begin reading. You may choose an alternative ethnography in consultation with the course coordinator, however, if you do so, you must discuss your choice with the coordinator prior to selecting a different ethnography.</p>\n<p><br/></p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course.</p>\n<p><br/></p>\n<p><strong>AI Use: </strong>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>You must submit your assignment electronically by the due time, on the due date. </strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Course Introduction</strong><br><p>In this introductory lecture, we begin to examine critically the role of anthropology in producing knowledge about and with Indigenous Australians and the intercultural relationships that define Australia. We will also introduce the course content, objectives, assessment, and expectations of students. </p>\n<p>To prepare for this class you are expected to read the set readings for this week, and choose an ethnography from the list in section 4.2. You will read this throughout the semester and write a review of it as one of your assessment tasks in this course.</p></br></p></div></td>",
            "topic_title": "<strong>Course Introduction</strong>",
            "topic_description": "Course Introduction In this introductory lecture, we begin to examine critically the role of anthropology in producing knowledge about and with Indigenous Australians and the intercultural relationships that define Australia. We will also introduce the course content, objectives, assessment, and expectations of students. To prepare for this class you are expected to read the set readings for this week, and choose an ethnography from the list in section 4.2. You will read this throughout the semester and write a review of it as one of your assessment tasks in this course.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Cultural Diversity across Indigenous Australia</strong><br><p>In this workshop, we examine cultural diversity among Indigenous Australians and consider differences in how Indigenous people have experienced colonisation and intercultural relations in Australia. We will also spend time this week getting to know each other and understanding the assessment requirements, as well as discussing your responses to week 1 and week 2's readings in relation to the history of colonisation and cultural diversity in Australia.</p>\n<p>NOTE: We will allocate topics for the presentation and written submission assessment during this week's workshop. If you cannot attend, you MUST make contact with the course coordinator who will assign you to a relevant week.</p></br></p></div></td>",
            "topic_title": "<strong>Cultural Diversity across Indigenous Australia</strong>",
            "topic_description": "Cultural Diversity across Indigenous Australia In this workshop, we examine cultural diversity among Indigenous Australians and consider differences in how Indigenous people have experienced colonisation and intercultural relations in Australia. We will also spend time this week getting to know each other and understanding the assessment requirements, as well as discussing your responses to week 1 and week 2's readings in relation to the history of colonisation and cultural diversity in Australia. NOTE: We will allocate topics for the presentation and written submission assessment during this week's workshop. If you cannot attend, you MUST make contact with the course coordinator who will assign you to a relevant week.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Critical Anthropology, Indigenous Knowledge, and the Lived Experience of Colonisation</strong><br><p>This week examines debates about anthropology and Indigenous Knowledge. We will consider: is it possible to understand other cultures, or are there aspects of other cultures that only insiders can comprehend? Specifically: can non-Indigenous people understand Indigenous culture?, or is Indigenous culture non-translatable, and capable of being understood only by Indigenous people? Is it perhaps the case that some aspects of culture can only be understood through lived experience? How does power, and privilege, relate to knowledge? While these are plainly philosophical questions, they are also political in colonial and post-colonial settings like Australia, particularly when we think about the discipline of anthropology and its changing relationship with Indigenous peoples. As part of this week's workshop we will consider these questions and debate various positions. Come to the workshop having read the set readings by Marcia Langton, A. Dirk Moses, and Aileen Moreton-Robinson. NOTE: Attendance is required as the first assessment asks you to reflect on aspects of the discussion in this workshop.</p></br></p></div></td>",
            "topic_title": "<strong>Critical Anthropology, Indigenous Knowledge, and the Lived Experience of Colonisation</strong>",
            "topic_description": "Critical Anthropology, Indigenous Knowledge, and the Lived Experience of Colonisation This week examines debates about anthropology and Indigenous Knowledge. We will consider: is it possible to understand other cultures, or are there aspects of other cultures that only insiders can comprehend? Specifically: can non-Indigenous people understand Indigenous culture?, or is Indigenous culture non-translatable, and capable of being understood only by Indigenous people? Is it perhaps the case that some aspects of culture can only be understood through lived experience? How does power, and privilege, relate to knowledge? While these are plainly philosophical questions, they are also political in colonial and post-colonial settings like Australia, particularly when we think about the discipline of anthropology and its changing relationship with Indigenous peoples. As part of this week's workshop we will consider these questions and debate various positions. Come to the workshop having read the set readings by Marcia Langton, A. Dirk Moses, and Aileen Moreton-Robinson. NOTE: Attendance is required as the first assessment asks you to reflect on aspects of the discussion in this workshop.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(12 Aug - 18 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Spencer and Gillen and the concept of the Dreaming</strong><br><p>Baldwin Spencer and Frank Gillen's research with Arrernte people in Central Australia presented the first recognisably 'ethnographic' description of Aboriginal religion, including Arrernte beliefs in the Alcheringa, or Dreaming. This week focuses on the contemporary reception of Spencer and Gillen's work in the 1890s, 1900s, and 1910s, its significance for later studies, and modern critiques, including further research about Aboriginal religion. To prepare for this week, you should read the set readings. You are further encouraged to look at Spencer and Gillen's original publications.</p></br></p></div></td>",
            "topic_title": "<strong>Spencer and Gillen and the concept of the Dreaming</strong>",
            "topic_description": "Spencer and Gillen and the concept of the Dreaming Baldwin Spencer and Frank Gillen's research with Arrernte people in Central Australia presented the first recognisably 'ethnographic' description of Aboriginal religion, including Arrernte beliefs in the Alcheringa, or Dreaming. This week focuses on the contemporary reception of Spencer and Gillen's work in the 1890s, 1900s, and 1910s, its significance for later studies, and modern critiques, including further research about Aboriginal religion. To prepare for this week, you should read the set readings. You are further encouraged to look at Spencer and Gillen's original publications.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(19 Aug - 25 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Norman Tindale and the concept of the tribe</strong><br><p>The AIATSIS Map of Indigenous Australia is a colourful visual depiction of relationships between Aboriginal people and Country. Amongst other sources, this map draws on the research of Norman Tindale, an Australian anthropologist. This workshop considers Tindale's research focused on establishing the 'boundaries' of 'tribes' against the backdrop of later critiques of these concepts by anthropologists and Aboriginal scholars. You should prepare for this workshop by undertaking the set readings for this week. You are also encouraged to examine Tindale's original publications, particularly his 1974 map.</p></br></p></div></td>",
            "topic_title": "<strong>Norman Tindale and the concept of the tribe</strong>",
            "topic_description": "Norman Tindale and the concept of the tribe The AIATSIS Map of Indigenous Australia is a colourful visual depiction of relationships between Aboriginal people and Country. Amongst other sources, this map draws on the research of Norman Tindale, an Australian anthropologist. This workshop considers Tindale's research focused on establishing the 'boundaries' of 'tribes' against the backdrop of later critiques of these concepts by anthropologists and Aboriginal scholars. You should prepare for this workshop by undertaking the set readings for this week. You are also encouraged to examine Tindale's original publications, particularly his 1974 map.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Phyllis Kaberry and the concept of gender</strong><br><p>Phyllis Kaberry conducted fieldwork in the Kimberley region of Western Australia in the 1930s. Her work documents Aboriginal women's experiences on the colonial frontier. This week will focus on Kaberry's work and later work by subsequent generations of feminist anthropologists, including feminist critiques of anthropology as well as Indigenous critiques of feminist anthropologists. Come to the workshop prepared to discuss the readings. You are particularly encouraged to read the original work of Phyllis Kaberry.</p></br></p></div></td>",
            "topic_title": "<strong>Phyllis Kaberry and the concept of gender</strong>",
            "topic_description": "Phyllis Kaberry and the concept of gender Phyllis Kaberry conducted fieldwork in the Kimberley region of Western Australia in the 1930s. Her work documents Aboriginal women's experiences on the colonial frontier. This week will focus on Kaberry's work and later work by subsequent generations of feminist anthropologists, including feminist critiques of anthropology as well as Indigenous critiques of feminist anthropologists. Come to the workshop prepared to discuss the readings. You are particularly encouraged to read the original work of Phyllis Kaberry.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(02 Sep - 08 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Caroline Tennant-Kelly and the concept of culture</strong><br/><p>This workshop will introduce the work of Caroline Tennant-Kelly at Cherbourg in Southeast Queensland. We will visit the Fryer library to examine the Tennant-Kelly materials, and discuss how to interpret fieldnotes and draw on ethnography from the past. Come to the workshop prepared to discuss the readings.</p></p></div></td>",
            "topic_title": "<strong>Caroline Tennant-Kelly and the concept of culture</strong>",
            "topic_description": "Caroline Tennant-Kelly and the concept of culture This workshop will introduce the work of Caroline Tennant-Kelly at Cherbourg in Southeast Queensland. We will visit the Fryer library to examine the Tennant-Kelly materials, and discuss how to interpret fieldnotes and draw on ethnography from the past. Come to the workshop prepared to discuss the readings.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Caroline Tennant-Kelly and culture (2)</strong><br/><p>In this workshop, we will discuss Caroline Tennant-Kelly's work in relation to the concept of culture, particularly the notion of cultural survival, cultural change, and culture loss. What does Tennant-Kelly's work contribute to our understanding of these things? We will also engage with Indigenous perspectives on Caroline Tennant-Kelly's work. Come to the workshop prepared to discuss the readings. You are particularly encouraged to read Caroline Tennant-Kelly's original research.</p></p></div></td>",
            "topic_title": "<strong>Caroline Tennant-Kelly and culture (2)</strong>",
            "topic_description": "Caroline Tennant-Kelly and culture (2) In this workshop, we will discuss Caroline Tennant-Kelly's work in relation to the concept of culture, particularly the notion of cultural survival, cultural change, and culture loss. What does Tennant-Kelly's work contribute to our understanding of these things? We will also engage with Indigenous perspectives on Caroline Tennant-Kelly's work. Come to the workshop prepared to discuss the readings. You are particularly encouraged to read Caroline Tennant-Kelly's original research.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>William Stanner and self-determination</strong><br/><p>This workshop will examine the work of William Stanner in relation to the first land rights case on the Gove Peninsula in Arnhem Land. We will particularly examine Stanner's work in relation to the concept of self-determination, memorably expressed by Stanner as the expectation that Aboriginal people must \"cease to be themselves.\" We will specifically examine the role of anthropologists in supporting Indigenous self-determination, for example, in Aboriginal Land Rights claims and later native title. Come to the workshop prepared to discuss the readings. You are particularly encouraged to read original publications by Stanner as well as Indigenous responses to his work.</p></p></div></td>",
            "topic_title": "<strong>William Stanner and self-determination</strong>",
            "topic_description": "William Stanner and self-determination This workshop will examine the work of William Stanner in relation to the first land rights case on the Gove Peninsula in Arnhem Land. We will particularly examine Stanner's work in relation to the concept of self-determination, memorably expressed by Stanner as the expectation that Aboriginal people must \"cease to be themselves.\" We will specifically examine the role of anthropologists in supporting Indigenous self-determination, for example, in Aboriginal Land Rights claims and later native title. Come to the workshop prepared to discuss the readings. You are particularly encouraged to read original publications by Stanner as well as Indigenous responses to his work.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid Sem break(23 Sep - 29 Sep)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-Semester Break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-Semester Break</strong>",
            "topic_description": "Mid-Semester Break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Diane Barwick and urban Aboriginal identity</strong><br/><p>This workshop will examine Diane Barwick's research with Aboriginal people at Melbourne in Victoria in the 1960s and various responses by Indigenous scholars. We will specifically examine research in relation to urban-living Indigenous people. To prepare for the workshop, please read the set readings, including Barwick's original publications.</p></p></div></td>",
            "topic_title": "<strong>Diane Barwick and urban Aboriginal identity</strong>",
            "topic_description": "Diane Barwick and urban Aboriginal identity This workshop will examine Diane Barwick's research with Aboriginal people at Melbourne in Victoria in the 1960s and various responses by Indigenous scholars. We will specifically examine research in relation to urban-living Indigenous people. To prepare for the workshop, please read the set readings, including Barwick's original publications.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(07 Oct - 13 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Contemporary Debates in Australian Anthropology</strong><br/><p>This week focuses on contemporary debates in Australian anthropology to prepare for your final assessment. In this week's workshop, we will consider </p>\n<p>* Arguments over the representation of Indigenous culture; </p>\n<p>* Relationships between Indigenous and non-Indigenous Australians;</p>\n<p>* The politics of suffering, helping anthropologists and cultural critique. </p>\n<p>To prepare for the workshop you should reflect the debates which your chosen ethnography addresses. You should also review the readings for this week to broaden your understanding of anthropological debates relating to Australia.To prepare for the workshop you should reflect the debates which your chosen ethnography addresses. You should also review the readings for this week to broaden your understanding of anthropological debates relating to Australia.</p></p></div></td>",
            "topic_title": "<strong>Contemporary Debates in Australian Anthropology</strong>",
            "topic_description": "Contemporary Debates in Australian Anthropology This week focuses on contemporary debates in Australian anthropology to prepare for your final assessment. In this week's workshop, we will consider * Arguments over the representation of Indigenous culture; * Relationships between Indigenous and non-Indigenous Australians; * The politics of suffering, helping anthropologists and cultural critique. To prepare for the workshop you should reflect the debates which your chosen ethnography addresses. You should also review the readings for this week to broaden your understanding of anthropological debates relating to Australia.To prepare for the workshop you should reflect the debates which your chosen ethnography addresses. You should also review the readings for this week to broaden your understanding of anthropological debates relating to Australia.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Final Assessment Preparation Check-In Week</strong><br/><p>This week we will meet briefly to discuss any issues relating to your final assessment. Please attend with any questions for discussion. We would expect to break after 1 hour but can keep going if required.</p></p></div></td>",
            "topic_title": "<strong>Final Assessment Preparation Check-In Week</strong>",
            "topic_description": "Final Assessment Preparation Check-In Week This week we will meet briefly to discuss any issues relating to your final assessment. Please attend with any questions for discussion. We would expect to break after 1 hour but can keep going if required.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Summary and Discussion of Anthropological Research</strong><br/><p>This workshop will involve an interactive panel discussion with speakers working in the field of anthropology in Indigenous Australian contexts. Students must come to the class prepared to ask questions of the panel, using the AAS Code of Ethics, and the AIATSIS Guidelines, plus your knowledge from the course. Each student should have at least two questions ready to ask the panel of speakers about anthropology today, and some of the ethical, political, and intellectual issues they confront in their work. You should particularly seek to engage intellectually with the guest speakers by familiarising yourself with aspects of their work prior to the class.</p></p></div></td>",
            "topic_title": "<strong>Summary and Discussion of Anthropological Research</strong>",
            "topic_description": "Summary and Discussion of Anthropological Research This workshop will involve an interactive panel discussion with speakers working in the field of anthropology in Indigenous Australian contexts. Students must come to the class prepared to ask questions of the panel, using the AAS Code of Ethics, and the AIATSIS Guidelines, plus your knowledge from the course. Each student should have at least two questions ready to ask the panel of speakers about anthropology today, and some of the ethical, political, and intellectual issues they confront in their work. You should particularly seek to engage intellectually with the guest speakers by familiarising yourself with aspects of their work prior to the class.",
            "learning_outcomes": []
        }
    ]
}