{
    "course_title": "Honours Project",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/BIOC6512-64251-7460",
    "full_course_code": "BIOC6512-64251-7460",
    "course_code": "BIOC6512",
    "class_code": "64251",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - )",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Design and undertake practical or theoretical experimental work under the guidance of an experienced supervisor."
        },
        {
            "number": "LO2.",
            "description": "Record the planning and outcome of experiments in a manner suitable for scientific research."
        },
        {
            "number": "LO3.",
            "description": "Analyse and critically evaluate scientific literature."
        },
        {
            "number": "LO4.",
            "description": "Develop innovative and achievable research objectives based on a thorough understanding of existing knowledge in a field."
        },
        {
            "number": "LO5.",
            "description": "Listen, analyse and critically evaluate scientific information presented in research seminars, and to become active participants by asking questions after the seminar."
        },
        {
            "number": "LO6.",
            "description": "Give clear, concise, organized, and accurate written and oral presentations of your research and the research of others."
        },
        {
            "number": "LO7.",
            "description": "Write a substantial research proposal and report in a format appropriate for a scientific investigation."
        },
        {
            "number": "LO8.",
            "description": "Act effectively in academic service and engagement roles and build collegiality."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Week 1 Orientation activities",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 22/07/2024 - 26/07/2024</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Participation/ Student contribution",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>There are a number of introductory courses in the first week where each student will be given information which will be very important to them throughout the year: Honours introductory session (orientation), School safety induction (for those based in building 68 or 76; students based in other locations will need to attend their local safety induction before commencing lab work), and two library workshops. Attendance is compulsory at each of these courses. You shall be informed of the dates they are held during the Honours introductory session.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Research Proposal",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>12.5% 2 unit equivalent </dd>",
            "due_date": "<dd><p> 2/09/2024 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assignment comprises a 4,000 word research proposal that outlines the work that you propose to undertake during your Honours year. The research proposal should be formatted in 12 point Arial or Times New Roman font with 1.5x line spacing and pages numbered. </p>\n<p>The Research Proposal should consist of the following sections, in order:</p>\n<p> 1. Title page (including the candidate's name and word count)</p>\n<p> 2. Table of Contents</p>\n<p> 3. Aims, background, and significance: This section should include a critical and concise review of the background literature (i.e. past relevant research), hypotheses, and a clear list of aims of the project in point form. Each section should be identified with a sub-heading, to be listed in the Table of Contents. You should clearly state the significance of the proposal to science (Why will this contribute to progress in knowledge?). Headings and sub-headings may be numbered if desired. Developments in the literature are usefully followed in chronological order, but this can be varied if there is a good reason for doing so. This part should normally comprise ~2/3 - 3/4 of your proposal.</p>\n<p> 4. Research plan and methods: This section should describe the general strategy for achieving the aims and the detailed plan, i.e. a list of types of experiments, including a summary of the methods to be used. This section can also include citation of literature describing such methods. This part should normally comprise ~1/3 - 1/4 of your proposal.</p>\n<p> 5. References: A full and accurate list of references must be given at the end of your proposal under the heading \"References\". References must be in the APA 7th referencing style. In text citations must include the author’s surname and year of publication.</p>\n<p>Words appearing on the title page, in the table of contents, and in the reference list should be excluded from the word count, as should words included in figures, tables and figure legends. In text citations are counted towards the word limit. The word limit will be strictly enforced, and examiners will be under no obligation to read beyond this limit.</p>\n<p>The Research Proposal is intended to provide an early focus for your project work. It may also form the basis for the introductory section of your research report.</p>\n<p>Specifically, the purpose of the research proposal is:</p>\n<p> • to ensure that the student knows the work already done in the research area;</p>\n<p> • to ensure that the student can assess deficiencies in the knowledge of the subject;</p>\n<p> • to test the student's ability to read literature critically;</p>\n<p> • to test the student's ability to organise evidence derived from other people's work;</p>\n<p> • to test the student's ability to write a clear, concise, readily understandable proposal in an objective manner.</p>\n<p>Your Research Proposal will be assessed by two academic or research staff members who will comment upon its qualities as outlined above. The assessed document will be returned to you.</p>\n<p>Questions that will be considered as part of the assessment of your proposal:</p>\n<p> 1. Is your analysis of the research field, including literature relating to past studies, a critical analysis or just a summary of what is known?</p>\n<p> 2. Have you given a clear statement of aims and hypotheses to be tested in the project? Are the aims and hypotheses reasonable?</p>\n<p> 3. Do you have a clear conceptual understanding of the science underpinning the project?</p>\n<p> 4. Have you provided a clear justification of the scientific significance of the proposal and why it is original and innovative?</p>\n<p> 5. Is it clear that the project is feasible?</p>\n<p> 6. Is the proposal well organised and presented?</p>\n<p><strong>Use of Artificial Intelligence (AI)</strong></p>\n<p>This assessment task evaluates student's abilities, skills and knowledge without the aid of Artificial Intelligence (Al). Students are advised that the use of Al technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit through the course Turnitin submission point in Blackboard. Please note: No hardcopy is to be submitted. SCMB will distribute your Turnitin submission for marking. Before submitting your assessment item to Turnitin please name your file in the following way. FAMILY NAME_GivenName_StudentID_CourseCode_AssignmentName For example: Bob Smith (ID: 54329876) would name his ABCD1234 essay 1 in the following way. SMITH_Bob_54329876_ABCD1234_Essay1</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Research Proposal Seminar and Discussion",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 9/09/2024 - 13/09/2024</p></dd>",
            "learning_objectives": null,
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The preparation and presentation of this seminar is designed to focus your thoughts on the tasks ahead as well as providing you with an opportunity to gain some experience in scientific presentation. This seminar is an item of formative assessment, and you will be provided with feedback on your performance.</p>\n<p>You will be notified of a time and venue for your talk by email the week prior to the period specified in the Timetable. Each seminar will be 10 minutes (maximum), with 5 minutes for discussion.</p>\n<p>All students are required to present their seminar as a PowerPoint presentation. Honours students must attend ALL sessions.</p>\n<p>Students will be asked in-depth questions about their seminar presentation. You will receive constructive feedback on which aspects were excellent, and what could be improved.</p>\n<p>The following list is simply intended to give students a guide as to the sort of parameters on which their presentation will be judged, but they are not meant to be exclusive. Three main facets will be considered.</p>\n<p>Content:</p>\n<p> 1. Did the speaker appear to understand clearly the background to, and the significance of the study?</p>\n<p> 2. Did the introduction clearly and concisely outline the nature and scope of the problem to be investigated?</p>\n<p> 3. Did the introduction orient the listener to the relationship of the current project with existing knowledge?</p>\n<p> 4. Was the method of investigation and, if necessary, the reasons for choice of a particular method explained?</p>\n<p> 5. Did the speaker use good judgement in presenting pertinent information and excluding non-essential or distracting details?</p>\n<p> 6. Were the strategies and proposed methods of investigation clearly explained?</p>\n<p>Presentation:</p>\n<p> 1. Did the speaker remember to face the audience when speaking, avoid reading the entire presentation, and avoid other distracting mannerisms?</p>\n<p> 2. Did the speaker project their voice clearly to the audience?</p>\n<p> 3. Were major concepts and research plans explained clearly and precisely?</p>\n<p> 4. Was the speaker able to increase your interest in the topic, through personal attributes: enthusiasm, imagination, etc.?</p>\n<p> 5. Did the speaker keep to the allotted time, and present material at a comprehensible rate?</p>\n<p> 6. Did the presentation standard indicate adequate preparation and rehearsal by the speaker?</p>\n<p> 7. Were slides and other A/V aids clear and helpful to the audience; rather than cluttered and confusing?</p>\n<p>Questions/ discussion:</p>\n<p> 1. Was the speaker able to adequately respond to questions about the seminar and the research proposal, or were incomplete answers given?</p>\n<p> 2. Did the speaker answer questions clearly, and address replies to the audience as a whole?</p>\n<p> 3. Did the speaker demonstrate an appropriate grasp of the context of the subject?</p>\n<p> <strong>What you must provide the day before the seminar:</strong></p>\n<p> Your PowerPoint file must be supplied to the Honours administrator the day before the start of the seminar program so that it can be loaded on to the School laptop computer. You will not be able to use your own computer for these presentations. More details will be provided closer to the date.</p>\n<p>Take note of the suggestions presented below in preparing your talk.</p>\n<p> • Do not talk too fast or present too much material. Focus on the basics and select the most important points to discuss carefully and in depth. Other issues which distract from the central issue, however important they may appear, can be dealt with in question time if necessary.</p>\n<p> • Plan to spend about half of your time on the background to your project and introducing the topic. Do not forget that most of those listening will be unfamiliar with your research area.</p>\n<p> • Plan to spend the second half of your time outlining your intentions. If by this stage you have some results, put them in by all means but do not dwell on them.</p>\n<p>• Consult your supervisor(s) for advice at all stages during the preparation of your talk. Leave time after preparation to have a \"dry run\" to practice your presentation with your supervisor and colleagues. Note that people often talk much more slowly during the real presentation than during practice sessions, or vice versa! If necessary, plan to skip some of your material if you get behind time so that you reach a satisfactory end within your allotted 10 minutes.</p>\n<p><strong>Use of Artificial Intelligence (AI) </strong></p>\n<p>This assessment task is to be completed in-person. The use of Artificial Intelligence (Al) tools will not be permitted. Any attempted use of Al may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Instructions on how to submit your seminar slides will be provided via the course Blackboard site. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Journal Club presentation & participation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>6.25% 1 unit equivalent </dd>",
            "due_date": "<dd><p> 23/09/2024 - 29/11/2024</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The assessment for this task has two components: i) the Journal Club presentation and ii) participation in the discussion of the presentations of other students in your Journal Club group. Marks will be awarded for the oral presentation, with this mark influenced by your contributions during the presentations of your peers.</p>\n<p>The objectives of this assessment task are for the student to:</p>\n<ul>\n<li>Gain knowledge in areas of molecular bioscience outside their immediate research topic;</li>\n<li>Read the literature critically, to recognise papers of great scientific merit in a defined area of the molecular biosciences;</li>\n<li>Evaluate comprehensively the work already done in that area, and to assess where deficiencies in the knowledge of the subject lie;</li>\n<li>Review a particular paper critically and detect its strengths and weaknesses;</li>\n<li>Give a presentation where you discuss the paper and answer questions relating to the outcomes of the research; and</li>\n<li>Develop a deeper understanding of the research projects of others in your Honours cohort and help build a cohort experience.</li>\n</ul>\n<p><em>Prior to the Journal Club sessions beginning</em>, you will be asked to nominate a paper that you will prepare your Journal club presentation on. These will be vetted by the Honours course coordinators and once all papers have been approved, a presentation timetable will be circulated.</p>\n<p><em>For your own Journal Club presentation</em>, you will be required to deliver a 20 minute PowerPoint presentation on a paper chosen by you. This will be followed by a 20 minute discussion and question period.</p>\n<p><em>For the presentations given by your peers</em>, you must read the paper to be presented ahead of the session and be an active contributor to the discussion and question period.</p>\n<p><strong>Attendance at all sessions of your Journal Club is compulsory</strong>. To get the best mark, you must give both an excellent presentation of your own, and contribute at a high level to the discussion associated with the presentations of the rest of your group.</p>\n<p><strong>Some Tips for the Journal Club presentation:</strong></p>\n<p>Your<em> PowerPoint</em> presentation is to take approximately 20 minutes. It is not wise to go considerably over or under this limit.</p>\n<p><strong>What should your presentation contain? </strong></p>\n<p>Perhaps most importantly you need to first establish the context of the paper you are reviewing. What is the generality of the field? What is the broad nature of the problem? What are the hypotheses of the paper and how do they relate to the state of the field? How does it relate to your own project? You might also refer to some of the work that is the basis for this paper. How recently was it done? By whom? Most of the talk should focus on what the paper has to say. What are its results or conclusions and how (or are?) they significant? Is there any controversy around the paper or are there any problems with the paper (e.g. in methods/technology, results, discussion) and can they be resolved? One way that you can look at the impact of the paper is to look it up on the <em>Web of Science </em>and look to see who has cited it and how. There is almost always interest to be gained from thinking about the sociology of the paper. Who wrote it? How many authors? Where are they based? What is their funding? Do they have a presence on the Web? Do they have a substantial body of work in this field?</p>\n<p> At the end of your talk you should hope to have:</p>\n<ul>\n<li>Conveyed the essence of the field;</li>\n<li>Conveyed the essence of the paper, its significance, and what you think of it; and</li>\n<li>Interested your audience.</li>\n</ul>\n<p>The oral assessment task will involve a 20 minute PowerPoint presentation on your selected paper followed by a 20 minute question period.</p>\n<p>During your Journal Club sessions you will be assessed based on attendance, willingness to ask questions and your overall contribution to any discussion. You must read the paper to be presented prior to each session to enable you to ask relevant questions that focus on critical issues of the study, presentation or overall research theme. Attendance is compulsory and will be recorded.</p>\n<p>Your oral presentation and participation will be assessed by the leader of your Journal Club group, with marks moderated by the Honours committee at the end of the year.</p>\n<p><strong>Absence from a Journal Club Session</strong></p>\n<p>Attendance and participation at all sessions of your Journal Club is compulsory and a course hurdle. We do not offer reschedules. Anyone who fails to complete this assessment item will have their grade downgraded by one grade level.*</p>\n<p>In the event that a student misses a session due to unforeseen circumstances or otherwise, it is essential that they immediately email <a href=\"mailto:enquiries@scmb.uq.edu.au\">enquiries@scmb.uq.edu.au</a> and provide the following information:</p>\n<p><strong>Email Subject Line</strong>: Honours Journal Club Absence</p>\n<p><strong>Name</strong>:</p>\n<p><strong>Student ID Number</strong>:</p>\n<p><strong>Date of missed journal club session</strong>:</p>\n<p><strong><em>Statement outlining why you are/were unable to attend your journal club session</em></strong></p>\n<p><strong>Your request must be made prior to or on the day of the missed session.</strong></p>\n<p>Please attach supporting documentation as per the <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension?p=1#1\">UQ Acceptable Reasons for an Extension</a>.</p>\n<p>*The Honours convenors will consider the circumstances relating to the absence and may, at their discretion, provide alternative assessment to meet hurdle 2 outlined in <em>ADDITIONAL COURSE GRADING INFORMATION.</em></p>\n<p><strong>Use of Artificial Intelligence (AI)</strong></p>\n<p>This assessment task is to be completed in-person. The use of Artificial Intelligence (Al) tools will not be permitted. Any attempted use of Al may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Instructions will be provided via the course Blackboard site. </p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-4",
            "assessment_title": "Progress Report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 4/11/2024 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Participation/ Student contribution, Performance",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>To monitor your progress you will be asked to submit a Progress Report towards the end of your first semester. This will not be a large document to prepare. We simply want you to fill out a 2-3 page report/questionnaire halfway through the year that will give us an idea of your progress as well as your plans and timeline for finishing.</p>\n<p>Your supervisor will be asked to complete a separate questionnaire and both will be treated confidentially. We will supply more details closer to the time. Although we will not conduct interviews as a matter of course, you may ask for one as a forum to discuss any concerns or other issues you may wish to raise. The sooner we hear about any problems you may be having, the sooner we can resolve them.</p>\n<p><strong>Use of Artificial Intelligence (AI)</strong></p>\n<p>This assessment task evaluates student's abilities, skills and knowledge without the aid of Artificial Intelligence (Al). Students are advised that the use of Al technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit through Blackboard by the due date and time. Before submitting please name your file in the following way. FAMILY NAME_GivenName_StudentID_CourseCode_AssignmentName For example: Bob Smith (ID: 54329876) would name his ABCD1234 essay 1 in the following way. SMITH_Bob_54329876_ABCD1234_Essay1</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-5",
            "assessment_title": "Draft Research Report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 12/05/2025 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You must submit a draft of your Research Report through TurnitIn and to your supervisors. We do not expect that this will be a finished draft, but it must be substantially complete. Although your supervisor is permitted to read and comment on your proposal, they must not undertake in-depth drafting. The written work must be your own.</p>\n<p>Your supervisor will review and correct the draft. It is the role of your supervisor to help you develop and fine-tune your writing. This process should progress as a partnership in which you are actively engaged. Remember however, that you retain full responsibility for the final report and that it must be your own work!</p>\n<p><strong>Use of Artificial Intelligence (AI)</strong></p>\n<p>This assessment task evaluates student's abilities, skills and knowledge without the aid of Artificial Intelligence (Al). Students are advised that the use of Al technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit through the course Turnitin submission point in Blackboard. Please note: No hardcopy is to be submitted. Before submitting your assessment item to Turnitin please name your file in the following way. FAMILY NAME_GivenName_StudentID_CourseCode_AssignmentName For example: Bob Smith (ID: 54329876) would name his ABCD1234 essay 1 in the following way. SMITH_Bob_54329876_ABCD1234_Essay1</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-6",
            "assessment_title": "Research Report & Research Performance",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>68.75% 11 unit equivalent </dd>",
            "due_date": "<dd><p> 26/05/2025 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance, Oral, Written",
            "category": "Paper/ Report/ Annotation, Participation/ Student contribution, Performance",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>A substantial report on the research project is to be submitted, adhering to the guidelines and format specifications outlined below.</p>\n<p> The report should be formatted in 12 point Arial or Times New Roman Font with 1.5 line spacing and page numbers included. The report should contain the following sections, in order:</p>\n<p> 1. Title</p>\n<p> 2. Candidate’s name</p>\n<p> 3. Preliminary pages – these must be worded and formatted exactly as they appear in Appendix 1 of the Bachelor of Science (Honours) Chemistry &amp; Molecular Biosciences Program Guide (Handbook)</p>\n<p> 4. Summary (or Abstract) – no more than one page</p>\n<p> 5. Table of contents</p>\n<p> 6. List of abbreviations</p>\n<p> 7. Introduction - including a brief summary of the aims, hypotheses, and research plan that may be drawn from the research proposal or may be updated as the project evolves throughout the year.</p>\n<p> 8. Material and Methods</p>\n<p> 9. Results</p>\n<p> 10. Discussion</p>\n<p> 11. Conclusions</p>\n<p> 12. References</p>\n<p>There is a <strong>hard limit</strong> of 8,000 words for Sections 7-11 above. Excluded from the word count are the Title, Candidate’s name, Preliminary pages, Summary, Table of Contents, List of Abbreviations, and References as well as text contained within figures, figure legends and tables. In-text citations are included in the word count. Appendices are permitted and are excluded from the word count but there is a hard limit of 100 pages for the entire report (including Appendices and all sections above). The word count should be included on the front page of the report. Where a substantial volume of direct quotes (e.g. survey responses) are included in the report and cannot be placed in Appendices, these may also be excluded from the word count.</p>\n<p>Students should note that while the inclusion of Appendices is allowed, examiners are under no obligation to read them or take their contents into consideration when examining the thesis. It is the student’s responsibility to ensure that the most relevant data is distilled into a presentable format within the main body of the research report.</p>\n<p>References must be in the APA 7th referencing style. In text citations must include the author’s surname and year of publication.</p>\n<p>We understand that pandemics, natural disasters, and other unforeseen circumstances impact everyone differently and with this in mind we ask students to include a ‘Statement on impact of disruptions” page in their Final Report. You should include a maximum of one page. You should outline how your Honours project was disrupted and describe the changes that were put in place in response to these disruptions. Disruptions could include an inability to perform laboratory work for a certain period, difficulties in ordering reagents, or any other disruptions you feel are relevant. The changes put in place could include changes to individual aims, scope, or topic of your project. The description of disruptions will provide some context for your examiners, especially when you have had to substantially change your project from your original plans.</p>\n<p><strong>NB: </strong>It is a mandatory requirement that the preliminary pages of the final research report are worded appropriately from the template (Research Report Declaration) available on the course Blackboard site or in the Honours handbook.</p>\n<p><strong>Writing the Research Report: The draft and final copy of your report</strong></p>\n<p>You must submit a draft of your report to your supervisor (see <em>Draft Research Report</em> assessment item). Although your supervisor is permitted to read and comment on your proposal, they must not undertake in-depth drafting. The written work must be your own.</p>\n<p>Your supervisor will review and correct the draft. It is the role of your supervisor to help you develop and fine-tune your writing. This process should progress as a partnership in which you are actively engaged. Remember however, that you retain full responsibility for the final report and that it must be your own work!</p>\n<p>Your report will be assessed by two examiners – members of academic or research staff who are not involved with your project. The two examiners for the report will generally be the same as those who examine the Research Proposal. The research report marking form is included as an attachment in the <em>Criteria and Marking Form </em>section of this page.</p>\n<p>Assessment of your report will be in three areas: content, referencing and presentation.</p>\n<p>(a) Content</p>\n<p>- You will be assessed on your ability to analyse and evaluate the literature and formulate ideas and hypotheses.</p>\n<p>- You will be assessed on the results obtained in your project. You should present as many of your results as space allows, including results that may have been unexpected or unpredicted, or experiments that didn't quite pan out as planned. The assessment will be made on how you have approached the project, the design of your experimental procedures and the clarity with which they are presented, the logical progression of your experimental work, and your ability to handle your data in terms of description, statistics (where necessary) and drawing conclusions from them.</p>\n<p>- The discussion is a critical part of the assessment of the Research Report. The capacity to discuss the significance of research findings is vital in science. You will be assessed on how well you can assemble and discuss your results and conclusions, your understanding of their relevance, and how you relate them to the international literature. Your reading of the scientific literature should give you an understanding of the critical importance of discussions in papers – this component of the assessment will therefore enable your examiners to assess your understanding of both the results you have obtained and your knowledge of your project area.</p>\n<p>(b) References</p>\n<p>References should be presented in a consistent format, adhering to the guidelines outlined above. Correct referencing is a crucial aspect of scientific writing. All sources should be cited, and citation lists should be free from errors. You should read widely around your topic of research and not rely on a handful of key papers or review articles to formulate your ideas or discuss the context of your work. Wherever possible you should endeavour to cite primary research articles as sources and attempt to cite the most recent literature.</p>\n<p>(c) Presentation</p>\n<p>You will be assessed on the presentation of your research report in terms of neatness, typographical errors, how well it is set out (with respect to the instructions detailed above), and its clarity with respect to text, tables, figures and references.</p>\n<p><strong>Viva</strong></p>\n<p>Following submission of your research report, you will be required to present a Research Seminar (typically 1-2 weeks later). The Research Seminar will be followed by a Viva which will be attended by your supervisor(s), the two examiners of your research report and the Honours Convenor(s). The viva has a duration of 20 mins and provides the opportunity for your examiners to enter with you into a deeper and more detailed discussion of your research report and findings than what is possible during the question period following your research seminar. This allows your examiners to get a more complete picture of your research project and report.</p>\n<p>The viva does not carry a mark of its own, but the performance of the student in the viva will be taken into consideration by the examiners and the chair in considering the student’s final mark. Marks are provided to the Honours Convenor(s) immediately after the viva and the Honours Convenor(s) and your supervisor(s) have the opportunity to address any issues, such as potentially diverging marks.</p>\n<p><em>Some tips on the Viva</em></p>\n<p>While a Viva in front of an assessment panel might sound like a daunting task, remember that all academics want young students to succeed. The Viva just allows for a more detailed picture than the Research Seminar. This is also the standard procedure for Research Higher Degree students during the individual milestone processes, and thus the Viva provides you with essential training for this situation. Your supervisor(s) will be present in your support and the Honours Convenor(s) act as impartial referees.</p>\n<p>Questions for the Viva are not provided in advance to the student. However, you should have a pretty good idea about the topics that will be discussed from the questions that your examiners have been asking during the Research Seminar.</p>\n<p><strong>Research Performance</strong></p>\n<p>The mark for Research Performance is provided by the principal supervisor. This mark is derived from your overall performance in the laboratory/field over the course of the Honours year. A report will be submitted by the principal supervisor which addresses various specific aspects of laboratory/field performance. The supervisor evaluation marking form is available via the course Blackboard site. The mark from your supervisor has equal weighting as to the mark of each of the examiners of your report.</p>\n<p>Laboratory/field records must be kept by students in a manner appropriate for a research project. These records must be handed to and retained by the principal supervisor and be available for reference by the Honours Committee or Convenor(s) during the examination process.</p>\n<p><strong>Use of Artificial Intelligence (AI)</strong></p>\n<p>This assessment task evaluates student's abilities, skills and knowledge without the aid of Artificial Intelligence (Al). Students are advised that the use of Al technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit through the course Turnitin submission point in Blackboard. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-7",
            "assessment_title": "Seminar Notebook",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 26/05/2025 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Notebook/ Logbook",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The School of Chemistry and Molecular Biosciences runs two weekly seminar series (one in Chemistry and one in Molecular Biosciences) and also hosts additional ad hoc seminars throughout the year by visiting researchers. Students based at an external location will likely find that additional seminars are hosted by their local School/Centre/Institute throughout the year. <strong><em>Regular attendance</em></strong> at these seminars is not only mandatory, but is an essential part of your training as a scientist, as this is where you are exposed to diverse scientific techniques and approaches. </p>\n<p>Students must document their attendance at seminars throughout the year by taking notes in a clearly documented, hard copy (i.e. not digital) seminar notebook. It is a requirement that you submit this seminar notebook at the end of the year together with your final Research Report. The book must contain details of all of the seminars the student has attended and is given either a Pass or Fail grade. It is expected that a complete seminar notebook will contain notes on <strong>at least</strong> 15 seminars attended throughout the year. This reflects the fact that while most seminar programs run ~ weekly, they may not be held every week of the year. You must pass this section to pass the course. </p>\n<p>The notebook should follow the guidelines below for each seminar:</p>\n<ul>\n<li>The date, title of the seminar and the speaker's name and affiliation;</li>\n<li>Notes (1/2 - 1 page) about the seminar, including the aims, hypotheses, scientific content, critical issues raised by the speaker, assumptions made. At least one question for the speaker should be included for each seminar. These notes must be taken during the seminar;</li>\n<li>A paragraph that states the objective(s) of the speaker's work (i.e. what were they trying to show) and what was achieved. This should be added after the seminar, based on the notes taken. Material copied directly from the speaker's abstract is not acceptable.</li>\n</ul>\n<p>Seminars that can be attended are not limited to those given in the student's School or Institution. Attendance at seminars held in other Schools, Centres or Institutes are acceptable. However, seminars given by PhD students, and informal seminars or presentations made at research group meetings are not acceptable for this part of the course.</p>\n<p>The diary should be available for inspection by the student’s supervisor or the Honours Convenor(s) at any time. At the end of the year, the diary must be handed in at the SCMB Administration Office to be assessed by the Honours Convenor(s).</p>\n<p><strong>Some Strategies: </strong></p>\n<ul>\n<li>The single most important thing you should do before the seminar is to read the speaker's abstract, if this has been provided. This will enable you to get a general overview of the major aims of the research, approaches used, and of the major conclusions drawn.</li>\n<li>During the seminar learn to listen critically and sympathetically. Listen for what the presenter means rather than pick at words or specific arguments. Focus attention on the aims, hypotheses, and assumptions made; the structure of the argument; and the evidence presented (or neglected).</li>\n<li>Make your notes brief and put them in your own words. Use margins for questions, comments, and notes to yourself on material that is not clear.</li>\n<li>Go over your notes as soon as possible after the seminar to write a summary paragraph that states the objective(s) of the speaker's work (i.e. what were they trying to show) and what was achieved.</li>\n</ul>\n<p><strong><em>Special note:</em></strong><em> Some students have previously remarked that regularly attending seminars in addition to scheduling and completing all of their experiments has been difficult. It is important for students to appreciate that while experimental work conducted in the lab is a major component of your Honours year, it is not the only component and other assessment items such as seminar attendance are equally important to your development as a professional scientist, as is the development of effective time management and planning skills, allowing you to schedule experiments around regular seminar attendance.  </em></p>\n<p><strong>Use of Artificial Intelligence (AI)</strong></p>\n<p>This assessment task is to be completed in-person. The use of Artificial Intelligence (Al) tools will not be permitted. Any attempted use of Al may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Seminar notebooks should be handed in over the counter at SCMB Administration Office (Level 3, Chemistry Building (68)) by 2pm on the due date. You are not required to have a cover sheet with your seminar notebook, but student name and number should be clearly written on the front of the diary for ease of identification.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-8",
            "assessment_title": "Final Research Seminar",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>12.5% 2 unit equivalent </dd>",
            "due_date": "<dd><p> 2/06/2025 - 6/06/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The ability to present research findings at scientific meetings, and the ability to defend the research findings, is an essential part of the training of a research scientist. The format of these seminars (15 minutes for the presentation) is the same as described for the Research Proposal Seminar above, except that (i) the focus is on the results of your research, the interpretation of these results, and an explanation of how your findings fit into the current state of research in your area, and (ii) the Final Research Seminar will be open to attendance by your supervisors, examiners and other members of research and academic staff. The seminar will be followed by a question period (5 minutes) where audience members will ask questions that will cover issues raised during the presentation. Your examiners may also ask about findings presented in your written research report. You should have a copy of your research report with you – your examiners will!</p>\n<p>Since the audience will be listening to a wide variety of talks over several days of presentations, it is important to give the \"Aims and Objectives\" of the research immediately after you tell the audience the title of your talk. It may even be appropriate to announce your primary finding at the beginning of the talk to help your audience keep your results in context.</p>\n<p> The questions and the student’s responses are important for two reasons:</p>\n<p> • First, they form part of the assessment of this component of the course.</p>\n<p> • Second, they provide the examiners of the student’s research report with an opportunity to probe the student’s knowledge about the project, something that will be examined further in the viva (which forms part of the assessment for the research report).</p>\n<p> <strong>Evaluation of the seminar and defence</strong></p>\n<p> Your presentation and defence will be assessed by senior members of the audience, including your examiners. The mark for your final research seminar is separate to the mark for your research report.</p>\n<p> This component will be marked as follows:</p>\n<p> • The Presentation (80% of the final mark).</p>\n<p> • Responses to questions (20% of the final mark).</p>\n<p>The following list is simply intended to give students a guide as to the sort of parameters on which an assessment will be based, but they are not meant to be exclusive. Four main facets will be considered.</p>\n<p> Introduction and Development of Topic (20%)</p>\n<p> 1. Did the introduction clearly and concisely outline the nature and scope of the topic reviewed or problem investigated?</p>\n<p> 2. Did the introduction orient the listener to the relationship of the current project with existing knowledge?</p>\n<p> 3. Was the method of investigation and, if necessary, the reasons for choice of a particular method explained?</p>\n<p> 4. Were the results clearly presented and logically ordered?</p>\n<p> 5. Did the speaker use good judgement in presenting pertinent information and excluding non-essential or distracting details?</p>\n<p> Analysis and Understanding (40%)</p>\n<p> 1. Were the results and/or concepts adequately analysed and critically evaluated?</p>\n<p> 2. Did the conclusions relate the results to the objectives of the investigation?</p>\n<p> 3. Did the speaker appear to understand clearly the background to the topic and the significance of the work?</p>\n<p> 4. Did the speaker acknowledge any real shortfalls in the work and suggest ways to overcome or avoid these in future work?</p>\n<p> 5. Did the summary adequately review the main points discussed in the seminar?</p>\n<p> Presentation (20%)</p>\n<p>1. Did the speaker remember to face the audience when speaking, avoid reading the entire presentation, and avoid other distracting mannerisms?</p>\n<p>2. Did the speaker project their voice clearly to the audience?</p>\n<p>3. Were major concepts and conclusions explained clearly and precisely?</p>\n<p>4. Was the speaker able to increase your interest in the topic, through personal attributes: enthusiasm, imagination, etc.?</p>\n<p>5. Did the speaker keep to the allotted time, and present material at a comprehensible rate?</p>\n<p>6. Did the presentation standard indicate adequate preparation and rehearsal by the speaker?</p>\n<p>7. Were slides and other A/V aids clear and helpful to the audience; rather than cluttered and confusing?</p>\n<p>Questions/ defence (20%)</p>\n<p>1. Was the speaker able to adequately respond to questions about the seminar and the research report, or were incomplete answers given?</p>\n<p>2. Did the speaker answer questions clearly, and address replies to the audience as a whole?</p>\n<p><em>Some tips for your seminar</em></p>\n<p>Scientific presentations are part substance and style and it is worth spending effort on both aspects.</p>\n<p>1. All students are expected to use PowerPoint for their presentation. If you feel that it is important to use a different program, you should contact the Honours Convenor(s) soon to discuss your plans.</p>\n<p>2. Prepare and practice. Unless you have had a LOT of experience in public speaking, the chances are that you will not finish after about 15 minutes which is the time allocated for speaking. Run too short and your audience will think that you do not have much to say. Run too long (worse) and you run the risk of being asked to stop speaking without having made all your points.</p>\n<p>3. Think about what you want to project to the audience. How do you do that? First by being organised and actually knowing what you are talking about. Second, by a series of <em>don’ts</em>. Don’t play it all for laughs (which can make your audience think the work is unimportant). A joke right at the beginning is not a bad idea if you have one, but don’t force it. Don’t look bored with your own work or disparage it yourself; leave that to others! Don’t dress like a slob! There is no need for a suit and tie but equally try to at least look like you are taking the session seriously.</p>\n<p>4. Have a clear structure to your talk. A lot of students do this by saying at the beginning of the talk what the structure will be – “<em>First I am going to introduce ..</em>., <em>then I will</em>...” etc. This can work, but if you can avoid it by making the structure clear as you go then that can be better. One of the more important moments in a seminar (perhaps especially your final seminar) is when you transition from background to what you are going to do (or have done). It is wise to make this really clear with a statement like “<em>So that is what we know/don’t know, this is what I am going to do</em>.” It lets the listener know exactly what is going on.</p>\n<p>5. Try to speak without notes. This is easy for some students and terrifying for others. Perhaps the best way to be organised is so that your slides remind you of exactly what it is that you need to say – so no need for notes. If this is a battle for you then practice, practice, practice.</p>\n<p>6. Keep your slides as simple as you can. Within limits, the fewer words the better. Don’t have whole sentences. Delete as many “the”s etc as you can. If you have several dot points on a slide it is often a good idea to animate them so that they come in one by one. If they are all there at once the audience is likely to read ahead and start to ignore you. You are the star – keep the focus on you! Watch out for typographical errors – they seem especially obvious in a PowerPoint presentation.</p>\n<p>7. Questions are an important part of the process and the part of the process that is not entirely under your control. Several important points here.</p>\n<ul>\n<li>Allow the Chair to field the questions. That is, allow him/her to decide who gets to ask a question. For this reason having a final slide of <em>Any questions?</em> is not a great idea. Let the Chair call for them. In an Honours seminar if a questioner is being unreasonable (asking mean or unreasonable questions) then it is the job of the Chair to intervene and save you.</li>\n<li>Remember to always answer the question to the whole room. A bad trap is to end up in a quiet conversation with a questioner at the front of the room. This lets the rest of the audience drift off. If the questioner unwisely asked the question very softly then it doesn’t hurt to repeat it so that the whole room knows what is being talked about.</li>\n<li>There are lots of different kinds of questions but perhaps the simplest classification is of those that you can answer and those that you can’t! If you can think of a respectable answer, then obviously fire away. Never answer with just yes or no. “Does malaria infect anything other than humans?” “Yes” = not much of an answer. Remember that you are demonstrating what a sharp well-read and organised person you are. If you can’t answer the question, don’t panic. If you do not know the answer, never just say “I don’t know!” Say “That is an interesting question. I don’t know, but I can see that it would be worth finding out because it might help me….. Thank you for that suggestion.” Or “I don’t know but I suspect that it would be a combination of X and Y ...” Never intimate that the question was stupid or that you have already answered it during the talk. If that is the case the rest of the audience will know and you will have their sympathy.</li>\n<li>Try not to look pleadingly at your supervisor for help if you can’t answer a question. If the supervisor takes over you will be suddenly excluded from the dialogue and marginalised in your own seminar. Much better to go with “That’s an interesting question and I will try to find out”.</li>\n</ul>\n<p><strong>Use of Artificial Intelligence (AI)</strong></p>\n<p>This assessment task is to be completed in-person. The use of Artificial Intelligence (Al) tools will not be permitted. Any attempted use of Al may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Instructions on how to submit your seminar slides will be provided via the course Blackboard site. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Practical or theoretical experimental work</strong><br><p>Practical or theoretical experimental work, under the guidance of an experienced supervisor.</p></br></p></div></td>",
            "topic_title": "<strong>Practical or theoretical experimental work</strong>",
            "topic_description": "Practical or theoretical experimental work Practical or theoretical experimental work, under the guidance of an experienced supervisor.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Recording and reporting of data</strong><br><p>Recording the planning and outcome of experiments in a manner suitable for scientific research. Reporting of results via group presentations.</p></br></p></div></td>",
            "topic_title": "<strong>Recording and reporting of data</strong>",
            "topic_description": "Recording and reporting of data Recording the planning and outcome of experiments in a manner suitable for scientific research. Reporting of results via group presentations.",
            "learning_outcomes": []
        }
    ]
}