{
    "course_title": "Research Project in Biotechnology",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/BIOT6122-64262-7460",
    "full_course_code": "BIOT6122-64262-7460",
    "course_code": "BIOT6122",
    "class_code": "64262",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - )",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Conextualise the practical and/or theoretical significance of your research project including innovation, feasibility and appropriate experimental approaches, within the body of published literature relevent to your project."
        },
        {
            "number": "LO2.",
            "description": "Design appropriate literature search strategies and other elements of preparation for your research project."
        },
        {
            "number": "LO3.",
            "description": "Develop innovative and achievable research objectives based on a thorough understanding of existing knowledge in a field."
        },
        {
            "number": "LO4.",
            "description": "Conduct practical or theoretical experimental work, under the guidance of an experienced supervisor."
        },
        {
            "number": "LO5.",
            "description": "Record the planning and outcome of experiments in a manner suitable for scientific research."
        },
        {
            "number": "LO6.",
            "description": "Locate and read current scientific literature related to the area of the research project."
        },
        {
            "number": "LO7.",
            "description": "Write a substantial research report in a format appropriate for a scientific investigation."
        },
        {
            "number": "LO8.",
            "description": "Construct a coherent and clear PowerPoint presentation."
        },
        {
            "number": "LO9.",
            "description": "Clearly and confidently deliver an oral presentation to an audience of scientists, including those who may be unfamiliar with your specific research area."
        },
        {
            "number": "LO10.",
            "description": "Give clear, concise, organized and accurate oral presentations of your research."
        },
        {
            "number": "LO11.",
            "description": "Explain difficult scientific concepts to non-experts."
        },
        {
            "number": "LO12.",
            "description": "Respond knowledgably to questions from others on aspects of your project, demonstrating a deep understanding of your field."
        },
        {
            "number": "LO13.",
            "description": "Analyse and critically evaluate scientific information presented in research seminars."
        },
        {
            "number": "LO14.",
            "description": "Listen and rapidly assimilate information delivered by other scientists in a seminar forum."
        },
        {
            "number": "LO15.",
            "description": "Develop skills associated with contributing to academic service and engagement, and building collegiality."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Research Proposal",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> 2 unit equivalent </dd>",
            "due_date": "<dd><p> 25/09/2024 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>During the first few months of your honours project you will search the literature, write a critical review that will normally be related to (although not necessarily restricted to) your research project, outline the overall aims and objectives of your research project, and explain the experimental methods you will undertake to meet your aims and objectives. The Research Proposal is to be no longer than 4,000 words, excluding references and table/figure legends. A word count must be listed in the title page and marks will be deducted if in excess of 4,400 words are submitted.</p>\n<p>NOTE: This is a Research Proposal supported by a relevant Literature Review. Of the 4,000 word document up to 25% (1,000 words), should be devoted to an outline and defence of your proposed research, the proposed timeline and the methods you propose to use. The preceding literature review should support your experimental design and choice of methods.</p>\n<p>Consult librarians for help in literature searching. Computer searches and access to material outside the University require the approval of your supervisor.</p>\n<p>The review should be written clearly and concisely, in a style consistent with major reviewing journals. It will consist of:</p>\n<ul>\n<li>Title Page: Title of review, name of student, course and word count.</li>\n<li>Contents page: All chapters and subheadings.</li>\n<li>List of abbreviations.</li>\n<li>Literature review: Organised into chapters and subheadings. All information is to be properly referenced (author and year) to distinguish it from your own ideas and opinions.</li>\n<li>Summary and evaluation: Outlining deficiencies in the literature in relation to the project and therefore defining the problem, which the research project will tackle.</li>\n<li>Outline specific research objectives (hypothesis that you aim to prove), methods to be developed and used, and timeline for major experiments. Defend the objectives and methods listed by reference to your literature review and through discussion.</li>\n<li>A full and accurate list of references (including titles of articles).</li>\n</ul>\n<p>The review must be typed, or word-processed, in the standard page format. A standard page is defined as an A4 page with a 2cm margins. A line spacing of 1.5 is to be used, and the text must be in 12 point. It is preferable to use a proportional font, and one that is easy on the eye to read, such as Times New Roman. Reference style should follow the main journal in your field. The library has additional resources on referencing styles.</p>\n<p>The review will be assessed on the basis of:</p>\n<ul>\n<li>The comprehension of the present state of the field.</li>\n<li>The critical analysis of previous work, conclusions and theories.</li>\n<li>The clarity and organisation of the writing.</li>\n<li>The clarity of the research objectives, and defence of proposed methods.</li>\n</ul>\n<p>Examiners external to your supervisors research group will be appointed by your supervisor to assess your Research Proposal. These will be the same examiners who will assess your Final Research Seminar and Final Research Report.</p>\n<p><strong>QUESTIONS TO KEEP IN MIND</strong></p>\n<p>Below are some of the questions the examiners of your Research Proposal/Literature Review will have in mind as they read your document.</p>\n<ul>\n<li>Is the topic clearly explained and put into context?</li>\n<li>Are the scope and aims of the literature review clearly explained?</li>\n<li>Has the literature been well searched and have gaps in the literature been identified?</li>\n<li>Have conflicts, inconsistencies and errors in the literature been identified?</li>\n<li>Has the literature been carefully analysed and discussed in sufficient detail?</li>\n<li>Is the review well-structured and organised?</li>\n<li>Is the writing style good? (grammar, sentence construction, paragraph construction)</li>\n<li>Is the review written clearly and concisely?</li>\n<li>Does poor presentation divert attention away from the content?</li>\n<li>Are there logical gaps within the review?</li>\n<li>How well has the general theme of the review been developed?</li>\n<li>Does the review meet the aims it set out?</li>\n<li>Have you drawn appropriate conclusions from the review?</li>\n<li>Have you linked the review to the need for your research?</li>\n<li>Have you established a clear hypothesis for your intended research to answer?</li>\n<li>Have you identified major methods to be developed/used?</li>\n<li>Have you assessed the time required for the suggested work and is the assigned time realistic?</li>\n<li> You should use these questions to guide you as you write.</li>\n</ul>\n<p><strong>Use of Artificial Intelligence (AI)</strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit through the course Turnitin submission point in Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Proposal Seminar",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 8/10/2024 - 11/10/2024</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You will give a 20-minute seminar (15-minute presentation followed by 5-minutes to respond to audience questions) outlining the area of your project and your proposed research. This seminar has two aims:</p>\n<ul>\n<li>to give you an opportunity to practice your seminar presentation skills and to obtain constructive feedback</li>\n<li>to generate questions and discussion about your experimental work</li>\n</ul>\n<p>You should time your seminar to run somewhere between 14 and 15 minutes. You will be given a warning at 14 minutes and if you go over time, you will be cut-off in mid-sentence at 16 minutes. You will then have 5 minutes to answer questions from the audience.</p>\n<p>The proposal seminar will be attended by your fellow honours students and the honours convenor.</p>\n<p><strong>SUGGESTIONS FOR PREPARING YOUR TALK</strong></p>\n<ol>\n<li>CONTENT - Remember, the purpose of giving a talk is to get a clear message across to the audience. It is not necessary to try to impress the audience with the amount of your knowledge. Therefore, do not try to present too much material. Build your talk around a clear central theme. Any issues which detract from a clear presentation, however important, can be dealt with in question time if necessary.</li>\n<li>DELIVERY - Pay attention to presentation techniques. Use appropriate audio visual aids. Speak clearly and not too fast. It is a good idea to consult books that give tips for public speaking.</li>\n<li>STRUCTURE - Plan to spend up to half the time on the background of your project to show the wider context of your project and half on what exactly you intend to do and how you intend to do it. Remember that most of the audience may be unfamiliar with your research area. Also remember, that in biotechnology, your audience will have a wide variety of backgrounds from the various biological sciences and engineering and even sometimes from business and law.</li>\n</ol>\n<p><strong>PLEASE NOTE:</strong> Computers used in seminar rooms are PCs. It is the student’s responsibility to ensure that any presentations prepared on a Mac are compatible with and will run on the supplied PC. Student’s own laptops are not used in seminar presentations.</p>\n<p><strong>What you must do the day before your talk:</strong></p>\n<p>You must submit a copy of your final PowerPoint slides to the honours administrator by 2pm the day before your talk, through the Turnitin submission portal in the BIOT6121 blackboard page. Your slides will be pre-loaded onto the school laptop ahead of your talk. You cannot make any changes to your slides once they have been submitted. Further submissions are available under SUBMISSION INSTRUCTIONS. </p>\n<p>If your proposal seminar contains confidential information you must submit your slides through the separate Turnitin submission portal labelled for CONFIDENTIAL PROJECT ONLY, and inform the honours administrator and convenor. Consult with your supervisor about the confidential nature of your presentation.</p>\n<p><strong>What you must do the day of your talk:</strong></p>\n<p>The room and final time will be communicated to you by the honours administrator. Please ensure you attend the entire session, including your peers proposal seminars. This is an important opportunity to learn about your peers projects and provide feedback to others working in similar and other fields of biotechnology. Attendance at the Proposal Seminars will count as attendance at one seminar in your seminar diaries (see separate information for your seminar diaries). You are also encouraged to attend the Final Seminars of the cohort of Biotechnology honours students who will be completing their honours projects in Semester 2 2024, due to be scheduled in November 2024. Further information about the venue, date and time will be communicated to you via the honours administrators. Attendance at the Final Seminars of the honours students completing their projects in Semester 2 2024 will provide you with the opportunity to learn and understand more about the format and process of a final seminar, which will help you when you prepare for your own final seminars. Attendance at the Final Seminars of the honours students completing their projects in Semester 2 2024 can count as one seminar attendance in your seminar diaries (see the information about your Seminar Diaries for more details).</p>\n<p><strong>Use of Artificial Intelligence (AI)</strong></p>\n<p>This assessment task is to be completed in-person. The use of Artificial Intelligence (Al) tools will not be permitted. Any attempted use of Al may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit a copy of your final PowerPoint slides to the honours administrator by 2pm the day before your talk, through the Turnitin submission portal in the BIOT6121 blackboard page. Your slides will be pre-loaded onto the school laptop ahead of your talk. You cannot make any changes to your slides once they have been submitted. Please name your slides in the following way: FAMILYNAME_Givenname_StudentID_Coursecode_AssignmentName. For example: Bob Smith (ID:12345678) would name his ABCD6789 essay 1 as SMITH_Bob_12345678_ABCD6789_Essay1.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Mid-year Methods Write-up and Check-point",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 17/02/2025 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Mid-Year Methods Write-up:</strong></p>\n<p>Writing up your research methods and preliminary findings as you go is an important skill and practice for research scientists. It allows you to record information while it is still fresh in your mind, helps reflect on your findings to date and plan future experiments, provides you with additional experience in writing and communicating your research findings for example through graphs and tables, and provides additional opportunities for feedback from your supervisors.</p>\n<p>This task involves writing up your research methods and findings to date, and presenting your preliminary or interim findings. Your supervisor will be provided a copy of your Mid-year Methods Write-up and can take this opportunity to provide you with feedback, ahead of your Final Report. You can include a revised version of your Mid-Year Methods Write-up in your Materials and Methods section of your Final Report. While there is no set word minimum for the Mid-Year Methods Write-up, as each student may be in a different stage of their research projects, you should not exceed 2000 words total. Think about how figures and tables can assist in communicating detailed information and findings to the readers, remembering proper figure and table caption and labelling conventions, including all axis on graphs and table columns appropriately labelled. </p>\n<p><strong>Check-point:</strong></p>\n<p>In addition to your methods and findings write-up, you will complete a check-point with your supervisor, and this will be submitted along with your write up.</p>\n<p>Your Mid-year Methods Write-up and Check-point should follow these guidelines:</p>\n<ul>\n<li>Title page: Project title, name of student, course, and word count.</li>\n<li>Abstract: No more than 1 page</li>\n<li>Materials and Methods to date: Cultures, uncommon chemicals and equipment. Cite standard methods or methods published elsewhere, noting modifications. Otherwise the method should be described in full (possibly in an appendix if the method takes up a lot of space to describe but developing the method was not a key part of your project).</li>\n<li>Preliminary or Interim Results: In any accepted format.</li>\n<li>Future work: Identification of further work required (might be incorporated into discussion). No more than 1 page.</li>\n<li>Full and accurate list of references (including titles of articles).</li>\n<li>Appendices: May or may not be necessary.</li>\n<li>Check-point form: filled out in consultation with your supervisor. This form will be available on the BIOT6121 blackboard site.</li>\n</ul>\n<p>The report must be typed, or word-processed, in the standard page format. A standard page is defined as an A4 page with a 2cm margins. A line spacing of 1.5 is to be used, and the text must be in 12 point. It is preferable to use a proportional font, and one that is easy on the eye to read, such as Times New Roman. References should be in the style of the leading journal in your field of Biotechnology. The UQ Library provides additional information on referencing styles.</p>\n<p>You must clearly indicate in your Report if any of your experimental work or data was conducted or collected by others.</p>\n<p><strong>Use of Artificial Intelligence (AI)</strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit through the course Turnitin submission point in Blackboard. Please note: No hardcopy is to be submitted. Before submitting your assessment item to Turnitin please name your file in the following way. FAMILY NAME_GivenName_StudentID_CourseCode_AssignmentName For example: Bob Smith (ID: 54329876) would name his ABCD1234 essay 1 in the following way. SMITH_Bob_54329876_ABCD1234_Essay1</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Written Report / Lab Performance",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> 10 unit equivalent </dd>",
            "due_date": "<dd><p> 26/05/2025 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance, Written",
            "category": "Paper/ Report/ Annotation, Notebook/ Logbook, Participation/ Student contribution",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Written Report:</strong></p>\n<p>You will write a research report in the style of a mini-thesis, or a large publication. It must have no more than 8,000 words, excluding the abstract, references and table/figure legends. A word count must be listed in the title page and marks will be deducted if in excess of 8,800 words are submitted. If appendices are included, they must not form part of the word count and they will not be examined. Material essential for understanding the report must not be put in appendices. You can use appendices for providing extra background material or for supplying raw data if you think it is of some use, but examiners cannot be expected to review it in detail.</p>\n<p>The research report will consist of:</p>\n<ul>\n<li>Title page: Project title, name of student, course, and word count.</li>\n<li>Abstract: No more than 1 page</li>\n<li>Contents: All chapter headings and subheadings. List of abbreviations.</li>\n<li>Introduction: Defining the scope and aim of the research project, in the context of the most relevant literature (must not exceed 1,500 words). This can be a reduced version of the original Research Proposal/Literature Review.</li>\n<li>Materials and Methods: Cultures, uncommon chemicals and equipment. Cite standard methods or methods published elsewhere, noting modifications. Otherwise the method should be described in full (possibly in an appendix if the method takes up a lot of space to describe but developing the method was not a key part of your project). This can be a reduced version of the Mid-Year Methods Write-up and Check-point.</li>\n<li>Procedures/Results/Discussion: In any accepted thesis format.</li>\n<li>General Discussion: May be quite large if no discussion in previous section. May be absent if sufficient discussion in previous section.</li>\n<li>Conclusions: Concise summary of major findings (might be incorporated into discussion).</li>\n<li>Future work: Identification of further work required (might be incorporated into discussion).</li>\n<li>Full and accurate list of references (including titles of articles).</li>\n<li>Appendices: May or may not be necessary.</li>\n</ul>\n<p>The report must be typed, or word-processed, in the standard page format. A standard page is defined as an A4 page with a 2cm margins. A line spacing of 1.5 is to be used, and the text must be in 12 point. It is preferable to use a proportional font, and one that is easy on the eye to read, such as Times New Roman. References should be in the style of the leading journal in your field of Biotechnology. The UQ Library provides additional information on referencing styles.</p>\n<p>We understand that pandemics, natural disasters, and other unforeseen circumstances impact everyone differently and with this in mind we ask students to include a ‘Statement on impact of disruptions” page in their Final Report. You should include a maximum of one page. You should outline how your Honours project was disrupted and describe the changes that were put in place in response to these disruptions. Disruptions could include an inability to perform laboratory work for a certain period, difficulties in ordering reagents, or any other disruptions you feel are relevant. The changes put in place could include changes to individual aims, scope, or topic of your project. The description of disruptions will provide some context for your examiners, especially when you have had to substantially change your project from your original plans.</p>\n<p>The report will be assessed on the basis of:</p>\n<ul>\n<li>your ability to organise information in a clear and logical manner;</li>\n<li>your communication skills: ability to write in good English. Your writing must be clear, concise and accurate (look up books on scientific writing);</li>\n<li>the quality of the work done. Given that in such a short research project significant positive results may be difficult to achieve, your approach to the problem is more important: it should be systematic, logical and compatible with good scientific method;</li>\n<li>your ability to: interpret data, draw conclusions, recognise the significance and potential applications of your findings, compare your work with that of others, discuss implications, show deficiencies and therefore highlight further work required.</li>\n</ul>\n<p>You must clearly indicate in your Written Report if any of your experimental work or data was conducted or collected by others.</p>\n<p><strong>QUESTIONS TO KEEP IN MIND</strong></p>\n<p>Below are some questions the examiners of your research report will have in mind as they read your report:</p>\n<ul>\n<li>Is the topic clearly introduced and put into context?</li>\n<li>Is the aim of the research clearly stated?</li>\n<li>Is the need for the research clearly justified?</li>\n<li>Is the experimental strategy clearly stated? Was it appropriate?</li>\n<li>Were appropriate experimental methods used? Have alternative methods been considered?</li>\n<li>Does the student demonstrate awareness of the limitations of methods?</li>\n<li>Is any assistance the student obtained appropriately acknowledged?</li>\n<li>Are the results presented clearly and logically in an appropriate form?</li>\n<li>Has the student presented appropriately processed results?</li>\n<li>Are the important results highlighted and fully explained?</li>\n<li>Does the student understand and communicate the reliability of the results?</li>\n<li>Are the results related to the initial aims?</li>\n<li>Are appropriate conclusions drawn? Do the results support the conclusions?</li>\n<li>Are the results analysed in the light of relevant literature?</li>\n<li>Are shortfalls in the work identified and are important conceptual advances recognised?</li>\n<li>Are important unanswered questions identified and are useful future directions and experiments suggested?</li>\n<li>Are the work and ideas of others adequately referenced?</li>\n<li>Have you demonstrated intellectual originality, and the ability to think critically and clearly?</li>\n</ul>\n<p>You should use these questions to guide you as you write. Keep in mind the following maxim: \"Scientists do not so much have the responsibility to write so that they can be understood, but rather scientists must write in such a way that it is not possible to misunderstand them\".</p>\n<p>You are strongly advised to write drafts of sections of your research report and submit them to your supervisor during your benchwork. It is also a good idea to prepare copies of graphs for presentation in the report as soon as a set of complete data is available. The time available after you stop your benchwork does NOT allow you sufficient time to write a good research report if you start from scratch. Your Mid-Year Methods Write-up and Check-point is designed to assist in this task.</p>\n<p>Your written report will be examined by two examiners nominated by your supervisor. These examiners will be the same examiners from your Research Proposal and Final Seminars.</p>\n<p><strong>Lab Performance:</strong></p>\n<p>In addition to the two examiners marks from your Written Report, your supervisor will evaluate your lab performance in a supervisor's evaluation report. This report and mark will carry the same weighting as the examiners marks for your final report (that is, your supervisor mark/100 will be added to each of your examiners marks/100 for your final report and the total divided by 3 to give your overall % mark for the 10 units of your final report). Hence your supervisors mark and each examiners mark carries a weighting of 3.33 units for the course.</p>\n<p>Your lab experiment notebooks are to be handed in to your supervisor at the same time your research report is submitted, and on completion of your assessment they become the property of your supervisor. All work must be directly recorded into these notebooks, which may be inspected at any time by the supervisor. They must be kept up to date. The aim of an experimental notebook is for someone proficient in the field to be able to read your notes and understand what you have done (so as to be able to repeat your experiments) and the results you have obtained. Therefore notebooks must be logically organised, clearly written, accurately cross-referenced and complete. There are many ways in which experimental notebooks can be organised; you should discuss suitable schemes with your supervisor.</p>\n<p><strong>Use of Artificial Intelligence (AI)</strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit through the course Turnitin submission point in Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-4",
            "assessment_title": "Seminar attendance diary",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 26/05/2025 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Notebook/ Logbook",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The School of Chemistry and Molecular Biosciences runs two weekly seminar series (one in Chemistry and one in Molecular Biosciences) and also hosts additional ad hoc seminars throughout the year by visiting researchers. Other schools and research institutes around UQ also run regular research seminars throughout the year. <strong><em>Regular attendance</em></strong> at these seminars is not only mandatory, but is an essential part of your training as a scientist, as this is where you are exposed to diverse scientific techniques and approaches. </p>\n<p>Students must attend at least <strong>at least</strong> 15 seminars throughout the year. This reflects the fact that while most seminar programs run ~ weekly, they may not be held every week of the year. You must pass this section to pass the course. </p>\n<p>You are also encouraged to attend the proposal seminars of the cohort of Biotechnology honours students who will be starting their honours projects in Semester 2 2023, due to be scheduled in October 2023 and the Final Seminars of the cohort of Biotechnology students who will be finishing their honours projects in Semester 1 2023, due to be scheduled in June 2023. Further information about the venue, date and time will be communicated to you via the honours administrators. Attendance at the Proposal Seminars and Final Seminar can count as attendance at one seminar (each) in your seminar diaries. Throughout the year, there will be additional opportunities to present short (5-10min) seminars to your fellow Biotechnology honours students. These will be communicated to you throughout the year and attendance at up to two of these peer seminars can count in your seminar diaries.</p>\n<p>Students must document their attendance at seminars throughout the year by taking notes in a clearly documented, hard copy (i.e. not digital) seminar notebook. It is a requirement that you submit this seminar notebook at the end of the year together with your final Research Report. The book must contain details of all of the seminars the student has attended and is given either a Pass or Fail grade. It is expected that a complete seminar notebook will contain notes on <strong>at least</strong> 15 seminars attended throughout the year. This reflects the fact that while most seminar programs run ~ weekly, they may not be held every week of the year. You must pass this section to pass the course. </p>\n<p>The notebook should follow the guidelines below for each seminar:</p>\n<ul>\n<li>The date, title of the seminar and the speaker's name and affiliation;</li>\n<li>Handwritten notes (1/2 - 1 page) about the seminar, including the aims, hypotheses, scientific content, critical issues raised by the speaker, assumptions made. At least one question for the speaker should be included for each seminar. These notes must be taken during the seminar;</li>\n<li>A paragraph that states the objective(s) of the speaker's work (i.e. what were they trying to show) and what was achieved. This should be added after the seminar, based on the notes taken. Material copied directly from the speaker's abstract is not acceptable.</li>\n</ul>\n<p>Seminars that can be attended are not limited to those given in the student's School or Institution. Attendance at seminars held in other Schools, Centres or Institutes are acceptable. However, seminars given by PhD students, and informal seminars or presentations made at research group meetings are not acceptable for this part of the course.</p>\n<p>The diary should be available for inspection by the student’s supervisor or the Honours Convenor(s) at any time. At the end of the year, the diary must be handed in at the SCMB Administration Office to be assessed by the Honours Convenor(s).</p>\n<p>Some Strategies:</p>\n<ul>\n<li>The single most important thing you should do before the seminar is to read the speaker's abstract, if this has been provided. This will enable you to get a general overview of the major aims of the research, approaches used, and of the major conclusions drawn.</li>\n<li>During the seminar learn to listen critically and sympathetically. Listen for what the presenter means rather than pick at words or specific arguments. Focus attention on the aims, hypotheses, and assumptions made; the structure of the argument; and the evidence presented (or neglected).</li>\n<li>Make your notes brief and put them in your own words. Use margins for questions, comments, and notes to yourself on material that is not clear.</li>\n<li>Go over your notes as soon as possible after the seminar to write a summary paragraph that states the objective(s) of the speaker's work (i.e. what was he/she trying to show) and what was achieved.</li>\n</ul>\n<p><em>Special note: Some students have previously remarked that regularly attending seminars in addition to scheduling and completing all of their experiments has been difficult. It is important for students to appreciate that while experimental work conducted in the lab is a major component of your Honours year, it is not the only component and other assessment items such as seminar attendance are equally important to your development as a professional scientist, as is the development of effective time management and planning skills, allowing you to schedule experiments around regular seminar attendance.  </em></p>\n<p><strong>Use of Artificial Intelligence (AI)</strong></p>\n<p>This assessment task is to be completed in-person. The use of Artificial Intelligence (Al) tools will not be permitted. Any attempted use of Al may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Seminar notebooks should be handed in over the counter at SCMB Administration Office (Level 3, Chemistry Building (68)) by 2pm on the due date. You are not required to have a cover sheet with your seminar notebook, but student name and number should be clearly written on the front of the diary for ease of identification.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-5",
            "assessment_title": "Final Research Seminar",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> 2 unit equivalent </dd>",
            "due_date": "<dd><p> 2/06/2025 - 6/06/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>One week after handing in your research report, you will present a seminar describing your research project. The ability to present your research work at scientific meetings is an essential part of your research training. Your second seminar will therefore be presented in the same way as a conference presentation. This means:</p>\n<ul>\n<li>You do not have to cram in everything you have done. You should give an overview of your work (highlighting your major results) or maybe give a more in-depth presentation of a crucial and self-contained sub-section of your work. The main aim is to have a clear message that you want to communicate to your audience.</li>\n<li>The audience will be from a variety of backgrounds, although you can assume that they all have a basic knowledge of biotechnology. You must try to communicate with the whole audience, not just members from your own sub-discipline.</li>\n</ul>\n<p>The seminar will consist of a 15-minute presentation and 15-minutes for questions and discussion from your examiners and the audience, similar to a viva. You should time your presentation to go for between 14 and 15 minutes. If you go overtime then you will be cut-off in mid-sentence at 16 minutes.</p>\n<p> NOTE: The seminar questions session is an opportunity for your Research Report examiners to gauge how well you understand your work, and it may influence the final mark they provide for your report</p>\n<p> Assessment of the research seminar will be on the basis of:</p>\n<ul>\n<li>quality of content;</li>\n<li>clarity of presentation (both oral and visual);</li>\n<li>ability to handle questions and discussion;</li>\n<li>ability to communicate effectively with an audience of diverse backgrounds.</li>\n</ul>\n<p><strong>QUESTIONS TO KEEP IN MIND</strong></p>\n<p>Some of the questions your markers will have in mind are outlined below.</p>\n<ul>\n<li>Did the introduction clearly state the problem being investigated?</li>\n<li>How well was the problem put into context with background information?</li>\n<li>Was the structure of the talk made clear at the start?</li>\n<li>Was the need for the research work clearly justified?</li>\n<li>Were the experimental strategies explained at an appropriate level of detail?</li>\n<li>Was there an adequate balance between background and results?</li>\n<li>Was a coherent set of important results presented?</li>\n<li>Did the presentation finish clearly and concisely? Or did it meander about towards the end?</li>\n<li>Was the main message of the presentation clear? Was the whole presentation built around this main message?</li>\n<li>Were there sufficient visual aids?</li>\n<li>Did the speaker enunciate clearly? Was the speaker clearly audible?</li>\n<li>Did the speaker engender interest in the topic?</li>\n<li>Did the speaker avoid reading and distracting mannerisms?</li>\n<li>Was the presentation well timed, and presented at an appropriate pace?</li>\n<li>Did the speaker answer questions directly? Did the speaker answer the questions that were asked? Did the speaker seek clarification of what was being asked when appropriate?</li>\n<li>Did the speaker demonstrate a deep understanding of the research area through their answers to questions?</li>\n</ul>\n<p>PLEASE NOTE: Computers used in seminar rooms are PCs. It is the student’s responsibility to ensure that any presentations prepared on a Mac are compatible with and will run on the supplied PC. Student’s own laptops are not used in seminar presentations.</p>\n<p><strong>What you must do the day before your talk:</strong></p>\n<p>You must submit a copy of your final PowerPoint slides to the honours administrator by 2pm the day before your talk, through the Turnitin submission portal in the BIOT6121 blackboard page. Your slides will be pre-loaded onto the school laptop ahead of your talk. You cannot make any changes to your slides once they have been submitted. Further submissions are available under SUBMISSION INSTRUCTIONS. </p>\n<p>If your proposal seminar contains confidential information you must submit your slides through the separate Turnitin submission portal labelled for CONFIDENTIAL PROJECT ONLY, and inform the honours administrator and convenor. Consult with your supervisor about the confidential nature of your presentation.</p>\n<p><strong>What you must do the day of your talk:</strong></p>\n<p>The room and final time will be communicated to you by the honours administrator. Please ensure you attend the entire session, including your peers seminars. This is an important opportunity to learn about your peers projects and provide feedback to others working in similar and other fields of biotechnology. You are also encouraged to attend the Final Seminars of the cohort of Biotechnology honours students who will be completing their honours projects in Semester 2 2024, due to be scheduled in November 2024. Further information about the venue, date and time will be communicated to you via the honours administrators. Attendance at the Final Seminars of the honours students completing their projects in Semester 2 2024 will provide you with the opportunity to learn and understand more about the format and process of a final seminar, which will help you when you prepare for your own final seminars. Attendance at the Final Seminars of the honours students completing their projects in Semester 2 2024 can count as one seminar attendance in your seminar diaries (see the information about your Seminar Diaries for more details).</p>\n<p><strong>Use of Artificial Intelligence (AI)</strong></p>\n<p>This assessment task is to be completed in-person. The use of Artificial Intelligence (Al) tools will not be permitted. Any attempted use of Al may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit a copy of your final PowerPoint slides to the honours administrator by 2pm the day before the seminars commence, through the Turnitin submission portal in the BIOT6121 blackboard page. Your slides will be pre-loaded onto the school laptop ahead of your talk. You cannot make any changes to your slides once they have been submitted. Please name your slides in the following way: FAMILYNAME_Givenname_StudentID_Coursecode_AssignmentName. For example: Bob Smith (ID:12345678) would name his ABCD6789 essay 1 as SMITH_Bob_12345678_ABCD6789_Essay1.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Peer Seminars</strong><br><p>Throughout the year there will be opportunities to present short summaries of your research progress and findings to date to your honours peers. These opportunities will be communicated through the honours administrator.</p></br></p></div></td>",
            "topic_title": "<strong>Peer Seminars</strong>",
            "topic_description": "Peer Seminars Throughout the year there will be opportunities to present short summaries of your research progress and findings to date to your honours peers. These opportunities will be communicated through the honours administrator.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lab performance</strong><br/><p>Practical or theoretical experimental work, under the guidance of an experienced supervisor.</p></p></div></td>",
            "topic_title": "<strong>Lab performance</strong>",
            "topic_description": "Lab performance Practical or theoretical experimental work, under the guidance of an experienced supervisor.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lab notebook</strong><br/><p>Recording the planning and outcome of experiments in a manner suitable for scientific research. You will report the results via discussion forums and/or group presentations within the lab, in your Mid-year Methods Write-up and Check-point, and in your final Research Report.</p></p></div></td>",
            "topic_title": "<strong>Lab notebook</strong>",
            "topic_description": "Lab notebook Recording the planning and outcome of experiments in a manner suitable for scientific research. You will report the results via discussion forums and/or group presentations within the lab, in your Mid-year Methods Write-up and Check-point, and in your final Research Report.",
            "learning_outcomes": []
        }
    ]
}