{
    "course_title": "Honours in Chemistry",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/CHEM6512-61846-7460",
    "full_course_code": "CHEM6512-61846-7460",
    "course_code": "CHEM6512",
    "class_code": "61846",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - )",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate advanced research skills through laboratory- and/or computer based work"
        },
        {
            "number": "LO2.",
            "description": "Keep a well documented and accurate laboratory notebook"
        },
        {
            "number": "LO3.",
            "description": "Objectively interpret experimental results"
        },
        {
            "number": "LO4.",
            "description": "Think independently and initiate new experimental approaches to the solution of a problem"
        },
        {
            "number": "LO5.",
            "description": "Demonstrate a clear and effective scientific writing style that offers clear and accurate explanations of the background to your project and sets out its aims in the form of a research proposal"
        },
        {
            "number": "LO6.",
            "description": "Competently search the scientific literature to locate information relevant to your research project"
        },
        {
            "number": "LO7.",
            "description": "Demonstrate a comprehensive awareness and knowledge of previous work that has been published by others in your chosen area of research"
        },
        {
            "number": "LO8.",
            "description": "Justify the importance of your project in terms of what new information it will bring to your field of research"
        },
        {
            "number": "LO9.",
            "description": "Demonstrate an effective scientific writing style that offers clear and accurate explanations of outcomes of your project in the form of a major research report"
        },
        {
            "number": "LO10.",
            "description": "Construct an attractive and clearly organised scientific PowerPoint presentation"
        },
        {
            "number": "LO11.",
            "description": "Speak clearly and confidently to an audience of scientists"
        },
        {
            "number": "LO12.",
            "description": "Offer clear and logical explanations of scientific concepts that may be unfamiliar to the non-specialist"
        },
        {
            "number": "LO13.",
            "description": "Answer appropriate questions from other scientists on aspects of your research project which demonstrate a deep understanding of your field"
        },
        {
            "number": "LO14.",
            "description": "Assimilate ideas and information delivered by other scientists during a seminar presentation"
        },
        {
            "number": "LO15.",
            "description": "Demonstrate advanced knowledge and problem-solving skills in your area of specialisation"
        },
        {
            "number": "LO16.",
            "description": "Utilise and adapt advanced knowledge in aspects of your project work"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Research Proposal",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>12.5% 2 unit equivalent </dd>",
            "due_date": "<dd><p> 23/10/2024 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This comprises a 3000 word (maximum) research proposal that provides an introduction to the work that you will undertake, the background to this project and why you are doing it. The word limit does NOT include references, table of contents or list of abbreviations, though all three of these things are required in the document. Although this assessment component is named Research Proposal, it will in fact, consist largely of a critical literature review of your research area. It will probably form the basis of your introductory research report (thesis) chapter.</p>\n<p>Although your supervisor is permitted to read and comment on a draft of your proposal, they must not undertake in-depth drafting. The written work must be your own. It is critical that your supervisor or a nominated senior researcher read a final draft of this document to provide feedback. YOU MUST ALLOW THIS PERSON AT LEAST ONE WEEK TO READ THE FINAL DRAFT OF YOUR REVIEW. This allows adequate time for the document to be read carefully, changes discussed and for you to make the changes.</p>\n<p>The purpose of the Research Proposal is:</p>\n<p>- to ensure that the student knows the work already done in the research area;</p>\n<p>- to ensure that the student can assess deficiencies in the knowledge of the subject;</p>\n<p>- to test the student's ability to read literature critically;</p>\n<p>- to test the student's ability to organise evidence derived from other people's work; and</p>\n<p>- to test the student's ability to write a clear, concise, readily understandable proposal in an objective manner.</p>\n<p>The Research Proposal should consist of the following sections:</p>\n<p>1.   Background and significance: This will constitute the bulk (~two thirds) of the document. It will consist of a critical and concise review of the literature in the area (i.e. past relevant research), under sub-headings, which are listed in a Table of Contents. You should clearly state the significance of the area of research to science. Headings and sub-headings may be numbered if desired. Developments in the literature are usefully followed in chronological order, but this can be varied if there is a good reason for doing so. The major research in the area should be presented critically which will then lead to a discussion of the gaps in knowledge in the area.</p>\n<p>2.   Aims/hypotheses: The discussion described above will lead into a concise description of the specific aims and/or hypotheses of your project. These can be presented in dot point form. It should be clear how these aims will address the gaps in the knowledge in the chosen area of research.</p>\n<p>3.   Research plan and methods: This section should describe the general strategy for achieving the aims listed in (2) and the detailed plan of how the experiments will be performed. This section can also include citation of literature describing such methods. This part should comprise approximately one-third of your proposal. THIS DOCUMENT IS NOT TO CONTAIN ANY PRELIMINARY RESULTS OR “PROGRESS SO FAR”.</p>\n<p>References in the text must be cited as per an ACS Chemistry journal format (it is recommended that this be discussed with the supervisor). A full and accurate list of references must be given at the end under the heading References. Students are strongly encouraged to learn how to use EndNote or comparable programs.</p>\n<p>You are to format the document with a 12 point Arial or Times New Roman font, on double-sided A4 paper, allowing 2cm margins on each side. Use 1.5 spacing. Number pages so that your Table of Contents can refer to them. Figures, schemes and tables should be placed in the running text. Figures, particularly chemical structures should be drawn in ChemDraw or a similar drawing program and pasted into the document.</p>\n<p>Your proposal will be assessed by two academic staff members. The examiners will be asked to consider the following questions:</p>\n<p>- Is your analysis of the research field, including literature relating to past studies, a critical analysis or just a summary of what is known?</p>\n<p>- Do you have a clear conceptual understanding of the science underpinning the project?</p>\n<p>- Have you provided a clear justification of the scientific significance of the proposal and why it is original and innovative?</p>\n<p>- Have you given a clear statement of aims and hypotheses to be tested in the project? Are the aims and hypotheses reasonable?</p>\n<p>- Is it clear that the project is feasible?</p>\n<p>- Is the proposal well organised and presented?</p>\n<p><strong>Use of Artificial Intelligence (AI)</strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit through the course Turnitin submission point in Blackboard. Please note: No hardcopy is to be submitted. SCMB will distribute your Turnitin submission for marking. Before submitting your assessment item to Turnitin please name your file in the following way. FAMILY NAME_GivenName_StudentID_CourseCode_AssignmentName For example: Bob Smith (ID: 54329876) would name his ABCD1234 essay 1 in the following way. SMITH_Bob_54329876_ABCD1234_Essay1</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Draft Research Report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 12/05/2025 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You must submit a draft of your Research Report through TurnitIn and to your supervisors. We do not expect that this will be a finished draft, but it must be substantially complete. Although your supervisor is permitted to read and comment on your proposal, they must not undertake in-depth drafting. The written work must be your own.</p>\n<p>Your supervisor will review and correct the draft. It is the role of your supervisor to help you develop and fine-tune your writing. This process should progress as a partnership in which you are actively engaged. Remember however, that you retain full responsibility for the final report and that it must be your own work!</p>\n<p><strong>Use of Artificial Intelligence (AI)</strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.<strong> </strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit through the course Turnitin submission point in Blackboard. Please note: No hardcopy is to be submitted. Before submitting your assessment item to Turnitin please name your file in the following way. FAMILY NAME_GivenName_StudentID_CourseCode_AssignmentName For example: Bob Smith (ID: 54329876) would name his ABCD1234 essay 1 in the following way. SMITH_Bob_54329876_ABCD1234_Essay1</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Research Report & Research Performance",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>62.5% 10 unit equivalent </dd>",
            "due_date": "<dd><p> 26/05/2025 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Participation/ Student contribution, Performance",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The research project is carried out under the supervision of a member (or members) of the academic staff. The research topic is assigned by the supervisor after consultation with the student.</p>\n<p>The research report (thesis) must be <strong>no more than 50 pages</strong> <strong>of double-spaced 12pt text</strong>. This limit does not include the index, reference list and appendices but does include figures. This limit will be strictly enforced. A small number of large figures, schemes or tables (but no free text) may be placed on facing pages if the student wishes, but this is not necessary and these facing pages will still count towards the 50 page limit. Although your supervisor is permitted to read and comment on a draft of your thesis, they must not undertake in-depth drafting. The written work must be your own. It is essential, however that your supervisor or some other senior researcher (perhaps a postdoc) reads drafts of your thesis while you are preparing it. You are not expected to know instinctively how to write such a document and this is an important learning opportunity.</p>\n<p>We understand that pandemics, natural disasters, and other unforeseen circumstances impact everyone differently and with this in mind we ask students to include a ‘Statement on impact of disruptions” page in their Final Report. You should include a maximum of one page. You should outline how your Honours project was disrupted and describe the changes that were put in place in response to these disruptions. Disruptions could include an inability to perform laboratory work for a certain period, difficulties in ordering reagents, or any other disruptions you feel are relevant. The changes put in place could include changes to individual aims, scope, or topic of your project. The description of disruptions will provide some context for your examiners, especially when you have had to substantially change your project from your original plans.</p>\n<p>The supervisor shall provide a mark out of 100 for the student's overall research performance which will take into account the quality of their research work, the quality of the thesis, initiative, perseverance in pursuing aims, organisational skills, independence and ability to communicate their ideas both orally and in writing. In particular the quality and number of thesis drafts read by the supervisor should be taken into account.</p>\n<p>YOU MUST GIVE YOUR SUPERVISOR (OR NOMINATED READER) TWO WEEKS TO READ THE FINAL DRAFT OF YOUR THESIS. This will allow adequate time for the thesis to be read in detail, possible changes discussed with you and for you to make these changes. It would be preferable if individual chapters/sections had been read by a qualified person long before this FINAL draft is given to the supervisor. It is STRONGLY RECOMMENDED that you write your thesis as you go through the year. The experimental section and data input can be compiled on a weekly basis and should be <strong>backed up on at least two different electronic storage facilities</strong>.</p>\n<p><strong>NB: </strong>It is a mandatory requirement that the preliminary pages of the final research report are worded appropriately from the template (Research Report Declaration) available on the course Blackboard site or in the Honours handbook.</p>\n<p><strong>Use of Artificial Intelligence (AI) </strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit through the course Turnitin submission point in Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Seminar Notebook",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 26/05/2025 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Notebook/ Logbook",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The School of Chemistry and Molecular Biosciences runs two weekly seminar series (one in Chemistry and one in Molecular Biosciences) and also hosts additional <em>ad hoc</em> seminars throughout the year by visiting researchers. Students based at an external location will likely find that additional seminars are hosted by their local School/Centre/Institute throughout the year. <strong><em>Regular attendance</em></strong> at these seminars is not only mandatory, but is an essential part of your training as a scientist, as this is where you are exposed to diverse scientific techniques and approaches. </p>\n<p>Students must document their attendance at seminars throughout the year by taking notes in a clearly documented, hard copy (i.e. not digital) seminar notebook. It is a requirement that you submit this seminar notebook at the end of the year together with your final Research Report. The book must contain details of all of the seminars the student has attended and is given either a Pass or Fail grade. It is expected that a complete seminar notebook will contain notes on <strong>at least</strong> 15 seminars attended throughout the year. This reflects the fact that while most seminar programs run ~ weekly, they may not be held every week of the year. You must pass this section to pass the course. </p>\n<p>The notebook should follow the guidelines below for each seminar:</p>\n<p>- The date, title of the seminar and the speaker's name and affiliation;</p>\n<p>- Handwritten notes (1/2 - 1 page) about the seminar, including the aims, hypotheses, scientific content, critical issues raised by the speaker, assumptions made. At least one question for the speaker should be included for each seminar. These notes must be taken during the seminar;</p>\n<p>- A paragraph that states the objective(s) of the speaker's work (i.e. what were they trying to show) and what was achieved. This should be added after the seminar, based on the notes taken. Material copied directly from the speaker's abstract is not acceptable.</p>\n<p>Seminars that can be attended are not limited to those given in the student's School or Institution. Attendance at seminars held in other Schools, Centres or Institutes are acceptable. However, seminars given by PhD students, and informal seminars or presentations made at research group meetings are not acceptable for this part of the course.</p>\n<p>The diary should be available for inspection by the student’s supervisor or the Honours Convenor(s) at any time. At the end of the year, the diary must be handed in at the SCMB Administration Office to be assessed by the Honours Convenor(s).</p>\n<p><strong>Some Strategies:</strong></p>\n<p>- The single most important thing you should do before the seminar is to read the speaker's abstract, if this has been provided. This will enable you to get a general overview of the major aims of the research, approaches used, and of the major conclusions drawn.</p>\n<p>- During the seminar learn to listen critically and sympathetically. Listen for what the presenter means rather than pick at words or specific arguments. Focus attention on the aims, hypotheses, and assumptions made; the structure of the argument; and the evidence presented (or neglected).</p>\n<p>- Make your notes brief and put them in your own words. Use margins for questions, comments, and notes to yourself on material that is not clear.</p>\n<p>- Go over your notes as soon as possible after the seminar to write a summary paragraph that states the objective(s) of the speaker's work (i.e. what was he/she trying to show) and what was achieved.</p>\n<p><em>Special note: Some students have previously remarked that regularly attending seminars in addition to scheduling and completing all of their experiments has been difficult. It is important for students to appreciate that while experimental work conducted in the lab is a major component of your Honours year, it is not the only component and other assessment items such as seminar attendance are equally important to your development as a professional scientist, as is the development of effective time management and planning skills, allowing you to schedule experiments around regular seminar attendance.</em></p>\n<p><strong>Use of Artificial Intelligence (AI)</strong></p>\n<p>This assessment task is to be completed in-person. The use of Artificial Intelligence (AI) tools will not be permitted. Any attempted use of AI may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Seminar notebooks should be handed in over the counter at SCMB Administration Office (Level 3, Chemistry Building (68)) by 2pm on the due date. You are not required to have a cover sheet with your seminar notebook, but student name and number should be clearly written on the front of the diary for ease of identification.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-4",
            "assessment_title": "Final Seminar and Thesis Viva",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>12.5% 2 unit equivalent </dd>",
            "due_date": "<dd><p> 2/06/2025 - 6/06/2025</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Each student will present a 20 minute Final Seminar summarising the outcomes and conclusions of their research project, which includes 5 minutes for questions from the general audience. The seminar is assessed by all academic staff in attendance and their averaged mark comprises the final seminar mark. Students will also undertake a 20 minute Oral Viva which is scheduled together with the Final Seminar's, to provide an opportunity to defend their Research Report and respond to specific questions from the thesis examiners. </p>\n<p><strong>Use of Artificial Intelligence (AI)</strong></p>\n<p>This assessment task is to be completed in-person. The use of Artificial Intelligence (AI) tools will not be permitted. Any attempted use of AI may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Instructions on how to submit your seminar slides will be provided via the course Blackboard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-5",
            "assessment_title": "Advanced Coursework",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>12.5% 2 unit equivalent </dd>",
            "due_date": "<dd><p> 30/05/2025</p>\n<p>\n</p><p>End of Semester 1 2025</p></dd>",
            "learning_objectives": null,
            "mode": "Oral, Written",
            "category": "Paper/ Report/ Annotation, Presentation, Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Assessment for the various modules of the Advanced Coursework may take the form of an essay, assignment and/or exams or quizzes. Details of specific assessment items will be provided in workshops.</p>\n<p>Each student shall select components from the following four modules according to their field of interest. For more details about each module please contact the Honours Convenor(s).</p>\n<p>The modules are very “fluid” and change each year depending on which academics are contributing. It is best to ask for details from the relevant coordinator. All modules will start in <strong>February 2025 </strong>so that the assessment can be completed well before the due date for the report documents. Please keep an eye on your UQ email address for details of starting times and meeting venues.</p>\n<p>Module 1: Organic Chemistry</p>\n<p>Coordinator:  Prof Joanne Blanchfield </p>\n<p>Module 2: Inorganic Chemistry</p>\n<p>Coordinator:  Assoc Prof Evan Moore</p>\n<p>Module 3: Physical and Materials Chemistry</p>\n<p>Coordinator:  Prof Debra Bernhardt </p>\n<p>Module 4: Chemistry Education</p>\n<p>Coordinator:  Prof Gwen Lawrie</p>\n<p>The selection of coursework should be discussed with the student’s supervisor. The final choice is subject to approval by the Honours Convenor(s).</p>\n<p><strong>Use of Artificial Intelligence (AI)</strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": null,
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Seminar Notes</strong><br><p>Students are required to attend weekly formal research seminars (at least 15 during the year), and maintain a seminar diary</p></br></p></div></td>",
            "topic_title": "<strong>Seminar Notes</strong>",
            "topic_description": "Seminar Notes Students are required to attend weekly formal research seminars (at least 15 during the year), and maintain a seminar diary",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Practical or Theoretical Experimental Work</strong><br><p>Practical or theoretical experimental work, under the guidance of an experienced supervisor.</p></br></p></div></td>",
            "topic_title": "<strong>Practical or Theoretical Experimental Work</strong>",
            "topic_description": "Practical or Theoretical Experimental Work Practical or theoretical experimental work, under the guidance of an experienced supervisor.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Recording and Reporting of Data</strong><br/><p>Recording the planning and outcome of experiments in a manner suitable for scientific research. Reporting of results via discussion forums and/or group presentations.</p></p></div></td>",
            "topic_title": "<strong>Recording and Reporting of Data</strong>",
            "topic_description": "Recording and Reporting of Data Recording the planning and outcome of experiments in a manner suitable for scientific research. Reporting of results via discussion forums and/or group presentations.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lectures, Problem Solving, Seminars</strong><br/><p>This course has several different modules available across various streams including:<br/>\n1. Organic Chemistry;<br/>\n2. Inorganic Chemistry;<br/>\n3. Physical Chemistry and<br/>\n4. Chemistry Education</p></p></div></td>",
            "topic_title": "<strong>Lectures, Problem Solving, Seminars</strong>",
            "topic_description": "Lectures, Problem Solving, Seminars This course has several different modules available across various streams including: 1. Organic Chemistry; 2. Inorganic Chemistry; 3. Physical Chemistry and 4. Chemistry Education",
            "learning_outcomes": []
        }
    ]
}