{
    "course_title": "Research Project",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/CIVL4600-60462-7460",
    "full_course_code": "CIVL4600-60462-7460",
    "course_code": "CIVL4600",
    "class_code": "60462",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Formulate an engineering problem from a limited brief"
        },
        {
            "number": "LO2.",
            "description": "Critically evaluate previous research"
        },
        {
            "number": "LO3.",
            "description": "Apply project management techniques to plan and carry out a small engineering research project in the allocated time frame, within the available resources and in a safe and ethical manner"
        },
        {
            "number": "LO4.",
            "description": "Generate appropriate evidence through a reproducible method that is suitable for drawing sound conclusions"
        },
        {
            "number": "LO5.",
            "description": "Evaluate critically the outcomes of your research"
        },
        {
            "number": "LO6.",
            "description": "Develop evidence-based arguments to support conclusions"
        },
        {
            "number": "LO7.",
            "description": "Report the rationale and findings in a written document"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Progress Report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 10/09/2024 4:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L07",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The individually written <strong>Progress Report</strong> aims to assess the students' ability to formulate, manage and execute a research plan with advice from their supervisor.</p>\n<p>The report document must include:</p>\n<ul>\n<li><strong>Introduction</strong> – Describe the background of the research project, the issues that need to be investigated and the importance of solving these issues</li>\n<li><strong>Literature review</strong>  – Critically review existing literature regarding this research topic, summarise what has been carried out previously, and identify the key aspects that can be improved in the subsequent studies. Based on the review, identify the key research questions, and list the research objectives of this study aiming to answer the research questions </li>\n<li><strong>Research plan</strong> – Describe the detailed plans to carry out the project, use a Gantt chart to tabulate the time plan of the project.</li>\n<li><strong>Work to Date </strong> – Use texts, figures and tables to show the work completed since the start of the project</li>\n<li><strong>Health and safety (optional) </strong>– If the project is carried out in the field or the lab, list the risk assessment and inductions to be carried out</li>\n<li><strong>References </strong>– List the literature cited throughout the report</li>\n</ul>\n<p> Use the Final Report template provided in Blackboard Learning resources to prepare the <strong>Progress Report</strong>.</p>\n<p>The <strong>expected length of the Progress Report's Main Content</strong>, excluding tables of contents, references, and appendices, should be approximately <strong>7 pages</strong> (for <strong>a two-unit one-semester Research Project course CIVL4600</strong>).</p>\n<p>The Progress Report will be assessed by the students' supervisor.</p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assessment must be submitted through the course BlackBoard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Final Report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                }
            ],
            "weighting": "<dd>70%</dd>",
            "due_date": "<dd><p> 4/11/2024 4:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>An individual written Final Report describing the research in detail. The report document must include:</p>\n<ul>\n<li><strong>Abstract</strong>  – Summarise the research background, gaps, methods, findings, conclusions, and implications using about 500 words. The abstract needs to be informative and concise so that readers can well understand your research without reading the whole report).</li>\n<li><strong>Introduction </strong>– Describe the background of the research area (e.g., industry sector/natural environments, use numbers to emphasise the significance of the industry/environment, how it is operated/functioning), then narrow down the identified issues of the research area and the importance of solving the issue.</li>\n<li><strong>Literature review </strong>– Use your own words (rather than copy their abstract) to review and comment on how the previous studies were carried out to address the identified issues, list the key research gaps of the past studies, and the hypothesis and the objectives of the study that can fill these gaps.</li>\n<li><strong>Research methods </strong>– Introduce the research tools used in the study (e.g., fieldwork, lab experiment, mathematical modelling or database). Use your own words to describe the procedures of the study (e.g., experimental steps, pre and post-process data). List the solutions used to fix any issues found during the studies (e.g., water leaking, missing data).</li>\n<li><strong>Results and discussion </strong>– Use tables and figures to detail the findings of your study, and use text to highlight the key information in the tables and figures. The discussion summarises all the findings presented by the tables and figures and compares the overall findings with previous studies.</li>\n<li><strong>Conclusion </strong>– Summaries the background, gaps, method and findings. Note that the conclusion is not a repetition of the abstract as it emphasises more on the significance of the research background, the implications of your study, the limitations of this study, and the recommendation on how future studies should be conducted.</li>\n<li><strong>References </strong>– list all of the references cited in the main report.</li>\n<li><strong>Appendix (Optional) </strong>– Place computer codes, large tables or figures generated by your research. Most of the reviewers would not read your appendix unless your argument in the main contents is not clear.</li>\n</ul>\n<p>While there are overlaps between the Progress Report and the Final Report, such as the Introduction and Literature Review, the Final Report is expected to address these sections in greater depth than the Progress Report.</p>\n<p>A template of the Final Report and past example reports are provided in the Blackboard learning resources.  The <strong>suggested length of the Final Report's Main Content</strong>, excluding tables of contents, references, and appendices is around <strong>20 pages</strong> for this <strong>two-unit one-semester course (CIVL4600).</strong></p>\n<p>The marking rubric of the Final Report can be found <a href=\"https://civil.uq.edu.au/current-students/coursework-research-projects\"><strong>here</strong></a><strong>.</strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assessment must be submitted through the course BlackBoard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(22 Jul - 27 Oct)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Scientific investigation</strong><br><p>The<strong> Civil Research Project course</strong> is organised in the following steps:</p>\n<p><strong>Project selection ( Week1 - Week 2)</strong>:</p>\n<ul>\n<li>Search the list of available research topics under <a href=\"https://student.eait.uq.edu.au/projects/?semester_id%5B%5D=7460&amp;school_id%5B%5D=civil&amp;q=&amp;sendButton=\">EAIT Projects</a> , and nominate up to five research topics of your interests. You will then be allocated based on your preference and academic supervision load. Allocations will be on a first-in, first-served basis. If you have already secured a supervisor and project, complete the <a href=\"https://forms.office.com/Pages/ResponsePage.aspx?id=z3fjtrOdy0aRovrZYFuxXHeGyt266JBHrAucGtRNDhJUOVJZRDlXUlBUVEo2SDBDUFVPTVo3SU83MC4u\">Coursework Project Agreement</a> form and forward the written endorsement from your supervisor to <a href=\"mailto:studentenquiries@civil.uq.edu.au\">studentenquiries@civil.uq.edu.au</a>. You will need to quote the reference number of the email into the form.</li>\n<li>Upon approval, you will receive an email confirming which project and supervisor you have been allocated. Afterwards, you will need to get the written endorsement of your supervisor and complete the <a href=\"https://forms.office.com/Pages/ResponsePage.aspx?id=z3fjtrOdy0aRovrZYFuxXHeGyt266JBHrAucGtRNDhJUOVJZRDlXUlBUVEo2SDBDUFVPTVo3SU83MC4u\">Coursework Project Agreement</a> form.</li>\n<li>If no choice is given by week 3, you will be randomly allocated to a research topic that was not filled in by then.</li>\n</ul>\n<p><strong>Project commencement (Week 2 - Week 4):</strong></p>\n<p>  Discuss with your supervisor about how to carry out the research project. List all necessary resources and work health and safety requirements, which may include:</p>\n<ul>\n<li>Completing relevant lab or field inductions</li>\n<li>Conducting appropriate risk assessments</li>\n<li>Gaining access to computational resources</li>\n<li>Acquiring licenses and installing required software and installing it</li>\n</ul>\n<p><strong>Scientific investigation (Week 1 - Week 13):</strong></p>\n<p>  With the relevant tools/site access/resources available, you will execute the investigation as per the discussion with your supervisor:</p>\n<ul>\n<li>Carry out a critical literature review regarding this research topic, identify how previous studies were carried out, Summarise the key research gaps and formulate the list of research objectives to tackle the identified research gaps</li>\n<li>Conduct the proposed scientific investigations, for example: field work, laboratory experiments, numerical modelling, data analysis</li>\n<li>Regularly discuss with your supervisor about the progress and issues raised during your investigation</li>\n<li>Writing up the literature review, progress to date as a report</li>\n</ul>\n<p>   You will need to work on the <strong>two-unit one-semester </strong><strong>research project course </strong><strong> (CIVL4600)</strong> for about <strong>10 hours</strong> per week.</p>\n<p><strong>Progress Report (due on Week 8) </strong></p>\n<p>See the assessment section for details</p>\n<p><strong>Final Report (due on Examination Week 1) </strong></p>\n<p>See the assessment section for details</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Scientific investigation</strong>",
            "topic_description": "Scientific investigation The Civil Research Project course is organised in the following steps: Project selection ( Week1 - Week 2) : Search the list of available research topics under EAIT Projects , and nominate up to five research topics of your interests. You will then be allocated based on your preference and academic supervision load. Allocations will be on a first-in, first-served basis. If you have already secured a supervisor and project, complete the Coursework Project Agreement form and forward the written endorsement from your supervisor to studentenquiries@civil.uq.edu.au . You will need to quote the reference number of the email into the form. Upon approval, you will receive an email confirming which project and supervisor you have been allocated. Afterwards, you will need to get the written endorsement of your supervisor and complete the Coursework Project Agreement form. If no choice is given by week 3, you will be randomly allocated to a research topic that was not filled in by then. Project commencement (Week 2 - Week 4): Discuss with your supervisor about how to carry out the research project. List all necessary resources and work health and safety requirements, which may include: Completing relevant lab or field inductions Conducting appropriate risk assessments Gaining access to computational resources Acquiring licenses and installing required software and installing it Scientific investigation (Week 1 - Week 13): With the relevant tools/site access/resources available, you will execute the investigation as per the discussion with your supervisor: Carry out a critical literature review regarding this research topic, identify how previous studies were carried out, Summarise the key research gaps and formulate the list of research objectives to tackle the identified research gaps Conduct the proposed scientific investigations, for example: field work, laboratory experiments, numerical modelling, data analysis Regularly discuss with your supervisor about the progress and issues raised during your investigation Writing up the literature review, progress to date as a report You will need to work on the two-unit one-semester research project course (CIVL4600) for about 10 hours per week. Progress Report (due on Week 8) See the assessment section for details Final Report (due on Examination Week 1) See the assessment section for details",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        }
    ]
}