{
    "course_title": "Learning from the International Experience",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/COMU3065-64848-7460",
    "full_course_code": "COMU3065-64848-7460",
    "course_code": "COMU3065",
    "class_code": "64848",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate skills of data collection based on observation and note-taking."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate understanding of theoretical frameworks for analysing intercultural experience and competence"
        },
        {
            "number": "LO3.",
            "description": "Engage in reflective processes for understanding and evaluating intercultural experiences and challenges"
        },
        {
            "number": "LO4.",
            "description": "Apply problem-solving and critical thinking skills in intercultural contexts"
        },
        {
            "number": "LO5.",
            "description": "Relate international experience to theoretical frameworks"
        },
        {
            "number": "LO6.",
            "description": "Articulate and communicate intercultural understanding effectively in a variety of genres"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Sequence: Fieldnotes",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 30/08/2024 5:00 pm</p>\n<p> 30/09/2024 5:00 pm</p>\n<p> 31/10/2024 5:00 pm</p>\n<p> 29/11/2024 5:00 pm</p>\n<p> 31/12/2024 5:00 pm</p>\n<p> 31/01/2025 5:00 pm</p>\n<p>\n</p><p>In order to accommodate different academic calendars at our Study Abroad partner institutions, there are six opportunities to submit a fieldnote: you only need to submit five. </p></dd>",
            "learning_objectives": "L01, L03",
            "mode": "Written",
            "category": "Notebook/ Logbook",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment item encourages you to approach your in-country study as fieldwork, compiling a shared databank of fieldnotes which will be analyzed in Semester 1 2025. The shared databank is housed on a padlet in the folder corresponding to this assessment item on Blackboard. You also upload each fieldnote to Turnitin (via a link on Blackboard) in order to receive personal, private, feedback.</p>\n<p><strong>What is a fieldnote?</strong> Your fieldnote uses a template provided on Blackboard to record the important details of a precise observation you have personally made. You explain why this observation is interesting as data relating to your chosen theme (see below), and note any questions it raises for you. Your focus is on the observation and questions it raises, which might themselves be answered by further observations. You can relate your observation, briefly, to wider patterns of behaviour, but your aim is not to describe those wider patterns. You may include photographs or recordings. The shared padlet proposes four initial themes for these observations, students can propose an additional theme for consideration. You do not need to post on all the themes. <em>Note: you can post additional observations to the padlet, above 5 in total: simply upload to Turnitin those you wish to be marked. </em></p>\n<ul>\n<li>Cultural practices (doing things differently)</li>\n<li>Intercultural practices (practices of mediation; negotiation, accommodation, successful or otherwise).</li>\n<li>Embodiment (being there; contact through the senses)</li>\n<li>Linguistic landscapes (language use in the host culture; language use amongst exchange students; language learning)</li>\n</ul>\n<p>Each entry will be at least 150 words. See Blackboard for further details of the information to include in each entry.</p>\n<p><strong>How many fieldnotes do I make and when do I post them? </strong>You should submit five fieldnotes for marking, but there are six opportunities to submit, to cater for different starting dates. You submit by the last working day of each month: August, September, October, November, December, January. Remember, nothing stops you submitting a fieldnote early, or submitting a fieldnote when you are no longer in-country as long as it relates to an observation you made during Study Abroad.</p>\n<p><strong>Marking criteria</strong>: Each field note is marked out of 5% on the quality of: information provided; Comments; Language. (See detailed grid on Blackboard)</p>\n<p><strong>Use of Generative AI and Machine Translation: </strong></p>\n<p>Use of Generative AI and Machine Translation: This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Each entry must be submitted via Turnitin AND posted on the shared padlet. Links to both are available via the Blackboard “Assessment” page. <em>Your assessment is not completely submitted until it has been uploaded to both platforms. </em></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Tutorial Leadership",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 10/03/2025 - 30/05/2025</p>\n<p>\n</p><p>Students lead the tutorial discussion once during the semester, in their choice of: Week 3, Week 5, Week 9, Week 11 or Week 13. </p></dd>",
            "learning_objectives": "L02, L03, L04, L05, L06",
            "mode": "Activity/ Performance, Oral",
            "category": "Participation/ Student contribution, Presentation, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Task Description:</strong></p>\n<p>Once during the semester following your Study Abroad experience, you will be responsible for leading part of the tutorial discussion. You provide a brief summary and analysis of a prescribed article/ chapter (6 - 8 minutes spoken in English), along with 3 to 5 critical questions for your peers. These questions should aim to increase comprehension of the article and to start a discussion of how the article provides a framework for interpreting your cohort's fieldnotes. (The discussion will be part of the seminar for the day, it is not expected that you will run the whole session).</p>\n<ul>\n<li>You will sign up through Blackboard to choose the day and topic of your discussion.</li>\n<li>You post the critical questions by 5 p.m. two days before the seminar, on the padlet for the week, so your classmates can prepare for discussion.</li>\n<li>You will orally present your summary and analysis and encourage discussion (in the classroom or via zoom).</li>\n<li>The presentation should last 6-8 minutes, however you are allowed to go over time to a maximum limit of 10 minutes.</li>\n</ul>\n<p>Fuller guidelines will be posted on Blackboard.</p>\n<p>Alternative date: If unavoidable circumstances mean that you cannot lead tutorial discussion on a given day, please notify the course co-ordinator as early as possible. For an alternative date, please submit an extension request. </p>\n<p><strong>Recording:</strong></p>\n<ul>\n<li>This assessment item will be video-recorded so that there is a record of your performance. <em>The recordings will be retained for 12 months on a secure UQ system in accordance with UQ policy specifically 3.10.02 Assessment Section 6.0(3) (</em><a href=\"https://ppl.app.uq.edu.au/content/3.10.02-assessment\"><em>https://ppl.app.uq.edu.au/content/3.10.02-assessment</em></a><em>). Access to recordings will be limited to the relevant School, Faculty and Student &amp; Academic Services staff and only accessed for the purpose of reviewing recordings in the event of issues or concerns raised regarding the task.</em></li>\n</ul>\n<p><strong>Marking criteria: </strong>The assessment item will be marked on the quality of: the summary of the article; the analysis of the extent to which the article is applicable to your cohort's experiences; the questions.  (A detailed rubric is provided on Blackboard.) </p>\n<p><strong>Use of generative AI and Machine Translation</strong></p>\n<ul>\n<li>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</li>\n</ul>\n<p><br/></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Tutorial leadership takes place during the scheduled sessions. Students can lead from St Lucia or via Zoom if they are External. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Pre-departure Seminar for Future Study Abroad Participants",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 7/04/2025 - 11/04/2025</p>\n<p>\n</p><p>The briefing session takes place in the usual class in Week 7, with other times scheduled if student numbers require it. </p></dd>",
            "learning_objectives": "L03, L04, L06",
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will present at a pre-departure seminar for other students interested in Study Abroad.</p>\n<p>This presentation should be 6-8 minutes long and supported by a powerpoint (or similar), after the seminar you will respond to 3-4 questions from the floor. You should refer to your Study Abroad experience, and those of your cohort, to provide precise, useful advice to your peers. You should pick a specific topic, which you should announce in the introduction to your presentation. </p>\n<p>For example, you might cover topics such as: </p>\n<ol>\n<li>How did you manage working in a different academic system? What did you learn from negotiating the differences? Were they any challenges and how did you overcome them? How could others learn from your experience?</li>\n<li>What advice would you give to other students considering participating in a student exchange in the host country? Share your intercultural insights.</li>\n<li>What skills and/or attributes that you have developed during your exchange experience have contributed to your personal and professional development? How could others learn from your experience.</li>\n</ol>\n<p>Please note: if you are also providing a text to the Global Experiences team, you can draw on that work for this presentation. Remember however, that this assessment item is a presentation, not a reading of a script. </p>\n<p><strong>Recording:</strong> This assessment item will be video-recorded so that there is a record of your performance. <em>The recordings will be retained for 12 months on a secure UQ system in accordance with UQ policy specifically 3.10.02 Assessment Section 6.0(3) (</em><a href=\"https://ppl.app.uq.edu.au/content/3.10.02-assessment\"><em>https://ppl.app.uq.edu.au/content/3.10.02-assessment</em></a><em>). Access to recordings will be limited to the relevant School, Faculty and Student &amp; Academic Services staff and only accessed for the purpose of reviewing recordings in the event of issues or concerns raised regarding the task.</em></p>\n<p><strong>Marking criteria:</strong> This assessment item will be marked on the quality of: the information provided; the presentation skills; language. (For a detailed rubric, see Blackboard.)</p>\n<p><strong>Use of Generative AI and Machine Translation: </strong></p>\n<ul>\n<li>Use of Generative AI and Machine Translation: This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.. </li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Analytical Essay",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>35%</dd>",
            "due_date": "<dd><p> 17/06/2025</p></dd>",
            "learning_objectives": "L02, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students write an essay which draws on a selection of the fieldnotes, relates them to theoretical frameworks for analysing intercultural experiences, competencies and study abroad, to provide a precise analysis leading to a logical conclusion. Students are invited to discuss their plan for their essay with the course co-ordinator before starting to write it. The essay should be clearly structured with an introduction stating the precise topic to be discussed, a summary of relevant literature, a brief indication of how the field notes and examples were selected, a discussion and conclusion. (More detailed guidelines are provided on Blackboard along with the essay questions.) </p>\n<p><strong>What to include:</strong></p>\n<ul>\n<li>Precise references to examples in the Field Notes. </li>\n<li>References to the readings studied throughout semester. </li>\n<li>References to concepts discussed in class. </li>\n</ul>\n<p><strong>Length:</strong> 2000 words (1 800 - 2 200 words, excluding the reference list and any appendices). Below 1 800, and the mark will be reduced proportionally. For example 30/35 for an essay which is 1500 words long will be reduced to 1500/2000 x 30. Markers will not read beyond 2 200 words.</p>\n<p><strong>Marking criteria: </strong>The essay will be marked on the quality of: the demonstrated understanding of theory discussed during the course; the analysis; organisation of the essay and its argument; academic writing. </p>\n<p><strong>Use of generative AI and Machine Translation:</strong> This task has been designed to be challenging, authentic and complex. Whilst students may use AI technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference AI / MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Essays should be uploaded to the Turnitin Link on Blackboard. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Not scheduled",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semester Two 2024: Study Abroad</strong><br><p>Your Study Abroad experience overlaps with UQ's semester two 2024. You may start and finish earlier or later, but you are participating in your Study Abroad experience. During this time, your contribution to COMU3065 takes the form of completing five fieldnotes - see the assessment section for details. </p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L06</p></div></td>",
            "topic_title": "<strong>Semester Two 2024: Study Abroad</strong>",
            "topic_description": "Semester Two 2024: Study Abroad Your Study Abroad experience overlaps with UQ's semester two 2024. You may start and finish earlier or later, but you are participating in your Study Abroad experience. During this time, your contribution to COMU3065 takes the form of completing five fieldnotes - see the assessment section for details.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L06"
            ]
        },
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semester 1 2025: Week One: Expectations and Experience </strong><br/></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Semester 1 2025: Week One: Expectations and Experience </strong>",
            "topic_description": "Semester 1 2025: Week One: Expectations and Experience",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semester 1 2025: Week Three: Identity Transformation</strong><br/></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Semester 1 2025: Week Three: Identity Transformation</strong>",
            "topic_description": "Semester 1 2025: Week Three: Identity Transformation",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semester 1 2025: Week Five: Becoming one of the locals????</strong><br/></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Semester 1 2025: Week Five: Becoming one of the locals????</strong>",
            "topic_description": "Semester 1 2025: Week Five: Becoming one of the locals????",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semester 1 2025: Week Seven: Pre-departure Seminar for Future Study Abroad Participants</strong><br/></p><p><strong>Learning outcomes:</strong> L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Semester 1 2025: Week Seven: Pre-departure Seminar for Future Study Abroad Participants</strong>",
            "topic_description": "Semester 1 2025: Week Seven: Pre-departure Seminar for Future Study Abroad Participants",
            "learning_outcomes": [
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 9",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semester 1 2025: Week Nine: Questioning Authenticity</strong><br/></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Semester 1 2025: Week Nine: Questioning Authenticity</strong>",
            "topic_description": "Semester 1 2025: Week Nine: Questioning Authenticity",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semester 1 2025: Week Eleven: Multilingual Mindsets</strong><br/></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Semester 1 2025: Week Eleven: Multilingual Mindsets</strong>",
            "topic_description": "Semester 1 2025: Week Eleven: Multilingual Mindsets",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semester 1 2025: Week Thirteen: Living and Working in Intercultural Spaces </strong><br/></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Semester 1 2025: Week Thirteen: Living and Working in Intercultural Spaces </strong>",
            "topic_description": "Semester 1 2025: Week Thirteen: Living and Working in Intercultural Spaces",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        }
    ]
}