{
    "course_title": "Design Computing Studio I - Interactive Technology",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/DECO1800-61222-7460",
    "full_course_code": "DECO1800-61222-7460",
    "course_code": "DECO1800",
    "class_code": "61222",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate an understanding of a problem space through the critical analysis of literature, existing works, and problem context (stakeholders, technology, data, function, etc) through ideation."
        },
        {
            "number": "LO2.",
            "description": "Generate and explore a range of design computing solutions within a problem space through ideation."
        },
        {
            "number": "LO3.",
            "description": "Develop and communicate design requirements in a cogent project proposal based on understanding and exploration of the problem space."
        },
        {
            "number": "LO4.",
            "description": "Evaluate and present design rationale for decisions made, and trace and reference design features and requirements to original sources."
        },
        {
            "number": "LO5.",
            "description": "Implement and deliver design computing solutions according to proposed requirements and specifications."
        },
        {
            "number": "LO6.",
            "description": "Demonstrate practical and technical skills by producing and delivering design computing solutions."
        },
        {
            "number": "LO7.",
            "description": "Reflect and refine design computing solutions through an iterative and reflexive process that critiques the design processes and methods used in projects and evaluates their effectiveness, on an individual and team level."
        },
        {
            "number": "LO8.",
            "description": "Develop and employ appropriate strategies to work as an effective member of a multi-disciplinary team, demonstrate respect for others values, work styles, and backgrounds, and address potential conflicts and problems that may occur when working in teams."
        },
        {
            "number": "LO9.",
            "description": "Construct and present well-organized and persuasive arguments, integrating evidence and logical reasoning to effectively communicate design ideas visually, orally, and written."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Critical Reflective Journals (Individual)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> 2 </dd>",
            "due_date": "<dd><p> 29/07/2024 - 14/10/2024</p></dd>",
            "learning_objectives": "L01, L02, L04, L06, L07, L08",
            "mode": "Written",
            "category": "Notebook/ Logbook, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>There is no formal requirement to submit weekly Critical Reflective Journals. However, voluntary submission by Monday of every week, commencing in Week 2, of your critical reflection of the previous week's content will receive formative feedback for weeks 1 to 5. The expectation is that, if you choose to submit weekly for the first five weeks and subsequently receive formative feedback, you will be proficient at applying <a href=\"https://www.ed.ac.uk/reflection/reflectors-toolkit/reflecting-on-experience/gibbs-reflective-cycle\">Gibbs Reflective Cycle framework</a> by week 5. Therefore, journals submitted sequentially in weeks 2 to 6 (relating to content from weeks 1 to 5) will receive individual formative feedback. </p>\n<p>Journals are not graded individually. A single grade is awarded at the end of semester for your entire critical reflective journal. The grade is based on the growth of your ability to critically reflect based on all sequentially submitted journals, and analysis of your iterative learning and activities throughout the semester.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission is on Blackboard's Online Journal via the Course menu. The date and time submitted is system recorded. The date submitted must be no later than 4pm the Monday following each week's content delivery. </p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>Late submissions <strong>will not</strong> receive formative feedback, may ultimately impact the quality of how you embed your critical reflections in your Annotated Process Portfolio Assessment, and may impact your overall grade for this assessment. </p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Annotated Process Portfolio (Individual)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> 4 </dd>",
            "due_date": "<dd><p> 14/10/2024 3:00 pm</p>\n<p>\n</p><p>Submit website link for Annotated Process Portfolio, to the Blackboard course site.</p></dd>",
            "learning_objectives": "L01, L02, L04, L06, L07, L08, L09",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>In the second half of the semester you will begin to curate the evidence collected, from your weekly submissions of your <strong>Critical Reflective Journal</strong>, to produce an annotated process portfolio. This <strong>Annotated Process Portfolio </strong>draws from your critical reflections and analysis, discusses your learning experiences throughout the entire semester, and presents the <strong>specific work YOU completed </strong>for the major project. It will concisely and clearly describe both the ‘ideal’ intended concept and the ‘actual’ final product delivered. This articulates both the intention and the execution of the concept, allowing you to <strong>create a narrative </strong>connecting one to the other through the presentation of your individual work. Your audience is external and you might use this portfolio for future professional job applications and interviews.</p>\n<p>Process journals are an important tool for developing professional practice and reflecting upon your design process. By keeping in-the-moment records of your work, ideas, decisions made, research conducted, etc., you have an account that can be referred back to if you need to justify a decision, find a resource, or roll back to a previous stage of work. In a team-based environment, it is also a useful record of your individual contributions to the project development, contributions that may be unclear or hidden in the final product, or that may be discarded along the way. Your process journal will collect the content and subsequent insights required to produce an effective process portfolio, providing the evidence needed to articulate your key individual contributions.</p>\n<p>The annotated process portfolio selects key evidence from your critical reflective journal and other submissions to present your work in the broader context of the major project (team), and in turn where the project fits in terms of the problem context, studio themes, technologies used, etc. The portfolio presents a curated account of your individual contributions to the development of the project and key insights/learnings you have acquired during the semester. The audience for your portfolio will be diverse. The portfolio itself is a design artefact. It is important you give appropriate thought to it’s appearance, functionality, and usability.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Final submissions are to be uploaded as per the instructions in the brief on Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Design Ideation Poster (Individual)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> 2 </dd>",
            "due_date": "<dd><p> 6/08/2024 8:00 am</p>\n<p>\n</p><p>Submission of Poster via Blackboard course site. In-studio oral presentations will commence after all student posters are submitted.</p></dd>",
            "learning_objectives": "L01, L02",
            "mode": "Oral, Product/ Artefact/ Multimedia",
            "category": "Creative Production/ Exhibition, Presentation, Poster",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Submission of poster via Blackboard site. In-studio presentation of Poster in scheduled studio Tue 6/08/2024 8:00 am. </p>\n<p>Individual students will complete a rapid design exploration task. Individual students will generate ideas and produce an A3 PDF Poster (template provided on Blackboard) that describes the idea, what dataset/s will be utilised, how the data will be visualised and interacted with, and who the users are. This task will be reflective of your individual style, which will then be reflected in your individual Annotated Process Portfolio. This poster will guide your self-critique in your reflective journaling, which will lead your critical discussion in your individual Annotated Process Portfolio. In addition, your inspiration poster will contribute to a whole-of-course ideas pool to draw themes and connections, which will launch the design computing projects.</p>\n<p>Students will document all ideas through to the final ideation poster from Week 1, 2 studios, and present in Week 3 studio.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Blackboard course site, Assessments menu.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Major Project (Team)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> Weighting 1; Team Agreement (Team), Weighting 2; Project Design Proposal (Team), Weighting 2; MVP (Team), Weighting 3; Final Prototype Tradeshow (Team), Weighting 2; Final Report (Team) </dd>",
            "due_date": "<dd><p>Weighting1;<br/>\nTeam Agreement (Team) submitted via Blackboard course site.  19/08/2024 4:00 pm</p>\n<p>Weighting 2;<br/>\nProject Design Proposal In-Studio presentation in timetabled Studio. 27/8/2024 8am;<br/>\nProject Design Proposal PowerPoint (Team) submitted via Blackboard course site.  26/08/2024 4:00 pm</p>\n<p>Weighting 2;<br/>\nMVP In-studio demonstration in timetabled Studio.<br/>\n17/9/2024 8:00 am;<br/>\nMVP (Team) submit MVP website link submitted via Blackboard course site.<br/>\n 16/09/2024 4:00 pm</p>\n<p>Weighting 3;<br/>\nIn-studio Final Prototype Tradeshow demonstration in timetabled Studio.<br/>\n22/10/2014 8:00 am;<br/>\nFinal Prototype Website address (link) submitted via Blackboard course site. </p>\n<p> 21/10/2024 4:00 pm</p>\n<p>Weighting 2;<br/>\nFinal Report (Team) submitted via Blackboard course site.  25/10/2024 4:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L08, L09",
            "mode": "Activity/ Performance, Oral, Product/ Artefact/ Multimedia, Written",
            "category": "Computer Code, Essay/ Critique, Practical/ Demonstration, Presentation, Product/ Design, Project, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This is the major project, which consists of five parts. Drawing from the individual ideation posters your team will decide on a project concept.</p>\n<ol>\n<li>You will submit a team agreement, which facilitates the team collaboration.</li>\n<li>The team outlines and presents a project proposal, which considers the high level design components.</li>\n<li>Then an MVP demonstrates the key functionality.</li>\n<li>In week 13, you will demonstrate your final digital prototype at an in-studio Tradeshow. This is an identity verified assessment and all students must be present on the day.</li>\n<li>To conclude, a final report captures the entire design process.</li>\n</ol>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission for each component includes:</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>Late submission penalty for each component includes:</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(22 Jul - 27 Oct)",
            "activity_type": "Studio",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Studios</strong><br><p>Studios introduce theory and practical design-related content to be explored and applied, initially in the individual tasks, and then in the team-project,ﾠsupport for project work, assessmentﾠand project-based presentations, and exercises related to project work. This includes the final in studio Tradeshow presentations.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Studios</strong>",
            "topic_description": "Studios Studios introduce theory and practical design-related content to be explored and applied, initially in the individual tasks, and then in the team-project,ﾠsupport for project work, assessmentﾠand project-based presentations, and exercises related to project work. This includes the final in studio Tradeshow presentations.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(22 Jul - 27 Oct)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Practicals</strong><br><p>There is an expectation of prior knowledge of HTML, CSS, and JavaScript. Practicals provide formal  software and technical skills development and project development support. Practicals are intended to develop technical skills for use in the Major Project (Team), and for technical project support. Practical exercises are designed to inform and refine concepts for use in projects. Major Project (Team) presentations and critiques occur regularly in Practicals.</p>\n<p>Practicals commence in week 1.</p></br></p><p><strong>Learning outcomes:</strong> L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Practicals</strong>",
            "topic_description": "Practicals There is an expectation of prior knowledge of HTML, CSS, and JavaScript. Practicals provide formal  software and technical skills development and project development support. Practicals are intended to develop technical skills for use in the Major Project (Team), and for technical project support. Practical exercises are designed to inform and refine concepts for use in projects. Major Project (Team) presentations and critiques occur regularly in Practicals. Practicals commence in week 1.",
            "learning_outcomes": [
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        }
    ]
}