{
    "course_title": "Advanced Human-Computer Interaction",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/DECO6500-64826-7460",
    "full_course_code": "DECO6500-64826-7460",
    "course_code": "DECO6500",
    "class_code": "64826",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Analyse and interpret comprehensive data on people's needs, values, and behaviours within different contexts of use, applying advanced research methods to effectively inform design decisions."
        },
        {
            "number": "LO2.",
            "description": "Integrate research findings and HCI theories and principles to support the design and creation of effective technology solutions, synthesising complex information to address real-world problems effectively."
        },
        {
            "number": "LO3.",
            "description": "Critically apply and evaluate HCI theories and methodologies in designing and evaluating technologies, demonstrating a deep understanding of how theoretical concepts are applied in practical scenarios."
        },
        {
            "number": "LO4.",
            "description": "Critically examine new and emerging technologies to identify opportunities and challenges for HCI, analysing the implications of these technologies on human experience, needs and values."
        },
        {
            "number": "LO5.",
            "description": "Critically evaluate the broader impacts of technologies on society, including considerations of ethics, accessibility, and cultural sensitivity, demonstrating an understanding of the social responsibilities of HCI practitioners."
        },
        {
            "number": "LO6.",
            "description": "Collaborate effectively in a multidisciplinary team, applying advanced methods and techniques for teamwork, including the use of digital tools and platforms, and critically evaluate and resolve conflicts to enhance team performance."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Project",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd> 2 </dd>",
            "due_date": "<dd><p>Draft Project Output - Research 15/08/2024 2:00 pm</p>\n<p>Draft Project Output - Analysis 29/08/2024 2:00 pm</p>\n<p>Draft Project Output - Design 12/09/2024 2:00 pm</p>\n<p>Draft Project Output - Evaluation 3/10/2024 2:00 pm</p>\n<p>Project - Presentation 14/10/2024 12:00 pm</p>\n<p>Project Output - Final 17/10/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L04, L05, L06",
            "mode": "Oral, Product/ Artefact/ Multimedia, Written",
            "category": "Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Aim: </strong>The aim of the project is to provide students with practical experience in designing and evaluating a technology solution to an HCI problem, while developing teamwork skills.</p>\n<p><strong>Description: </strong>In small groups, students will undertake a comprehensive design and evaluation process aimed at producing outputs for their individual reports. This includes conducting research, performing a detailed analysis using appropriate methods, proposing a design solution, and testing a prototype. The project's findings, analyses, and reflections will be critical inputs for each student's individual report. Regular progress reports and reflective journals will document each student's contributions and learning, ensuring that all necessary information is gathered for the individual assessment.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Project Outputs, excluding the Presentation item, will be submitted to a Turnitin link that will be available on Blackboard. Further information about submission will be available in the brief for this assessment item.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> 2 </dd>",
            "due_date": "<dd><p> 4/11/2024 2:00 pm</p></dd>",
            "learning_objectives": "L02, L03, L04, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Aim:</strong> The individual report aims to assess students' ability to critically apply HCI principles, theories, and methods to a real-world problem, and to reflect on their project experience.</p>\n<p><strong>Description:</strong> Each student will individually write a comprehensive report that critically analyses an HCI theory, principle, or method based on their project findings. The report will include background on the HCI problem and technology, detailed analysis of the selected HCI theory, principle, or method, evaluation of its applicability to the Grand Challenge addressed, and personal reflections on the project. This assessment focuses on critical thinking, the application of knowledge, and reflective practice.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission will be to a Turnitin link that will be available in Blackboard.  Further information about submission will be available in the brief for this assessment item.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Debate",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> 1 </dd>",
            "due_date": "<dd><p> 21/10/2024 12:00 pm</p>\n<p>\n</p><p>Debates will be held during the Studios as timetabled.</p></dd>",
            "learning_objectives": "L03, L04, L05, L06",
            "mode": "Oral",
            "category": "Participation/ Student contribution",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Aim:</strong> The debate aims to develop students' critical thinking, research, and argumentation skills by evaluating the relevance and applicability of HCI principles, theories, and methods in contemporary contexts.</p>\n<p><strong>Description:</strong> Students will be divided into teams and assigned a specific HCI principle, theory, or method to debate. Each team will argue either for or against its applicability in the current world. The debate will include preparation of opening statements, arguments, rebuttals, and closing statements. Peer evaluation will also be part of the assessment to ensure fair contribution and teamwork.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Full details about debate timing and submission will be provided in the brief for this assessment item.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13",
            "activity_type": "Studio",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Weekly Studios</strong><br><p>Each week there are 2 studios with each studio being 2 hours in length. Please note that in order to maximise your learning <strong>you should plan to attend both studios each week</strong>.</p>\n<p>These studio sessions blend seminars with hands-on activities, creating a dynamic learning environment where you will explore the practical application of HCI principles, theories, and methods. Each session is designed to deepen your understanding through direct application of the concepts discussed in the seminars.</p>\n<p><strong>Nature of Studio Sessions:</strong></p>\n<p><strong><em>Multidisciplinary and Cross-Disciplinary Space</em></strong>: Our studios are designed to foster collaboration and interaction among students from various disciplines, reflecting the inherently multidisciplinary nature of HCI. You will work alongside peers from diverse academic backgrounds, including design, computer science, psychology, engineering, and more. This cross-disciplinary approach enriches the learning experience, providing multiple perspectives and fostering innovative thinking.</p>\n<p><strong><em>Interactive Learning</em></strong>: Studio sessions emphasize active participation and engagement. You will be involved in a range of activities such as user research, prototyping, usability testing, and iterative design processes. These activities are structured to encourage experimentation, creativity, and problem-solving.</p>\n<p><strong><em>Application of HCI Concepts</em></strong>: The studios are intended to be a practical extension of the seminars. You will apply the HCI concepts, theories, and methods discussed in the seminars to real-world scenarios and design challenges. This hands-on approach ensures that you not only understand the theoretical aspects but also gain practical experience in applying them.</p>\n<p><strong><em>Collaborative Projects</em></strong>: Throughout the course, you will participate in collaborative projects that simulate professional HCI practice. Working in teams, you will tackle complex design problems, conduct user research, develop prototypes, and evaluate your designs. This collaborative environment mirrors the teamwork and interdisciplinary collaboration typical in the field of HCI.</p>\n<p><strong><em>Feedback and Reflection</em></strong>: Regular feedback sessions are an integral part of the studio experience. You will present your work, receive constructive feedback from peers and instructors, and reflect on your learning process. This iterative cycle of feedback and reflection helps you continuously improve your skills and deepen your understanding of HCI concepts.</p>\n<p>By participating in these multidisciplinary and cross-disciplinary studio sessions, you will develop a comprehensive skill set that prepares you for the diverse challenges in the field of HCI. The insights and skills you acquire in the studios will be directly applicable to your projects and future professional practice.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Weekly Studios</strong>",
            "topic_description": "Weekly Studios Each week there are 2 studios with each studio being 2 hours in length. Please note that in order to maximise your learning you should plan to attend both studios each week . These studio sessions blend seminars with hands-on activities, creating a dynamic learning environment where you will explore the practical application of HCI principles, theories, and methods. Each session is designed to deepen your understanding through direct application of the concepts discussed in the seminars. Nature of Studio Sessions: Multidisciplinary and Cross-Disciplinary Space : Our studios are designed to foster collaboration and interaction among students from various disciplines, reflecting the inherently multidisciplinary nature of HCI. You will work alongside peers from diverse academic backgrounds, including design, computer science, psychology, engineering, and more. This cross-disciplinary approach enriches the learning experience, providing multiple perspectives and fostering innovative thinking. Interactive Learning : Studio sessions emphasize active participation and engagement. You will be involved in a range of activities such as user research, prototyping, usability testing, and iterative design processes. These activities are structured to encourage experimentation, creativity, and problem-solving. Application of HCI Concepts : The studios are intended to be a practical extension of the seminars. You will apply the HCI concepts, theories, and methods discussed in the seminars to real-world scenarios and design challenges. This hands-on approach ensures that you not only understand the theoretical aspects but also gain practical experience in applying them. Collaborative Projects : Throughout the course, you will participate in collaborative projects that simulate professional HCI practice. Working in teams, you will tackle complex design problems, conduct user research, develop prototypes, and evaluate your designs. This collaborative environment mirrors the teamwork and interdisciplinary collaboration typical in the field of HCI. Feedback and Reflection : Regular feedback sessions are an integral part of the studio experience. You will present your work, receive constructive feedback from peers and instructors, and reflect on your learning process. This iterative cycle of feedback and reflection helps you continuously improve your skills and deepen your understanding of HCI concepts. By participating in these multidisciplinary and cross-disciplinary studio sessions, you will develop a comprehensive skill set that prepares you for the diverse challenges in the field of HCI. The insights and skills you acquire in the studios will be directly applicable to your projects and future professional practice.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        }
    ]
}