{
    "course_title": "Dental Practice V B",
    "study_period": "Sem 2 2024",
    "location": "Herston",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/DENT5200-61794-7460",
    "full_course_code": "DENT5200-61794-7460",
    "course_code": "DENT5200",
    "class_code": "61794",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Professionalism, Communication, Health Promotion - Consistently demonstrate the ability to work co-operatively, safely, ethically and communicates effectively to provide patient centered care using a reflective approach"
        },
        {
            "number": "LO2.",
            "description": "Clinical Information Gathering - Collect and record contemporaneous information that is necessary and relevant for patient care with consistent regard for patient privacy"
        },
        {
            "number": "LO3.",
            "description": "Critical Thinking, Diagnosis & Management Planning - Independently and consistently identify disease or abnormalities that require treatment or investigation and applies evidence, clinical reasoning and judgement to plan appropriately sequenced oral health care"
        },
        {
            "number": "LO4.",
            "description": "Clinical Treatment & Evaluation - Independently and consistently apply evidence, clinical reasoning and judgement to manage oral conditions, pathology and medically related disorders and diseases associated with the dentition, mouth and associated structures"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Final clinical competence assessment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> P/F MUST PASS </dd>",
            "due_date": "<dd><p> 27/05/2024 - 1/11/2024</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Notebook/ Logbook, Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Assessment requirements:</p>\n<p>Bring their physical logbooks for submission in the final on-site week in the semester. This must be completed in all aspects as detailed in the physical logbook until the date of submission of the portfolio. Please note:</p>\n<ol>\n<li>All details within the physical daily treatment logbook must be completed with regards to patient information (deidentified) and treatment codes for that appointment.</li>\n<li>Verbal feedback provided must be recorded and signed off by supervisor at the end of the session. </li>\n<li>A short 2-4 line reflection must be recorded in the logbook daily, and a weekly structured reflection must be written around a specific case undertaken during the week, particularly where the supervisor/s have provided constructive feedback, or a grade of expectations not met was received. </li>\n<li>\"Tally\" or treatment summary sheets at the start of the logbook must be filled in for all cases completed at both interim (already filled in) and final submission time points. </li>\n<li>For students at QH clinics these reports must be signed off as complete by the Principal Dentist: 1) Clinical Records 2) Missing Treatment Items and 3) CCC: Client identified, informed consent, site identified, final team check.</li>\n</ol>\n<p>The logbook/ portfolio records can be audited randomly by the course coordinator to verify authenticity of assessment and signature of supervisor.</p>\n<p>Assessment of the FINAL clinical practice performance will be by the clinical supervisory team at each placement facility, in discussion with the course coordinator. This is based on student's performance and the quality of the critical self-reflections following each session/day, during the assessment period from the interim time point to the submission of this assessment task. Additionally, the effort made by the student to take on board the interim report feedback will be considered while this report is being finalised. </p>\n<p>Assessment objectives</p>\n<p>Four domains will be assessed to an expectations met or not met standard and mapped to the Professional competency requirements for the accreditation body for this program - The Australian Dental Council  <a href=\"https://www.adc.org.au/sites/default/files/Media_Libraries/PDF/Accreditation/Professional%20Competencies%20of%20the%20Newly%20Qualified%20Dentist_rebrand.pdf\">(</a>https://www.adc.org.au/accreditation/accredited-programs/professional-competencies/<a href=\"https://www.adc.org.au/sites/default/files/Media_Libraries/PDF/Accreditation/Professional%20Competencies%20of%20the%20Newly%20Qualified%20Dentist_rebrand.pdf\">)</a></p>\n<p>The domains being assessed are: </p>\n<p>1. Professionalism, Communication and Health promotion </p>\n<p>2. Scientific knowledge and Clinical Information Gathering</p>\n<p>3. Critical Thinking, Diagnosis and Management Planning</p>\n<p>4. Clinical Treatment and Evaluation</p>\n<p>Passing requirement</p>\n<p>To pass this assessment, students must achieve a pass on this FINAL report. This is a SUMMATIVE must pass assessment on clinical performance progress at this stage. To achieve a pass, the criteria are as follows:</p>\n<p>All domains are weighted equally, and student must achieve a pass in each domain, and an overall pass.</p>\n<p>- A pass in each domain will involve a student receiving 2 or less \"expectations not met\" (ENM) mark in Domain 1, and 1 or less \"expectation not met\" (ENM) in Domains 2-4. </p>\n<p>- An overall pass for the report will involve a student receiving 4 or less \"expectations not met\" (ENM) mark across the 4 domains.</p>\n<p>There will be opportunity for feedback and improvement when the audit report is conducted to students, and students must have reflected on the feedback provided to improve their clinical performance in the latter part of the semester and use it to improve in areas identified as lacking or borderline. Both comments and grades must be taken into account.  </p>\n<p>There is no resubmission or resit available for this component. This is a summative assessment to enable the student to demonstrate clinical competency to be able to progress into the final capstone clinical placement course of the program.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Daily sign offs, weekly reflections, and mid- and end-of-semester reviews are submitted during the semester via UQ's ePad: https://uqepad.myprogress.app.uq.edu.au/</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Objective Structured Clinical Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> P/F MUST PASS </dd>",
            "due_date": "<dd><p> 11/11/2024</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance",
            "category": "Practical/ Demonstration",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Assessment introduction </strong></p>\n<p>You will work through five stations where you will be asked to perform simulated clinical tasks, or answer questions related to tasks, that you have reviewed in the preclinic, clinic and case-based discussions online and in the clinic, through the semester.</p>\n<p> </p>\n<p>Tasks can include: (but not limited to)</p>\n<ul>\n<li>Patient interview</li>\n<li>History taking including assessing pain experience</li>\n<li>Reviewing case notes/ investigations to create a care plan</li>\n<li>Communicating a care plan and obtaining informed consent</li>\n<li>Communicating with carers, patients and families ethically, effectively and professionally</li>\n<li>Working in professional clinical teams</li>\n<li>Being aware at all times of ethical and legal obligations</li>\n<li>Identifying at risk situations for specific clniical scenarios</li>\n<li>Writing a prescription within scope of practice</li>\n<li>Using instruments and materials within specific clinical scenarios for restorative, surgical and non surgical situations including delivering local anaesthetic and performing mock extractions on manikins.</li>\n<li>​Students must expect all routine clinical tasks to be included and should be up to date with therapeutic guidelines and medical emergency management in the dental situation.</li>\n</ul>\n<p> </p>\n<p><strong>Assessment method</strong></p>\n<p>Assessment will be in the following four domains and will vary between stations, based on the task:</p>\n<p> </p>\n<p>1. Professionalism, Communication, team work</p>\n<p>2. Scientific knowledge and Clinical Information Gathering</p>\n<p>3. Critical Thinking, Diagnosis and Management Planning</p>\n<p>4. Clinical Treatment and Evaluation</p>\n<p> </p>\n<p>The criteria for meeting competency in this work based assessment, are all mapped to  Professional competency requirements for the accreditation body for this program - The Australian Dental Council (https://www.adc.org.au/accreditation/accredited-programs/professional-competencies/).  Supplementary assessment is available for this task (in accordance with PPL 3.10.09).</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Oral examination focused on care planning",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> P/F MUST PASS </dd>",
            "due_date": "<dd><p> 11/11/2024</p></dd>",
            "learning_objectives": null,
            "mode": "Oral",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The oral examination in November will assess the your readiness for general dental practice.</p>\n<p>The 20-minute examination will assess your knowledge, understanding and ability in general dentistry including patient evaluation and examination, selection and interpretation of appropriate diagnostic tests, clinical decision making, care planning and sequencing treatment, rationale for treatment, and other clinical skills including choice of materials and techniques, patient management, ethics and professionalism. You will be provided one or more patient cases to review for 10 minutes, just prior to the examination. Examiners will pose questions relating to diagnosis, rationale for clinical decisions, procedures and aspects of clinical treatment.</p>\n<p>This assessment task will assess your knowledge, understanding, and ability in general dentistry including patient assessment and examination, diagnostic tests, decision making, care planning and sequencing treatment, rationale for treatment, clinical skills including choice of materials, patient management, ethics and professionalism.</p>\n<p>Supplementary assessment is available for this task (in accordance with PPL Assessment Procedure). </p>\n<p> </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 22(27 May - 03 Nov)",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Clinical experience in community dental practice</strong><br><p>Students will be provided every opportunity to undertake a general dental practice clinical placement with a one-week break during the extended clinical semester.</p>\n<p>Students are required to undertake supervised clinical experience, across the range of practice disciplines, as rostered per week during the normal working hours of Queensland Health / ATSICHS / Goondir / UQ and MNHHS Alliance OHC Herston clinics.</p>\n<p>If unable to undertake placement activities, students may not be able to meet the requirements of the course satisfactorily. </p>\n<p>Competencies will be assessed in various domains through the course of the placement through chair side direct observations and in the end of semester objective structured clinical examination.</p>\n<p>Students will record the work they complete in an electronic treatment logbook (MyProgress ePad), as well as write structured weekly self reflections on developing professional practice over the semester. The Course Coordinator will carry out periodic audits to evaluate students' performance during the semester. Afterhours meetings may be scheduled; these meetings will be a good opportunity to have an engagement activity between the course coordinator and the students. Student performance, reflective activities and student progression will be the focus of these meetings.</p></br></p></div></td>",
            "topic_title": "<strong>Clinical experience in community dental practice</strong>",
            "topic_description": "Clinical experience in community dental practice Students will be provided every opportunity to undertake a general dental practice clinical placement with a one-week break during the extended clinical semester. Students are required to undertake supervised clinical experience, across the range of practice disciplines, as rostered per week during the normal working hours of Queensland Health / ATSICHS / Goondir / UQ and MNHHS Alliance OHC Herston clinics. If unable to undertake placement activities, students may not be able to meet the requirements of the course satisfactorily. Competencies will be assessed in various domains through the course of the placement through chair side direct observations and in the end of semester objective structured clinical examination. Students will record the work they complete in an electronic treatment logbook (MyProgress ePad), as well as write structured weekly self reflections on developing professional practice over the semester. The Course Coordinator will carry out periodic audits to evaluate students' performance during the semester. Afterhours meetings may be scheduled; these meetings will be a good opportunity to have an engagement activity between the course coordinator and the students. Student performance, reflective activities and student progression will be the focus of these meetings.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Exam week 1(11 Nov - 17 Nov)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Objective Structured Clinical Examination</strong><br><p>This activity is linked to learning activities within clinical, preclinical, and online virtual clinic sessions, but will also consolidate the knowledge and clinical skills gathered over the course of the final capstone semester in this program.<br/>\nThe end of semester activity will consist of multiple clinical stations, focusing on competency in a range of clinical activities in a simulated environment, with the use of standardised patients and clinical scenarios and aids, requiring a range of communication and problem-solving skills to be assessed.</p></br></p></div></td>",
            "topic_title": "<strong>Objective Structured Clinical Examination</strong>",
            "topic_description": "Objective Structured Clinical Examination This activity is linked to learning activities within clinical, preclinical, and online virtual clinic sessions, but will also consolidate the knowledge and clinical skills gathered over the course of the final capstone semester in this program. The end of semester activity will consist of multiple clinical stations, focusing on competency in a range of clinical activities in a simulated environment, with the use of standardised patients and clinical scenarios and aids, requiring a range of communication and problem-solving skills to be assessed.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Exam week 1(11 Nov - 17 Nov)",
            "activity_type": "Case-based learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Case based care planning and discussion</strong><br><p>This activity is based on students developing their self-learning skills in which students will be required to demonstrate in Semester 2 2024. Students will need to demonstrate knowledge and understanding in describing patient s histories, any presenting complaint/s, the clinical examination and diagnostic work up, the care plan including a discussion of rationale and decisions specific to the components and sequencing of the plan and the delivery of care. A discussion of outcomes and prognosis, and a critical reflection on personal learning from the activity should be included. This learning activity will focus on developing student self-learning skills, problem solving skills, and critical thinking in which the student will be able to answer common clinical questions relating to diagnosis, rationale for clinical decisions, procedures and aspects of clinical treatment. A direct face-to-face interview will be held at the end of semester over 20-30 minutes. Focus is on assessing underlying knowledge, clinical reasoning, judgement and communication skills around an unseen complex case made available to the student to review just prior to the interview.</p></br></p></div></td>",
            "topic_title": "<strong>Case based care planning and discussion</strong>",
            "topic_description": "Case based care planning and discussion This activity is based on students developing their self-learning skills in which students will be required to demonstrate in Semester 2 2024. Students will need to demonstrate knowledge and understanding in describing patient s histories, any presenting complaint/s, the clinical examination and diagnostic work up, the care plan including a discussion of rationale and decisions specific to the components and sequencing of the plan and the delivery of care. A discussion of outcomes and prognosis, and a critical reflection on personal learning from the activity should be included. This learning activity will focus on developing student self-learning skills, problem solving skills, and critical thinking in which the student will be able to answer common clinical questions relating to diagnosis, rationale for clinical decisions, procedures and aspects of clinical treatment. A direct face-to-face interview will be held at the end of semester over 20-30 minutes. Focus is on assessing underlying knowledge, clinical reasoning, judgement and communication skills around an unseen complex case made available to the student to review just prior to the interview.",
            "learning_outcomes": []
        }
    ]
}