{
    "course_title": "Design: Systems",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/DSGN3200-60049-7460",
    "full_course_code": "DSGN3200-60049-7460",
    "course_code": "DSGN3200",
    "class_code": "60049",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 16/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate advance understanding and application of creative problem solving, critical thinking and research skills to answer a project brief."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate leadership in the management of a design project through the application of appropriate methods, processes, and techniques to create a design outcome to a high professional standard"
        },
        {
            "number": "LO3.",
            "description": "Critically reflect on individual design strengths, professional skills and attributes and formative feedback to develop a personal design identity, practice, and portfolio"
        },
        {
            "number": "LO4.",
            "description": "Communicate effectively and professionally with peers, potential employers/clients, and other stakeholder within design practice"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Technique, Process, Proposition",
            "special_indicators": [],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 28/08/2024 4:00 pm</p>\n<p>\n</p><p><strong>Digital Submission:</strong> via Blackboard</p>\n<p><strong>Presentation:</strong> in class Thursday 29 August</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Oral, Product/ Artefact/ Multimedia",
            "category": "Product/ Design, Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Assessment Rationale: </strong></p>\n<p>Assessment 1 is a comprehensive evaluation of your understanding and responses to studio tasks, focusing on exploring various design techniques, processes, and your ability to develop a compelling design proposition. This assessment aims to assess your mastery of design methods, your creativity in problem-solving, and your ability to articulate and present your design ideas effectively.</p>\n<p>The Process Documentation component requires you to provide a documented overview of your weekly design process. It should include visuals, sketches, annotations, and reflections on the studio tasks. This documentation showcases your ability to follow a systematic approach to design, demonstrating the evolution of your ideas and the refinement of your design solutions.</p>\n<p>The Proposition Report is a crucial component of the assessment, where you are expected to create a well-presented design report that effectively communicates the background research, insights, and your design position. This report should showcase your ability to critically analyse and synthesize information, employing appropriate visuals, diagrams, and supporting evidence to strengthen your design proposition. It is an opportunity to demonstrate your capacity for effective communication and persuasive writing skills within a design context.</p>\n<p>The Proposition Presentation component requires you to deliver an oral presentation that provides an overview of your design process and design proposition. This presentation should effectively communicate your design journey, highlighting key milestones and design decisions. It is essential to articulate your ideas clearly and concisely, demonstrating your ability to engage and communicate effectively with an audience. Visual aids, such as slides need to be utilised to support your presentation.</p>\n<p><strong>Note: </strong>The weights allocated to each component reflect the relative importance placed on the different aspects of the assessment. The Process Documentation carries the highest weight as it encompasses the documentation of your design process, which is fundamental to understanding your approach and progression. The Proposition Report carries a substantial weight as it showcases your ability to articulate your design ideas in a written format. The Proposition Presentation carries a smaller weight as it serves as a complementary component to the report, allowing you to demonstrate your oral communication skills and present a concise overview of your design proposition.</p>\n<p><strong>Complex/Authentic assessment using AI and/or MT to support learning:</strong> Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The School of Architecture, Design and Planning uses Blackboard and Turnitin for assessment submission. Turnitin is accessed through the course Blackboard site. Turnitin also checks for plagiarism or instances where the original work of others is not appropriately acknowledged.  </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>The late penalty for this assessment item will be calculated as follows: </p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Developed Design",
            "special_indicators": [],
            "weighting": "<dd>60%</dd>",
            "due_date": "<dd><p> 23/10/2024 4:00 pm</p>\n<p>\n</p><p><strong>Digital Submission: </strong>via Blackboard </p>\n<p><strong>Presentation:</strong> in class Thursday 24 August</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Oral, Product/ Artefact/ Multimedia, Written",
            "category": "Presentation, Product/ Design, Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Assessment Rationale:</strong></p>\n<p>The Developed Design assessment is a comprehensive evaluation of your ability to apply your design principles, philosophy, and process to develop a comprehensive and refined design solution. This assessment focuses on assessing your capability to translate conceptual ideas into a tangible and well-executed design project, showcasing your mastery of design methods, creativity in problem-solving, and effective communication of design ideas.</p>\n<p>The Process Documentation component requires you to demonstrate a systematic and iterative approach to design. This documentation should showcase the evolution of your ideas and the refinement of your design solutions. You are expected to present a clear and organised overview of your design process, highlighting key milestones, design decisions, and iterations. It should provide insights into your critical thinking, problem-solving strategies, and the application of design methods throughout the development of your design solution.</p>\n<p>The Final Design Report is a vital component of the assessment, where you will present a well-structured and visually compelling design solution. This report should effectively communicate your design solution, incorporating supporting visuals, diagrams, or prototypes as applicable. It should provide a comprehensive overview of your design, including key design principles, rationale, and detailed explanations of design elements. The report should demonstrate your ability to synthesize research, apply relevant design theories and methodologies, and present a clear and cohesive design narrative. It should showcase your attention to detail, aesthetic considerations, functionality, and how your design solution addresses the identified problem or need.</p>\n<p>The Presentation Boards component requires you to create two A2 boards that visually communicate your design solution. These boards should be thoughtfully designed, utilising appropriate graphic design principles to effectively present key aspects of your design project. They should showcase the visual and aesthetic qualities of your design, highlight the key design features, and create a compelling visual narrative. The presentation boards should demonstrate your ability to effectively communicate the design intent, user experience and considerations.</p>\n<p>The Presentation component requires you to deliver a professional presentation that effectively communicates your design solution, development process, and the rationale behind your design decisions. The presentation should be well-structured, engaging, and articulate. You should demonstrate your ability to confidently articulate your design choices, respond to questions, and provide a comprehensive overview of your design solution. The presentation should effectively communicate the design narrative, user experience considerations, innovative aspects, and the impact of your design solution.</p>\n<p><strong>Note:</strong> The weights allocated to each component reflect the relative importance placed on the different aspects of the assessment. The Process Documentation emphasizes the importance of a systematic and iterative design process. The Final Design Report carries the highest weight, as it evaluates your ability to present a well-executed design solution. The Presentation Boards and Presentation components complement the written report by allowing you to visually and orally communicate your design solution and design rationale, showcasing your ability to engage and effectively communicate your design ideas to an audience.</p>\n<p><strong>Complex/Authentic assessment using AI and/or MT to support learning:</strong> Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The School of Architecture, Design and Planning uses Blackboard and Turnitin for assessment submission. Turnitin is accessed through the course Blackboard site. Turnitin also checks for plagiarism or instances where the original work of others is not appropriately acknowledged.  </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>The late penalty for this assessment item will be calculated as follows: </p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture</strong><br/><p>Week 1 - Introduction to the Course</p>\n<p>Week 2 - System Research </p>\n<p>Week 3 - System Analysis </p>\n<p>Week 4 - Framing Insights</p>\n<p>Week 5 - Synthesis &amp; Refinement </p>\n<p>Week 6 - No Lecture</p>\n<p>Week 7 - Design Scenarios</p>\n<p>Week 8 - Framing Solutions</p>\n<p>Week 9 - Realising Offerings </p>\n<p>Week 10 - No Lecture</p>\n<p>Week 11 - No Lecture</p>\n<p>Week 12 - No Lecture</p>\n<p>Week 13 - Presentations</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Lecture</strong>",
            "topic_description": "Lecture Week 1 - Introduction to the Course Week 2 - System Research Week 3 - System Analysis Week 4 - Framing Insights Week 5 - Synthesis & Refinement Week 6 - No Lecture Week 7 - Design Scenarios Week 8 - Framing Solutions Week 9 - Realising Offerings Week 10 - No Lecture Week 11 - No Lecture Week 12 - No Lecture Week 13 - Presentations",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Studio",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Studio</strong><br/><p>Week 1 - Professional Practice Skills - Design Philosophy </p>\n<p>Week 2 - Professional Practice Skills - Branding</p>\n<p>Week 3 - Design research and project brief</p>\n<p>Week 4 - Professional Practice Skills- Critique </p>\n<p>Week 5 - Professional Practice Skills- Project Refinement </p>\n<p>Week 6 - Presentations no lecture </p>\n<p>Week 7 - Design Project Work, Weekly update presentation and Individual Feedback</p>\n<p>Week 8 - Design Project Work, Weekly update presentation and Individual Feedback</p>\n<p>Week 9 - Design Project Work, Weekly update presentation and Individual Feedback</p>\n<p>Week 10 - Design Project Work, Weekly update presentation and Individual Feedback</p>\n<p>Week 11 - Design Project Work, Weekly update presentation and Individual Feedback</p>\n<p>Week 12 - Design Project Work, Weekly update presentation and Individual Feedback</p>\n<p>Week 13 - Presentations</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Studio</strong>",
            "topic_description": "Studio Week 1 - Professional Practice Skills - Design Philosophy Week 2 - Professional Practice Skills - Branding Week 3 - Design research and project brief Week 4 - Professional Practice Skills- Critique Week 5 - Professional Practice Skills- Project Refinement Week 6 - Presentations no lecture Week 7 - Design Project Work, Weekly update presentation and Individual Feedback Week 8 - Design Project Work, Weekly update presentation and Individual Feedback Week 9 - Design Project Work, Weekly update presentation and Individual Feedback Week 10 - Design Project Work, Weekly update presentation and Individual Feedback Week 11 - Design Project Work, Weekly update presentation and Individual Feedback Week 12 - Design Project Work, Weekly update presentation and Individual Feedback Week 13 - Presentations",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}