{
    "course_title": "Building Inclusive Secondary Classrooms",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC3606-63118-7460",
    "full_course_code": "EDUC3606-63118-7460",
    "course_code": "EDUC3606",
    "class_code": "63118",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate an awareness of recent developments in research into effective teaching in inclusive classroom environments and the differentiation of teaching in ways that are responsive to the learning strengths and needs of students across the full range of abilities and that take account of the impact on learning of diverse backgrounds (e.g. linguistic, Indigenous, cultural, religious and socio-economic)."
        },
        {
            "number": "LO2.",
            "description": "Reflect on legislative requirements, system policies and processes, positive behaviour supports, and teaching strategies that promote student wellbeing and safety, and support participation and learning of all students with a focus on those with disabilities."
        },
        {
            "number": "LO3.",
            "description": "Plan challenging learning goals and effectively organise classroom activities for students of diverse backgrounds and across the full range of abilities using age-appropriate curriculum and approaches to differentiated teaching strategies."
        },
        {
            "number": "LO4.",
            "description": "Explain approaches for interpreting student data and strategies for working appropriately with others, including parents/carers, external professionals and community groups to action a personalised learning plan and modify teaching practices."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate clear, fluent, and coherent communication skills consistent with personal, professional and academic conventions."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Task 1 - Learning need in a discipline area",
            "special_indicators": [],
            "weighting": "<dd>30% Approx. 2000 words ~ 4 pages </dd>",
            "due_date": "<dd><p> 16/08/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>See task description on Blackboard.</p>\n<p>For this task, you will undertake a study of some of the available literature to investigate a learning need, selected from one of the following options. It is expected that you will focus on an aspect of interest to you within <strong>one</strong> of the areas of learning need.</p>\n<p>·    <strong>Language – e.g. dyslexia, low literacy level, developmental language disorder</strong></p>\n<p>·    <strong>Social / emotional – e.g. Autism Spectrum Disorder, Mental Health impacts</strong></p>\n<p>·    <strong>Learning attainment – e.g. low attainment, intellectual disability, gifted learners</strong></p>\n<p>·    <strong>Physical and sensory – e.g. hearing impairment, sensory sensitivity, Cerebral Palsy</strong></p>\n<p>·    <strong>Culture – e.g. Religion, sexuality, socioeconomic status</strong></p>\n<p> </p>\n<p>You are to prepare an annotated bibliography of <strong>five</strong> key references and draw implications for teaching in one of your discipline areas (e.g. Geography, Physics). In selecting your references, you are to include <strong>in this order</strong>:</p>\n<ol>\n<li>One relevant chapter from the set textbook for this course</li>\n<li>One chapter from another book of your choice</li>\n<li>One journal article from the reference list of one of the chapters</li>\n<li>Two other relevant research articles published within the last five years.</li>\n</ol>\n<p><strong> </strong></p>\n<p><strong>Format</strong></p>\n<p>In approximately 2000 words and a maximum of four pages, include:</p>\n<ul>\n<li>An introduction specifying your selected learning need and your teaching area.</li>\n<li>For each of the five references, include the following contents:</li>\n<li>Full bibliographic citation in APA format.</li>\n<li>Specify the content or scope of the reference and the Intended audience</li>\n<li>Summarise the main points</li>\n<li>Identify any conclusions or implications made by the author/s</li>\n<li>Discuss the relevance to your teaching area, connections to the APSTs that apply to your response, strengths and limitations of the work, and other applicable issues</li>\n<li>Conclude with implications and considerations from your analysis of the five references as a set for your teaching, particularly with reference to your chosen teaching area(s).</li>\n</ul>\n<p><strong>Reference List and Acknowledgements – (NOT included within the 2000 wordcount)</strong></p>\n<p>Reference List: Your full bibliographic citation in APA format which makes up part of your response is <strong>not required to be replicated</strong> within a separate reference list. If/where you use intext citations of other sources, this is required to be included in a separate reference list. The reference list is not included within the 2000 wordcount.</p>\n<p><strong>Acknowledgement: Please ensure you acknowledge where and how you have used AI including the AI tool used for example ChatGPT, Bing Chat, Grammarly GO. Also include:</strong></p>\n<ul>\n<li><strong>Questions used to generate the response.</strong></li>\n<li><strong>Refining questions used.</strong></li>\n<li><strong>Instructional questions used.</strong></li>\n<li><strong>How you have synthesised the products of AI into your assessment.</strong></li>\n</ul>\n<p><strong>The Acknowledgement is not included within the word count.</strong></p>\n<p><strong>Please be mindful of the policy outlined under assessment within the ECP and copied below for your convenience:</strong></p>\n<p><strong>Use of generative AI to support or inform assessment.</strong></p>\n<p>The assessment tasks have been designed to be challenging, authentic and complex. Whilst students may use AI technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference AI use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>To pass these assessments, students will be required to demonstrate detailed comprehension of their written submission independent of AI tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Via Turnitin in the Assessment folder on Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Task 2 - Adjusted learning activity development",
            "special_indicators": [],
            "weighting": "<dd>30% ~ 4 pages </dd>",
            "due_date": "<dd><p> 20/09/2024 2:00 pm</p></dd>",
            "learning_objectives": "L03, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>See task description on Blackboard.</p>\n<p>In this task, you will plan a lesson to meet the needs of a range of students such as those with disability, from diverse linguistic, cultural, religious and socioeconomic backgrounds, including Indigenous learners, and with a range of abilities. The lesson plan will be applicable to one of your teaching areas and based on the Australian Curriculum.</p>\n<p> </p>\n<p>Drawing on relevant legislative and policy documents, and using the principles of differentiated instruction and Universal Design for Learning (UDL), you will plan a lesson demonstrating teaching strategies that support student participation (including strategies for teaching Aboriginal and Torres Strait Islander students), as well as strategies for assessing what students know or are able to do as a result of the lesson. In addition to the general planning for all, you will plan learning adjustments based on a learning need such as you investigated for Task 1, indicating appropriate adjustments for teaching and assessing a student with that need.</p>\n<p> </p>\n<p>Include (in a maximum of 4 A4 pages):</p>\n<ul>\n<li>A brief overview (no more than one A4 page) explaining the context for the lesson such as: teaching area, year level, the specific learning need you have addressed and a discussion of relevant APST standards. This is to provide background for the lesson.</li>\n<li>Planning for the lesson, in a format of your choice. Establish learning goals that provide achievable challenges for students of varying abilities and characteristics. This should be a maximum of two pages A4, including the UDL features.</li>\n<li>Indications of UDL design features for:</li>\n<li>Engagement (stimulate interest and motivation for learning)</li>\n<li>Representation (present information and content in different ways)</li>\n<li>Access and Expression (differentiate ways to assess learning outcomes that allow students to show what they know or can do).</li>\n<li>Explanation of adjustments designed to meet the learning need you have investigated. </li>\n<li>An explanation of teaching strategies you have chosen and how they are responsive to the learning strengths and needs of students from diverse linguistic, cultural, religious and socioeconomic backgrounds.</li>\n</ul>\n<p> </p>\n<p>In an appendix (not counted in the page limit) include all resources for the lesson including enabling and extending prompts*. Include references for resources (where appropriate) on the resource itself and not in a reference list at the end. This is to be useful for your future work so that you will have the reference with the resource.</p>\n<p> </p>\n<p>Any other references can be included in a reference list in an appendix and will not be counted in the reference list.</p>\n<p> </p>\n<p><strong>Acknowledgement: Please ensure you acknowledge where and how you have used AI including the AI tool used for example ChatGPT, BingChat, Grammarly GO. Also include:</strong></p>\n<ul>\n<li><strong>Questions used to generate the response.</strong></li>\n<li><strong>Refining questions used.</strong></li>\n<li><strong>Instructional questions used.</strong></li>\n<li><strong>How you have synthesised the products of AI into your assessment.</strong></li>\n</ul>\n<p><strong>The Acknowledgement is not included within the word count.</strong></p>\n<p><strong>Please be mindful of the policy outlined under assessment within the ECP.</strong></p>\n<p> </p>\n<p>* Enabling and extending prompts represent a technique developed to support learners from a range of abilities. See: Sullivan, P., Mousley, J., &amp; Zevenbergen, R. (2006). Teacher actions to maximize mathematics learning opportunities in heterogeneous classrooms. <em>International Journal of Science and Mathematics Education, 4</em>, 117-143.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Via Turnitin in the Assessment folder on Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Task 3 - Case study report: Response to scenario",
            "special_indicators": [],
            "weighting": "<dd>40% ~ 5 pages </dd>",
            "due_date": "<dd><p> 4/11/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>See task description on Blackboard.</p>\n<p>This is a culminating task where you will build on your understandings of building inclusive classrooms by documenting preparations for a meeting with parents.</p>\n<p><br/></p>\n<p>Scenario: [Note – this will vary. The PLP provided will be a de-identified current document]</p>\n<p>Two weeks into the new school year, the parents of a student in your year 9 class have asked to meet with you to discuss how you will accommodate their child’s learning needs as specified in the Personalised Learning Plan (PLP).</p>\n<p>In this task, you will document your preparation for the meeting (up to five pages), including the following:</p>\n<p>1.\tBackground (suggested two A4 pages)</p>\n<ul>\n<li>A summary of the relevant legislation and policy documents. (Choose a jurisdiction where you plan to teach).</li>\n<li>An indication of the assessment data (formative and summative) you would study prior to the meeting to provide background on the student’s progress.</li>\n<li>An overview of your investigation of applicable external professionals and community representatives including professional support networks, such as disability associations, and other community groups for extending your personal professional knowledge and practice.</li>\n</ul>\n<p>2.\tA plan for the meeting (suggested two A4 pages)</p>\n<ul>\n<li>Location, timing, seating arrangement, refreshments etc.</li>\n<li>Introductions – opportunity for parents to indicate what they wish to gain from the meeting</li>\n<li>How you will work with parents/carers over the year, including considerations of sensitivity, confidentiality, seeking their input and advice, and how you intend to collaborate with them throughout the year</li>\n<li>Explanation of learning adjustments applicable to your subject area in response to the student’s PLP</li>\n<li>Explanation of reasonable adjustments planned for assessment, in response to the PLP</li>\n<li>Explanation of your plan for the student’s wellbeing and safety, including positive behaviour support processes (Tier 1, 2 or 3, as applicable).</li>\n</ul>\n<p>3.\tFollow up (suggested up to one A4 page)</p>\n<ul>\n<li>Recording of the conversation</li>\n<li>Further meetings</li>\n<li>Reporting to others (e.g., school learning support team)</li>\n</ul>\n<p>Acknowledgement: Please ensure you acknowledge if, where and how you have used AI including the AI tool used for example ChatGPT, Bing Chat, Grammarly GO.</p>\n<p>Also include:</p>\n<ul>\n<li>Questions used to generate the response.</li>\n<li>Refining questions used.</li>\n<li>Instructional questions used.</li>\n<li>How you have synthesised the products of AI into your assessment.</li>\n</ul>\n<p>The Acknowledgement is not included within the word count.</p>\n<p>Please be mindful of the policy outlined under assessment within the ECP.</p>\n<p>The acknowledgment is not included in the page limit.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Via Turnitin in the Assessment folder on Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Embracing inclusive practice Week 1</strong><br><p>This first week's activities set the context for this course. It introduces students to the concept of inclusion and begins the work of developing an evidence base for practice.<br/>\nIntroduction to UDL</p></br></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Embracing inclusive practice Week 1</strong>",
            "topic_description": "Embracing inclusive practice Week 1 This first week's activities set the context for this course. It introduces students to the concept of inclusion and begins the work of developing an evidence base for practice. Introduction to UDL",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Understanding the legislative context - Evidence for Inclusive Education Week 2</strong><br/></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Understanding the legislative context - Evidence for Inclusive Education Week 2</strong>",
            "topic_description": "Understanding the legislative context - Evidence for Inclusive Education Week 2",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Understanding the legislative context - The right to quality inclusive education Week 3</strong><br><p>This module focuses on the legislation and policy context that underpins students' rights to quality education.</p></br></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Understanding the legislative context - The right to quality inclusive education Week 3</strong>",
            "topic_description": "Understanding the legislative context - The right to quality inclusive education Week 3 This module focuses on the legislation and policy context that underpins students' rights to quality education.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 4(12 Aug - 18 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Understanding the legislative context - Student wellbeing and quality of life Week 4</strong><br><p>This module explores current work on improving student well-being and educational quality of life. </p></br></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Understanding the legislative context - Student wellbeing and quality of life Week 4</strong>",
            "topic_description": "Understanding the legislative context - Student wellbeing and quality of life Week 4 This module explores current work on improving student well-being and educational quality of life.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 5(19 Aug - 25 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Planning for Learning - Universal Design for Learning; Using technology in the classroom Week 5</strong><br><p>Advances in ICT have had a dramatic effect on accessibility of learning. Many features are now built in to devices. Bring along your favourite piece of learning technology to demonstrate.</p></br></p><p><strong>Learning outcomes:</strong> L03, L05</p></div></td>",
            "topic_title": "<strong>Planning for Learning - Universal Design for Learning; Using technology in the classroom Week 5</strong>",
            "topic_description": "Planning for Learning - Universal Design for Learning; Using technology in the classroom Week 5 Advances in ICT have had a dramatic effect on accessibility of learning. Many features are now built in to devices. Bring along your favourite piece of learning technology to demonstrate.",
            "learning_outcomes": [
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Planning for Learning - Year level adjusted curriculum Week 6</strong><br><p>The Australian Curriculum is a year-level curriculum. The implications for planning, particularly with respect to gifted learners and learners with intellectual disabilities will be explored.</p></br></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Planning for Learning - Year level adjusted curriculum Week 6</strong>",
            "topic_description": "Planning for Learning - Year level adjusted curriculum Week 6 The Australian Curriculum is a year-level curriculum. The implications for planning, particularly with respect to gifted learners and learners with intellectual disabilities will be explored.",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 7(02 Sep - 08 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Planning for Learning - Assessment Week 7</strong><br/><p>Assessment has a range of purposes, sometimes referred to as:<br/>\nAssessment for learning - so teachers and their students can make learning progress<br/>\nAssessment of learning - finding out what students know and can do as a result of teaching<br/>\nAssessment as learning - undertaking tasks can lead to learning.</p>\n<p>Designing and interpreting assessment in the context of inclusive practice is the focus of this module.</p></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Planning for Learning - Assessment Week 7</strong>",
            "topic_description": "Planning for Learning - Assessment Week 7 Assessment has a range of purposes, sometimes referred to as: Assessment for learning - so teachers and their students can make learning progress Assessment of learning - finding out what students know and can do as a result of teaching Assessment as learning - undertaking tasks can lead to learning. Designing and interpreting assessment in the context of inclusive practice is the focus of this module.",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Planning for Learning - Language and Literacy support Week 8</strong><br><p>Language support is the work of all teachers.<br/>\nSome students will have specific language difficulties and disabilities.<br/>\nSome will have learning strengths.<br/>\nGuest presenter from Speech Therapy will discuss language disorders and how speech language pathologists work with teachers.</p></br></p><p><strong>Learning outcomes:</strong> L03, L05</p></div></td>",
            "topic_title": "<strong>Planning for Learning - Language and Literacy support Week 8</strong>",
            "topic_description": "Planning for Learning - Language and Literacy support Week 8 Language support is the work of all teachers. Some students will have specific language difficulties and disabilities. Some will have learning strengths. Guest presenter from Speech Therapy will discuss language disorders and how speech language pathologists work with teachers.",
            "learning_outcomes": [
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Planning for Learning - Positive Behaviour Support Week 9</strong><br><p>Establishing and maintaining a classroom for learning relies on supporting students to exhibit productive learning behaviours. Behaviour is communication so responding to the need being expressed is more effective than responding to the behaviour itself. This module focuses on an approach known as 'Positive Behaviour Supports'.</p></br></p><p><strong>Learning outcomes:</strong> L03, L05</p></div></td>",
            "topic_title": "<strong>Planning for Learning - Positive Behaviour Support Week 9</strong>",
            "topic_description": "Planning for Learning - Positive Behaviour Support Week 9 Establishing and maintaining a classroom for learning relies on supporting students to exhibit productive learning behaviours. Behaviour is communication so responding to the need being expressed is more effective than responding to the behaviour itself. This module focuses on an approach known as 'Positive Behaviour Supports'.",
            "learning_outcomes": [
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Building a Community of Practice - Working with others - Week 10 </strong><br><p>Teachers work in teams, often as the leader. When a student with a individual learning plan is in the class, many people may be involved in the community of practice. These could be teacher aides, specialist teachers, therapists, parents and learning support teams. This module will explore ways of building positive relationships, including running meetings.</p></br></p><p><strong>Learning outcomes:</strong> L04</p></div></td>",
            "topic_title": "<strong>Building a Community of Practice - Working with others - Week 10 </strong>",
            "topic_description": "Building a Community of Practice - Working with others - Week 10 Teachers work in teams, often as the leader. When a student with a individual learning plan is in the class, many people may be involved in the community of practice. These could be teacher aides, specialist teachers, therapists, parents and learning support teams. This module will explore ways of building positive relationships, including running meetings.",
            "learning_outcomes": [
                "L04"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 11 To Week 12(07 Oct - 20 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Building a community of practice - Working with others Weeks 11 &amp; 12</strong><br><p>No lectures for weeks 11 and 12. Tutorials will support understanding of course material.</p></br></p><p><strong>Learning outcomes:</strong> L04</p></div></td>",
            "topic_title": "<strong>Building a community of practice - Working with others Weeks 11 &amp; 12</strong>",
            "topic_description": "Building a community of practice - Working with others Weeks 11 & 12 No lectures for weeks 11 and 12. Tutorials will support understanding of course material.",
            "learning_outcomes": [
                "L04"
            ]
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Building a Community of Practice - Community resources Week 13</strong><br><p>This week the lecture slot will be a panel discussion with invited guests.</p></br></p><p><strong>Learning outcomes:</strong> L04, L05</p></div></td>",
            "topic_title": "<strong>Building a Community of Practice - Community resources Week 13</strong>",
            "topic_description": "Building a Community of Practice - Community resources Week 13 This week the lecture slot will be a panel discussion with invited guests.",
            "learning_outcomes": [
                "L04",
                "L05"
            ]
        }
    ]
}