{
    "course_title": "Primary Professional Experience 2",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC3750-62257-7460",
    "full_course_code": "EDUC3750-62257-7460",
    "course_code": "EDUC3750",
    "class_code": "62257",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate an understanding of schools as workplaces and be familiar with the statutory, ethical and other requirements that govern the work of teachers in schools."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate the application of professional and disciplinary knowledge to engage with curriculum, pedagogy, assessment and reporting of student outcomes, and use this knowledge to design lesson plans and learning experiences."
        },
        {
            "number": "LO3.",
            "description": "Create inclusive, supportive and intellectually challenging educational environments, use a range of resources including ICT and a range of teaching strategies that engage all learners, and set appropriate learning goals for students of all abilities and from a broad range of backgrounds."
        },
        {
            "number": "LO4.",
            "description": "Demonstrate a range of verbal and nonverbal communication strategies to support student engagement."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate skills of critical reflection to evaluate student learning and assessment data, and make informed decisions regarding student learning and required modifications to teaching practices."
        },
        {
            "number": "LO6.",
            "description": "Demonstrate skills of and purpose for critical reflection and engagement with APSTs, colleagues and mentors to identify professional learning needs and develop achievable plans for personal professional growth. In doing so, effectively engage with constructive feedback through the stages of preservice teaching and beginning teaching."
        },
        {
            "number": "LO7.",
            "description": "Demonstrate clear, fluent, and coherent communication skills consistent with personal, professional and academic conventions."
        },
        {
            "number": "LO8.",
            "description": "Demonstrate all teaching and professional requirements of the professional experience placement."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Policies & Procedures for Professional Experience",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 2/08/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L08",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students must read the Policies and Procedures for Professional Experience Placements document and respond to the statement declaration on Blackboard by the due date. Failure to do so will result in a withdrawal of the placement and the awarding of a grade of Fail for the course. </p>\n<p><br/></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Completion of declaration statement on Blackboard to acknowledge that the student has read, understood and will abide by the policies and procedures.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": null,
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Professional Experience (Report)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 12/08/2024 - 6/09/2024</p>\n<p>\n</p><p>Forms are to be uploaded to Blackboard at the half-way point and then on completion of the practicum. </p>\n<p>The Interim Report form (or At Risk) form is to be uploaded by <strong>Monday the 26th of August, 2pm.</strong> </p>\n<p>The Final Evaluation form is to be uploaded no later than <strong>Friday the 13th of September, 2pm</strong>.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L08",
            "mode": "Activity/ Performance",
            "category": "Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students are required to successfully complete <strong>20 days of a supervised and assessed professional experience block placement</strong> in an approved school setting. The placement will be arranged only by the School of Education.</p>\n<p>The 20-day block will comprise of observations, hands-on classroom assistance, planning and teaching segments of lessons, full lessons and moving to sequences of lessons.</p>\n<ul>\n<li>The first 2 to 3 days to be observation and settling into school environment and context, as well as planning and consulting with supervising teacher(s) for future teaching</li>\n<li>Teaching segments of lessons towards end of Week 1 moving to full lessons start of Week 2</li>\n<li>Sequences of lessons to start towards end of Week 3 until end of placement.</li>\n<li>By the end of the placement students should be teaching 50% of a full-time teaching load</li>\n<li>Preservice teacher observations continue throughout placement</li>\n</ul>\n<p>During the practicum, students are expected to demonstrate competence across the APSTs. To do this, students will demonstrate that they have undertaken the inherent requirements of the role of a teacher. This means that students at the very least, will be expected to:</p>\n<ul>\n<li>attend the school at least half an hour before and after school start and finish times to discuss that day's and subsequent days' expectations</li>\n<li>attend any meetings held during the time of the practicum, e.g. year level/departmental or whole of staff meetings or any professional development meetings where attendance is approved by the school,</li>\n<li>participate in extracurricular activities etc available during the block.</li>\n</ul>\n<p>Students are expected to have read, and abide by the School of Education Policies &amp; Procedures document for Professional Experience Placements.</p>\n<p><br/></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Upload via link on Blackboard</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": null,
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Professional practice log and Reflective essay",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 20/09/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L08",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Notebook/ Logbook, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Part A – Professional practice log</strong></p>\n<p>During your four-week professional experience placement you are to keep a log of items collected, created, presented, and/or modified/adapted that could be used as evidence to demonstrate your fulfilment of Standards Three, Four and Five of Domain Two - Professional Practice. You are to use the attached professional practice log to record, annotate and map your chosen items against the standards and the specific focus areas. You are required to record <strong>5 items</strong> - ideally you should aim to include items that address multiple focus areas and standards. <strong>Your annotation for each item should be approximately 150-200 words </strong>and should explain how the item demonstrates the identified focus areas (refer to the Graduate level descriptors to guide your annotations).</p>\n<p>The chosen items must be attached as appendices to your professional practice log.</p>\n<p> </p>\n<p><strong>Part B – Critical reflection: Positive impact on student learning</strong></p>\n<p>You are to critically reflect on how you were able to demonstrate a positive impact of your teaching on student learning during your four-week block. The focus on impact does not imply that you must show evidence of student growth on national or jurisdictional standardised tests. Rather the focus is on demonstrating the impact that you as a preservice teacher have had on student learning.</p>\n<p> </p>\n<p>You are to prepare a <strong>1000-word essay that critically reflects on the positive impact of your teaching on student learning. </strong>Evidence of the impact on student learning could take the form of a case study. You may choose to collect, interpret and use data sources/evidence to inform and then adjust your teaching to impact on student learning. This data may be from student, classroom, school and/or systemic levels. For example, you could analyse selected work samples from one student early and later in your professional experience block, or you could consult with one student of interest to inform your identification of learning needs and then again at the end of the placement to identify where learning or development has occurred.</p>\n<p> </p>\n<p>It is recommended that some of the items collected in Part A should be linked to this task and should be the evidence you use to inform and prepare your critical reflection.</p>\n<p><br/></p>\n<p> </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Link via Blackboard</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Personal development plan and critical reflection",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 25/10/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L06, L07, L08",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You are required to complete a personal development plan (PDP) to identify your professional learning needs so far in your teacher preparation program. Using the PDP template on the course Blackboard site you are to evaluate your performance and knowledge against the Australian Professional Standards for Graduate Teachers. You should also refer to feedback provided by your supervising teacher(s) during your placement to assist your evaluation (e.g. lesson feedback, final evaluation).</p>\n<p> </p>\n<p>Using your personal development plan, you are required to<strong> write a 1500 word critically reflective narrative where you reflect on your performance during the four-week professional experience block and your courses covered in this program; and identify where you need to improve your practice to better meet the learning needs of both yourself and your students. </strong>You should revisit the three professional learning goals that you identified in Primary Professional Experience 1.</p>\n<p> </p>\n<p>You will also need to reference relevant literature that supports your analysis of your development and the ways in which you are seeking personal growth (e.g. consider theories on reflective practice, pedagogy, learning etc.). As a guide, it is suggested that you use 8-10 references in total, using APA 7th edition.</p>\n<p> </p>\n<p>You should identify the ways in which your philosophy of teaching has evolved and changed since your first professional experience placement. You should also identify and explain the strategies that you will put into place before and during your final professional experience and how these strategies will enhance your practice.</p>\n<p><br/></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Link via Blackboard</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Preparing for professional practice</strong><br><p>This lecture aims to clarify the legislative, school and employing authority requirements, and ethical principles and practices in the teaching and learning process.</p>\n<p>We will cover the standards, legal issues, code of ethics, statutory obligations including occupational safety and child protection policies, as well as school visit protocols.<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L08</p></div></td>",
            "topic_title": "<strong>Preparing for professional practice</strong>",
            "topic_description": "Preparing for professional practice This lecture aims to clarify the legislative, school and employing authority requirements, and ethical principles and practices in the teaching and learning process. We will cover the standards, legal issues, code of ethics, statutory obligations including occupational safety and child protection policies, as well as school visit protocols. .",
            "learning_outcomes": [
                "L01",
                "L08"
            ]
        },
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Preparing for professional practice</strong><br><p>In this workshop we will explore how you can best prepare for and make the most out of your professional practice experience. The focus will be on the practicalities of professional experience and establishing positive professional relationships with various stakeholders. </p>\n<p>We will also further clarify the assessment requirements and available resources.<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L08</p></div></td>",
            "topic_title": "<strong>Preparing for professional practice</strong>",
            "topic_description": "Preparing for professional practice In this workshop we will explore how you can best prepare for and make the most out of your professional practice experience. The focus will be on the practicalities of professional experience and establishing positive professional relationships with various stakeholders. We will also further clarify the assessment requirements and available resources. .",
            "learning_outcomes": [
                "L01",
                "L08"
            ]
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Preparing for teaching and learning</strong><br><p>In this lecture we aim to deepen your understanding of the qualities of an excellent teacher, and the pedagogical knowledge required for effective lesson planning and implementation.<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L06</p></div></td>",
            "topic_title": "<strong>Preparing for teaching and learning</strong>",
            "topic_description": "Preparing for teaching and learning In this lecture we aim to deepen your understanding of the qualities of an excellent teacher, and the pedagogical knowledge required for effective lesson planning and implementation. .",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L06"
            ]
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Preparing for teaching and learning</strong><br><p>In this workshop the aim is to prepare you for the practicalities of planning, implementing and reflecting upon lessons across a range of subjects. We will also engage in ongoing critical reflection, goal setting and planning to prepare you for success in professional placement and subsequent assessment requirements.<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L06</p></div></td>",
            "topic_title": "<strong>Preparing for teaching and learning</strong>",
            "topic_description": "Preparing for teaching and learning In this workshop the aim is to prepare you for the practicalities of planning, implementing and reflecting upon lessons across a range of subjects. We will also engage in ongoing critical reflection, goal setting and planning to prepare you for success in professional placement and subsequent assessment requirements. .",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L06"
            ]
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Preparing for classroom management</strong><br><p>In this lecture we will cover the key ideas related to fostering positive relationships in the classroom, and effective behaviour management strategies. The focuses will include creating safe and supportive environments, differentiation, organisation, establishing expectations, communication and observation.<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Preparing for classroom management</strong>",
            "topic_description": "Preparing for classroom management In this lecture we will cover the key ideas related to fostering positive relationships in the classroom, and effective behaviour management strategies. The focuses will include creating safe and supportive environments, differentiation, organisation, establishing expectations, communication and observation. .",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Preparing for classroom management</strong><br><p>In this workshop we will dig deeper into and practice specific strategies related to behaviour management. We will also engage in ongoing critical reflection, goal setting and planning to prepare you for success in professional placement and subsequent assessment requirements.<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Preparing for classroom management</strong>",
            "topic_description": "Preparing for classroom management In this workshop we will dig deeper into and practice specific strategies related to behaviour management. We will also engage in ongoing critical reflection, goal setting and planning to prepare you for success in professional placement and subsequent assessment requirements. .",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 4 To Week 7(12 Aug - 08 Sep)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Professional Experience</strong><br><p>4 weeks (20 days) of full time supervised practicum in a school setting. Observations, planning and teaching segments and full lessons.<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Professional Experience</strong>",
            "topic_description": "Professional Experience 4 weeks (20 days) of full time supervised practicum in a school setting. Observations, planning and teaching segments and full lessons. .",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Reflection on placement</strong><br><p>In this lecture we will explore reflective and reflexive approaches to personalised professional development, and connect these with your own experience and upcoming critical reflections.</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L05, L06</p></div></td>",
            "topic_title": "<strong>Reflection on placement</strong>",
            "topic_description": "Reflection on placement In this lecture we will explore reflective and reflexive approaches to personalised professional development, and connect these with your own experience and upcoming critical reflections.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Reflection on placement</strong><br><p>In this workshop will largely involve a debrief after professional experience, and sharing strategies and resources from the professional experience placement.</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L05, L06</p></div></td>",
            "topic_title": "<strong>Reflection on placement</strong>",
            "topic_description": "Reflection on placement In this workshop will largely involve a debrief after professional experience, and sharing strategies and resources from the professional experience placement.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Know students and how they learn</strong><br><p>In this lecture we will look at the physical, social and intellectual development and characteristics of students and how these might effect learning and the implications for teaching.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Know students and how they learn</strong>",
            "topic_description": "Know students and how they learn In this lecture we will look at the physical, social and intellectual development and characteristics of students and how these might effect learning and the implications for teaching.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Know students and how they learn</strong><br><p>In this workshop we will further explore strategies around differentiating for the diversity of learning needs in the classroom.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Know students and how they learn</strong>",
            "topic_description": "Know students and how they learn In this workshop we will further explore strategies around differentiating for the diversity of learning needs in the classroom.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Mid Sem break(23 Sep - 29 Sep)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-semester Break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-semester Break</strong>",
            "topic_description": "Mid-semester Break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Using assessments and data in the classroom</strong><br><p>This lecture will explore assessment data within a primary context (systemic data, school, class) is used to evaluate student learning, provide feedback, and modify teaching practice.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05, L06</p></div></td>",
            "topic_title": "<strong>Using assessments and data in the classroom</strong>",
            "topic_description": "Using assessments and data in the classroom This lecture will explore assessment data within a primary context (systemic data, school, class) is used to evaluate student learning, provide feedback, and modify teaching practice.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Using assessments and data in the classroom</strong><br><p>The workshop will focus on various in-class formative and summative assessment practices, and how to provide feedback to guide student learning.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05, L06</p></div></td>",
            "topic_title": "<strong>Using assessments and data in the classroom</strong>",
            "topic_description": "Using assessments and data in the classroom The workshop will focus on various in-class formative and summative assessment practices, and how to provide feedback to guide student learning.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 11(07 Oct - 13 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Plan for &amp; implement effective teaching &amp; learning</strong><br><p>In this lecture we will explore evidence-based teaching strategies for designing lessons across a range of subjects.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Plan for &amp; implement effective teaching &amp; learning</strong>",
            "topic_description": "Plan for & implement effective teaching & learning In this lecture we will explore evidence-based teaching strategies for designing lessons across a range of subjects.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 11(07 Oct - 13 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Plan for &amp; implement effective teaching &amp; learning</strong><br><p>In the workshop we will focus further discuss and practice different teaching strategies.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Plan for &amp; implement effective teaching &amp; learning</strong>",
            "topic_description": "Plan for & implement effective teaching & learning In the workshop we will focus further discuss and practice different teaching strategies.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Parental engagement</strong><br><p>In this lecture we will explore how you can make meaningful connections with parents to support student learning and well-being. </p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Parental engagement</strong>",
            "topic_description": "Parental engagement In this lecture we will explore how you can make meaningful connections with parents to support student learning and well-being.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Parental engagement</strong><br><p>The workshop will build upon previous learning related to professional development, goal setting, and reflection. The focus will be on making meaningful connections with parents to support student learning and well-being. We will discuss the AITSL standards in preparation for the final critical reflection.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Parental engagement</strong>",
            "topic_description": "Parental engagement The workshop will build upon previous learning related to professional development, goal setting, and reflection. The focus will be on making meaningful connections with parents to support student learning and well-being. We will discuss the AITSL standards in preparation for the final critical reflection.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Big picture planning across the curriculum</strong><br/><p>This lecture explores how teachers consider the broader needs of their students by incorporate the general capabilities including critical and creative thinking; digital literacy; ethical understanding; intercultural understanding and personal and social capability; numeracy and literacy to enhance the learning opportunities and broader development of students in their classroom.</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Big picture planning across the curriculum</strong>",
            "topic_description": "Big picture planning across the curriculum This lecture explores how teachers consider the broader needs of their students by incorporate the general capabilities including critical and creative thinking; digital literacy; ethical understanding; intercultural understanding and personal and social capability; numeracy and literacy to enhance the learning opportunities and broader development of students in their classroom.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Big picture planning across the curriculum</strong><br/><p>In this workshop we will look at practical strategies and target areas of the curriculum for developing the general capabilities in the classroom, including critical and creative thinking; digital literacy; ethical understanding; intercultural understanding and personal and social capability; numeracy and literacy. </p></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Big picture planning across the curriculum</strong>",
            "topic_description": "Big picture planning across the curriculum In this workshop we will look at practical strategies and target areas of the curriculum for developing the general capabilities in the classroom, including critical and creative thinking; digital literacy; ethical understanding; intercultural understanding and personal and social capability; numeracy and literacy.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        }
    ]
}