{
    "course_title": "Early Years Curriculum and Pedagogical Foundations",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC1760-60106-7460",
    "full_course_code": "EDUC1760-60106-7460",
    "course_code": "EDUC1760",
    "class_code": "60106",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate understanding of core early years curricula and pedagogy concepts"
        },
        {
            "number": "LO2.",
            "description": "Demonstrate knowledge and understanding of young children and their learning"
        },
        {
            "number": "LO3.",
            "description": "Design quality environments to foster creativity and curiosity in young children"
        },
        {
            "number": "LO4.",
            "description": "Document childrens learning through detailed visual and text descriptions"
        },
        {
            "number": "LO5.",
            "description": "Plan learning experiences based on young childrens interests to enhance young childrens learning"
        },
        {
            "number": "LO6.",
            "description": "Critically analyse early years education literature and draw implications for early years learning environments and values for children's learning"
        },
        {
            "number": "LO7.",
            "description": "Demonstrate an awareness of a range of strategies to engage parents and care givers as partners in the educative process"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Early Years Critical Literature Reflection",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>10% 2 paragraphs each reflection </dd>",
            "due_date": "<dd><p> 23/07/2024 6:00 pm</p>\n<p> 29/07/2024 9:30 am</p>\n<p> 5/08/2024 9:30 am</p>\n<p> 12/08/2024 9:30 am</p>\n<p> 19/08/2024 9:30 am</p>\n<p> 26/08/2024 9:30 am</p>\n<p> 2/09/2024 9:30 am</p>\n<p>\n</p><p>Reflections are Due Weeks 1 – 7 half an hour before the lecture. During tutorials in Week 1, students will be shown how to use the RiPPLE platform so the due date for Week 1 is Tuesday 6pm. All other weeks the reflection is due Monday 9:30 am.</p></dd>",
            "learning_objectives": "L01, L02, L06, L07",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Early Years Literature Reflection:</strong> Critical Reflection Response (Week 1 – 7)</p>\n<p>The reflection is a response to the weekly course reading. After your weekly reading, write a <strong>two paragraph reflection</strong> where you <strong>report</strong> the main ideas in the article, <strong>relate </strong>the ideas to your own experience, <strong>reason </strong>by showing why the ideas are important or the perspectives they provide, <strong>reconstruct </strong>how this idea may be used by you in future professional experiences. Submit your reflection via the RiPPLE platform. Then, in the next week, moderate three of your peers reflection by scoring and writing one simple comment about the nature of their responses. No comments are to be made about how well written the reflection is. For example, meeting the report, relate, reason and reconstruct target. <strong>Comment on how your peer has interpreted what the article tells us about early years values, principles and pedagogy. </strong>You receive one mark for the <strong>submission and moderation</strong> each week. You need to score 3 or above in RiPPLE to receive a mark/grade. Peer feedback is monitored by the course coordinator. Any instances of unprofessional or unethical feedback will be overridden by the course coordinator to ensure fair, collegial and professional responses as underscored in early years education.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Upload your critical reflection to the designated folder in the UQ RiPPLE platform which can be accessed from the course Blackboard site.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Early Years Learning Spaces",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>35% 1500 words approx. </dd>",
            "due_date": "<dd><p> 22/08/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L06",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Paper/ Report/ Annotation, Practical/ Demonstration, Product/ Design",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Assessment Task 1</strong></p>\n<p><strong>1.GOMA Activities</strong> – UQ Art Museum and Queensland Gallery of Modern Art Tutorial – You will observe, document, and review the learning spaces according to early childhood values and concepts, including design characteristics and tools. Week 2 and 4 Tutorial – participation in a Visual Thinking Strategy session, Week 3 Tutorial – Visit to Queensland Gallery of Modern Art Early Years Spaces for interactive tour. During these combined sessions you will be introduced to pedagogical listening and documentation methods. At the Gallery of Modern Art you will document notes and photograph <strong>design elements</strong> in the <strong>spaces</strong> used to create an early years learning environment. <strong>No children are to be included in photographs.</strong> Consider the spaces from a child's perspective. What features would engage young children and put them in direct conversation with the surrounding world? How does the space allow the potential for children's continual exchange with the personal, cultural and social context to construct meaningful experiences to attribute sense, knowledge building and integrated understanding?</p>\n<p><strong>2.Write a review</strong> of the GOMA site identifying evidence of <strong>pertinent</strong> key early childhood concepts highlighted in the course that you identified in that space. Use photos (photos must contain images of the <strong>spaces only</strong>, with <strong>no people included</strong>) embedded in the review to document and explain in visual along with the written elaborations, how each early years relational pedagogical concept is applied. Justify your review with explicit references to course readings and wider literature on designing pedagogical spaces in the early years. Note how the environment and the educators can attend to and engage children’s needs and interests, along with potential for constructing experiences which they are capable of attributing sense and meaning (750 words). Use of footnotes is advised.</p>\n<p><strong>3.Plan an early years learning space</strong> that engages personal, social and cultural experiences conducive to developing the rights of each child. Use an on-line planning tool to create your own purposeful designed learning space to show application of design principles whilst creating an innovative environment beyond traditional classroom understanding. Planning tools include: floorplanner, roomsketcher, alongside active skill-building sessions in creating injunctions with AI to create design elements will be provided in tutorials). Include inspiration from your visit to GOMA and Visual Thinking Strategy sessions. Label the design to highlight how you used ideas from these experiences to inform your own unique learning environment plan.</p>\n<p><strong>4.Annotate each key feature of your plan</strong> noting your <strong>pedagogical intent rationale </strong>showing a distinct purpose in your learning space between materials, opportunities, and young children. Clear practical evidence linking to the United Nations Sustainability Goals must be evident in your plan and annotations. Use footnotes to add detail for each design element, including integrate reference citations from the course and wider readings. Footnote word counts are not included in the overall word count. Underneath your plan and annotations, describe and explain <strong>the educative purposes and goals</strong> and <strong>how you as a teacher could facilitate co-constructed learning</strong> with each element in the space you have designed (approx. 750 words). The plan will need to consider both interior and exterior space. Evidence of careful inclusion of design elements they provide interactive experiences in relation to the child and their surrounding reality. Evidence for careful inclusion of design elements to elicit a <strong>style of interactions in relation to the child and their surrounding reality </strong>is expected, even incorporating alternative educative approaches such as forest schools, needs in rural locations, inner city educational sites, or environments attached within workplaces. <strong>All citations and referencing</strong> to be in <strong>APA 7th</strong> style.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>For AI conditions please refer to Additional Course Grading Information</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Early Years Documentation and Planning",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>55% 2000 words approx. </dd>",
            "due_date": "<dd><p> 23/10/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07",
            "mode": "Activity/ Performance, Oral, Product/ Artefact/ Multimedia, Written",
            "category": "Creative Production/ Exhibition, Paper/ Report/ Annotation, Notebook/ Logbook, Participation/ Student contribution, Practical/ Demonstration, Presentation, Project, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You will be provided with <strong>three case study scenarios</strong> of early years children engaging in an activity. Choose <strong>one</strong> case study for the following tasks:</p>\n<ol>\n<li><strong>Document the potential development evidenced in the learning episode using a Visual Thinking Strategy approach</strong>. Use of the Notability App is preferable. In your documentation, integrate a snip taken from the case study image as part of your annotation process.</li>\n<li>Write a <strong>running record commentary</strong> that depicts and articulates what the child/children can do/say/move/thinks/understand; any demonstrated interest; indication as to their sense of curiosity; potential for enriching the learning (use curricula and policy), any family/community/social/cultural considerations. In the commentary, reference literature, identify and explain early years values and concepts explicitly, then justify your documentation (tell the importance and purpose for documenting children's learning in the overall teaching and learning process). The running record is to be inserted as an appendix item and does not count towards the word limit.</li>\n<li>During Week 10 tutorials, in small groups you will <strong>present your documentation (5mins)</strong> and each group member will provide professional feedback. The purpose of receiving feedback is to reflect on your plan to refine before assessment submission whilst also engaging in a collegial professional practice – a core value of early years education.</li>\n<li><strong>Plan a child-led project</strong> from the documented case study. Include a rationale, description of previous learning, intended learning objectives, at least 3 learning episodes to demonstrate the phases inherent in a project approach, pedagogical strategies (what the children and teacher will be doing in each phase), resources, curriculum links, family/community links, intended outcomes, key questions, acknowledgement of individual learning considerations, link the UN sustainability goals. All EDUC1760 course concepts are expected to be included in the plan.</li>\n<li><strong>Write and include a reflection after our community event at UQ in Week 11</strong> (in lieu of lectures and tutorials) to tell who you invited; the responses received; why integrating the community as partners is important for enriching learning in an early years context; and what you have learned personally from documenting; reflect on how you approached dialoguing with people from the community. No references necessary in this part of the task.</li>\n<li><strong>Include a reference list</strong> in APA 7th style.</li>\n</ol>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission via TurnitIn link in the EDUC 1760 Blackboard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The Young Child and Early Years Landscape</strong><br><p>Lecture – Students to explore the RiPPLE link on Blackboard before the first lecture</p>\n<p>Tutorial – Students to bring iPads and/or laptops for an introduction to the Notability App. </p>\n<p>The Notability application will be used ongoing as a documentation tool throughout the course.</p>\n<p><br/></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L07</p></div></td>",
            "topic_title": "<strong>The Young Child and Early Years Landscape</strong>",
            "topic_description": "The Young Child and Early Years Landscape Lecture – Students to explore the RiPPLE link on Blackboard before the first lecture Tutorial – Students to bring iPads and/or laptops for an introduction to the Notability App. The Notability application will be used ongoing as a documentation tool throughout the course.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L07"
            ]
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Documentation and Pedagogy</strong><br><p>Lecture/Tutorial/RiPPLE Task</p>\n<p>Tutorials this week will be held at the UQ Art Museum. Please meet in the UQAM foyer at your scheduled tutorial time.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L07</p></div></td>",
            "topic_title": "<strong>Documentation and Pedagogy</strong>",
            "topic_description": "Documentation and Pedagogy Lecture/Tutorial/RiPPLE Task Tutorials this week will be held at the UQ Art Museum. Please meet in the UQAM foyer at your scheduled tutorial time.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L07"
            ]
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Early Years Environments and Design Principles</strong><br><p>Lecture/Excursion/RiPPLE Task</p>\n<p>Tutorials this week will take place at Queensland Gallery of Modern Art, Stanley Pl, South Brisbane QLD 4101.</p>\n<p>Tutorials will be held on Friday at 50 min intervals between 10:00 – 1:00 pm instead of the usual tutorial session time slots. Detailed information will be given in Week 2.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L07</p></div></td>",
            "topic_title": "<strong>Early Years Environments and Design Principles</strong>",
            "topic_description": "Early Years Environments and Design Principles Lecture/Excursion/RiPPLE Task Tutorials this week will take place at Queensland Gallery of Modern Art, Stanley Pl, South Brisbane QLD 4101. Tutorials will be held on Friday at 50 min intervals between 10:00 – 1:00 pm instead of the usual tutorial session time slots. Detailed information will be given in Week 2.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L07"
            ]
        },
        {
            "learning_period": "Week 4(12 Aug - 18 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Pedagogy and Documentation</strong><br><p>Lecture, Tutorial, RiPPLE Reflection</p>\n<p>Tutorials this week will be held at the UQ Art Museum. Please meet in the UQAM foyer at your scheduled tutorial time.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Pedagogy and Documentation</strong>",
            "topic_description": "Pedagogy and Documentation Lecture, Tutorial, RiPPLE Reflection Tutorials this week will be held at the UQ Art Museum. Please meet in the UQAM foyer at your scheduled tutorial time.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 5(19 Aug - 25 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Embodied Teaching and Learning</strong><br><p>Lecture/Tutorial/RiPPLE Reflection</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Embodied Teaching and Learning</strong>",
            "topic_description": "Embodied Teaching and Learning Lecture/Tutorial/RiPPLE Reflection",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Child-led Projects</strong><br/><p>Lecture/Tutorial/RiPPLE Task</p>\n<p>The lecture this week is a Lego Serious Play session.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Child-led Projects</strong>",
            "topic_description": "Child-led Projects Lecture/Tutorial/RiPPLE Task The lecture this week is a Lego Serious Play session.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 7(02 Sep - 08 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Play, Experimentation, Ethics</strong><br/><p>Lecture/Tutorial/RiPPLE Task</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Play, Experimentation, Ethics</strong>",
            "topic_description": "Play, Experimentation, Ethics Lecture/Tutorial/RiPPLE Task",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Transitions, Interaction, Belonging</strong><br/><p>Lecture/Tutorial/Documentation Presentations</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Transitions, Interaction, Belonging</strong>",
            "topic_description": "Transitions, Interaction, Belonging Lecture/Tutorial/Documentation Presentations",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Community, Parent and Family Engagement</strong><br/><p>Lecture</p>\n<p>Tutorial: Document, Display, Dialogue – Community Event at UQ Art Museum @Tuesday 17th September 4 – 5:30pm.</p></p><p><strong>Sub-activity:</strong> Community Event UQ Art Museum Tuesday 17th September– instead of tutorial and participation required as part of Assessment 2</p><p><strong>Learning outcomes:</strong> L01, L03, L04, L06, L07</p></div></td>",
            "topic_title": "<strong>Community, Parent and Family Engagement</strong>",
            "topic_description": "Community, Parent and Family Engagement Lecture Tutorial: Document, Display, Dialogue – Community Event at UQ Art Museum @Tuesday 17th September 4 – 5:30pm. Sub-activity: Community Event UQ Art Museum Tuesday 17th September– instead of tutorial and participation required as part of Assessment 2",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Documentation, Planning, and Writing Project Plans</strong><br/><p>Lecture/Tutorial</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Documentation, Planning, and Writing Project Plans</strong>",
            "topic_description": "Documentation, Planning, and Writing Project Plans Lecture/Tutorial",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 11(07 Oct - 13 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Integrated Learning</strong><br/><p>Lecture/Tutorial</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Integrated Learning</strong>",
            "topic_description": "Integrated Learning Lecture/Tutorial",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Developing an Early Years Plan</strong><br/><p>Drop In Session – Practical Assessment Support</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05, L07</p></div></td>",
            "topic_title": "<strong>Developing an Early Years Plan</strong>",
            "topic_description": "Developing an Early Years Plan Drop In Session – Practical Assessment Support",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05",
                "L07"
            ]
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Reviewing an Early Years Plan</strong><br/><p>Reviewing Early Years Plans – Drop-in Practical Assessment Support Session</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Reviewing an Early Years Plan</strong>",
            "topic_description": "Reviewing an Early Years Plan Reviewing Early Years Plans – Drop-in Practical Assessment Support Session",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        }
    ]
}