{
    "course_title": "Building Professional Knowledge",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC7605-62010-7460",
    "full_course_code": "EDUC7605-62010-7460",
    "course_code": "EDUC7605",
    "class_code": "62010",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate an understanding of teaching as a dynamic and challenging form of professional work."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate an understanding of the diverse backgrounds, development and characteristics of students, and how these may affect learning, and teaching strategies for supporting them in their personal development, health and wellbeing."
        },
        {
            "number": "LO3.",
            "description": "Identify and implement teaching strategies, including the use of ICTs, that provide students with appropriate, challenging learning goals and an engaging yet safe and supportive learning environment."
        },
        {
            "number": "LO4.",
            "description": "Recognise and understand the place of legislative, school and employing authority requirements in the teaching and learning process, and which enable strategies to support student well-being and safety."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate knowledge of relevant codes of practices and critical reflection on the technical and communication skills required to interact effectively with students, care givers and fellow professionals in an educational environment."
        },
        {
            "number": "LO6.",
            "description": "Demonstrate clear, fluent, and coherent communication skills consistent with personal, professional and academic conventions."
        },
        {
            "number": "LO7.",
            "description": "Demonstrate all teaching and professional requirements of the professional experience placement."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Critical reflection essay",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail 1500 words </dd>",
            "due_date": "<dd><p> 6/09/2024 2:00 pm</p></dd>",
            "learning_objectives": "L02, L04",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>After completing the four-week module that focused on the student health and wellbeing work that teachers conduct in schools, you are to write a critical reflection essay around a topic of interest covered in this module.  <strong>Your essay should be 1500 words and will cover a topic within the following area or areas:</strong></p>\n<p><strong>Child protection</strong></p>\n<p>·       Curriculum approaches to support child protection strategies</p>\n<p>·       Impact of child protection policies on teachers’ health and wellbeing</p>\n<p>·       Exploring the boundaries between caring teaching and child welfare</p>\n<p><strong>Community partnerships for health and wellbeing</strong></p>\n<p>·       Empowering parents to support young people’s wellbeing</p>\n<p>·       Working with external providers effectively to promote student health and wellbeing</p>\n<p>·       Teachers’ work as boundary spanners in the provision of school health and welfare services</p>\n<p><strong>Students’ mental health and wellbeing</strong></p>\n<p>·       Teachers’ role in modelling positive health and wellbeing for students</p>\n<p>·       School resources that support students positive health and wellbeing</p>\n<p>·       Effective policy landscape for the promotion of student health and wellbeing</p>\n<p><strong>Your essay should critically reflect on how the chosen topic has contributed to building your professional knowledge as a preservice teacher.</strong></p>\n<p>In writing your critical reflection you should refer to content covered in the module, relevant academic literature, the Australian Professional Standards for Graduate teachers (in particular standards 4.4, 7.1 and 7.2) and where possible, your observations and experiences during your placement. </p>\n<p>APST 4.4, 7.1, 7.2</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission via Turnitin link on Blackboard</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Supervised professional experience placement",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 30/09/2024 - 11/10/2024</p>\n<p>\n</p><p>Evaluation Form to be uploaded by Friday 18th October 2:00pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07",
            "mode": "Activity/ Performance",
            "category": "Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Two week block (10 days) - Monday 30th September to Friday 11th October. (Note: Monday 7th October - Public Holiday)</strong></p>\n<p>You are required to attend a school allocated to you by the university in order to observe teaching practice, school life, students, and develop observation and communication skills within a school context. You are also required to plan and teach segments of lessons and full lessons.</p>\n<p>You will have a two week block in Weeks 10 &amp; 11 of the semester. 100% attendance is mandatory. You must adhere to the School of Education's policies and procedures for professional experience at all times.</p>\n<p>The 10 day block will comprise of observations, hand-on classroom assistance, planning and teaching segments of lessons and full lessons.</p>\n<p>Illness preventing attendance during your professional experience must be notified to the placements administrator, education@uq.edu.au, the UQ facilitator, your teacher and the school coordinator. Missed days must be made up and negotiated to the satisfaction of the school. Work is NOT acceptable as a reason for missing a day.</p>\n<p>Throughout the semester you will be required to attend on-campus workshops to prepare you for your prac. Attendance is required for all of these workshops or you may jeopardise your placement. Any missed classes must be supported by medical certificates or other supporting documentation. Alternate assessment may be required to compensate for the missed days at the discretion of the course coordinator.</p>\n<p>Your supervising teacher/s will prepare a report at the end of the 10 days that will advise on your performance in the school context and will determine your outcome for the professional experience.</p>\n<p>Students are expected to have read, and abide by the School of Education Policies and Procedures Document for Professional Experience Placements</p>\n<p>NOTE: all students are responsible for the collection of original evaluation forms. These are to be uploaded to Blackboard on completion of the practicum (<strong>must be uploaded by Friday 18th October, 2pm</strong>). Failure to upload the practicum evaluation forms to the Blackboard site may result in a failing grade being awarded for the course.</p>\n<p>APST: 2.1, 2.2, 2.5, 2.6, 3.1, 4.2, 4.3, 6.3, 7.1, 7.2</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit Evaluation Report via assessment link on Blackboard</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Building a portfolio",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail 3000 words </dd>",
            "due_date": "<dd><p> 18/10/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Notebook/ Logbook, Portfolio, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>From your ten-day professional experience placement you are required to collate and present a portfolio containing a summary of observations, planning notes and a personal teaching philosophy.</p>\n<p><strong>Part A – Summary of observations</strong></p>\n<p><strong>You are to prepare a 2000-word summary of observations that addresses all of the following topics:</strong></p>\n<ul>\n<li>Understanding the school environment and being a teacher;</li>\n<li>Knowing your learners (physical, social and intellectual development and characteristics of students and how these may affect learning);</li>\n<li>Strategies to support full participation of students with disability;</li>\n<li>Literacy and numeracy teaching strategies/programs and their application in the classroom and school;</li>\n<li>Practical approaches to manage challenging behaviour;</li>\n<li>Assessment (systemic data – school, class, focus on students – for example PATM, PATR, NAPLAN; moderation of assessment and reporting mechanisms, the purpose of keeping accurate and reliable records).</li>\n</ul>\n<p>In order to write the summary of observations, you should refer to the notes that you compiled for the various observation focus areas below – <strong>use these 10 focus areas as headings</strong> for your summary of observations.</p>\n<ul>\n<li> An introduction to the school environment (who are the various stakeholders?)</li>\n<li>School policies and procedures (legislative, administrative and organisational)</li>\n<li>The importance of communication within a school community</li>\n<li>Extra-curricular activities and opportunities within a school</li>\n<li>The duties and responsibilities of being a teacher</li>\n<li>Who are your learners? – understanding, catering for and managing individual student needs. Supporting student health and wellbeing.</li>\n<li>An introduction to classroom management</li>\n<li>The development of literacy and numeracy skills – classroom and school level</li>\n<li>Organising the learning (teaching and learning strategies/activities) – the what, why and how</li>\n<li>The use of information communication and technologies (ICTs) in the classroom and across the school</li>\n</ul>\n<p>  </p>\n<p><strong>Part B - Planning notes and reflections - Planning notes + 500 word reflections/goals</strong></p>\n<p><strong>During the placement you have had the opportunity to plan for and present segments of lessons/mini lessons and full lessons (where possible).</strong></p>\n<ol>\n<li>You are to include three examples of plans that you created and presented (including resources) and provide a personal reflection for each. Your reflection should address what went well and what you would improve for next time (150-200 words).</li>\n<li>Based on these personal reflections and feedback provided by your supervising teacher(s), you are required to identify three professional learning goals that will guide your next professional experience placement. You should link your professional learning goals to relevant Australian Professional Standards for Teachers and their focus areas.</li>\n</ol>\n<p><br/></p>\n<p><strong>Part C - Personal Teaching Philosophy - 500 words</strong></p>\n<p><strong>In reference to Part A and B and through reflection on the professional experience placement and your journey to date in the program, prepare a 500 word personal teaching philosophy </strong>that captures and presents <strong>how you will aim to ensure that your teaching has a positive impact on student learning</strong>.This statement should also identify your values, beliefs and ideas about teaching and the type of teacher you will aim to become. The three domains from the Australian Professional Standards for Teachers may help you frame your philosophy.</p>\n<p>This will be an important and valuable statement to revisit as your progress through the professional experience courses and your program.</p>\n<p>APST: 1.1, 1.6, 2.1, 2.2, 2.5, 4.3, 4.4, 6.1, 6.3</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via assessment link on Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>An introduction to being a teacher &amp; school life</strong><br><p>Role of a teacher; Qualities of a good teacher; Standards; Code of Ethics. Legislative, school and employing authority requirements, and ethical principles and practices in the teaching and learning process; The school environment (who are the various stakeholders?) An introduction to classroom observation skills. Preparing for school visits (part 1) School visit protocols. How to work effectively with supervising teachers and respond appropriately to feedback designed to improve teaching practices. </p>\n<p>Introduction to Micro-Teaching Activity. </p>\n<p>Read/Ref: Chapter 1, 2 &amp; 3</p>\n<p>APST: 3.5, 4.1, 7.1, 7.2</p></br></p><p><strong>Learning outcomes:</strong> L01, L05</p></div></td>",
            "topic_title": "<strong>An introduction to being a teacher &amp; school life</strong>",
            "topic_description": "An introduction to being a teacher & school life Role of a teacher; Qualities of a good teacher; Standards; Code of Ethics. Legislative, school and employing authority requirements, and ethical principles and practices in the teaching and learning process; The school environment (who are the various stakeholders?) An introduction to classroom observation skills. Preparing for school visits (part 1) School visit protocols. How to work effectively with supervising teachers and respond appropriately to feedback designed to improve teaching practices. Introduction to Micro-Teaching Activity. Read/Ref: Chapter 1, 2 & 3 APST: 3.5, 4.1, 7.1, 7.2",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Know students and how they learn</strong><br/><p>: Understanding the physical, social and intellectual development and characteristics of students and how these may affect learning and the implications for teaching. Preparing for school visits (part 2):</p>\n<p>Micro-teaching activities.</p>\n<p>Read/Ref: Chapter 4, 6, 7, 10</p>\n<p>APST: 1.3, 1.4, 1.5, 1.6, 4.1, 7.1, 7.2</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Know students and how they learn</strong>",
            "topic_description": "Know students and how they learn : Understanding the physical, social and intellectual development and characteristics of students and how these may affect learning and the implications for teaching. Preparing for school visits (part 2): Micro-teaching activities. Read/Ref: Chapter 4, 6, 7, 10 APST: 1.3, 1.4, 1.5, 1.6, 4.1, 7.1, 7.2",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Teacher and student health and wellbeing</strong><br/><p>Four week module taught by HMNS on pre-service teachers health knowledge (e.g. child protection, community partnerships in health, students mental health and wellbeing, maintaining teachers own health and well-being).</p>\n<p>APST: 4.4, 7.1, 7.2</p></p><p><strong>Learning outcomes:</strong> L02, L04</p></div></td>",
            "topic_title": "<strong>Teacher and student health and wellbeing</strong>",
            "topic_description": "Teacher and student health and wellbeing Four week module taught by HMNS on pre-service teachers health knowledge (e.g. child protection, community partnerships in health, students mental health and wellbeing, maintaining teachers own health and well-being). APST: 4.4, 7.1, 7.2",
            "learning_outcomes": [
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4(12 Aug - 18 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Teacher and student health and wellbeing</strong><br/><p>Four week module taught by HMNS on pre-service teachers health knowledge (e.g. child protection, community partnerships in health, students mental health and wellbeing, maintaining teachers own health and well-being)</p>\n<p>Show Holiday 14th August</p>\n<p>APST: 4.4, 7.1, 7.2</p></p><p><strong>Learning outcomes:</strong> L02, L04</p></div></td>",
            "topic_title": "<strong>Teacher and student health and wellbeing</strong>",
            "topic_description": "Teacher and student health and wellbeing Four week module taught by HMNS on pre-service teachers health knowledge (e.g. child protection, community partnerships in health, students mental health and wellbeing, maintaining teachers own health and well-being) Show Holiday 14th August APST: 4.4, 7.1, 7.2",
            "learning_outcomes": [
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5(19 Aug - 25 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Teacher and student health and wellbeing</strong><br/><p>Four week module taught by HMNS on pre-service teachers health knowledge (e.g. child protection, community partnerships in health, students mental health and wellbeing, maintaining teachers own health and well-being).</p>\n<p>APST: 4.4, 7.1, 7.2</p></p><p><strong>Learning outcomes:</strong> L02, L04</p></div></td>",
            "topic_title": "<strong>Teacher and student health and wellbeing</strong>",
            "topic_description": "Teacher and student health and wellbeing Four week module taught by HMNS on pre-service teachers health knowledge (e.g. child protection, community partnerships in health, students mental health and wellbeing, maintaining teachers own health and well-being). APST: 4.4, 7.1, 7.2",
            "learning_outcomes": [
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Teacher and student health and wellbeing</strong><br/><p>Four week module taught by HMNS on pre-service teachers health knowledge (e.g. child protection, community partnerships in health, students mental health and wellbeing, maintaining teachers own health and well-being).</p>\n<p>APST: 4.4, 7.1, 7.2</p></p><p><strong>Learning outcomes:</strong> L02, L04</p></div></td>",
            "topic_title": "<strong>Teacher and student health and wellbeing</strong>",
            "topic_description": "Teacher and student health and wellbeing Four week module taught by HMNS on pre-service teachers health knowledge (e.g. child protection, community partnerships in health, students mental health and wellbeing, maintaining teachers own health and well-being). APST: 4.4, 7.1, 7.2",
            "learning_outcomes": [
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7(02 Sep - 08 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Plan for &amp; implement effective teaching &amp; learning</strong><br/><p>An introduction to planning. Setting learning goals and objectives for student learning making links within curriculum requirements and knowledge of how students learn. Reflecting on prac experiences; Communication within a school community; Understanding the school environment and being a teacher. </p>\n<p>Micro-teaching activities. </p>\n<p>Readings/Ref: 1 (Chapter 5);</p>\n<p>APST: 2.1 - 2.6, 3.1 - 3.7</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Plan for &amp; implement effective teaching &amp; learning</strong>",
            "topic_description": "Plan for & implement effective teaching & learning An introduction to planning. Setting learning goals and objectives for student learning making links within curriculum requirements and knowledge of how students learn. Reflecting on prac experiences; Communication within a school community; Understanding the school environment and being a teacher. Micro-teaching activities. Readings/Ref: 1 (Chapter 5); APST: 2.1 - 2.6, 3.1 - 3.7",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction to Classroom Org. &amp; Behav. Manag. 1</strong><br/><p>Classroom organisation - routines and strategies. Practical approaches to manage challenging behaviour. Revisiting lesson planning and prac expectations..</p>\n<p> Micro-teaching activities. </p>\n<p>Readings/Ref: 1 (Chapter 8);</p>\n<p>APST: 1.1,1.2, 3.5, 4.1, 4.3, 7.1, 7.2 </p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Introduction to Classroom Org. &amp; Behav. Manag. 1</strong>",
            "topic_description": "Introduction to Classroom Org. & Behav. Manag. 1 Classroom organisation - routines and strategies. Practical approaches to manage challenging behaviour. Revisiting lesson planning and prac expectations.. Micro-teaching activities. Readings/Ref: 1 (Chapter 8); APST: 1.1,1.2, 3.5, 4.1, 4.3, 7.1, 7.2",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction to Classroom Org. &amp; Behav. Manag. 2</strong><br/><p>Classroom organisation - routines and strategies. Practical approaches to manage challenging behaviour. Revisiting lesson planning and prac expectations..</p>\n<p>Micro-teaching activities.</p>\n<p>Readings/Ref: 1 (Chapter 8);</p>\n<p>APST: 1.1,1.2, 3.5, 4.1, 4.3, 7.1, 7.2</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Introduction to Classroom Org. &amp; Behav. Manag. 2</strong>",
            "topic_description": "Introduction to Classroom Org. & Behav. Manag. 2 Classroom organisation - routines and strategies. Practical approaches to manage challenging behaviour. Revisiting lesson planning and prac expectations.. Micro-teaching activities. Readings/Ref: 1 (Chapter 8); APST: 1.1,1.2, 3.5, 4.1, 4.3, 7.1, 7.2",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Professional experience</strong><br/><p>10 day block in schools Observations, hands-on classroom assistance, planning and teaching segments of lessons and full lessons. </p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Professional experience</strong>",
            "topic_description": "Professional experience 10 day block in schools Observations, hands-on classroom assistance, planning and teaching segments of lessons and full lessons.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 11(07 Oct - 13 Oct)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Professional experience</strong><br/><p>10 day block in schools Observations, hands-on classroom assistance, planning and teaching segments of lessons and full lessons. </p>\n<p>Public Holiday 7th October</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Professional experience</strong>",
            "topic_description": "Professional experience 10 day block in schools Observations, hands-on classroom assistance, planning and teaching segments of lessons and full lessons. Public Holiday 7th October",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Plan for &amp; implement effective teaching &amp; learning</strong><br/><p>Reflection on professional experience (part 1). Reflection on Lesson planning. Teaching strategies for learning activities and physical layout of learning space. Strategies for developing literacy and numeracy skills.</p>\n<p>Micro-teaching activities</p>\n<p>Read/Ref: Chapter 5</p>\n<p>APST: 3.1 - 3.7</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Plan for &amp; implement effective teaching &amp; learning</strong>",
            "topic_description": "Plan for & implement effective teaching & learning Reflection on professional experience (part 1). Reflection on Lesson planning. Teaching strategies for learning activities and physical layout of learning space. Strategies for developing literacy and numeracy skills. Micro-teaching activities Read/Ref: Chapter 5 APST: 3.1 - 3.7",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Where to from here?; Professional learning</strong><br/><p>Reflection on the professional experience (part 2). Identifying professional learning needs and goals for continuous growth and development as a pre-service teacher, including the importance of links with the Australian Professional Standards for Teachers.</p>\n<p>Micro-teaching Activities</p>\n<p>Read/Ref: Chapter 9</p>\n<p>APST: 1-7</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Where to from here?; Professional learning</strong>",
            "topic_description": "Where to from here?; Professional learning Reflection on the professional experience (part 2). Identifying professional learning needs and goals for continuous growth and development as a pre-service teacher, including the importance of links with the Australian Professional Standards for Teachers. Micro-teaching Activities Read/Ref: Chapter 9 APST: 1-7",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        }
    ]
}