{
    "course_title": "Building Inclusive Primary Classrooms",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC3760-60653-7460",
    "full_course_code": "EDUC3760-60653-7460",
    "course_code": "EDUC3760",
    "class_code": "60653",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate an awareness of recent developments in research into effectively teaching in inclusive primary classroom environments and the differentiation of teaching in ways that are responsive to the learning strengths and needs of students across the full range of abilities and that take account of the impact on learning of diverse backgrounds (e.g. linguistic, Indigenous, cultural, religious and socio-economic)."
        },
        {
            "number": "LO2.",
            "description": "Critically reflect on legislative requirements, system policies and processes, positive behaviour supports and teaching strategies that promote student wellbeing and safety, and support participation and learning of all students with a focus on those with disabilities."
        },
        {
            "number": "LO3.",
            "description": "Plan challenging learning goals and effectively organise classroom activities for all students using age-appropriate curriculum and evidence-based approaches to differentiated teaching."
        },
        {
            "number": "LO4.",
            "description": "Explain approaches for interpreting student data and strategies for working effectively, sensitively and confidentially with others, including parents/carers and draw on external professionals and community representatives expertise to action a personalised learning plan and modify teaching practices."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate clear, fluent, and coherent communication skills consistent with personal, professional and academic conventions."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Assessment Task 1: Annotated Bibliography",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>30% 2,000 words (10% leeway) </dd>",
            "due_date": "<dd><p> 9/08/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L03, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Please ensure you carefully read the task description and marking criteria on the course Blackboard.</strong></p>\n<p>For this task, you will undertake a study on some of the available literature to investigate a learning need, selected from one of the following options. It is expected that you will focus on an aspect of interest to you within one of the areas of learning need.</p>\n<ul>\n<li><strong>Language – e.g. multilingualism, dyslexia, low literacy level, developmental language disorder</strong></li>\n<li><strong>Social / emotional – e.g. Autism Spectrum Disorder, Mental Health impacts</strong></li>\n<li><strong>Learning attainment – e.g. low attainment, gifted learners</strong></li>\n<li><strong>Physical and sensory – e.g. vision impairment, sensory sensitivity, Cerebral Palsy</strong></li>\n<li><strong>Culture – e.g. Indigeneity, religion, sexuality, socioeconomic status</strong></li>\n</ul>\n<p>You are to prepare an annotated bibliography of <strong>five</strong> key references and draw implications for teaching. In selecting your references you are to include:</p>\n<ul>\n<li>One relevant chapter from the set textbook for this course (Ashman, 2019, 6th ed.)</li>\n<li>One chapter from another book of your choice (within the last five years)</li>\n<li>One journal article from the reference list of one of the above chapters (within the last ten years)</li>\n<li>Two other relevant research articles published within the last five years.</li>\n</ul>\n<p><strong>Required Components: </strong></p>\n<p>In approximately 2,000 words, include:</p>\n<ul>\n<li>An introduction specifying your selected learning need and your specialisation teaching area</li>\n<li>For each of the five references, include the following contents:</li>\n<li>Full bibliographic citation in APA 7th format</li>\n<li>Specify the content or scope of the reference and the intended audience</li>\n<li>Summarise the main points</li>\n<li>Identify any conclusions or implications made by the author/s</li>\n<li>Discuss the relevance to your primary specialisation (e.g., Mathematics; English; Science; HASS), connections to the APSTs, strengths and limitations of the work, and other applicable issues</li>\n<li>Conclude with implications and recommendations from your analysis of the five references as a set for your teaching.</li>\n</ul>\n<p><strong>The submission is formatted in a Word document (2cm margins, 11-point font, 1.5 line spacing). Place the word count on the top of the submission. </strong>No cover page is needed.</p>\n<p><strong>Use of inclusive language</strong></p>\n<p><strong>Use of APA conventions   </strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The assignment is to be submitted as a Word document<strong> </strong>and uploaded to <em>Turnitin</em> on Blackboard. Aim to submit at least a day prior to the due date so you can check the originality report and revise your work if necessary. The percentage value is not always indicative of incorrect citation. Check the match and re-edit or revise where needed. You are allowed to have unlimited attempts of submission until the due day and time. Only the last attempt will be marked. Allow yourself plenty of time to submit your final version by the due date and time.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Assessment Task 2: Adjusted Learning Activity Development",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>30% 2,000 words (4 pages max.) </dd>",
            "due_date": "<dd><p> 8/10/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L03, L04, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Product/ Design",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Please ensure you carefully read the task description and marking criteria on the course Blackboard.</strong></p>\n<p>In this task, you will <strong>plan a learning activity in a 40-minute lesson to meet the needs of a range of students</strong> such as those with disability, from diverse linguistic, cultural, religious, and socio-economic backgrounds, including Indigenous learners, and with a range of abilities.</p>\n<p>The learning activity must be applicable to a year level of your choice based on the Australian Curriculum and within your area of specialisation (e.g., Mathematics/Numeracy; English/Literacy; Science; Humanities and Social Sciences). </p>\n<p>Drawing on relevant legislative and policy documents and using the principles of differentiated instruction and Universal Design for Learning (UDL), you will plan a lesson demonstrating teaching strategies that support student participation and learning (including strategies for teaching Aboriginal and Torres Strait Islander students), as well as strategies for assessing what students know or are able to do as a result of the lesson. In addition to the general planning for all, you will plan adjustments based on a learning need such as you investigated for Task 1, indicating appropriate strategies and adjustments for teaching and assessing a student with that need.</p>\n<p> Include:</p>\n<ul>\n<li><strong>A brief overview </strong>(no more than one A4 page) explaining the context for the lesson such as: teaching area, year level, the specific learning need you have addressed and a discussion of relevant APST standards. This is to provide background for the lesson.</li>\n<li><strong>Planning for the lesson,</strong> in a format of your choice (in a table template). Establish learning goals that provide achievable challenges for students of varying abilities and characteristics. This should be a maximum of two pages A4, including clear sequences of the activity in the lesson, resources, “differentiation for all” and “adjustments for the focused need”, with a clear indication of the UDL features applied (guideline code and descriptor, e.g., 3.1 Activate or supply background knowledge). UDL design features for:</li>\n</ul>\n<p>- Multiple means of engagement (stimulate interest and motivation for learning)</p>\n<p>- Multiple means of representation (present information and content in different ways)</p>\n<p>- Multiple means of action and expression (differentiate ways to assess learning outcomes that allow students to show what they know or can do).</p>\n<p>        (All resources should include enabling and extending prompts.)</p>\n<ul>\n<li><strong>Explanation of adjustments</strong> designed to meet the learning need you have investigated (maximum one A4 page) through a brief explicit reference to the legislative requirements of your context and justifications based on evidence from academic and/or research literature.</li>\n<li> <strong>References </strong>(This section is not counted in the 4 pages requirement)  </li>\n</ul>\n<p><strong>Use of APA conventions</strong></p>\n<p><strong>Use of Inclusive language </strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The assignment is to be submitted to <em>Turnitin</em> link on the Blackboard. Aim to submit at least a day prior to the due date so you can check the originality report and revise your referencing if necessary. The percentage value is not always indicative of incorrect citation. Check the similarities and re-edit or revise them where necessary. You are allowed to have unlimited attempts until the due date and time. Only the last submission will be marked. <strong>Allow yourself plenty of time to submit your final copy by the due date and time. </strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Assessment Task 3: Case Study Report: Response to Scenario",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>40% 3,000 words (6 pages max.) </dd>",
            "due_date": "<dd><p> 25/10/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Please ensure you carefully read the task description and marking criteria on the course Blackboard.</strong></p>\n<p>This is a culminating task where you will build on your understandings of building inclusive classrooms by documenting preparations for a meeting with parents.</p>\n<p><strong>Scenario:</strong></p>\n<p><strong>The parents of a student in your year 2 class have asked to meet with you to discuss how you will accommodate their child’s learning needs as specified in the Personalised Learning Plan (PLP)*. Please see the PLP on the Blackboard. </strong></p>\n<p>In this task, you will document your preparation for the meeting, including the following:</p>\n<ol>\n<li>A brief discussion of the relevant legislation and policy documents. (Three levels of legislation including choosing a jurisdiction where you plan to teach). Legislative and academic references should be included. </li>\n<li>An indication of the assessment data you would study prior to the meeting to provide background on the student’s progress. Acknowledge the sources where appropriate. </li>\n<li>An overview of your study of the PLP provided, including a plan for the teaching and assessment adjustments and behaviour support you would make in your program and to the classroom environment (as appropriate) to ensure effective learning and support inclusive student engagement in the classroom.<strong> </strong>Use evidence from literature to support your justifications on adjustments made.  </li>\n<li>An overview of your investigation of applicable external professionals and community representatives including professional support networks, such as disability associations, and other community groups for extending your personal professional knowledge and practice. (In a table including the title, URL, key features, utility and how to use)</li>\n<li>A plan for the meeting</li>\n</ol>\n<ul>\n<li>Location, timing, seating arrangement, refreshments etc.</li>\n<li>Introductions – opportunity for parents to indicate what they wish to gain from the meeting</li>\n<li>How you will indicate to parents that you seek their input and advice and how you intend to collaborate with them through the year</li>\n<li>Explanation of learning adjustments applicable to subject areas (including your specialisation) in response to the student’s PLP</li>\n<li>Explanation of reasonable adjustments planned for assessment</li>\n<li>Explanation of your plan for the student’s wellbeing and safety, including positive behaviour support processes (practical approaches to managing challenging behaviours).</li>\n</ul>\n<p>         6. Follow up</p>\n<ul>\n<li>Keep a record of the conversation</li>\n<li>Further meetings</li>\n</ul>\n<p>         References (This section is not counted in the word count) </p>\n<p><strong>Use headings to guide the reader.</strong> In Sections 1-3, use formatting: 2 cm margins, 11-point font, 1.5 line spacing. It is suggested that you organise Sections 4-6 in table format and use formatting that suits the table format.  </p>\n<p><strong>Use of APA conventions</strong></p>\n<p><strong>Use of inclusive language </strong></p>\n<p>* Each year, a new PLP would be generated using the current model required by Education Queensland. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The assignment is to be submitted to <em>Turnitin</em> link on the Blackboard. Aim to submit at least a day prior to the due date so you can check the originality report and revise your referencing if necessary. The percentage value is not always indicative of incorrect citation. Check the similarities and re-edit or revise them where necessary. You are allowed to have unlimited attempts until the due date and time. Only the last submission will be marked. <strong>Allow yourself plenty of time to submit your final copy by the due date and time. </strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture and Tutorial  1 - Module 1: Building an evidence base</strong><br/><p>Course overview and embracing inclusion and challenges (APST 1.1, 1.2, 1.3, 1.4, 1.6, 3.7, 4.1, 4.2)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Lecture and Tutorial  1 - Module 1: Building an evidence base</strong>",
            "topic_description": "Lecture and Tutorial  1 - Module 1: Building an evidence base Course overview and embracing inclusion and challenges (APST 1.1, 1.2, 1.3, 1.4, 1.6, 3.7, 4.1, 4.2)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture and Tutorial  2 - Module 2: Understanding the legislative context and positive behaviour support </strong><br/><p>(APST 1.2, 1.3, 1.4, 1.5, 1.6, 2.1, 2.2, 2.3, 2.4, 3.1, 3.2, 3.3, 3.4, 3.5, 3.6, 3.7, 4.1, 4.2, 4.3, 5.1, 7.2)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Lecture and Tutorial  2 - Module 2: Understanding the legislative context and positive behaviour support </strong>",
            "topic_description": "Lecture and Tutorial  2 - Module 2: Understanding the legislative context and positive behaviour support (APST 1.2, 1.3, 1.4, 1.5, 1.6, 2.1, 2.2, 2.3, 2.4, 3.1, 3.2, 3.3, 3.4, 3.5, 3.6, 3.7, 4.1, 4.2, 4.3, 5.1, 7.2)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture and Tutorial  3 - Module 3(1): Building a teaching program</strong><br/><p>Curriculum adaptations and inclusive teaching approaches (APST 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 2.1, 2.2, 2.3, 3.1, 3.2, 3.3, 3.4, 4.1, 4.2, 5.1)</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Lecture and Tutorial  3 - Module 3(1): Building a teaching program</strong>",
            "topic_description": "Lecture and Tutorial  3 - Module 3(1): Building a teaching program Curriculum adaptations and inclusive teaching approaches (APST 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 2.1, 2.2, 2.3, 3.1, 3.2, 3.3, 3.4, 4.1, 4.2, 5.1)",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 4 To Week 7(12 Aug - 08 Sep)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Professional experience placement </strong><br/></p></div></td>",
            "topic_title": "<strong>Professional experience placement </strong>",
            "topic_description": "Professional experience placement",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture and Tutorial  4 - Module 3(2): Building a teaching program</strong><br/><p>Supporting social and interpersonal development (APST 1.1, 1.2, 1.5, 1.6, 2.1, 2.2, 3.1, 3.2, 3.3, 3.4, 3.5, 4.1, 4.2, 4.3)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Lecture and Tutorial  4 - Module 3(2): Building a teaching program</strong>",
            "topic_description": "Lecture and Tutorial  4 - Module 3(2): Building a teaching program Supporting social and interpersonal development (APST 1.1, 1.2, 1.5, 1.6, 2.1, 2.2, 3.1, 3.2, 3.3, 3.4, 3.5, 4.1, 4.2, 4.3)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture and Tutorial  5 - Module 3(3): Building a teaching program </strong><br/><p>Technologies for inclusion and supporting outstanding learners and students with intellectual disabilities (APST 1.2, 1.3, 1.5, 1.6, 2.1, 2.2, 2.3, 2.5, 2.6, 3.1, 3.2, 3.3, 3.4, 5.1)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Lecture and Tutorial  5 - Module 3(3): Building a teaching program </strong>",
            "topic_description": "Lecture and Tutorial  5 - Module 3(3): Building a teaching program Technologies for inclusion and supporting outstanding learners and students with intellectual disabilities (APST 1.2, 1.3, 1.5, 1.6, 2.1, 2.2, 2.3, 2.5, 2.6, 3.1, 3.2, 3.3, 3.4, 5.1)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture and Tutorial  6 - Module 3(4): Building a teaching program </strong><br/><p>Supporting diverse needs of literacy (APST 1.3, 1.4, 1.5, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 3.2, 3.3, 3.4, 3.5, 4.1, 5.1, 5.2, 5.4, 5.5)</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Lecture and Tutorial  6 - Module 3(4): Building a teaching program </strong>",
            "topic_description": "Lecture and Tutorial  6 - Module 3(4): Building a teaching program Supporting diverse needs of literacy (APST 1.3, 1.4, 1.5, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 3.2, 3.3, 3.4, 3.5, 4.1, 5.1, 5.2, 5.4, 5.5)",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 11(07 Oct - 13 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Preparation of Assessment Task 2 </strong><br/><p>Assistance of Assignment 2 will be provided (APST: 1.3; 1.4; 2.4) </p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Preparation of Assessment Task 2 </strong>",
            "topic_description": "Preparation of Assessment Task 2 Assistance of Assignment 2 will be provided (APST: 1.3; 1.4; 2.4)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture and Tutorial 7 - Module 3(5): Building a teaching program</strong><br/><p>Supporting diverse needs of numeracy (APST 1.3, 1.4, 1.5, 2.1, 2.2, 2.3, 2.5, 2.6, 3.2, 3.3, 3.4, 3.5, 4.1, 5.1, 5.2, 5.4, 5.5)</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Lecture and Tutorial 7 - Module 3(5): Building a teaching program</strong>",
            "topic_description": "Lecture and Tutorial 7 - Module 3(5): Building a teaching program Supporting diverse needs of numeracy (APST 1.3, 1.4, 1.5, 2.1, 2.2, 2.3, 2.5, 2.6, 3.2, 3.3, 3.4, 3.5, 4.1, 5.1, 5.2, 5.4, 5.5)",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture and Tutorial 8 - Module 4: Building a community of practice and class review </strong><br/><p>Working with parents/carers, specialist teacher and other professionals; using student data; community resources; class review (APST 3.7, 4.3, 5.4, 5.5, 7.3, 7.4)</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Lecture and Tutorial 8 - Module 4: Building a community of practice and class review </strong>",
            "topic_description": "Lecture and Tutorial 8 - Module 4: Building a community of practice and class review Working with parents/carers, specialist teacher and other professionals; using student data; community resources; class review (APST 3.7, 4.3, 5.4, 5.5, 7.3, 7.4)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}