{
    "course_title": "Primary Professional Experience 1",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC7530-60739-7460",
    "full_course_code": "EDUC7530-60739-7460",
    "course_code": "EDUC7530",
    "class_code": "60739",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate an understanding of teaching as a dynamic and challenging form of professional work."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate an understanding of the diverse backgrounds, development and characteristics of students, and how these may affect learning, and teaching strategies to meet the specific learning needs of students across the full range of abilities."
        },
        {
            "number": "LO3.",
            "description": "Know and understand literacy and numeracy teaching strategies and their application in learning areas."
        },
        {
            "number": "LO4.",
            "description": "Identify and implement teaching strategies, including the use of ICTs, that provide students with appropriate, challenging learning goals and an engaging yet safe and supportive learning environment."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate understanding of assessment strategies (including informal and formal, diagnostic, formative and summative approaches), the purpose of assessment moderation and a range of strategies for reporting to students and parents/carers."
        },
        {
            "number": "LO6.",
            "description": "Demonstrate broad knowledge of strategies that can be used to evaluate teaching programs to improve student learning."
        },
        {
            "number": "LO7.",
            "description": "Recognise and understand the place of legislative, school, employing authority requirements and systemic assessment data in the teaching and learning process."
        },
        {
            "number": "LO8.",
            "description": "Demonstrate knowledge of relevant codes of practices and critical reflection on the technical and communication skills required to interact effectively with students, care givers and fellow professionals in an educational environment."
        },
        {
            "number": "LO9.",
            "description": "Demonstrate clear, fluent, and coherent communication skills consistent with personal, professional and academic conventions."
        },
        {
            "number": "LO10.",
            "description": "Demonstrate all teaching and professional requirements of the professional experience placement."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Policies & Procedures for Professional Experience",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 29/07/2024</p></dd>",
            "learning_objectives": "L07, L08",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Participation/ Student contribution",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students must read the Policies and Procedures for Professional Experience Placements document and respond to the statement declaration on Blackboard by the due date. Failure to do so will result in a withdrawal of the placement and the awarding of a grade of Fail for the course. </p>\n<p>APST: 4, 7</p>\n<p>Statement:</p>\n<p><strong>I have read, understood and will abide by, the 2021 Policies and Procedures for Professional Experience Placements.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Completion of declaration statement on Blackboard to acknowledge that the student has read, understood and will abide by the policies and procedures.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Professional Experience (Report)",
            "special_indicators": [],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 18/10/2024</p>\n<p>\n</p><p>A 2 week block</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L08, L09, L10",
            "mode": "Activity/ Performance",
            "category": "Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p> </p>\n<p><strong>Two week block (10 days) - 30/09- 11/10</strong></p>\n<p>You are required to attend a school allocated to you by the university in order to observe teaching practice, school life, students, and develop observation and communication skills within a school context. You will have one day per week for two consequitive weeks in a school and 100% attendance is mandatory. It is not acceptable to load single day visits into a reduced number of weeks.</p>\n<p><strong>You are required to be at the school at least half an hour before school starts. </strong></p>\n<p>Illness preventing attendance on your observation day must be notified to the placements administrator, education@uq.edu.au, the course coordinator, your teacher and the school coordinator. Missed days must be made up and negotiated to the satisfaction of the school. Work is NOT acceptable as a reason for missing an observation day.</p>\n<p>Throughout the semester you will be required to attend on-campus workshops to prepare you for your observation days. Attendance is required for all of these workshops <strong>or you may jeopardise your placement.</strong> Any missed classes must be supported by medical certificates or other supporting documentation. Alternate assessment may be required to compensate for the missed days at the discretion of the course coordinator.</p>\n<p>Your supervising teacher/s will prepare a report at the end of the 10 week period that will advise on your performance in the school context and will determine your outcome for the observation practicum.</p>\n<p><strong>NOTE: all students are responsible for the collection of original evaluation forms. These are to be uploaded to Blackboard on completion of the practicum (Monday 21st October). Failure to upload the practicum evaluation forms to the Blackboard site may result in a failing grade being awarded for the course. Please do NOT assume that your teacher will forward the form to the university or that the teacher will upload the form to Blackboard.</strong></p>\n<p>APST: 2.1, 2.2, 2.5, 2.6, 3.1, 4.2, 4.3, 6.3, 7.1, 7.2 </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Upload to link via Blackboard.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Implementation of Recent Educational Developments",
            "special_indicators": [],
            "weighting": "<dd> Pass/Fail 2000 words </dd>",
            "due_date": "<dd><p> 18/10/2024</p></dd>",
            "learning_objectives": "L02, L03, L04, L05, L06, L09",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>As part of your observations during the 10 day block palcement, you are required to investigate and critically analyse the ways in which literacy and numeracy initiatives are implemented in your school and specifically in the classrooms you have been observing.</p>\n<p>Prepare a report of 2000 words that clearly and coherently demonstrates your knowledge and understanding of recent developments in literacy and numeracy and how that is carried out in your specific school’s context. You must include a context for the report and a literacy and numeracy profile of the students in your placement school that draws on systemic assessment data for the school, class and focus students (school analysis e.g., PATM, PATR, NAPLAN). Your report should also evaluate a specific literacy or numeracy teaching program at your placement school. You should evaluate the learning program and its purported relationship with student learning. Your report should conclude with recommendations to adapt/modify/change the program for the purpose of improving student learning. Your report will be supported by evidence from your observation days with examples or case studies drawn from the classrooms you have been observing. You will also support your writing with references to academic literature.</p>\n<p>Your report should also demonstrate your knowledge and understanding of the following focus areas:</p>\n<p>o Strategies for differentiating teaching to meet the specific learning needs of students across the full range of abilities (specifically in literacy and</p>\n<p>numeracy)</p>\n<p>o Literacy and numeracy teaching strategies and their application in teaching areas</p>\n<p>o Assessment strategies, including informal and formal, diagnostic, formative and summative approaches to assess student learning (specifically in</p>\n<p>literacy and numeracy).</p>\n<p>Please make sure you de-identify the school, teachers and students in your report.</p>\n<p>APST: 1.5, 2.5, 3.6, 5.1, 5.4</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Upload to link via Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Observations, lesson plans & teaching philosophy",
            "special_indicators": [],
            "weighting": "<dd> Pass/Fail 3000 words </dd>",
            "due_date": "<dd><p> 13/11/2024</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L09",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>From your ten-day professional experience placement you are required to collate and present a portfolio containing a summary of observations, planning notes and a personal teaching philosophy.</p>\n<p> </p>\n<p><strong>Part A – Summary of observations</strong></p>\n<p>You are to prepare a 2000-word summary of observations that addresses all of the following topics:</p>\n<p>·       Understanding the school environment and being a teacher;</p>\n<p>·       Knowing your learners (physical, social and intellectual development and characteristics of students and how these may affect learning);</p>\n<p>·       Literacy and numeracy teaching strategies/programs and their application in the classroom and school;</p>\n<p>·       Practical approaches to manage challenging behaviour;</p>\n<p>·       Assessment (moderation of assessment and reporting mechanisms, the purpose of keeping accurate and reliable records).</p>\n<p>In order to write the summary of observations, you should refer to the notes that you compiled for the various observation focus areas.</p>\n<p> </p>\n<p><strong>Part B - Planning notes and reflections</strong></p>\n<p>During the placement you have had the opportunity to plan for and present segments of lessons/mini lessons and full lessons (where possible).</p>\n<p>1.    You are to include three examples of plans that you created and presented and provide a personal reflection for each. Your reflection should address what went well and what you would improve for next time (150-200 words).</p>\n<p>2.     Based on these personal reflections and feedback provided by your supervising teacher(s), you are required to identify three professional learning goals that will guide your next professional experience placement. You should link your professional learning goals to relevant Australian Professional Standards for Teachers and their focus areas (you may present your goals as dot points).</p>\n<p> </p>\n<p><strong>Part C - Personal teaching philosophy</strong></p>\n<p>In reference to Part A and B and through reflection on the professional experience placement and your journey to date in the program, prepare a 500-word personal teaching philosophy that captures and presents how you will aim to ensure that your teaching has a positive impact on student learning.  This statement should also identify your values, beliefs and ideas about teaching and the type of teacher you will aim to become. </p>\n<p>The three domains from the Australian Professional Standards for Teachers may help you frame your philosophy.</p>\n<p>This will be an important and valuable statement to revisit as you progress through the professional experience courses and the Master of Teaching (Primary) program.</p>\n<p> </p>\n<p>APST: 1.1, 2.1, 2.2, 2.5, 4.3, 5.3, 5.5, 6.1, 6.3</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Upload to link via Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>An introduction to being a teacher &amp; school life</strong><br><p>Role of a teacher; Qualities of a good teacher; Standards; Code of Ethics.<br/>\nThe school environment (who are the various stakeholders)?</p></br></p><p><strong>Learning outcomes:</strong> L01, L06, L08, L09, L10</p></div></td>",
            "topic_title": "<strong>An introduction to being a teacher &amp; school life</strong>",
            "topic_description": "An introduction to being a teacher & school life Role of a teacher; Qualities of a good teacher; Standards; Code of Ethics. The school environment (who are the various stakeholders)?",
            "learning_outcomes": [
                "L01",
                "L06",
                "L08",
                "L09",
                "L10"
            ]
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Professional Issues</strong><br><p>School visit protocols - legal issues, statutory obligations including occupational safety and child protection policies.<br/>\nHow to work effectively with supervising teachers and respond appropriately to feedback designed to improve teaching practices.<br/>\nClassroom observation skills.</p></br></p><p><strong>Learning outcomes:</strong> L01, L06, L08, L09, L10</p></div></td>",
            "topic_title": "<strong>Professional Issues</strong>",
            "topic_description": "Professional Issues School visit protocols - legal issues, statutory obligations including occupational safety and child protection policies. How to work effectively with supervising teachers and respond appropriately to feedback designed to improve teaching practices. Classroom observation skills.",
            "learning_outcomes": [
                "L01",
                "L06",
                "L08",
                "L09",
                "L10"
            ]
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Literacy &amp; numeracy across the curriculum</strong><br><p>Literacy and numeracy teaching strategies/programs and their application in the classroom and school.</p>\n<p>Microteaching activities.</p></br></p><p><strong>Learning outcomes:</strong> L03, L05, L10</p></div></td>",
            "topic_title": "<strong>Literacy &amp; numeracy across the curriculum</strong>",
            "topic_description": "Literacy & numeracy across the curriculum Literacy and numeracy teaching strategies/programs and their application in the classroom and school. Microteaching activities.",
            "learning_outcomes": [
                "L03",
                "L05",
                "L10"
            ]
        },
        {
            "learning_period": "Week 4(12 Aug - 18 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Know students and how they learn (Workshop):</strong><br><p>Understanding the physical, social and intellectual development and characteristics of students and how these may affect learning and the implications for teaching.</p>\n<p>Microteaching activities.</p></br></p><p><strong>Learning outcomes:</strong> L02, L10</p></div></td>",
            "topic_title": "<strong>Know students and how they learn (Workshop):</strong>",
            "topic_description": "Know students and how they learn (Workshop): Understanding the physical, social and intellectual development and characteristics of students and how these may affect learning and the implications for teaching. Microteaching activities.",
            "learning_outcomes": [
                "L02",
                "L10"
            ]
        },
        {
            "learning_period": "Week 5(19 Aug - 25 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>An introduction to lesson planning</strong><br/><p>Setting learning goals and objectives for student learning making links within curriculum requirements and knowledge of how students learn.</p>\n<p>Microteaching activities.</p></p><p><strong>Learning outcomes:</strong> L04, L07, L10</p></div></td>",
            "topic_title": "<strong>An introduction to lesson planning</strong>",
            "topic_description": "An introduction to lesson planning Setting learning goals and objectives for student learning making links within curriculum requirements and knowledge of how students learn. Microteaching activities.",
            "learning_outcomes": [
                "L04",
                "L07",
                "L10"
            ]
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction to classroom and behaviour management</strong><br/><p>Classroom organisation - routines and strategies.<br/>\nPractical approaches to manage challenging behaviour.</p>\n<p>Microteaching activities.</p></p><p><strong>Learning outcomes:</strong> L02, L04, L09, L10</p></div></td>",
            "topic_title": "<strong>Introduction to classroom and behaviour management</strong>",
            "topic_description": "Introduction to classroom and behaviour management Classroom organisation - routines and strategies. Practical approaches to manage challenging behaviour. Microteaching activities.",
            "learning_outcomes": [
                "L02",
                "L04",
                "L09",
                "L10"
            ]
        },
        {
            "learning_period": "Week 7(02 Sep - 08 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Plan for &amp; implement effective teaching&amp;learning 1</strong><br><p>Lesson planning.<br/>\nTeaching strategies for learning activities and physical layout of learning space.</p>\n<p>Microteaching activities.</p></br></p><p><strong>Learning outcomes:</strong> L02, L04, L06, L07, L10</p></div></td>",
            "topic_title": "<strong>Plan for &amp; implement effective teaching&amp;learning 1</strong>",
            "topic_description": "Plan for & implement effective teaching&learning 1 Lesson planning. Teaching strategies for learning activities and physical layout of learning space. Microteaching activities.",
            "learning_outcomes": [
                "L02",
                "L04",
                "L06",
                "L07",
                "L10"
            ]
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Plan for &amp; implement effective teaching&amp;learning 2</strong><br><p>Lesson planning. Teaching strategies for learning activities and physical layout of space.</p>\n<p>Microteaching activities.</p></br></p><p><strong>Learning outcomes:</strong> L02, L04, L06, L07, L10</p></div></td>",
            "topic_title": "<strong>Plan for &amp; implement effective teaching&amp;learning 2</strong>",
            "topic_description": "Plan for & implement effective teaching&learning 2 Lesson planning. Teaching strategies for learning activities and physical layout of space. Microteaching activities.",
            "learning_outcomes": [
                "L02",
                "L04",
                "L06",
                "L07",
                "L10"
            ]
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Planning &amp; Communication within a school community</strong><br/><p>Planning continued.</p>\n<p>Understanding the school environment and being a teacher.</p>\n<p>Microteaching activities.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09, L10</p></div></td>",
            "topic_title": "<strong>Planning &amp; Communication within a school community</strong>",
            "topic_description": "Planning & Communication within a school community Planning continued. Understanding the school environment and being a teacher. Microteaching activities.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09",
                "L10"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 10 To Week 11(30 Sep - 13 Oct)",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Two week block placement</strong><br><p>Ten days of full time supervised practicum in a school setting. Observations, hands-on classroom assistance, planning and teaching segments of lessons and full lessons.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09, L10</p></div></td>",
            "topic_title": "<strong>Two week block placement</strong>",
            "topic_description": "Two week block placement Ten days of full time supervised practicum in a school setting. Observations, hands-on classroom assistance, planning and teaching segments of lessons and full lessons.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09",
                "L10"
            ]
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Assessment</strong><br/><p>Systemic data   school, class, focus on students   for example PATM,<br/>\nPATR, NAPLAN; moderation of assessment, reporting mechanisms and the purpose of<br/>\nkeeping accurate and reliable records.</p></p><p><strong>Learning outcomes:</strong> L05, L06, L07, L10</p></div></td>",
            "topic_title": "<strong>Assessment</strong>",
            "topic_description": "Assessment Systemic data   school, class, focus on students   for example PATM, PATR, NAPLAN; moderation of assessment, reporting mechanisms and the purpose of keeping accurate and reliable records.",
            "learning_outcomes": [
                "L05",
                "L06",
                "L07",
                "L10"
            ]
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Where to from here?</strong><br><p>Reflection on the professional experience.<br/>\nIdentifying professional learning needs and goals for continuous growth and development as a preservice teacher, including the importance of links with the Australian Professional Standards for Teachers.</p>\n<p>Recap of key assessment tasks.</p>\n<p>Reflection on course and preparing for future professional experience.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09, L10</p></div></td>",
            "topic_title": "<strong>Where to from here?</strong>",
            "topic_description": "Where to from here? Reflection on the professional experience. Identifying professional learning needs and goals for continuous growth and development as a preservice teacher, including the importance of links with the Australian Professional Standards for Teachers. Recap of key assessment tasks. Reflection on course and preparing for future professional experience.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09",
                "L10"
            ]
        }
    ]
}