{
    "course_title": "Teachers as Educational Innovators and Agents of Change",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC7604-62434-7460",
    "full_course_code": "EDUC7604-62434-7460",
    "course_code": "EDUC7604",
    "class_code": "62434",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate comprehensive, critical understanding of contemporary educational innovation and change."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate a sophisticated understanding of strategies to support their work as innovators and change agents in classroom and school contexts."
        },
        {
            "number": "LO3.",
            "description": "Articulate ways in which innovation and change can contribute to improved teaching practice and enhanced learning opportunities for students."
        },
        {
            "number": "LO4.",
            "description": "Demonstrate knowledge of teaching strategies to engage students in their learning and expand curriculum learning opportunities through appropriate selection of resources, with particular emphasis on safe, responsible and ethical use of ICT."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate knowledge of strategies to effectively evaluate teaching programs."
        },
        {
            "number": "LO6.",
            "description": "Demonstrate understanding of appropriate sources of engaging in professional learning."
        },
        {
            "number": "LO7.",
            "description": "Demonstrate clear, fluent, and coherent communication skills, including verbal and non-verbal communication skills, consistent with personal, professional and academic conventions."
        },
        {
            "number": "LO8.",
            "description": "Work effectively and collaboratively in teams to make informed team decisions, demonstrate interpersonal, leadership and communication skills, and critically evaluate personal and peer contributions to team processes."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Weekly Reading Response in RiPPLE",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>15% 300-500 words </dd>",
            "due_date": "<dd><p> Week 1 Mon - Week 8 Thu</p>\n<p>\n</p><p>No submission in week 7.</p></dd>",
            "learning_objectives": "L01, L02, L03, L07, L08",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Participation/ Student contribution",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>For most contact weeks, you will be required to write approximately 300 - 500 words in response to that week’s course content and concepts via the UQ RiPPLE platform. These responses are then moderated by two peers through this same platform. As such, this task requires you to (i) develop your own response and (ii) moderate two of your peers’ responses. You are assessed on both the quality of your reading response and the quality of your feedback in the moderations.</p>\n<ul>\n<li>You will submit seven reading responses in total:</li>\n<li>Weeks 1 - 6 and 8.</li>\n<li>You will moderate three peer responses in each of those seven submissions.</li>\n<li>The RIPPLE Resource Creation portal for reading responses opens every Monday after the lecture. You have until Thursday to submit your reading resource.</li>\n<li>The window to moderate three of your peer resources opens on Wednesday and is due 10am on Monday before the lecture.</li>\n</ul>\n<p><strong>Steps</strong></p>\n<ol>\n<li>After engaging with the required and/or recommended readings, draw on the 4R Reflection model to write approximately 500 words in response to one of these readings. You can view exemplars and read an explanation of the 4R Reflection Model in <em>Blackboard&gt;Assessment&gt;Weekly reading response. </em></li>\n<li>Upload your response by the due date to the Weekly Reading Response folder in <em>Blackboard&gt;Assessment</em> where you will find a link to the UQ RiPPLE platform.</li>\n<li>Using the ‘Moderate’ function in RiPPLE, provide two sentences of feedback to three peers. Ensure that your moderation articulates the reasons for your judgement against the assessment criteria e.g., specific evidence/examples from the response.</li>\n<li>After moderation, each student will receive their reading response and associated moderation feedback through the RiPPLE platform.</li>\n<li>No references are needed.</li>\n</ol>\n<p><strong>Please note:</strong></p>\n<ul>\n<li>This is an in-class assessment item and you CANNOT apply for an extension via the Unitask portal. </li>\n<li>To receive credit for each submission, you must complete both a reading response and a moderation of three peer reading responses. If you complete only one or the other, you will receive no credit for that week’s submission. For example, if you complete your reading response but only complete one peer moderation, you will not receive any credit for that week. </li>\n<li>You can calculate your grade for this task as a percentage e.g., 5 / 7 x 100 = 71.4% = 5 overall. </li>\n</ul>\n<p><br/></p>\n<p>To receive credit for each submission, you must complete both a reading response and a moderation of three peer reading responses. If you complete only one or the other, you will receive no credit for that week’s submission. For example, if you complete your reading response but only complete one peer moderation, you will not receive any credit for that week</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submitted through Blackboard each week using the RiPPLE platform.<br/>\nBlackboard&gt;Assessment&gt;Reading responses</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Professional Development 'Byte'",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>25% 1000 words (annotated bibliography) </dd>",
            "due_date": "<dd><p> 6/09/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L04, L06, L07, L08",
            "mode": "Activity/ Performance",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>APST Assessed: 2.6, 3.4, 3.5, 4.5, 6.2</p>\n<p>Length: 20 mins + 1000-word annotated bibliography and teaching resources (no word limit applied to teaching resources)</p>\n<p><strong>Task Description</strong></p>\n<p>The first step of this task is to create groups. Each group should have 5 members.</p>\n<ul>\n<li>Go to Blackboard</li>\n<li>Assessments</li>\n<li>AT2 PD Byte</li>\n<li>Group sign on sheet</li>\n</ul>\n<p>In small groups of up to 4 students, you will collaboratively design a professional development (PD) ‘byte’ for your fellow preservice teachers. Your PD byte will be a succinct, accessible, targeted and practical professional development experience that deploys learning design principles appropriate to an asynchronous context to support your colleagues to understand how to use ICT to expand curriculum learning opportunities for students in a specific learning area of the Australian Curriculum.</p>\n<p>Your PD byte presentation can be delivered in any format such as a slideshow in PowerPoint or Prezi, or you can even try less common applications for presentations such as Padlet. Whichever software or application you decide to use, your PD Byte presentation must include 20 minutes of original narration recorded by the group (roughly 5 minutes per person in a group of 4).</p>\n<p>The video presentation should also contain a QR code that will provide access to the annotated bibliography and resources so that your fellow preservice teachers can engage with them.</p>\n<p>Your PD byte should also:</p>\n<p>• Clearly identify the learning area and specific learning outcomes you are targeting (the APST may help inform your learning outcomes)</p>\n<p>• Equip your colleagues with one or two strategies for using an ICT tool to expand curriculum learning opportunities for school students in relation to the learning area and learning outcomes you have identified</p>\n<p>• Demonstrate your capacity to design learning to achieve the learning objectives of your PD session using a range of strategies and activities that engage your colleagues in learning (e.g., brief activity, pause to think, discuss with a partner, respond to a quiz or poll, post to Padlet etc.)</p>\n<p>• Critically evaluate how ICT can be used safely, responsibly, and ethically in the context of your seminar focus</p>\n<p>Your PD Byte must be accompanied by:</p>\n<ul>\n<li>an annotated bibliography detailing (i) eight appropriate sources of professional learning (scholarly or reputable professional books or articles) related to your seminar focus that will help teachers to further develop their practice and (ii) two teaching resources (10 items in total). Your annotated bibliography and resources will be made available to your fellow preservice teachers via a QR code that will be displayed during your presentation.</li>\n<li>A task planner or work log (in a graph or table) for planning and progress monitoring for the entire group. The planner should detail the contributions made by each group member, which should be equally shared (see ‘Important information about group work’ below).</li>\n</ul>\n<p> </p>\n<p><strong>Submission Note:</strong></p>\n<p>Your group must carefully follow submission instructions (below) to ensure accessibility for both engagement and marking:</p>\n<p><br/></p>\n<p><strong>Important information about group work</strong></p>\n<p><strong>You will receive a single group mark for this task, as all group members should contribute equally to the design and delivery of the PD session. However, exceptions can be made in the event of one or more group members engaging in ‘social loafing’ (also known as ‘free-riding’):</strong></p>\n<p><em>Free riding is a form of social loafing seen in a group when one or more members slacks off and ‘rides’ on the extra efforts of their co-workers (Walker &amp; Angelo, 1998).</em></p>\n<p><strong>If your small group is experiencing dysfunction, including ‘social loafing’ by one or more members, it is your responsibility to bring this promptly to the attention of your tutor / course coordinator, who will then support the group to resolve the problems in a respectful way. If no resolution can be found, the tutor / course coordinator can take steps including:</strong></p>\n<ul>\n<li>Removal of the non-contributing student/s from the group and require student/s to complete the task either individually or in another small group with other ‘social loafers’</li>\n<li>Deducting one grade from the overall group score for non-contributing student/s, as evidenced in the task planner or work log (see criteria sheet).</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit one Word document containing</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Critical Reflection",
            "special_indicators": [],
            "weighting": "<dd>25% 2000 words </dd>",
            "due_date": "<dd><p> 20/09/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L06, L07, L08",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Task Description</p>\n<p>You are to write a 2000-word critical reflection on the professional development 'byte' you designed and delivered in small groups. Your critical reflection should synthesise relevant course content with your lived experience to:</p>\n<p>• Evaluate how successfully the teaching and learning strategies you designed and deployed in the PD byte achieved your learning objectives and align with the relevant APST standards</p>\n<p>• Evaluate what you have learned, as a presenter and participant, in relation to:</p>\n<p>o How ICT can be used to expand curriculum learning opportunities for students</p>\n<p>o The safe, responsible, and ethical use of ICT</p>\n<p>o How you can continuously improve your own practice and contribute to the profession more broadly - and what that means to you exactly</p>\n<p>o The experience of professional collaboration with your peers</p>\n<p>o How change theory/ies could support improved practice.</p>\n<p> </p>\n<p>PLEASE NOTE: Because this task asks you to critically reflect on your own and others' presentations, you will need to watch the recordings of fellow pre service teachers <a href=\"https://padletuq.padlet.org/m_ocriciano2/educ2604-pd-byte-oyjy8f678vezi4os\">here</a>.</p>\n<p><br/></p>\n<p>APST Assessed: 2.6, 3.4, 4.5, 6.2</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Evaluating a teaching program",
            "special_indicators": [],
            "weighting": "<dd>35% 2500 words </dd>",
            "due_date": "<dd><p> 25/10/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Task Description</strong></p>\n<p>You are to write a case study of 2500 words which evaluates a teaching program. In the context of this task, the term ‘program’ means an identifiable and distinct ‘packaged’ approach that claims to support or enhance student learning – it does not necessarily have to involve ICT. It could, for example, be a reading program (e.g., Reading to Learn); numeracy program (e.g., Cognitively Guided Instruction); technology program (e.g., P-TECH); music program (e.g., Kodály music education); multi-subject program (e.g., STEM/STEAM); and so on.</p>\n<p>You might have encountered this program during your professional experience placement, or you might want to identify a program through academic or professional literature. Either way, it is recommended that you choose a program that is either (i) directly related to one of your teaching areas, or (ii) aligned with one of the General Capabilities, such as Literacy, Numeracy, or Critical and Creative Thinking. Above all, choose a program that you believe will be useful to you in the future.</p>\n<p>To evaluate the program, you should explore and synthesise relevant scholarly literature to:</p>\n<ul>\n<li>Identify the program’s purported relationship with student learning</li>\n<li>Examine its strengths and weaknesses</li>\n<li>Explore implications for teachers and learners</li>\n<li>Provide recommendations to adapt/modify/change the program for the purpose of improving student learning</li>\n<li>Demonstrate knowledge of strategies that can be used by teachers to evaluate teaching programs to improve student learning</li>\n<li>Use APA7 formatting and referencing conventions.</li>\n</ul>\n<p> </p>\n<p><strong>Quick Tips</strong></p>\n<p>Choose something you are interested in learning about that you believe you can justify counts as a \"teaching program\" based on your interpretation of the description in the criteria.</p>\n<p>In case you have some concerns about whether the teaching program truly fits, the teaching team recommends you add a comment to explain or justify why you think what you chose counts as a teaching program, addressing potential concerns for fit (if you think there are any), referring to the relevant influences on your opinion, and ultimately convincing yourself (and the teaching team) that your choice is appropriate enough for this assessment. </p>\n<p>Your efforts in explaining a potential issue with your program choice will help the person marking your paper understand your perspective. We will try to grant you the benefit of the doubt unless we strenuously disagree (e.g., you chose a search engine, a general repository such as Pinterest or Wikipedia, a management-focused ICT tool unrelated to your content, or other inappropriate choices).</p>\n<p>You will still approach it as evaluating a program, you can still show your program evaluation skills, so even if we do disagree at some level, you have the opportunity to address the criteria. Adding further reflections as suggested above will likely help you reinforce (to yourself and the person marking your paper) that you chose something sufficiently appropriate for this context.</p>\n<p> APST Assessed: 3.6</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Freire's Banking Education and  Educational change</strong><br><p>APST: 6.2; 3.6</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L06</p></div></td>",
            "topic_title": "<strong>Freire's Banking Education and  Educational change</strong>",
            "topic_description": "Freire's Banking Education and  Educational change APST: 6.2; 3.6",
            "learning_outcomes": [
                "L01",
                "L03",
                "L06"
            ]
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The purposes of Education: teachers and students </strong><br><p>APST: 6.2; 3.6</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L07</p></div></td>",
            "topic_title": "<strong>The purposes of Education: teachers and students </strong>",
            "topic_description": "The purposes of Education: teachers and students APST: 6.2; 3.6",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L07"
            ]
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Educational Technology: friend, foe or something else?</strong><br><p>APST: 2.6; 3.4; 4.5; 7.1; 7.2</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L06, L07</p></div></td>",
            "topic_title": "<strong>Educational Technology: friend, foe or something else?</strong>",
            "topic_description": "Educational Technology: friend, foe or something else? APST: 2.6; 3.4; 4.5; 7.1; 7.2",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 4(12 Aug - 18 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Acronyms everywhere: SAMR, TPACK and ADDIE</strong><br/></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06, L07</p></div></td>",
            "topic_title": "<strong>Acronyms everywhere: SAMR, TPACK and ADDIE</strong>",
            "topic_description": "Acronyms everywhere: SAMR, TPACK and ADDIE",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 5(19 Aug - 25 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ethical and Safe use of ICT </strong><br><p>PLEASE NOTE: The lecture will be a face-to-face webinar on esafety (compulsory before doing your placement). You will work on the other course material, in a self-directed way, through a learning module in Blackboard. The design choices reflect blended learning pedagogy, and you will reflect on this as part of the learning experience.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L07, L08</p></div></td>",
            "topic_title": "<strong>Ethical and Safe use of ICT </strong>",
            "topic_description": "Ethical and Safe use of ICT PLEASE NOTE: The lecture will be a face-to-face webinar on esafety (compulsory before doing your placement). You will work on the other course material, in a self-directed way, through a learning module in Blackboard. The design choices reflect blended learning pedagogy, and you will reflect on this as part of the learning experience.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Design is the word: Design Justice,  Universal Design for Learning  and  Design Thinking </strong><br><p>APST: 2.6; 3.4; 3.6</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Design is the word: Design Justice,  Universal Design for Learning  and  Design Thinking </strong>",
            "topic_description": "Design is the word: Design Justice,  Universal Design for Learning  and  Design Thinking APST: 2.6; 3.4; 3.6",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 7(02 Sep - 08 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Australian Curriculum and Policy in ICT</strong><br><p>APST: 2.6; 3.4; 4.5; 6.2<br/>\nNo Lecture - work in small groups on Presentations.<br/>\nWorkshop: Revise Critical Reflection and presentations.<br/>\nPresentations will take place during the usual workshop time.<br/>\nWritten component due: Tuesday 05 September at 14:00.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Australian Curriculum and Policy in ICT</strong>",
            "topic_description": "Australian Curriculum and Policy in ICT APST: 2.6; 3.4; 4.5; 6.2 No Lecture - work in small groups on Presentations. Workshop: Revise Critical Reflection and presentations. Presentations will take place during the usual workshop time. Written component due: Tuesday 05 September at 14:00.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ways of knowing: Epistemologies of the South, Indigenous knowledge and leadership</strong><br><p>APST 2.6; 3.4;4.5; 6.2<br/>\nNo lecture - work in small groups on presentations<br/>\nPresentations will take place during the workshop.<br/>\nWritten component due: Tuesday 12 September at 14:00</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L07, L08</p></div></td>",
            "topic_title": "<strong>Ways of knowing: Epistemologies of the South, Indigenous knowledge and leadership</strong>",
            "topic_description": "Ways of knowing: Epistemologies of the South, Indigenous knowledge and leadership APST 2.6; 3.4;4.5; 6.2 No lecture - work in small groups on presentations Presentations will take place during the workshop. Written component due: Tuesday 12 September at 14:00",
            "learning_outcomes": [
                "L01",
                "L02",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>AI, You and Leanring Analytics</strong><br><p>APST: 3.6; 6.2<br/>\nAT2: Critical Reflection - due Friday 22 September at 14:00</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>AI, You and Leanring Analytics</strong>",
            "topic_description": "AI, You and Leanring Analytics APST: 3.6; 6.2 AT2: Critical Reflection - due Friday 22 September at 14:00",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Mid Sem break(23 Sep - 29 Sep)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>MID SEMESTER BREAK</strong><br><p>Monday 25 September - Friday 29 September</p></br></p></div></td>",
            "topic_title": "<strong>MID SEMESTER BREAK</strong>",
            "topic_description": "MID SEMESTER BREAK Monday 25 September - Friday 29 September",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 10 To Week 11(30 Sep - 13 Oct)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Professional experience placement</strong><br><p>No workshop for 2 weeks due to professional expereince in an accompanying course. However, you do have a RiPPLE reflection. You will need to read this article: Vongkulluksn, V. W., Xie, K., &amp; Bowman, M. A. (2018). The role of value on teachers' internalization of external barriers and externalization of personal beliefs for classroom technology integration. Computers and Education, 118, 70 81. <a href=\"https://doi.org/10.1016/j.compedu.2017.11.009\">https://doi.org/10.1016/j.compedu.2017.11.009</a>  Access via UQ library using this link: <a href=\"https://search.library.uq.edu.au/permalink/f/tbms52/TN_cdi_crossref_primary_10_1016_j_compedu_2017_11_009\">https://search.library.uq.edu.au/permalink/f/tbms52/TN_cdi_crossref_primary_10_1016_j_compedu_2017_11_009</a>.  You also have a RiPPLE reflection in the 2nd week. You will read other students' responses and add to their comments.</p></br></p></div></td>",
            "topic_title": "<strong>Professional experience placement</strong>",
            "topic_description": "Professional experience placement No workshop for 2 weeks due to professional expereince in an accompanying course. However, you do have a RiPPLE reflection. You will need to read this article: Vongkulluksn, V. W., Xie, K., & Bowman, M. A. (2018). The role of value on teachers' internalization of external barriers and externalization of personal beliefs for classroom technology integration. Computers and Education, 118, 70 81. https://doi.org/10.1016/j.compedu.2017.11.009 Access via UQ library using this link: https://search.library.uq.edu.au/permalink/f/tbms52/TN_cdi_crossref_primary_10_1016_j_compedu_2017_11_009 .  You also have a RiPPLE reflection in the 2nd week. You will read other students' responses and add to their comments.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Reframing and resignifying leadership</strong><br><p>No lecture this week. In terms of readings, please read through the examples of past student responses to AT3.</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Reframing and resignifying leadership</strong>",
            "topic_description": "Reframing and resignifying leadership No lecture this week. In terms of readings, please read through the examples of past student responses to AT3.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Online Communities</strong><br><p>Lecture: Course wrap-up and questions on AT3<br/>\nWorkshop: Drop in for any support with AT3.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Online Communities</strong>",
            "topic_description": "Online Communities Lecture: Course wrap-up and questions on AT3 Workshop: Drop in for any support with AT3.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        }
    ]
}