{
    "course_title": "Indigenous Knowledge & Education",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/EDUC2090-63114-7460",
    "full_course_code": "EDUC2090-63114-7460",
    "course_code": "EDUC2090",
    "class_code": "63114",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate a critical understanding of theoretical underpinnings and debates, curriculum, legislative and policy frameworks, and pedagogical practices which make up the landscape of Indigenous education in Australia today."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate understanding of the importance of critical and continual reflection on their professional, political and personal worldview and research-informed practices as an educator in relation to how Indigenous Australian students engage in education and learning, their peoples and cultures, and their histories and languages."
        },
        {
            "number": "LO3.",
            "description": "Demonstrate understanding of and reflection on Indigenous Australian education as located within broader educational frameworks, system policies, processes and contexts."
        },
        {
            "number": "LO4.",
            "description": "Demonstrate understandings of evidence-based teaching and learning strategies, alongside your worldview as a teacher, in relation to working with Aboriginal and Torres Strait Islander students."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate a growing capacity to work effectively and respectfully within the Indigenous Australian education landscape."
        },
        {
            "number": "LO6.",
            "description": "Demonstrate the skills and knowledge to engage effectively and work in partnership with Aboriginal and Torres Strait Islander peoples and communities."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Reflective learning journal",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>40% 1200 words </dd>",
            "due_date": "<dd><p> 22/08/2024 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Assessment task one requires you to complete a reflective journal outlining your learning and engagement with a range of materials and learning sources across this unit. Using the ‘Five Rs’ (Bain et al., 1999), you will undertake a process of thinking critically about your learning, your responses to the learning and how you will take that forward into your practice as a teacher in the future.</p>\n<p>You will complete three reflections in total of 400 words each <strong>(total word count: 1200)</strong>.</p>\n<p>You must have a range of examples of learning materials including:</p>\n<p>·      Lectures</p>\n<p>·      Tutorial activities</p>\n<p>·      Readings</p>\n<p>·      Online materials and activities</p>\n<p> </p>\n<p>Reflections are to be written in short paragraphs and in first person. There must be evidence of engagement with:</p>\n<p>·      theories introduced throughout the unit such as critical race theory</p>\n<p>·      engagement of a range of course learning materials and literature including Indigenous authored sources</p>\n<p>·      application of the 5 Rs in reflecting on your learning experience</p>\n<p>·      critical reflection on your worldview (social, cultural, political, economic) and the impact upon your reaction to engaging with Indigenous Australian peoples and learning</p>\n<p>·      consideration of how to apply the learning from your reflection in your practice as a teacher</p>\n<p><strong>Five Rs (adapted from Bain, Ballantyne, Packer &amp; Mills, 1999)</strong></p>\n<p><strong>Reporting:</strong> what was the source of the learning?</p>\n<p><strong>Responding:</strong> what were your feelings towards the issue? what was your initial response?</p>\n<p><strong>Relating:</strong> how did the learning relate to your past and current personal and or professional experiences? why was it significant in the context of learning about Indigenous education?</p>\n<p><strong>Reasoning:</strong> what theories are relevant in helping to understand and critically reflect on the issue? why do you think you had the initial response and what factors impacted on this?</p>\n<p><strong>Reconstructing</strong>: why was this a significant learning experience for you as a teacher? how will you take this learning forward into practice</p>\n<p>-Lectures</p>\n<p>-Tutorial activities</p>\n<p>-Readings</p>\n<p>- Online materials and activities</p>\n<p>Reflections are to be written in short paragraphs and in first person. There must be evidence of engagement with:</p>\n<ul>\n<li>theories introduced throughout the unit such as critical race theory</li>\n<li>engagement of a range of course learning materials and literature including Indigenous authored sources</li>\n<li>application of the 5 Rs in reflecting on your learning experience</li>\n<li>critical reflection on your social positioning (social, cultural, political, economic) and the impact upon your reaction to engaging with Indigenous Australian peoples and learning</li>\n<li>consideration of how to apply the learning from your reflection in your practice as a teacher</li>\n</ul>\n<p><br/></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Please submit through Turnitin. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Indigenous Education Professional Portfolio",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>60% 2000 words </dd>",
            "due_date": "<dd><p> 24/10/2024 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Assessment task two requires you to develop a professional portfolio, which will allow you demonstrate your understanding of the field of Indigenous education and connect it to your professional context. You will also demonstrate your ability to embed Indigenous knowledges and perspectives in your discipline area and discuss the theories, literature and policy that inform how and why professionals play an important role in shaping social and political discourse in Indigenous education.</p>\n<p>There are three parts to your professional portfolio. In all sections, you are required to use scholarly sources (using APA) and refer to Indigenous education policy, relevant theories and literature to support the development of your portfolio.</p>\n<p>To do this work effectively, teachers must have the ability to engage in critical self-reflection and be proactive in identifying gaps in their knowledge and skills. As part of this portfolio, you will develop a future professional learning plan that outlines your plan to engage with a range of materials and learning to continue your professional learning and development in Indigenous education.</p>\n<p>There are three parts to your professional portfolio. In all sections, you are required to use scholarly sources (using APA) and refer to Indigenous education policy, relevant theories and literature to support the development of your portfolio.</p>\n<p><strong>Part A (500 words)</strong></p>\n<p>Professional statement</p>\n<p>You will write a professional statement outlining your intent to address the Australian Professional Standards for Teachers and the Australian Curriculum cross-priority aimed at addressing improving Indigenous education outcomes and practices. The statement can be added to your professional portfolio and <strong>can be written in first person</strong>. Your statement may include:</p>\n<p>·      Reference to Indigenous education policy, the Australian Professional Standards for Teachers and the Australian Curriculum</p>\n<p>·      Your professional values</p>\n<p>·      Reference to reconciliation</p>\n<p>·      Theories and literature that have influenced your theories</p>\n<p>·      Reference to Indigenous aspirations in education</p>\n<p><strong>Part B (1000 words)</strong></p>\n<p>Lesson plan and rationale</p>\n<p>You will develop one lesson plan that clearly demonstrate your ability to embed Indigenous Australian knowledges and perspectives into curriculum. You may use a lesson plan template used in your curriculum area but the lesson plan must include:</p>\n<p>·      Learning objectives</p>\n<p>·      Year level</p>\n<p>·      Key learning area</p>\n<p>·      Time frame</p>\n<p>·      Pedagogical adjustments</p>\n<p>·      Indigenous material and resources used (with evidence of rigorous selection of the type of resources used)</p>\n<p>·      Mechanisms for evaluation of the lesson</p>\n<p><br/></p>\n<p>Rationale</p>\n<p>The rationale will address the reasons why it is important for teachers to be capable and confident in addressing issues in Indigenous education, including engaging effectively and collaboratively with Indigenous students, families and communities, embedding Indigenous perspectives and how to teach Indigenous students.</p>\n<p><strong>This rationale</strong> <strong>will be written in third person</strong> and will need to use scholarly sources only. This can include policy documents and peer reviewed literature. In the rationale, you will need to address:</p>\n<ul>\n<li>Why it is important for teachers to know Indigenous education policy and how to include it in their practice</li>\n<li>How theories can assist in addressing the issues</li>\n<li>How embedding Indigenous knowledges and perspectives addresses issues in Indigenous education and broader social issues</li>\n<li>Why it is important for teachers to engage and work in partnership with Indigenous peoples and communities</li>\n</ul>\n<p> </p>\n<p><strong>Part C (500 words)</strong></p>\n<p>Indigenous Education professional development</p>\n<p>The professional development plan can be written in first person. This section is designed to allow you to self-assess gaps that might still exist in your understanding of Australian histories, your culture and standpoint, Aboriginal and Torres Strait Islander cultures and histories and Indigenous education frameworks and approaches. You may identify materials from a range of sources including:</p>\n<ul>\n<li>Indigenous community events and organisations</li>\n<li>Professional development sessions</li>\n<li>Books</li>\n<li>Web based resources</li>\n<li>Documentaries</li>\n</ul>\n<p>A suggested template for your plan is below:</p>\n<p><br/></p>\n<p>Gap area    <strong>I</strong>     Resource (reference or information      <strong>I</strong>      How will engaging with resource address the gap      <strong>I</strong>      How does this address policy (APSTs, Aust. Curriculum, CT)</p>\n<p>_</p>\n<p>_</p>\n<p>_</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Please submit via Turnitin on Blackboard. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 1 grade for each 24 hour period from time submission is due will apply for up to 7 days. After 7 days you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introducing Indigenous knowledges and education </strong><br><p>In tutorials this week, we will have a chance to explain, explore and discuss the requirements for this course. We will also begin the relational aspect of this course and get to know who we are and linking them to pedagogical practices that can be used in the classroom.</p>\n<p><br/></p></br></p></div></td>",
            "topic_title": "<strong>Introducing Indigenous knowledges and education </strong>",
            "topic_description": "Introducing Indigenous knowledges and education In tutorials this week, we will have a chance to explain, explore and discuss the requirements for this course. We will also begin the relational aspect of this course and get to know who we are and linking them to pedagogical practices that can be used in the classroom.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introducing Indigenous knowledges and education </strong><br><p>The first lecture for the course is a positioning lecture where we provide an overview, and an introduction to the landscape of Indigenous education. This introductory lecture will discuss use of appropriate language in engaging with the course content, providing a summary of why specific languages are preferred and the key theories and policies that underpin these discussions. The assessment tasks for the course will also be outlined.</p></br></p></div></td>",
            "topic_title": "<strong>Introducing Indigenous knowledges and education </strong>",
            "topic_description": "Introducing Indigenous knowledges and education The first lecture for the course is a positioning lecture where we provide an overview, and an introduction to the landscape of Indigenous education. This introductory lecture will discuss use of appropriate language in engaging with the course content, providing a summary of why specific languages are preferred and the key theories and policies that underpin these discussions. The assessment tasks for the course will also be outlined.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Worldviews</strong><br><p>This week in the tutorials we will look at what we are connected to and knowing ourselves so we can better understand our students. We will also explore how our social, cultural and historical experiences shape our lenses and worldviews. Learning Objectives: 1, 2, 3</p></br></p></div></td>",
            "topic_title": "<strong>Worldviews</strong>",
            "topic_description": "Worldviews This week in the tutorials we will look at what we are connected to and knowing ourselves so we can better understand our students. We will also explore how our social, cultural and historical experiences shape our lenses and worldviews. Learning Objectives: 1, 2, 3",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Worldviews</strong><br><p>This lecture will focus on who we are as a person and a teacher. It will explore the ways of knowing, the ways of doing and the ways of being so that we can learn to understand who we are, privilege and barriers and connections.</p></br></p></div></td>",
            "topic_title": "<strong>Worldviews</strong>",
            "topic_description": "Worldviews This lecture will focus on who we are as a person and a teacher. It will explore the ways of knowing, the ways of doing and the ways of being so that we can learn to understand who we are, privilege and barriers and connections.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Australian histories - how much do we really know?</strong><br><p>This week we will explore Australian histories and critically reflect on why we know or don't know and how we have come to know.<br/>\nLearning Objectives: 2, 4</p></br></p></div></td>",
            "topic_title": "<strong>Australian histories - how much do we really know?</strong>",
            "topic_description": "Australian histories - how much do we really know? This week we will explore Australian histories and critically reflect on why we know or don't know and how we have come to know. Learning Objectives: 2, 4",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>QLD Histories and the importance of communities:</strong><br><p>Guest Lecturer: Aunty Denise Proud Honorary Senior Fellow, UQ https://education.uq.edu.au/profile/2448/denise-proud PLEASE NOTE THIS SESSION WILL NOT BE RECORDED Aunty Denise is a proud Aboriginal woman and respected Elder and educator, known nationally and internationally for her work as an artist, author and presenter. Aunty Denise is also an expert consultant in Indigenous and early childhood education. She will share her personal experience of living through past policies in Queensland on the settlement of Cherbourg and her journey of becoming a successful educator in diverse settings.</p></br></p></div></td>",
            "topic_title": "<strong>QLD Histories and the importance of communities:</strong>",
            "topic_description": "QLD Histories and the importance of communities: Guest Lecturer: Aunty Denise Proud Honorary Senior Fellow, UQ https://education.uq.edu.au/profile/2448/denise-proud PLEASE NOTE THIS SESSION WILL NOT BE RECORDED Aunty Denise is a proud Aboriginal woman and respected Elder and educator, known nationally and internationally for her work as an artist, author and presenter. Aunty Denise is also an expert consultant in Indigenous and early childhood education. She will share her personal experience of living through past policies in Queensland on the settlement of Cherbourg and her journey of becoming a successful educator in diverse settings.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(12 Aug - 18 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Equity and Equality in the classroom </strong><br><p>This tutorial will explore the concept of race and racism within Australian schools and  how we can embed Indigenous perspectives within our content and what it means for our praxis as teachers. We will start to look at lesson plans in detail. </p></br></p></div></td>",
            "topic_title": "<strong>Equity and Equality in the classroom </strong>",
            "topic_description": "Equity and Equality in the classroom This tutorial will explore the concept of race and racism within Australian schools and  how we can embed Indigenous perspectives within our content and what it means for our praxis as teachers. We will start to look at lesson plans in detail.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(12 Aug - 18 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Equity &amp; Equality</strong><br><p>This lecture will focus on the nature of racism today and its presence within Australia's education systems. Our position as teachers within this racialised landscape will be examined, Finally, strategies for teachers to address racism and support their Aboriginal and Torres Strait Islander students will be discussed.incorporating perspectives?<br/>\nAn Evaluation Framework: making informed decisions in curriculum design (gaining professional agency).</p></br></p></div></td>",
            "topic_title": "<strong>Equity &amp; Equality</strong>",
            "topic_description": "Equity & Equality This lecture will focus on the nature of racism today and its presence within Australia's education systems. Our position as teachers within this racialised landscape will be examined, Finally, strategies for teachers to address racism and support their Aboriginal and Torres Strait Islander students will be discussed.incorporating perspectives? An Evaluation Framework: making informed decisions in curriculum design (gaining professional agency).",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(19 Aug - 25 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Hidden Histories Crossing Cultures</strong><br><p>In this tutorial students will begin to create basic lesson plans around Australia s history and selected key learning area.</p></br></p></div></td>",
            "topic_title": "<strong>Hidden Histories Crossing Cultures</strong>",
            "topic_description": "Hidden Histories Crossing Cultures In this tutorial students will begin to create basic lesson plans around Australia s history and selected key learning area.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(19 Aug - 25 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Hidden Histories Crossing Cultures</strong><br><p>This interactive lecture will look at Australia's history through an Aboriginal and Torres Strait Islander perspective using art work to tell the story.</p></br></p></div></td>",
            "topic_title": "<strong>Hidden Histories Crossing Cultures</strong>",
            "topic_description": "Hidden Histories Crossing Cultures This interactive lecture will look at Australia's history through an Aboriginal and Torres Strait Islander perspective using art work to tell the story.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Curriculum is not neutral</strong><br><p>This tutorial explores how curriculum works and what this means for Indigenous Australian learners and reflecting on how this can contribute to our professional knowledge</p></br></p></div></td>",
            "topic_title": "<strong>Curriculum is not neutral</strong>",
            "topic_description": "Curriculum is not neutral This tutorial explores how curriculum works and what this means for Indigenous Australian learners and reflecting on how this can contribute to our professional knowledge",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Curriculum is not neutral</strong><br/><p>We explore how values, knowledges and beliefs shape the design curriculum approaches. Indigenous Australian peoples: embedding or incorporating perspectives? An Evaluation Framework: making informed decisions in curriculum design (gaining professional agency). </p></p></div></td>",
            "topic_title": "<strong>Curriculum is not neutral</strong>",
            "topic_description": "Curriculum is not neutral We explore how values, knowledges and beliefs shape the design curriculum approaches. Indigenous Australian peoples: embedding or incorporating perspectives? An Evaluation Framework: making informed decisions in curriculum design (gaining professional agency).",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(02 Sep - 08 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Black is...</strong><br/><p>This tutorial will explore the concept of identity after learning about past policies such as the exemption certificate as we reflect on how teachers can affirm the identities of young people in schools.</p></p></div></td>",
            "topic_title": "<strong>Black is...</strong>",
            "topic_description": "Black is... This tutorial will explore the concept of identity after learning about past policies such as the exemption certificate as we reflect on how teachers can affirm the identities of young people in schools.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(02 Sep - 08 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The Stolen Generations &amp; exemption certificate</strong><br/><p>Guest Lecturer: Aunty Judi Wickes THIS SESSION WILL NOT BE RECORDED Aunty Judi (Kalkadoon/Wakka Wakka) is a respected community Elder, social worker and educator who writes and presents nationally and internationally on her research about the impact of the stolen generation and the certificate of exemption. Aunty Judi will share her research and her story about her many years working as a social worker in community organisations and in education settings. </p></p></div></td>",
            "topic_title": "<strong>The Stolen Generations &amp; exemption certificate</strong>",
            "topic_description": "The Stolen Generations & exemption certificate Guest Lecturer: Aunty Judi Wickes THIS SESSION WILL NOT BE RECORDED Aunty Judi (Kalkadoon/Wakka Wakka) is a respected community Elder, social worker and educator who writes and presents nationally and internationally on her research about the impact of the stolen generation and the certificate of exemption. Aunty Judi will share her research and her story about her many years working as a social worker in community organisations and in education settings.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Policy and professional practice</strong><br/><p>This workshop will assist in making connections between key Indigenous education policy objectives and your professional statement (assessment 2).</p></p></div></td>",
            "topic_title": "<strong>Policy and professional practice</strong>",
            "topic_description": "Policy and professional practice This workshop will assist in making connections between key Indigenous education policy objectives and your professional statement (assessment 2).",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Indigenous education policy</strong><br/><p>This lecture will look at international, national and state Indigenous education policy. We will explore some of the key policy objectives and how they inform practice approaches in schools. We will hear from the Department of Education Queensland about the 'Every Aboriginal and Torres Strait Islander student succeeding strategy' through their 3 priorities: connection to culture; high expectations and meaningful pathways.</p></p></div></td>",
            "topic_title": "<strong>Indigenous education policy</strong>",
            "topic_description": "Indigenous education policy This lecture will look at international, national and state Indigenous education policy. We will explore some of the key policy objectives and how they inform practice approaches in schools. We will hear from the Department of Education Queensland about the 'Every Aboriginal and Torres Strait Islander student succeeding strategy' through their 3 priorities: connection to culture; high expectations and meaningful pathways.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Selecting curriculum materials:</strong><br/><p>This hands on workshop provides a tool called YARNS (Madsen et al) to assist teachers in identifying appropriate curriculum materials and resources in embedding Indigenous knowledges and perspectives.</p></p></div></td>",
            "topic_title": "<strong>Selecting curriculum materials:</strong>",
            "topic_description": "Selecting curriculum materials: This hands on workshop provides a tool called YARNS (Madsen et al) to assist teachers in identifying appropriate curriculum materials and resources in embedding Indigenous knowledges and perspectives.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Critical selection of curriculum resources:</strong><br/><p>In this lecture, Danielle will share her experiences working in both rural and urban schools, the importance of understanding media dialogue and influence and how teachers can identify quality curriculum materials when embedding Indigenous knowledges and perspectives in the curriculum.</p></p></div></td>",
            "topic_title": "<strong>Critical selection of curriculum resources:</strong>",
            "topic_description": "Critical selection of curriculum resources: In this lecture, Danielle will share her experiences working in both rural and urban schools, the importance of understanding media dialogue and influence and how teachers can identify quality curriculum materials when embedding Indigenous knowledges and perspectives in the curriculum.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid Sem break(23 Sep - 29 Sep)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid Semester Break</strong><br/><p>No classes this week</p></p></div></td>",
            "topic_title": "<strong>Mid Semester Break</strong>",
            "topic_description": "Mid Semester Break No classes this week",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Embedding Aboriginal and Torres Strait Islalnder knowledges and perspectives  </strong><br/><p>This workshop unpacks content from the lecture to explore the elements of what effective embedding of Indigenous knowledges and perspectives looks like in practice. </p></p></div></td>",
            "topic_title": "<strong>Embedding Aboriginal and Torres Strait Islalnder knowledges and perspectives  </strong>",
            "topic_description": "Embedding Aboriginal and Torres Strait Islalnder knowledges and perspectives This workshop unpacks content from the lecture to explore the elements of what effective embedding of Indigenous knowledges and perspectives looks like in practice.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Embedding Aboriginal and Torres Strait Islander knowledges and perspectives </strong><br/><p>This week we will explore and engage with strategies and ways of embedding Indigenous perspectives in our work. We will look at how to embed and implement Indigenous perspectives and knowledges across a range of key learning areas.</p></p></div></td>",
            "topic_title": "<strong>Embedding Aboriginal and Torres Strait Islander knowledges and perspectives </strong>",
            "topic_description": "Embedding Aboriginal and Torres Strait Islander knowledges and perspectives This week we will explore and engage with strategies and ways of embedding Indigenous perspectives in our work. We will look at how to embed and implement Indigenous perspectives and knowledges across a range of key learning areas.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(07 Oct - 13 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Building Partnerships &amp; co-constructing curriculum</strong><br/><p>This week we will look at the phases of co-constructing learning experiences.</p></p></div></td>",
            "topic_title": "<strong>Building Partnerships &amp; co-constructing curriculum</strong>",
            "topic_description": "Building Partnerships & co-constructing curriculum This week we will look at the phases of co-constructing learning experiences.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(07 Oct - 13 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Building Partnerships &amp; co-constructing curriculum</strong><br/><p>This week we will explore and engage with specific frameworks for embedding Indigenous perspectives in our classrooms.</p></p></div></td>",
            "topic_title": "<strong>Building Partnerships &amp; co-constructing curriculum</strong>",
            "topic_description": "Building Partnerships & co-constructing curriculum This week we will explore and engage with specific frameworks for embedding Indigenous perspectives in our classrooms.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Practicing culturally responsive teaching</strong><br/><p>This week we will explore different ways to implement culturally responsive teaching in the classroom.</p></p></div></td>",
            "topic_title": "<strong>Practicing culturally responsive teaching</strong>",
            "topic_description": "Practicing culturally responsive teaching This week we will explore different ways to implement culturally responsive teaching in the classroom.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Culturally Responsive Teaching</strong><br/><p>This lecture will unpack pedagogical approaches and strategies that align with Aboriginal and Torres Strait Islander education and students  customs, characteristics, experience, and perspectives as tools for better classroom instruction.</p></p></div></td>",
            "topic_title": "<strong>Culturally Responsive Teaching</strong>",
            "topic_description": "Culturally Responsive Teaching This lecture will unpack pedagogical approaches and strategies that align with Aboriginal and Torres Strait Islander education and students  customs, characteristics, experience, and perspectives as tools for better classroom instruction.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In My Blood it Runs</strong><br/><p>Bringing our work to a close: In the final tutorials for this course, we will provide space for you to debrief about your experiences, understandings and challenges in this course. </p></p></div></td>",
            "topic_title": "<strong>In My Blood it Runs</strong>",
            "topic_description": "In My Blood it Runs Bringing our work to a close: In the final tutorials for this course, we will provide space for you to debrief about your experiences, understandings and challenges in this course.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In My Blood it Runs</strong><br/><p>In My Blood it Runs: This lecture will include a special screening of 'In My Blood it Runs' The film features ten year old Djuan, a child healer who speaks three languages and is a good hunter. Yet he is 'failing' at school and is labelled as troubled. The lecture will unpack some of the prevailing issues in the education system that underpin Djuan's story. We will explore some antidotes to this story and possibilities for teachers to play a role in addressing these systemic issues. </p></p></div></td>",
            "topic_title": "<strong>In My Blood it Runs</strong>",
            "topic_description": "In My Blood it Runs In My Blood it Runs: This lecture will include a special screening of 'In My Blood it Runs' The film features ten year old Djuan, a child healer who speaks three languages and is a good hunter. Yet he is 'failing' at school and is labelled as troubled. The lecture will unpack some of the prevailing issues in the education system that underpin Djuan's story. We will explore some antidotes to this story and possibilities for teachers to play a role in addressing these systemic issues.",
            "learning_outcomes": []
        }
    ]
}