{
    "course_title": "Sustainable Business Practice",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/ENVM4525-64630-7460",
    "full_course_code": "ENVM4525-64630-7460",
    "course_code": "ENVM4525",
    "class_code": "64630",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Describe the drivers of sustainable practices in contemporary business and key concepts in sustainability including principles of governance, corporate legitimacy, stakeholder engagement and disclosure."
        },
        {
            "number": "LO2.",
            "description": "Explain key aspects of strategy, planning and reporting in sustainable business practice, including the Global Reporting Initiative, the CERES Roadmap, various relevant standards and certification schemes and how to apply the concept of Materiality."
        },
        {
            "number": "LO3.",
            "description": "Apply and demonstrate an understanding of how to estimate, monitor and manage inputs and outputs like water, energy, waste and emissions from organisations, products and services, particularly in the built environment."
        },
        {
            "number": "LO4.",
            "description": "Distinguish features and principles of sustainable procurement, lean supply chain management and sustainable design"
        },
        {
            "number": "LO5.",
            "description": "Relate how human rights and social justice principles feature in sustainable business practice, particularly in regards to securing licenses to operate, effective employee management and ethical engagement with stakeholders, notably vulnerable groups and indigenous people."
        },
        {
            "number": "LO6.",
            "description": "Critique the influence of the banking, insurance and investment sector on sustainable business practice expectations and standards."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Case Study",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>50% Individual </dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>2/11/2024 - 16/11/2024</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Case Study Assessment ENVM4525 Semester 2 2024</strong></p>\n<p>  </p>\n<p><strong>Contents</strong></p>\n<p>1. Preface</p>\n<p>2. Task Instructions, Word Limit and Report Structure</p>\n<p>3. Due Dates</p>\n<p>4. Submission Method and Marking System</p>\n<p>5. Formatting and Referencing Requirements</p>\n<p> </p>\n<p><strong>1. Preface</strong></p>\n<p>Many firms encapsulate their ‘Sustainable Business Practices’ and ‘Environmental, Social and Governance (ESG)’ activities within their sustainability reporting initiatives. In this assignment you will examine the sustainability reports of a specified firm. The objective is for you to develop and demonstrate your understanding of how sustainability reporting initiatives guide how firms engage in sustainable business practice. </p>\n<p> </p>\n<p><strong>2. Task Instructions, Word Limit and Report Structure</strong></p>\n<ul>\n<li>Each student will be assigned (via blackboard) a case study firm by the end of Week 1.</li>\n<li>Each student is required to complete the assignment on their assigned case study firm.</li>\n<li>No two students should complete the assignment on the same case study firm.</li>\n<li>Students who enrol after Week 1 or for whatever reason have not been assigned a case study firm by the end of Week 1, must email the course coordinator as soon as possible so they can be assigned a case study firm.</li>\n<li>Your task is to examine the sustainability reports of the case study firm and describe the ESG activities and sustainable business practices the firm has engaged in. To do this, you must follow the Report Structure outlined below and include the content listed in the Report Structure below for each relevant section.</li>\n<li>Case studies are a research method commonly used in environmental management. The format of case study analysis varies based on the research purpose and context. In this assignment, follow the Report Structure provided below. Case study analysis allows detailed examination and explanation of an interesting example of an important and often complex phenomenon. In this assignment, the interesting example is your case study firm, and the phenomenon is how the firm engages in sustainable business practice and sustainability reporting.</li>\n<li>The recommended word length for the assignment is 2500 words. This excludes the title, abstract, all figures and tables and their titles, footnotes, citations, and the reference list. There is no penalty for exceeding the recommended word limit.</li>\n<li>Your report must follow the Report Structure outlined below.</li>\n</ul>\n<p> </p>\n<p> <strong>Section</strong></p>\n<p> <strong>Content</strong></p>\n<p> <strong>Word Length</strong></p>\n<p>   Title</p>\n<p> You can choose your own title. Good titles have meaning and give the reader insight into what the report is about. For example, <em>‘Assignment 1 ENVM4525’</em> has no meaning, but this one does; <em>‘A study of how ANZ includes climate change related issues in its Environmental, Social and Governance reporting initiatives’.</em> An important part of this assignment is how you focus on issues that are ‘materially’ important to the case study firm. In this example, the title reveals how ‘climate change related issues’, such as climate risk disclosure, are a prominent part of the way ANZ reports on sustainability matters. By focussing on materially important issues, within the context of a wider description of the overall content of the report</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students are required to submit an electronic copy of their assignment through Turnitin in Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>50% Individual </dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>2/11/2024 - 16/11/2024</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>\n</p><ul>\n<li>The exam will cover all material covered in the course between Weeks 1 and 13.</li>\n<li>The exam will include a mix of multiple choice and short answer/essay questions.</li>\n<li>The exam will be marked out of 50.</li>\n<li>The exam is a closed-book exam centrally controlled and invigilated by UQ.</li>\n<li>The revision questions listed at the end of each week’s lecture notes will be useful revision.</li>\n<li>You must get a mark of 50% or higher in the exam (25/50 or greater) to pass the course (see Assessment Hurdle listed in the course profile).</li>\n<li>Referencing is not required in the exam, however, if you choose to cite references, please use Harvard referencing style.</li>\n<li>The exam will be an on-campus exam. Have your UQ student ID card available for all your exams. Students enrolled in Internal delivery must attend the exam in person. In the event of disruption during the end of semester exam period that prevents the scheduled assessment occurring as planned, the assessment will be changed to a ProctorU exam. The timing of the assessment may also be impacted.</li>\n</ul>\n<p>PERFORMANCE HURDLE: Students are required to achieve a mark of 50% or greater in the Exam to pass the course.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": []
}