{
    "course_title": "Cinema in French",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/FREN3360-63134-7460",
    "full_course_code": "FREN3360-63134-7460",
    "course_code": "FREN3360",
    "class_code": "63134",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "speak and write about cinema in French as well as analyse audiovisual texts using the technical vocabulary appropriate to the discipline"
        },
        {
            "number": "LO2.",
            "description": "identify the characteristics specific to particular authors, movements and genres studied in the course"
        },
        {
            "number": "LO3.",
            "description": "understand and apply the various cinematic theories which will be the object of the course"
        },
        {
            "number": "LO4.",
            "description": "adapt the interpretive strategies learned in the course for application to a wider range of texts and situations."
        },
        {
            "number": "LO5.",
            "description": "complete assignment and exam tasks in accordance with UQ policies on academic integrity"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Blackboard Viewing/Reading Tasks",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p>Task 1 -  30/07/2024 2:00 pm</p>\n<p>Task 2 -  6/08/2024 2:00 pm</p>\n<p>Task 3 -  13/08/2024 2:00 pm</p>\n<p>Task 4 -  20/08/2024 2:00 pm</p>\n<p>Task 5 -  27/08/2024 2:00 pm</p>\n<p>Task 6 -  3/09/2024 2:00 pm</p>\n<p>Task 7 -  10/09/2024 2:00 pm</p>\n<p>Task 8 -  17/09/2024 2:00 pm</p>\n<p>Task 9 - 1/10/2024 2:00 pm</p>\n<p>Task 10 - 8/10/2024 2:00 pm</p>\n<p>Task 11 -  15/10/2024 2:00 pm</p>\n<p>Task 12 - 22/10/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will complete a series of viewing/reading tasks available on Blackboard in the course of semester based on film screenings and readings for particular weeks. <strong>There will be a total of twelve tasks available in the course of semester with the top ten tasks counting for the final overall result of 10%</strong>. Each task is weighted equally.</p>\n<p>Please note: The tasks are to be completed using Inspera Assessment. Inspera Assessment provides additional functionality to complement the existing suite of digital learning tools at UQ with a greater range of question types, accessibility provisions, and non-English languages. Students in this course will complete these tasks using their own devices. Further details, including an introduction to Inspera functionality, practice opportunities and where to go for support will be provided in the Blackboard site for this course in Week 1 of the semester.</p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The tasks are to be completed through the FREN3360 Blackboard site.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Oral Presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p>Week 5 Wed - Week 13 Wed</p>\n<p>Students must sign up for the presentation date by Monday in Week 3.</p>\n<p>20 minutes maximum, the transcription should be from 1,000-1,200 words.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Activity/ Performance, Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Students will do one oral presentation with a partner from Week 5 in the tutorial session. </strong></p>\n<p>STUDENTS MUST SIGN UP TO A PRESENTATION SLOT BY MONDAY WEEK 3. A timetable for presentations will then be posted on Blackboard by the start of Week 4.</p>\n<p><strong>General instructions: </strong></p>\n<p>With your partner, you will choose a film from a list published on the Blackboard site and you will compare it to one or more of the films screened in the course of the semester. For your comparison, you will formulate a research question and you will analyse the film according to one of the approaches discussed in class (for example, according to auteur theory, genre theory, in relation to specific cinematic movements etc).</p>\n<p>Alternatively, you could choose a particular stylistic trait of the film--the sound, the lighting, the editing, the music etc--and discuss it from a theoretical or technical perspective.</p>\n<p>You will specify the precise subject of your presentation in the introduction (for example, a specific thematic studied in accordance with auteur theory etc). </p>\n<p>It is important to remember that other students won't necessarily have seen the film you are presenting. It will be necessary therefore to:</p>\n<ul>\n<li>give essential details on the film (release date, director, principal actors, themes)</li>\n<li>situate it in terms of the work of the director, filmic movements etc</li>\n<li>situate the film in relation to genre</li>\n<li>give a brief summary of the plot</li>\n<li>presentations are expected to be around 20 minutes max.</li>\n</ul>\n<p><strong>Marking criteria:</strong></p>\n<ul>\n<li>As specified in the criteria, you will need to demonstrate: your knowledge of the films compared; your understanding of the relevant film theory; your use of the correct cinematic terminology; and understanding of relevant secondary material. You will also be assessed on the quality of your spoken French and the dynamism of your presentation.</li>\n<li>Your presentation will include a PowerPoint with still images from the film though not actual film clips (as these take up too much time in class). </li>\n<li>For integrity purposes, you will need to provide a written transcription of your presentation (from 1,000-1,200 words) including bibliography which you will also upload to Turnitin on the FREN3360 Blackboard site by 12pm the Friday of the week of your presentation.</li>\n<li><strong>You will be given a collective grade for the analysis and an individual grade for the French.</strong></li>\n<li>YOU MUST CHOOSE AN AUTEUR/TOPIC DIFFERENT FROM THE ONE CHOSEN FOR YOUR COMPARATIVE ANALYSIS</li>\n</ul>\n<p>More detailed instructions will be distributed in class and posted on the Blackboard site.</p>\n<p><strong>Use of generative AI and translation software</strong></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct</p>\n<p><strong>Working in teams</strong></p>\n<p>Please note that your presentation will work best if you work as a team. For example, you may decide to divide the presentation into sections for different team members to work on, but your presentation will be stronger if all team members read each other's work and offer feedback and advice. This will make the overall presentation more coherent.</p>\n<p>If one or more group member does not participate with the group (i.e. attending meetings, responding to messages, completing drafts in a timely manner as decided by the group, submitting work as requested), the group member may be removed from the group and required to complete work individually without the benefit of feedback from the other member(s) of the team. It is incumbent upon team members to treat each other professionally and to report to the course coordinator if a member has been non-responsive or non-participatory. If a team member is removed from a group, he or she will be notified in writing by the course coordinator.</p>\n<p>If you have circumstances which prevent you from working in a group, you must formally request permission to complete this assessment item individually by emailing the course coordinator before team assignments are made. Your request should include supporting documentation or refer to a SAP.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You will need to provide a written transcription of your presentation including bibliography which you will also upload to Turnitin on the FREN3360 Blackboard site by 12pm the Friday of the week of your presentation.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Comparative analysis of two film sequences",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p>Week 5 Fri - Week 13 Fri</p>\n<p>Students must sign up to the comparative analysis by Monday in Week 4.</p></dd>",
            "learning_objectives": "L01, L02, L03, L05",
            "mode": "Oral, Written",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>For each film screened from weeks 2-12, you will be given a list of possible themes to examine for your comparative analysis. You will be asked to choose two sequences from one of the films screened from Weeks 2-12 which was not the subject of detailed discussion in class (or if they were, you will have chosen them for reasons different from those discussed in class). You will analyse them by specifying the particular thematic you are studying in the two sequences and explaining the relationship between the two scenes chosen and other scenes relating to the same thematic in the film or in other films by the same auteur (does the second sequence simply reinforce the thematic developed in the first, or does it represent a variation or evolution of the thematic, or does it subvert the thematic previously presented, for example). Alternatively, you may concentrate on a stylistic aspect of the film (narrative structure, acting, editing, sound, lighting etc) but you must specify which particular stylistic aspect and its relation to the chosen thematic. You should give a brief description of each sequence analysed (three or four sentences maximum) which will give you the opportunity to demonstrate your knowledge of appropriate cinematic terminology. You will submit your commentary on the sequences in two forms: the first is an oral commentary spoken over either YouTube clips (if available) of the two sequences chosen or a PowerPoint presentation with audio composed of stills from the two sequences, using a Flip video; the second is a written transcription of this commentary to be uploaded via Turnitin.</p>\n<p>You will not be permitted to use<em> Les 400 coups</em> for your analysis as this film will serve as an example in class.</p>\n<p>You must work on a different director/topic from your oral presentation.</p>\n<p>There are four submission dates for the comparative analysis, depending on which film you have chosen:</p>\n<p>Week 5 - Friday before 5pm (films screened in weeks 2-3)</p>\n<p>Week 7 - Friday before 5pm (films screened in weeks 4-6)</p>\n<p>Week 10 - Friday 4 before 5pm (films screened from weeks 7-9)</p>\n<p>Week 13 - Friday  before 5pm (films screened from weeks 10-12)</p>\n<p>Length : 800-1000 words for the transcription</p>\n<p><strong>Students must sign up to the analyse comparative by Monday in Week 4.</strong></p>\n<p><strong>You must choose a film by an author/on a topic different from that chosen for your oral presentation.</strong></p>\n<p><strong>Use of AI and machine translation</strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Written transcript to be uploaded to Turnitin. Video submission instructions will be posted to Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "End of semester exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>40% HURDLE (40%) </dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>2/11/2024 - 16/11/2024</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will do an end of semester exam in which they will write an essay of 800-1,200 words responding to one of a set of questions. The general topic areas from which these questions will be drawn will be published on Blackboard in Week 11 of semester. Students will learn the specific questions relating to these topics in the exam.</p>\n<p>Please note,<strong> you will not be permitted to choose as the principal object of your analysis the film which you chose for your analyse comparative, nor a film by a director whose work was the object of your oral presentation, but you will be allowed to make reference to those films. </strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(22 Jul - 27 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Weeks 1-13 Lecture series</strong><br><p>Weekly lectures on film auteurs, movements, and theories.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Weeks 1-13 Lecture series</strong>",
            "topic_description": "Weeks 1-13 Lecture series Weekly lectures on film auteurs, movements, and theories.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(22 Jul - 27 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Weeks 1-13 Tutorials</strong><br><p>One hour tutorial from Weeks 1-13 on selected auteurs, movements, theories and cinema-specific terminology in French.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Weeks 1-13 Tutorials</strong>",
            "topic_description": "Weeks 1-13 Tutorials One hour tutorial from Weeks 1-13 on selected auteurs, movements, theories and cinema-specific terminology in French.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 12(22 Jul - 20 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Weeks 1-12 Film screenings</strong><br><p>There will be film screenings for those specific films for which a livestream film is not available to be viewed at home.  All films will be shown with English or, where possible, French subtitles.  Please see Blackboard for further details.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Weeks 1-12 Film screenings</strong>",
            "topic_description": "Weeks 1-12 Film screenings There will be film screenings for those specific films for which a livestream film is not available to be viewed at home.  All films will be shown with English or, where possible, French subtitles.  Please see Blackboard for further details.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}