{
    "course_title": "Genders & Cultures: Comparative Perspectives on Race and Ethnicity",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/GEND2001-64807-7460",
    "full_course_code": "GEND2001-64807-7460",
    "course_code": "GEND2001",
    "class_code": "64807",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Engage in analysis of the complex ways in which gender, sexuality, race, class and culture intersect and operate within/against oppression and empowerment through discourses of coloniality/decoloniality, critical theories, and gender/feminist movements across the globe."
        },
        {
            "number": "LO2.",
            "description": "Collaboratively engage with contemporary cultural production and debates in gender studies on the intersectionality of gender across, around and through the borders of sexuality, class, race and ethnicity, and culture."
        },
        {
            "number": "LO3.",
            "description": "Critically reflect upon your own gendered, sexual and racial identities to further understand the ways in which the personal becomes the political in working towards gender justice in local and global contexts."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Weekly Journal",
            "special_indicators": [],
            "weighting": "<dd>30% 300 words per week (3 entries x 10% each) </dd>",
            "due_date": "<dd><p> 5/08/2024 - 21/10/2024</p>\n<p>\n</p><p>Journals are due on Mondays the following week at 2pm. </p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Notebook/ Logbook",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Between weeks 2-12, students will submit <strong>three</strong> weekly journal entries via Blackboard. You may choose which weeks to submit, but for the best results try to submit one in Week 2, 3, or 4 to get early feedback on your writing, analysis, and referencing. For three weeks of the course, you will be required to write a short answer to the Tutorial Journal Question, based on your understandings of the required readings, lectures, and tutorials. This will allow you to get some feedback on your ideas and spread out your workload. You will need to find the Tutorial Journal Question under the relevant topic each week. Journals will be due Monday the following week at 2pm (i.e. for Week 2, the journal is due Monday 5th August in Week 3).</p>\n<p>The best Journals will be thoughtful and analytical, rather than simply regurgitating the readings. You will need to address the question, rather than talking around the topic or simply summarising the readings. They need to be referenced (either APA or Chicago footnotes). Referencing is not included in word limits for essays and written assignments (unless footnotes are discursive in character). Your journal entries must not be simply a summary of the weekly course material. You must show that you are critically reflecting on the material.</p>\n<p><strong>Word Limits: </strong>A final word count<strong> </strong>that is within ±10% of the set length (300 words) is acceptable. Word count does not include footnotes; however, discursive footnotes are included in the word count. A word count that is outside these 10% will receive a proportionate penalty and will be graded against the grading criteria. </p>\n<p><strong>AI: </strong>This assessment task evaluates the student's abilities, skills and knowledge without the aid of artificial intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via Turnitin on Blackboard (Assessment Folder).</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Podcast Episode",
            "special_indicators": [],
            "weighting": "<dd>30% 10-minute Podcast Episode </dd>",
            "due_date": "<dd><p> 13/09/2024 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Oral, Written",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You will need to research and analyse one of the topics provided (list on Blackboard) to produce a 10-minute podcast episode. You will need to upload both a recorded version of the episode and a transcript to Turnitin.</p>\n<p>The structure of your presentation will vary depending on your project, but you must include the following:</p>\n<ul>\n<li>The question that you are seeking to answer, and the argument you are presenting in response to that question.</li>\n<li>A clear and engaging description of the topic.</li>\n<li>Critical analysis of the topic and its implications for feminism and/or gender justice, including engagement with relevant theory/philosophical perspectives and concepts that we have explored in the course, particularly focusing on race, culture, or ethnicity.</li>\n<li>A justification of why this topic is important to learn about.</li>\n</ul>\n<p> </p>\n<p>Since this is a Gender Studies course, not a media production course, the technical quality will not be a major criterion of assessment. However, please be as creative as you like, with music, sound effects, interviews etc. </p>\n<p><strong>Length Limits: </strong>A final length<strong> </strong>that is within ±10% of the set length (10 minutes) is acceptable. A final podcast length that is outside these 10% will receive a proportionate penalty and will be graded against the grading criteria. </p>\n<p><strong>AI: </strong>This assessment task evaluates the student's abilities, skills and knowledge without the aid of artificial intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via Turnitin on Blackboard (Assessment Folder).</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Research Essay",
            "special_indicators": [],
            "weighting": "<dd>40% 2000 words </dd>",
            "due_date": "<dd><p> 25/10/2024 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You will write a research essay responding to <strong>one</strong> of the essay questions/topics that will be made available on Blackboard early in the semester. Essay questions/topics will relate to the weekly lecture topics and the key concepts, themes, and theoretical perspectives from the course. Detailed marking criteria will be available on Blackboard and we will discuss the expectations around the reflective research essay format in classes throughout the semester.</p>\n<p>You may write using first person perspective in your essays and pay attention to the argument that you are making when answering the question. In your analysis of the question, make sure you engage with and reference the relevant course material including, especially the assigned weekly readings related to your essay question. Make sure your essay has a clear and logical structure and that your argument and analysis flows from your introduction to conclusion. You must not write on a topic you have already researched in this subject, for any of your tutorial journals or for your podcast. You should include at least 6 scholarly sources.</p>\n<p><strong>Word Limits: </strong>A final word count<strong> </strong>that is within ±10% of the set length (2000 words) is acceptable. Word count does not include footnotes; however, discursive footnotes are included in the word count. A word count that is outside these 10% will receive a proportionate penalty and will be graded against the grading criteria. </p>\n<p><strong>AI: </strong>This assessment task evaluates the student's abilities, skills and knowledge without the aid of artificial intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via Turnitin on Blackboard (Assessment Folder).</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction</strong><br><p>In the first week of GEND2001, we begin to explore the key concepts of the course and consider some of the ways that our experience and understanding of gender is shaped by experiences of other social, cultural, political, and economic (etc.) experiences including race, class, culture, sexuality, and so on. We ask big questions about identity, subjectivity, selfhood, and the ways that multiple aspects of our identities become entangled to shape our experience of the world - including of marginalisation and oppression. We will also discuss the structure of the course and assessment.</p></br></p></div></td>",
            "topic_title": "<strong>Introduction</strong>",
            "topic_description": "Introduction In the first week of GEND2001, we begin to explore the key concepts of the course and consider some of the ways that our experience and understanding of gender is shaped by experiences of other social, cultural, political, and economic (etc.) experiences including race, class, culture, sexuality, and so on. We ask big questions about identity, subjectivity, selfhood, and the ways that multiple aspects of our identities become entangled to shape our experience of the world - including of marginalisation and oppression. We will also discuss the structure of the course and assessment.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Feminist Genealogies and Colonial Legacies</strong><br><p>In Week 2 of the course, we think carefully about the legacies and ongoing impacts of coloniality on our understandings and experiences of gender and sexuality.</p></br></p></div></td>",
            "topic_title": "<strong>Feminist Genealogies and Colonial Legacies</strong>",
            "topic_description": "Feminist Genealogies and Colonial Legacies In Week 2 of the course, we think carefully about the legacies and ongoing impacts of coloniality on our understandings and experiences of gender and sexuality.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Heterosexualism and the Colonial Modern Gender System</strong><br><p>In Week 3 of the course, we turn to the work of Maria Lugones. We will examine her concept of the coloniality of gender and her call for a decolonial feminism.</p></br></p></div></td>",
            "topic_title": "<strong>Heterosexualism and the Colonial Modern Gender System</strong>",
            "topic_description": "Heterosexualism and the Colonial Modern Gender System In Week 3 of the course, we turn to the work of Maria Lugones. We will examine her concept of the coloniality of gender and her call for a decolonial feminism.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(12 Aug - 18 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Reimagining Geographies of Selves</strong><br><p>In Week 4, we engage with queer theory via Gloria Anzaldúa's work to ask questions and imagine new possibilities about selfhood with a special focus on labels, fixed categories and divisions between self and others. </p></br></p></div></td>",
            "topic_title": "<strong>Reimagining Geographies of Selves</strong>",
            "topic_description": "Reimagining Geographies of Selves In Week 4, we engage with queer theory via Gloria Anzaldúa's work to ask questions and imagine new possibilities about selfhood with a special focus on labels, fixed categories and divisions between self and others.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(19 Aug - 25 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Indigenous Feminisms</strong><br><p>The Week 5 lecture will consider the ways that the lives of Indigenous peoples are shaped by understandings of race, and we will examine active resistance to racism and coloniality.</p></br></p></div></td>",
            "topic_title": "<strong>Indigenous Feminisms</strong>",
            "topic_description": "Indigenous Feminisms The Week 5 lecture will consider the ways that the lives of Indigenous peoples are shaped by understandings of race, and we will examine active resistance to racism and coloniality.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Feminist Artivism</strong><br><p>In Week 6, we look at artivism (art + activism) and the way it has been used to cultivate awareness particularly about racial inequalities in feminist communities.</p></br></p></div></td>",
            "topic_title": "<strong>Feminist Artivism</strong>",
            "topic_description": "Feminist Artivism In Week 6, we look at artivism (art + activism) and the way it has been used to cultivate awareness particularly about racial inequalities in feminist communities.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(02 Sep - 08 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Can the Subaltern Speak?</strong><br><p>In the Week 7 lecture we will examine the politics of the subaltern, particularly thinking about postcolonial and decolonial feminisms in India. </p></br></p></div></td>",
            "topic_title": "<strong>Can the Subaltern Speak?</strong>",
            "topic_description": "Can the Subaltern Speak? In the Week 7 lecture we will examine the politics of the subaltern, particularly thinking about postcolonial and decolonial feminisms in India.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Feminisms in Asia</strong><br><p>Week 8, we will examine theories and discourses of Asian feminisms situated in a postcolonial context to reconsider the hegemony of western feminism.</p></br></p></div></td>",
            "topic_title": "<strong>Feminisms in Asia</strong>",
            "topic_description": "Feminisms in Asia Week 8, we will examine theories and discourses of Asian feminisms situated in a postcolonial context to reconsider the hegemony of western feminism.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>We Should All Be Feminists: Nigerian Feminism</strong><br><p>In Week 9, we will begin to unpack different African feminisms by using Nigeria as a decolonial case study.</p></br></p></div></td>",
            "topic_title": "<strong>We Should All Be Feminists: Nigerian Feminism</strong>",
            "topic_description": "We Should All Be Feminists: Nigerian Feminism In Week 9, we will begin to unpack different African feminisms by using Nigeria as a decolonial case study.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ecofeminisms</strong><br><p>In Week 10, we ask: what do feminism, decoloniality, and environmentalism have to do with each other?</p></br></p></div></td>",
            "topic_title": "<strong>Ecofeminisms</strong>",
            "topic_description": "Ecofeminisms In Week 10, we ask: what do feminism, decoloniality, and environmentalism have to do with each other?",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(07 Oct - 13 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Migrant &amp; Refugee Women </strong><br><p>In Week 10, we explore the experiences of migrant &amp; refugee women in Australia and consider the intersection of race and gender.</p></br></p></div></td>",
            "topic_title": "<strong>Migrant &amp; Refugee Women </strong>",
            "topic_description": "Migrant & Refugee Women In Week 10, we explore the experiences of migrant & refugee women in Australia and consider the intersection of race and gender.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Islamic Feminisms</strong><br><p>In Week 12, we will explore perspectives and key issues in Islamic Feminisms around the world.</p></br></p></div></td>",
            "topic_title": "<strong>Islamic Feminisms</strong>",
            "topic_description": "Islamic Feminisms In Week 12, we will explore perspectives and key issues in Islamic Feminisms around the world.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Course Wrap-Up</strong><br/><p>This week we are going to think about the major themes that have emerged throughout the course and the overall takeaway messages from GEND2001. </p></p></div></td>",
            "topic_title": "<strong>Course Wrap-Up</strong>",
            "topic_description": "Course Wrap-Up This week we are going to think about the major themes that have emerged throughout the course and the overall takeaway messages from GEND2001.",
            "learning_outcomes": []
        }
    ]
}