{
    "course_title": "The Modern History of East Asia",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/HIST2040-63180-7460",
    "full_course_code": "HIST2040-63180-7460",
    "course_code": "HIST2040",
    "class_code": "63180",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand the broad contours of East Asia's historical development dating from around 1800 through to the present."
        },
        {
            "number": "LO2.",
            "description": "Understand the place of East Asia in global history over the last two centuries."
        },
        {
            "number": "LO3.",
            "description": "Understand the diverse historical actors in East Asia, from China to Japan, Korea, Taiwan, the different countries of Southeast Asia, and external actors including the European colonial powers, the United States and the Soviet Union."
        },
        {
            "number": "LO4.",
            "description": "Critically evaluate the major intellectual debates and schools of thought in this field of history."
        },
        {
            "number": "LO5.",
            "description": "Express your understanding in a clear and precise manner in both written and oral forms."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Tutorial Participation",
            "special_indicators": [],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 31/07/2024 - 17/10/2024</p>\n<p>\n</p><p>Tutorials start in Week 2. Due to the Royal Queensland Show holiday on Wednesday, 14 August, there will be no HIST2040 classes in Week 4. The last tutorials will be taught in Week 12.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Activity/ Performance",
            "category": "Participation/ Student contribution",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students are required to attend tutorials, having read the assigned tutorial readings, and actively participate in the discussion of issues raised in the lectures and tutorial readings. The aim is to develop skills in articulating one's ideas in public and to critical discuss the major intellectual debates in the history of modern East Asia. </p>\n<p><em>Marking criteria are available in the ‘Assessment’ folder in Blackboard for this course</em>. </p>\n<p><br/></p>\n<p>In the event of illness, students can make up participation marks by providing their tutor with a medical certificate for the period in question and 1 to 1.5 pages of responses to the tutorial questions related to the readings for the missed tutorial. These should be emailed to the tutor prior to the following tutorial. These responses will be noted by the tutor in lieu of actual participation in the missed tutorial.</p>\n<p> <strong><em>Note: </em>Tutorials start in Week 2.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Essay: Primary Source Analysis",
            "special_indicators": [],
            "weighting": "<dd>30% 1000 words </dd>",
            "due_date": "<dd><p> 22/08/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Writing history is an interplay between \"secondary sources\" produced by scholars in the past and the present, and \"primary sources\", that is, historical evidence that is left in the form of a \"trace\" of an historical event - e.g. a speech, government record, book, newspaper article, memoir, folksong, etc. This assignment is designed to develop your skills in the critical analysis of primary sources. This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<p><br/></p>\n<p>On the Blackboard site for HIST2040 will be posted extracts from various primary sources related to the themes of this course. </p>\n<p>Choose one of these extracts and explain its significance in the context of modern East Asian history.</p>\n<p><br/></p>\n<p>In your analysis you should cover the following issues:</p>\n<p><br/></p>\n<p>(i) the year / period in which the source was composed;</p>\n<p>(ii) the background of the person / people who produced the source;</p>\n<p>(iii) the purpose for which the source was composed;</p>\n<p>(iv) the theory or philosophy or world view, endogenous or Western, that is expressed in the source;</p>\n<p>(v) the broader significance of this source in terms of the historical context in which it was produced.</p>\n<p><br/></p>\n<p>You should structure the paper as a single essay, but make sure you fully address each of the five issues above.</p>\n<p><br/></p>\n<p>To assist in your analysis of this source you may refer to the secondary scholarly literature on the country and period of history in which the source appeared. An extensive bibliography is not required. Please list the primary source. In addition, five secondary sources are sufficient but more can be used. Footnotes, quotes and bibliography are not included in the word limit of 1000 words (plus or minus 10%). Please avoid discursive footnotes.</p>\n<p><br/></p>\n<p><em>Marking criteria are available in the ‘Assessment’ folder in Blackboard for this course</em>.</p>\n<p><br/></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Please submit your assignment by the due date via the Turnitin link that can be found on Blackboard under \"Assessment\".</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Research Project",
            "special_indicators": [],
            "weighting": "<dd>50% 2000 words/ 10 minutes </dd>",
            "due_date": "<dd><p> 24/10/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Essay/ Critique, Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>The major assignment in this course is to address one of the questions below in ONE of the following three forms: (i) Essay; (ii) Podcast; (iii) Documentary-style Movie (using Apple's iMovie or Windows' Movie Maker).</strong></p>\n<p><br/></p>\n<p>The length requirement of each format is as follows:</p>\n<p>1. Essay: 2000 words (for referencing use Chicago style 17A; footnotes and bibliography are not included in the word limit of 2000 words, plus or minus 10%. Please avoid discursive footnotes.</p>\n<p>2. Podcast: 10 minutes</p>\n<p>3. Movie: 10 minutes</p>\n<p><br/></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<p><br/></p>\n<p><em>Marking criteria are available in the ‘Assessment’ folder in Blackboard for this course</em>.</p>\n<p><br/></p>\n<p><strong>NOTE:</strong><em> </em><strong><em>The sources you use for this assignment should be predominantly books, chapters, and journal articles from the discipline of History. </em></strong></p>\n<p><strong>ASSIGNMENT QUESTIONS</strong></p>\n<p>1. What were the reasons for \"the Great Divergence\" (Pomeranz 2000)? </p>\n<p>2. What was China's \"tributary system\", and how did the coming of the European colonial powers during the nineteenth century impact upon that system?</p>\n<p>3. Discuss the decline of the Confucian system of bureaucracy in northeast Asian states in the nineteenth century (<em>answer with reference to China, Japan, Korea or Vietnam</em>).</p>\n<p>4. What effect did European influence have on religion in East Asia during the nineteenth and early twentieth century? (<em>Answer with reference to one country</em>).</p>\n<p>5. How did Korea become a colony of Japan?</p>\n<p>6. Why was Siam (Thailand) not colonized?</p>\n<p>7. How successful was the Qing Dynasty in attempting to modernize China in the second half of the nineteenth century? <em>OR</em>: Account for the rise of Chinese nationalism in the late nineteenth and early twentieth century.</p>\n<p>8. How was Japan able to modernize its economy and military following the Meiji Restoration in 1868?</p>\n<p>9. Discuss the impact of French colonial rule on Vietnam.</p>\n<p>10. Was the early women's movement in East Asia influenced by the West or driven internally? (<em>Answer with reference to one country</em>).</p>\n<p>11. Discuss the role of the ethnic Chinese in the economies and societies of colonial Southeast Asia from 1850-1941.</p>\n<p>12. What was the impact of Japanese colonial rule on the society of Korea <em>or</em> Taiwan?</p>\n<p>13. Discuss the historical experiences of indigenous peoples in an East Asian country. What were the similaries and differences with the historical experiences of indigenous peoples in Western settler societies? (<em>Answer with reference to one country</em>).</p>\n<p>14. How was the Communist Party of China successful in coming to power in 1949?</p>\n<p>15. What were the major reasons for the rise of Indonesian nationalism in the first half of the twentieth century?</p>\n<p>16. What were the reasons for the Korean War, 1950-53?</p>\n<p>17. What factors gave rise to armed ethno-nationalist movements in Myanmar after independence?</p>\n<p>18. Evaluate the \"orthodox\" and \"revisionist\" debate about the reasons for the Vietnam War.</p>\n<p>19. What were the reasons for Japan's \"economic miracle\" after its defeat in World War Two?</p>\n<p>20. Discuss the significance of either the Great Famine (1959-61) or the Cultural Revolution (1966-76) in China's modern history.</p>\n<p>21. What were the reasons for the massacres of communists and suspected communists in Indonesia in 1965-66?</p>\n<p>22. Explain the process of democratization that has taken place in Taiwan since the 1980s.</p>\n<p>23. What are the reasons for the Islamic resurgence in Southeast Asia since the 1980s? (<em>Answer with reference to one country</em>).</p>\n<p>24. Discuss the modernization of a religious tradition in an East Asian country (<em>answer with reference to one country</em>).</p>\n<p>25. What are the similarities and differences between modern women's movements in East Asia and in the West? (<em>You may focus on one OR more countries</em>).</p>\n<p>26. What is North Korea's <em>Juche</em> ideology, and how influential has it been?</p>\n<p>27. What was the \"Reform and Opening Up\" policy in the PRC, and how successful was it?</p>\n<p>28. Discuss the recent rise of LGBTQ activism in East Asia. How successful has it been in achieving its goals? (<em>Answer with reference to one East Asian country</em>).</p>\n<p>29. Account for the success of the popular culture industry in Korea.</p>\n<p>30. Why have the Armed Forces been such a powerful political force in Myanmar since the late 1950s?</p>\n<p><br/></p>\n<p>***</p>\n<p>TIPS FOR DOING A GOOD ASSIGNMENT IN HISTORY</p>\n<p>1. Answer the question as thoroughly as possible.</p>\n<p>2. Good research: Use books, book chapters, and articles mainly from the discipline of History.</p>\n<p>3. Good structure: Organize your introduction, sections, paragraphs, and conclusion.</p>\n<p>4. Good writing: Write clearly. Avoid the passive voice. Avoid overlength sentences. Use capitals correctly.</p>\n<p>5. 'Wow factor'. Avoid stale, well-worn arguments. Push the critical analysis as far as you can go.</p>\n<p>6. Good referencing: Reference thoroughly and use the correct referencing format: Chicago 17A footnotes and bibliography.</p>\n<p>7. Avoid moralizing and appeals to the emotions. Let the historical evidence drive the argument.</p>\n<p><br/></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Don't give your essay or assignment a new title. Instead, please state the assignment question that you have chosen from the list.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week One: \"Introduction: What is East Asia?\"</strong><br><p>Introduction: What is East Asia ?</p>\n<p>The first part of the lecture will introduce students to the course, explain the course content, and the assessment items. The second part of the lecture will discuss the concept of \"East Asia\", the various countries that make up the region, and the relationship between Northeast Asia and Southeast Asia. </p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week One: \"Introduction: What is East Asia?\"</strong>",
            "topic_description": "Week One: \"Introduction: What is East Asia?\" Introduction: What is East Asia ? The first part of the lecture will introduce students to the course, explain the course content, and the assessment items. The second part of the lecture will discuss the concept of \"East Asia\", the various countries that make up the region, and the relationship between Northeast Asia and Southeast Asia.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week Two: \"Before the Great Divergence: East Asia in 1800\"</strong><br><p>Before the Great Divergence: East Asia in 1800</p>\n<p>We are familiar with the history of European dominance in East Asia. Yet up until 1800 most of East Asia was politically independent. China was the world's largest economy. Standards of living were comparable with much of Europe. Japan and Korea were stable, moderately prosperous states, while mainland Southeast Asian kingdoms were expanding. Kenneth Pomeranz's influential 2000 work, <em>The Great Divergence, </em>argues that Europe only began to overtake East Asia in the nineteenth century, when the economic \"divergence\" between the two regions rapidly widened. This week's tutorial looks at East Asia prior to European dominance.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week Two: \"Before the Great Divergence: East Asia in 1800\"</strong>",
            "topic_description": "Week Two: \"Before the Great Divergence: East Asia in 1800\" Before the Great Divergence: East Asia in 1800 We are familiar with the history of European dominance in East Asia. Yet up until 1800 most of East Asia was politically independent. China was the world's largest economy. Standards of living were comparable with much of Europe. Japan and Korea were stable, moderately prosperous states, while mainland Southeast Asian kingdoms were expanding. Kenneth Pomeranz's influential 2000 work, The Great Divergence, argues that Europe only began to overtake East Asia in the nineteenth century, when the economic \"divergence\" between the two regions rapidly widened. This week's tutorial looks at East Asia prior to European dominance.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week Three:  \"European and Japanese Imperialism, c. 1840s-1910\"</strong><br><p>European and Japanese Imperialism, c1840s-1910</p>\n<p>Throughout the nineteenth century European military and commercial power expanded throughout East Asia. The Opium Wars and the subsequent \"unequal treaties\" weakened China, East Asia's greatest power. The American navy forced the Tokugawa Shogunate to open up Japan's economy, while Korea's isolation was ended by the Japanese as Japan itself emerged as an imperial power. Dutch, British, French, and later American military incursions resulted in most of Southeast Asia falling under direct colonial rule by the early twentieth century. </p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week Three:  \"European and Japanese Imperialism, c. 1840s-1910\"</strong>",
            "topic_description": "Week Three:  \"European and Japanese Imperialism, c. 1840s-1910\" European and Japanese Imperialism, c1840s-1910 Throughout the nineteenth century European military and commercial power expanded throughout East Asia. The Opium Wars and the subsequent \"unequal treaties\" weakened China, East Asia's greatest power. The American navy forced the Tokugawa Shogunate to open up Japan's economy, while Korea's isolation was ended by the Japanese as Japan itself emerged as an imperial power. Dutch, British, French, and later American military incursions resulted in most of Southeast Asia falling under direct colonial rule by the early twentieth century.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5(19 Aug - 25 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week Five: \"Revolution, Republicanism, and Anti-Colonial Nationalism, c. 1900-1937\"</strong><br><p>Revolution, Republicanism, and Anti-Colonial Nationalism, c1900-1937</p>\n<p>The first half of the twentieth century was an age of revolution in East Asia. The failure of the traditional monarchies to defend their kingdoms from European (or Japanese) incursions stimulated radical new political ideas. Many of these ideas came from Europe: revolution, republicanism, constitutionalism, nationalism, democracy, science, social equality, socialism, and communism.  </p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week Five: \"Revolution, Republicanism, and Anti-Colonial Nationalism, c. 1900-1937\"</strong>",
            "topic_description": "Week Five: \"Revolution, Republicanism, and Anti-Colonial Nationalism, c. 1900-1937\" Revolution, Republicanism, and Anti-Colonial Nationalism, c1900-1937 The first half of the twentieth century was an age of revolution in East Asia. The failure of the traditional monarchies to defend their kingdoms from European (or Japanese) incursions stimulated radical new political ideas. Many of these ideas came from Europe: revolution, republicanism, constitutionalism, nationalism, democracy, science, social equality, socialism, and communism.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week Six:  \"Being Modern in East Asia in the Interwar Years, c. 1918-37\"</strong><br><p>Being Modern in East Asia in the Interwar Years, c1918-37</p>\n<p>The interwar years in East Asia were a time of extraordinary social and cultural openness and vitality. Traditional culture and religion were questioned. The desire to be modern and \"civilized\" was influential. European middle-class fashions, consumer goods, and even manners, were popular. The women's movement and the issue of gender equality became closely bound up with nationalism movements. In Japan, the \"modern girl\" phenomenon exemplified a new ideal of sexual liberation. Conservatives tried to respond to these progressive ideas with cultural programs of their own, like Republican China's \"New Life Movement\" in the 1930s. For many East Asians, Japan was an influential model of a modern, prosperous, powerful, and independent nation.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week Six:  \"Being Modern in East Asia in the Interwar Years, c. 1918-37\"</strong>",
            "topic_description": "Week Six:  \"Being Modern in East Asia in the Interwar Years, c. 1918-37\" Being Modern in East Asia in the Interwar Years, c1918-37 The interwar years in East Asia were a time of extraordinary social and cultural openness and vitality. Traditional culture and religion were questioned. The desire to be modern and \"civilized\" was influential. European middle-class fashions, consumer goods, and even manners, were popular. The women's movement and the issue of gender equality became closely bound up with nationalism movements. In Japan, the \"modern girl\" phenomenon exemplified a new ideal of sexual liberation. Conservatives tried to respond to these progressive ideas with cultural programs of their own, like Republican China's \"New Life Movement\" in the 1930s. For many East Asians, Japan was an influential model of a modern, prosperous, powerful, and independent nation.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 7(02 Sep - 08 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week Seven: \"The Greater East Asia Co-Prosperity Sphere and the Pacific War\" </strong><br><p>The Greater East Asia Co-Prosperity Sphere and the Pacific War</p>\n<p>Japan's invasion of China in 1937 not only began the devastating 8-year long second Sino-Japanese War but would bring about a complete reshaping of the political order in East Asia. America's entry into World War II in 1941 had a major impact on Japan's Southward Advance and the growth of the Greater East Asia Co-Prosperity Sphere. </p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week Seven: \"The Greater East Asia Co-Prosperity Sphere and the Pacific War\" </strong>",
            "topic_description": "Week Seven: \"The Greater East Asia Co-Prosperity Sphere and the Pacific War\" The Greater East Asia Co-Prosperity Sphere and the Pacific War Japan's invasion of China in 1937 not only began the devastating 8-year long second Sino-Japanese War but would bring about a complete reshaping of the political order in East Asia. America's entry into World War II in 1941 had a major impact on Japan's Southward Advance and the growth of the Greater East Asia Co-Prosperity Sphere.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week Eight:  \"The Collapse of Colonial Rule and Decolonization\"  </strong><br><p>The Collapse of Colonial Rule and Decolonization</p>\n<p>By late 1940s, the Japanese Empire had been defeated, the Chinese Communist Party had established the People's Republic of China, the Nationalist Party had retreated to Taiwan, Korea was independent but divided, and Vietnamese, Indonesians, Burmese, and Malays were fighting or negotiating for an end to European colonial rule in Southeast Asia. All over East Asia new independent regimes came to power amidst intense political instability.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week Eight:  \"The Collapse of Colonial Rule and Decolonization\"  </strong>",
            "topic_description": "Week Eight:  \"The Collapse of Colonial Rule and Decolonization\" The Collapse of Colonial Rule and Decolonization By late 1940s, the Japanese Empire had been defeated, the Chinese Communist Party had established the People's Republic of China, the Nationalist Party had retreated to Taiwan, Korea was independent but divided, and Vietnamese, Indonesians, Burmese, and Malays were fighting or negotiating for an end to European colonial rule in Southeast Asia. All over East Asia new independent regimes came to power amidst intense political instability.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week Nine: \"The Cold War in East Asia I: Communism and Anti-Imperialism, c1949-1975\"</strong><br><p>The Cold War in East Asia I: Communism and Anti-Imperialism, c. 1949-1975</p>\n<p>Many communist parties were established in East Asia following the 1917 Russian Revolution, but the victory of the Chinese Communist Party in 1949 contributed to the rapid spread of communism in the region. This drew in the world's new superpowers, the US and the USSR, making East Asia a central battleground of the global Cold War. The Korean War was the first \"hot war\" of the Cold War period. In the 1950s the Indonesian Communist Party (PKI) became the 3rd largest in the world. Anti-imperialism, nationalism, and communism combined in the Vietnam War, which ended in a rare military failure for the US and the unification of Vietnam under a socialist government in 1975.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week Nine: \"The Cold War in East Asia I: Communism and Anti-Imperialism, c1949-1975\"</strong>",
            "topic_description": "Week Nine: \"The Cold War in East Asia I: Communism and Anti-Imperialism, c1949-1975\" The Cold War in East Asia I: Communism and Anti-Imperialism, c. 1949-1975 Many communist parties were established in East Asia following the 1917 Russian Revolution, but the victory of the Chinese Communist Party in 1949 contributed to the rapid spread of communism in the region. This drew in the world's new superpowers, the US and the USSR, making East Asia a central battleground of the global Cold War. The Korean War was the first \"hot war\" of the Cold War period. In the 1950s the Indonesian Communist Party (PKI) became the 3rd largest in the world. Anti-imperialism, nationalism, and communism combined in the Vietnam War, which ended in a rare military failure for the US and the unification of Vietnam under a socialist government in 1975.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week Ten: \"The Cold War in East Asia II: Anti-Communism, c1960-1979\"</strong><br><p>The Cold War in East Asia II: Anti-Communism, c1960-1979</p>\n<p>The rise of anti-communism in East Asia and frustration with the intense political instability led to an authoritarian turn in the non-communist states of East Asia. The military seized power in Thailand, Myanmar, Korea, South Vietnam, and Indonesia, while Taiwan (the Republic of China) was under the authoritarian rule of the Nationalist Party (KMT). Only Japan under its new, post-war constitution remained democratic. </p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week Ten: \"The Cold War in East Asia II: Anti-Communism, c1960-1979\"</strong>",
            "topic_description": "Week Ten: \"The Cold War in East Asia II: Anti-Communism, c1960-1979\" The Cold War in East Asia II: Anti-Communism, c1960-1979 The rise of anti-communism in East Asia and frustration with the intense political instability led to an authoritarian turn in the non-communist states of East Asia. The military seized power in Thailand, Myanmar, Korea, South Vietnam, and Indonesia, while Taiwan (the Republic of China) was under the authoritarian rule of the Nationalist Party (KMT). Only Japan under its new, post-war constitution remained democratic.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 11(07 Oct - 13 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week Eleven:  \"Democratization and Social Movements, c. 1980-2000\"</strong><br><p>Democratization and Social Movements, c1980-2000s</p>\n<p>As the Cold War wound down and East Asian states enjoyed greater stability and prosperity, authoritarian regimes came under pressure from various new social movements to democratize. In Taiwan, Korea, the Philippines, Thailand, and even Indonesia, authoritarian rulers were forced to give up power. In communist China, a pro-democracy movement led by students was crushed in Tiananmen Square in June 1989. Meanwhile women's movements, ethnic groups, indigenous peoples, environmental groups, and more recently LGBTQ campaigners, became increasingly organized and vocal, demonstrating the emergence of a lively civil society in East Asia. </p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week Eleven:  \"Democratization and Social Movements, c. 1980-2000\"</strong>",
            "topic_description": "Week Eleven:  \"Democratization and Social Movements, c. 1980-2000\" Democratization and Social Movements, c1980-2000s As the Cold War wound down and East Asian states enjoyed greater stability and prosperity, authoritarian regimes came under pressure from various new social movements to democratize. In Taiwan, Korea, the Philippines, Thailand, and even Indonesia, authoritarian rulers were forced to give up power. In communist China, a pro-democracy movement led by students was crushed in Tiananmen Square in June 1989. Meanwhile women's movements, ethnic groups, indigenous peoples, environmental groups, and more recently LGBTQ campaigners, became increasingly organized and vocal, demonstrating the emergence of a lively civil society in East Asia.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week Twelve: \"East Asia's Reintegration: Society and Popular Culture since the 1990s\"</strong><br><p>East Asia's Reintegration: Society and Popular Culture since the 1990s</p>\n<p>Growing prosperity across East Asia since the 1990s, together with the growth of the tourism industry, budget airlines, and the expansion of the popular culture industry, initially led by Japan (<em>manga</em>, <em>anime</em>, J-Pop) and later by Korea (K-Pop, K-drama, cosmetic surgery, etc.), and most recently the development of the internet and mass use of social media, have led to a growing cultural integration of the East Asian region. </p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week Twelve: \"East Asia's Reintegration: Society and Popular Culture since the 1990s\"</strong>",
            "topic_description": "Week Twelve: \"East Asia's Reintegration: Society and Popular Culture since the 1990s\" East Asia's Reintegration: Society and Popular Culture since the 1990s Growing prosperity across East Asia since the 1990s, together with the growth of the tourism industry, budget airlines, and the expansion of the popular culture industry, initially led by Japan ( manga , anime , J-Pop) and later by Korea (K-Pop, K-drama, cosmetic surgery, etc.), and most recently the development of the internet and mass use of social media, have led to a growing cultural integration of the East Asian region.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week Thirteen:  \"The Fading of US Hegemony in East Asia, 2010s-Present\"</strong><br><p>The Fading of US Hegemony in East Asia, 2010s</p>\n<p>Following the end of the Pacific War in 1945 the US expanded its influence in East Asia, primarily to prevent the spread of communism. By the end of the Cold War in the early 1990s, the US had become the hegemonic power in the region. With the recent economic rise of China and its increased willingness to assert regional influence, US hegemony in East Asia has been challenged. Is East Asia returning to a precolonial pattern of independent states with a powerful, prosperous China at its core?</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Week Thirteen:  \"The Fading of US Hegemony in East Asia, 2010s-Present\"</strong>",
            "topic_description": "Week Thirteen:  \"The Fading of US Hegemony in East Asia, 2010s-Present\" The Fading of US Hegemony in East Asia, 2010s Following the end of the Pacific War in 1945 the US expanded its influence in East Asia, primarily to prevent the spread of communism. By the end of the Cold War in the early 1990s, the US had become the hegemonic power in the region. With the recent economic rise of China and its increased willingness to assert regional influence, US hegemony in East Asia has been challenged. Is East Asia returning to a precolonial pattern of independent states with a powerful, prosperous China at its core?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}