{
    "course_title": "Professions, People and Healthcare",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/HLTH1000-62562-7460",
    "full_course_code": "HLTH1000-62562-7460",
    "course_code": "HLTH1000",
    "class_code": "62562",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (15/07/2024 - 16/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Identify determinants of health and well-being, reflecting on socio-economic and physical aspects, along with individual characteristics and behaviours."
        },
        {
            "number": "LO2.",
            "description": "Recognise population groups experiencing social exclusion and marginalisation in Australia, and the impact on their health and well-being."
        },
        {
            "number": "LO3.",
            "description": "Describe the range of roles in health and health-related settings within the workforce in Australia."
        },
        {
            "number": "LO4.",
            "description": "Explain the structure and layers of the Australian health care system, comparing it to global healthcare systems."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate effective communication and collaborative practice in a healthcare context, emphasising person centred practices."
        },
        {
            "number": "LO6.",
            "description": "Communicate the importance of culturally relevant and safe health care practice and services to advance Aboriginal and Torres Strait Islander health outcomes."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Adaptive Learning Tasks",
            "special_indicators": [],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p>RiPPLE Round 1: 2%<br/>\nCreate an effective resource from Themes 1 and 2 22/07/2024 - 9/08/2024</p>\n<p>RiPPLE Round 2: 2%<br/>\nEffectively Moderate Five Resources from peer submissions related to Theme 1 and 2.  29/07/2024 - 16/08/2024</p>\n<p>RiPPLE Round 3: 2%<br/>\nAnswer 10 questions correctly from Theme 1 and 2 approved resources.  5/08/2024 - 23/08/2024</p>\n<p>RiPPLE Round 4: 2%<br/>\nCreate an effective resource from Theme 3 19/08/2024 - 6/09/2024</p>\n<p>RiPPLE Round 5: 2%<br/>\nEffectively Moderate Five Resources from peer submissions related to Theme 3 26/08/2024 - 13/09/2024</p>\n<p>RiPPLE Round 6: 3%<br/>\nAnswer 15 questions correctly from Theme 3 approved resources. 2/09/2024 - 20/09/2024</p>\n<p>RiPPLE Round 7: 2%<br/>\nCreate an effective resource from Theme 4 and 5 16/09/2024 - 11/10/2024</p>\n<p>RiPPLE Round 8: 2%<br/>\nEffectively Moderate Five Resources from peer submissions related to Theme 4 and 5 30/09/2024 - 18/10/2024</p>\n<p>RiPPLE Round 9: 3%<br/>\nAnswer 15 questions correctly from Theme 4 and 5 approved resources. 7/10/2024 - 25/10/2024</p>\n<p>\n</p><p>All due at 4 pm on the specific dates. </p></dd>",
            "learning_objectives": "L03, L05",
            "mode": "Activity/ Performance",
            "category": "Participation/ Student contribution, Tutorial/ Problem Set",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Question Authoring, Moderating and Answering via RiPPLE</strong></p>\n<ul>\n<li>The aim of this assessment task is facilitate <strong>active, learner-centred, personalised and social learning</strong> and to allow students to engage with AI in this platform.</li>\n<li>Students will author 1 effective resource/ question, moderate 5 eligible resources and answer 10-15 questions. The tasks will occur in 3 week blocks of create-moderate-practice for specific course content. This is repeated three times, to allow a total of nine rounds for students to score a <strong>maximum of 20% on successfully completing to the required standards in all rounds.</strong></li>\n<li>Round 1-5 and 7-8 are worth 2% each; Rounds 6 and 9 are worth 3%</li>\n</ul>\n<p><br/></p>\n<p>Attendance at tutorials is required to familiarise yourself with the platform, and in understanding how to approach this task successfully for each round. Maximise the face to face time, to seek in person feedback from peers and tutors in class.</p>\n<ul>\n<li>There are 3 weeks allocated for each round. Rounds in each 3 week cycle of create, moderate and practice will overlap to make it favourable for the students to complete the linked tasks.</li>\n<li>Ensure you create as <strong>early as possible </strong>in the allocated week/s to allow peers to moderate your question so it is \"effective\".</li>\n<li>Ensure you start moderating <strong>early in the cycle</strong> for your moderations to be approved by staff and peers. </li>\n<li>Your creations and moderations will be quality checked by staff and will be rejected if not up to the standard required.</li>\n<li>If this is early enough in the 3 week cycle, you can modify as per feedback and resubmit <strong>before</strong> the deadline for that round.</li>\n<li>The RiPPLE dashboard will keep you updated on the status of your submissions.</li>\n<li>If they have not been approved, check for flags and any feedback, and if you have linked to the correct assessment and required content theme.</li>\n<li>Correctly answering 10-15 practice questions (unlimited attempts) will also need time, so start early in the round's allocated time and keep practising for the full three weeks.</li>\n</ul>\n<p><strong>Please note: </strong>If you submit your creations and moderations, at the very last minute and there is no time for it to be moderated or checked to be \"effective\", there is a possibility of a mark of zero will be provided. The three week blocks are provided so you are able to <strong>check on continous feedback, and respond</strong> or create a new effective resource/ moderate more where required.</p>\n<p><br/></p>\n<p>Artificial Intelligence (AI) provides emerging tools that may support students in completing this assessment task. Students may appropriately use AI in completing this assessment task. Students must clearly reference any use of AI in each instance. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Online submission via RiPPLE link within Blackboard in set assessment rounds. </p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Infographic and presentation/role play on professions and professionals",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>35%</dd>",
            "due_date": "<dd><p>Week 7: Infographic to be submitted by the end of the allocated tutorial for each group.</p>\n<p>Week 8 - 9: Three-minute presentation or role play will occur in student allocated face-to-face sessions, depending on tutorial allocation in these two weeks.</p></dd>",
            "learning_objectives": "L03, L05",
            "mode": "Activity/ Performance, Product/ Artefact/ Multimedia",
            "category": "Presentation, Poster, Role play/ Simulation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment task aims to develop students' understanding and skills in interprofessional collaboration within the context of health promotion.</p>\n<p>This could take on the context of health promotion poster to an individual (e.g. smoking cessation or education about lifestyle risk factors in chronic disease) or to a community (e.g. importance of vaccinations for preventing widespread disease or promoting community health protection such as water fluoridation). The topic should have potential for interprofessional collaboration, rather than being from a narrow disciplinary focus.</p>\n<p>The audience that the infographic and presentation/role play is being pitched to has <strong>low health literacy.</strong></p>\n<p>Students will work in small multi disciplinary groups to create an infographic and present their findings and recommendations through a presentation or role play. Teams will be formed in class in Week 2 and team charters agreed to. Select teams with at least 4 or 5 different disciplines/ professions. Teams should be between <strong>4-6 students. </strong></p>\n<p><strong>Part 1: The infographic </strong></p>\n<p>In your groups, create an infographic that illustrates a health promotion campaign addressing a specific topical health issue that needs interprofessional collaboration. This should include:</p>\n<ul>\n<li>A clear title and brief introduction to the health issue.</li>\n<li>Key statistics and data related to the health issue.</li>\n<li>Evidence-based health promotion strategies.</li>\n<li>The role of various health professionals in addressing the issue.</li>\n</ul>\n<p>·      Visual elements (graphs, images, icons) to enhance understanding and engagement.</p>\n<ul>\n<li>References should be added to the end of the infographic and cited within the infographic using APA style.</li>\n<li>The infographic should be A3 landscape.</li>\n<li>The infographic should be visually appealing, easy to read, and follow a logical flow. Use online tools such as Canva, Piktochart, or Adobe Spark.</li>\n</ul>\n<p><br/></p>\n<p><strong>Part 2: Presentation or Role Play (3-4 minutes)</strong></p>\n<p><strong>Task: </strong>Deliver a 3-4 minute presentation or role play to the class, explaining the infographic and the importance of interprofessional collaboration in the chosen health promotion campaign. All members should present or take a speaking role in the role play. The presentation should cover:</p>\n<ul>\n<li>An overview of the health issue.</li>\n<li>The health promotion strategies depicted in the infographic.</li>\n<li>The roles and contributions of different health professionals in the campaign.</li>\n<li>Challenges and benefits of interprofessional collaboration in health promotion.</li>\n</ul>\n<p>If you choose to do a role play you should focus on using a script to involve all team members, while still addressing the above.</p>\n<p>Use PowerPoint or other presentation software to support your talk. Ensure clear, concise, and engaging delivery.</p>\n<p><br/></p>\n<p>This will be assessed on the following criteria:</p>\n<p><strong>Infographic: </strong>Clarity and Relevance of Content, Visual Appeal and Organization, Accuracy and Use of Evidence-Based Information and Inclusion of Interprofessional Roles and Collaboration.</p>\n<p><strong>Presentation/ Role Play: </strong>Depth of Understanding of the Health Issue, Explanation and Application of Health Promotion Strategies, Demonstration of Interprofessional Collaboration, Communication and Engagement with Audience, Overall Delivery and Professionalism</p>\n<p>The Team Charter will be submitted along with the final infographic on Blackboard.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Infographics will be submitted online via Blackboard Assignments in the allocated week 7 tutorial. All students in the team must contribute as agreed in the team charter.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Report on a Health Care system",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 11/10/2024 4:00 pm</p></dd>",
            "learning_objectives": "L04, L05",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Paper/ Report/ Annotation, Essay/ Critique, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assignment aims to help students understand the limitations and potentials of Large Language Models (LLMs) in generating healthcare reports. By creating a poorly structured report and then refining it, students will learn to identify and correct errors, improving their editing and critical thinking skills.</p>\n<p>The assessment will have three parts:</p>\n<p><strong>Part 1:</strong> Students will create a <strong>poorly structured written 300 word response</strong> on the structure of a Healthcare System - using a large language model (LLM) <strong>(5%)</strong></p>\n<p>Students will be provided a list of topics and examples of \"poor\" prompts to use in a Large Language Model (LLM) of Generative AI bot of their choice (ChatGPT or Bard) to create a 300 word response on a health care system. Optionally students can experiment with different LLMs to try and get the worst essay in terms of grammatically poor, factually incorrect and fake references within the output.</p>\n<p><strong>Part 2: Copy Editing and Annotation (15%)</strong></p>\n<p>Students will now copy edit the generated report, annotate changes, and explain the reasoning behind each correction.</p>\n<ul>\n<li>Use a word processor to track changes and edit the generated report.</li>\n<li>Annotate and comment on each change, explaining why it was necessary.</li>\n<li>Ensure your edited report is grammatically correct, factually accurate, and contains only complete and accurate citations. Use APA style for referencing.</li>\n<li>The maximum word limit for this part is <strong>750 words.</strong></li>\n</ul>\n<p><strong>Part 3: Reflective Addendum (5%)</strong></p>\n<p>Write a 250-word reflection on the appropriate use of LLMs in healthcare reporting and your initial experience with this process.</p>\n<ul>\n<li>Reflect on the strengths and weaknesses of using LLMs for generating healthcare reports.</li>\n<li>Discuss what you learned from the process of generating and editing the report.</li>\n<li>Consider the ethical implications and potential benefits of using LLMs in healthcare communication.</li>\n</ul>\n<p>All three parts should be combined into one document and submitted. Template and further instructions will be provided on Blackboard at the start of semester.</p>\n<p>Artificial Intelligence (AI) provides emerging tools that may support students in completing this assessment task. Students may appropriately use AI in completing this assessment task. Students must clearly reference any use of AI in each instance. A failure to reference AI use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Online submission via Blackboard Turnitin</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Cultural Safety in Practice Reflection Tasks",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p>Part 1 Week 4: 16 August 2024 4 pm (5%)</p>\n<p>Part 2 Week 13: By the end of the allocated tutorial for each student (15%)</p></dd>",
            "learning_objectives": "L02, L06",
            "mode": "Written",
            "category": "Essay/ Critique, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>In HLTH1000 Learning Objectives 2 and 6 are primarily linked with your engagement with Modules 1 &amp; 2 of the <em>Cultural Safety in Practice </em>modules, and is assessed exclusively through the <strong>critical reflection </strong>corresponding with this material. You must attempt both reflections as part of course requirements to attempt all tasks.</p>\n<p>You’ll be engaging with these modules twice in HLTH1000:</p>\n<ul>\n<li>Week 2-3 will explore an overview of Aboriginal and Torres Strait Islander peoples' histories and cultures</li>\n<li>Week 10-12 the focus is on contemporary Aboriginal and Torres Strait Islander health.</li>\n</ul>\n<p>This is only part of your learning journey in culturally safe practice as you will engage with the third module and fourth modules in future courses in your program. </p>\n<p>In<strong> </strong>the <strong>week 3 tutorial </strong>you will write a<strong> 500 word reflection </strong>that will focus on <strong>Theme 2: Cultural Safety in Practice Module One (5%) Due August 16th 4 pm for all students. </strong></p>\n<p>By the end of <strong>week 13</strong> you will write and submit a second <strong>500 word reflective essay</strong> that will focus on <strong>Theme 5: Cultural Safety in Practice Modules Two (15%) due end of the tutorial allocated in week 13. </strong></p>\n<ul>\n<li>Specific instructions will be provided on Blackboard at the start of semester.</li>\n<li>The reflective essays will enable you to communicate the importance of culturally relevant and safe health care practice and services to advance Aboriginal and Torres Strait Islander health outcomes.</li>\n</ul>\n<p><br/></p>\n<p><strong>A note about Artificial Intelligence (AI)</strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge <strong>without the aid of Artificial Intelligence (AI)</strong>. Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(22 Jul - 27 Oct)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Online Self Directed Learning</strong><br><p>Complete the relevant online learning modules the week prior to face to face sessions. </p></br></p></div></td>",
            "topic_title": "<strong>Online Self Directed Learning</strong>",
            "topic_description": "Online Self Directed Learning Complete the relevant online learning modules the week prior to face to face sessions.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Theme 1: Health, People and Populations</strong><br><p>Complete the Theme 1 Online self directed learning modules in Week 1. </p>\n<p>Week 2:</p>\n<ul>\n<li>Describe health and how to measure health. </li>\n<li>Identify determinants of health and well-being, reflecting on socio-economic and physical aspects, along with individual characteristics and behaviours.</li>\n<li>Recognise population groups experiencing social exclusion and marginalisation in Australia. </li>\n</ul></br></p></div></td>",
            "topic_title": "<strong>Theme 1: Health, People and Populations</strong>",
            "topic_description": "Theme 1: Health, People and Populations Complete the Theme 1 Online self directed learning modules in Week 1. Week 2: Describe health and how to measure health. Identify determinants of health and well-being, reflecting on socio-economic and physical aspects, along with individual characteristics and behaviours. Recognise population groups experiencing social exclusion and marginalisation in Australia.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Theme 2: Cultural Safety in Practice Module 1</strong><br><p>Complete Theme 2 online self directed learning modules in Week 1 and 2. </p>\n<p>Week 3:</p>\n<ul>\n<li>Describe key features of identity among Aboriginal and Torres Strait Islander peoples.</li>\n<li>Explain the diversity of Aboriginal and Torres Strait Islander cultures, beliefs, languages and practices.</li>\n<li>Describe the history of Aboriginal and Torres Strait Islander peoples in Australia.</li>\n<li>Identify government policies and procedures that have failed or fail to care for the health and wellbeing of Aboriginal and Torres Strait Islander peoples.</li>\n<li>Develop the skills and knowledge to provide culturally relevant and safe health care practice and services that is free of racism .</li>\n</ul></br></p><p><strong>Learning outcomes:</strong> L02, L06</p></div></td>",
            "topic_title": "<strong>Theme 2: Cultural Safety in Practice Module 1</strong>",
            "topic_description": "Theme 2: Cultural Safety in Practice Module 1 Complete Theme 2 online self directed learning modules in Week 1 and 2. Week 3: Describe key features of identity among Aboriginal and Torres Strait Islander peoples. Explain the diversity of Aboriginal and Torres Strait Islander cultures, beliefs, languages and practices. Describe the history of Aboriginal and Torres Strait Islander peoples in Australia. Identify government policies and procedures that have failed or fail to care for the health and wellbeing of Aboriginal and Torres Strait Islander peoples. Develop the skills and knowledge to provide culturally relevant and safe health care practice and services that is free of racism .",
            "learning_outcomes": [
                "L02",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 5 To Week 8(19 Aug - 15 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Theme 3: Professions and health workforce in Australia</strong><br><p>Complete Theme 3 Online self directed learning modules week 4-7. \\</p>\n<p>Attend and participate in 2-hour sessions focussing on Professions and Health workforce in Australia between Week 5-7. Complete in person assessment in Week 8 Tutorial.</p>\n<p><strong>Week 5: </strong>Identify services and practitioners within the Australian health workforce and create a resource on professional identity and making connections for interprofessional collaboration. </p>\n<p><strong>Week 6: </strong>Explain the key factors that underpin good team work in health care contexts.</p>\n<p>Describe the importance of person centred practices to achieve effective healthcare outcomes.</p>\n<p><strong>Week 7: </strong>Create a resource on professional identity and making connections for interprofessional collaboration. (Submit infographic end of this session).</p>\n<p><strong>Week 8: </strong>Demonstrate Interprofessional collaboration in a simulated role play. (In class assessment task).</p></br></p><p><strong>Learning outcomes:</strong> L03, L05</p></div></td>",
            "topic_title": "<strong>Theme 3: Professions and health workforce in Australia</strong>",
            "topic_description": "Theme 3: Professions and health workforce in Australia Complete Theme 3 Online self directed learning modules week 4-7. \\ Attend and participate in 2-hour sessions focussing on Professions and Health workforce in Australia between Week 5-7. Complete in person assessment in Week 8 Tutorial. Week 5: Identify services and practitioners within the Australian health workforce and create a resource on professional identity and making connections for interprofessional collaboration. Week 6: Explain the key factors that underpin good team work in health care contexts. Describe the importance of person centred practices to achieve effective healthcare outcomes. Week 7: Create a resource on professional identity and making connections for interprofessional collaboration. (Submit infographic end of this session). Week 8: Demonstrate Interprofessional collaboration in a simulated role play. (In class assessment task).",
            "learning_outcomes": [
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 9 To Week 10(16 Sep - 06 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Theme 4: Healthcare system in Australia and overseas </strong><br><p>Complete online modules week 8-10. Attend and participate in 2-hour sessions focussing on healthcare systems around the world, including Australia between weeks 9-10</p>\n<p><strong>Week 9:</strong> Explain the structure and layers of the Australian health care system in terms of organisation and governance.</p>\n<p><strong>Week 10: </strong>Describe the funding models and regulation of the Australian Health care system. Compare the Australian health care system with those in North America, Europe and South East Asia.</p>\n<p><strong>Week 11: </strong>No Tutorials Report on a health care system using Gen AI, copy edit and reflect on the use of Gen AI in health care reports. (Due week 11) </p></br></p><p><strong>Learning outcomes:</strong> L04</p></div></td>",
            "topic_title": "<strong>Theme 4: Healthcare system in Australia and overseas </strong>",
            "topic_description": "Theme 4: Healthcare system in Australia and overseas Complete online modules week 8-10. Attend and participate in 2-hour sessions focussing on healthcare systems around the world, including Australia between weeks 9-10 Week 9: Explain the structure and layers of the Australian health care system in terms of organisation and governance. Week 10: Describe the funding models and regulation of the Australian Health care system. Compare the Australian health care system with those in North America, Europe and South East Asia. Week 11: No Tutorials Report on a health care system using Gen AI, copy edit and reflect on the use of Gen AI in health care reports. (Due week 11)",
            "learning_outcomes": [
                "L04"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 11 To Week 13(07 Oct - 27 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Theme 5: Cultural Safety in Practice Module 2 </strong><br><p>Complete the online learning modules during <strong>week 11</strong> (no face to face sessions)</p>\n<p><strong>Week 12: </strong></p>\n<ul>\n<li>Explain Aboriginal and Torres Strait Islander peoples' conceptions of health and illness, including social and emotional well-being Identify current demographic, health indicator and statistical trends among Aboriginal and Torres Strait Islander peoples</li>\n<li>Outline factors contributing to health inequalities in the Australian context, including inequality of access</li>\n<li>Outline the social and cultural determinants of health among Aboriginal and Torres Strait Islander peoples</li>\n</ul>\n<p> <strong>Week 13: </strong></p>\n<ul>\n<li>Describe the local and contemporary context of managing and advancing Aboriginal and Torres Strait Islander health outcomes</li>\n<li>Describe the role of Aboriginal and Torres Strait Islander health sector initiatives, including Aboriginal Community Controlled Health Services and Aboriginal and Torres Strait Islander health professionals</li>\n<li>Communicate the importance of culturally relevant and safe health care practice and services to advance Aboriginal and Torres Strait Islander health outcomes. (Summative reflection)</li>\n</ul></br></p><p><strong>Learning outcomes:</strong> L06</p></div></td>",
            "topic_title": "<strong>Theme 5: Cultural Safety in Practice Module 2 </strong>",
            "topic_description": "Theme 5: Cultural Safety in Practice Module 2 Complete the online learning modules during week 11 (no face to face sessions) Week 12: Explain Aboriginal and Torres Strait Islander peoples' conceptions of health and illness, including social and emotional well-being Identify current demographic, health indicator and statistical trends among Aboriginal and Torres Strait Islander peoples Outline factors contributing to health inequalities in the Australian context, including inequality of access Outline the social and cultural determinants of health among Aboriginal and Torres Strait Islander peoples Week 13: Describe the local and contemporary context of managing and advancing Aboriginal and Torres Strait Islander health outcomes Describe the role of Aboriginal and Torres Strait Islander health sector initiatives, including Aboriginal Community Controlled Health Services and Aboriginal and Torres Strait Islander health professionals Communicate the importance of culturally relevant and safe health care practice and services to advance Aboriginal and Torres Strait Islander health outcomes. (Summative reflection)",
            "learning_outcomes": [
                "L06"
            ]
        }
    ]
}