{
    "course_title": "First Nations Health and Wellbeing",
    "study_period": "Sem 2 2024",
    "location": "External",
    "attendance": "Online",
    "url": "https://course-profiles.uq.edu.au/course-profiles/INDH7002-64710-7460",
    "full_course_code": "INDH7002-64710-7460",
    "course_code": "INDH7002",
    "class_code": "64710",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand and apply a culturally safe practice."
        },
        {
            "number": "LO2.",
            "description": "Describe Aboriginal and Torres Strait Islander health in a historical context and analyse the impact of colonial processes on First Nation health outcomes."
        },
        {
            "number": "LO3.",
            "description": "Apply and critically assess the role of the determinants of health to global and national First Nations health outcomes."
        },
        {
            "number": "LO4.",
            "description": "Apply a health equity framework to analyse the strengths of First Nations led health initiatives."
        },
        {
            "number": "LO5.",
            "description": "Apply participatory and collaborative approaches to create sustainable, culturally safe and responsive health policy, services, and systems."
        },
        {
            "number": "LO6.",
            "description": "Demonstrate skills in written and oral communication, advocacy, reflection, digital capabilities, and teamwork."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Critical Reflexivity Portfolio through Decolonising Lens",
            "special_indicators": [],
            "weighting": "<dd>45%</dd>",
            "due_date": "<dd><p>VLog 1 (A Personal Standpoint) 8/08/2024 2:00 pm</p>\n<p>VLog 2 (Culturally Safe Practice) 29/08/2024 2:00 pm</p>\n<p>VLog 3 (Advocacy and Health Systems) 19/09/2024 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Portfolio, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>A Reflexive Portfolio is a digital collection of your reflexive inquiries into big questions and themes prompted through the Semester in INDH7002. These questions or themes will be weaved through Lectorials and Tutorials, however, the Portfolio gives students the personal space to dive deep into their own reflexive processes. Developing a strong reflexive practice is foundational to being a respectful, culturally sensitive, equitable, and well-informed practitioner, scholar and Ally. Reflexivity is vital to understanding how cultural paradigms and our own experiences influence our worldviews, unconscious biases, and philosophy in healthcare and research. </p>\n<p>This Portfolio involves three discrete but connected video log (vlog) submissions. For each submission, you are asked to complete a Digital Module (each extending on Lectorial content).</p>\n<ul>\n<li>Module 1: is linked with your first reflexive Vlog (a personal standpoint (15%)</li>\n<li>Module 2: in linked with your second reflexive Vlog (culturally safe practice (15%)</li>\n<li>Module 3: is linked with your third reflexive Vlog (advocacy and health systems) (15%)</li>\n</ul>\n<p>The Modules will provide you the space to reflect on, in and for culturally safe practice and engage with broader social and political issues impacting Aboriginal and Torres Strait Islander peoples’ health outcomes.</p>\n<p><strong>Purpose</strong>: To demonstrate your developing capabilities to apply critical self-reflection skills and discuss your understanding of key concepts and experiences of learning and application to your future public health professional practice.</p>\n<p><strong>Audience and your role: Your role:</strong> Draw from your own standpoint as an INDH7002 student<strong>. Audience: </strong>The INDH7002 teaching team</p>\n<p><strong>Submission type</strong>: 3 x Individual reflective video logs                                                                                                                </p>\n<p><strong>Format:</strong></p>\n<ul>\n<li>3 minutes Vlog     </li>\n<li>Referencing style APA 7th (include a reference slide)</li>\n<li>Individual task                           </li>\n</ul>\n<p><strong>Learning Objectives Assessed: (1, 2, 3, 6)</strong></p>\n<p><strong>Getting Started:</strong> Your video logs (Vlog) should:</p>\n<ol>\n<li> Present your video log in first person and use active voice</li>\n<li>Vlogs should be 3 minutes (+/-10%).</li>\n<li>Draw from examples to substantiate your reflections (e.g. when making a point about something, an example helps bring that idea to life).</li>\n<li>Engage with each Module and suggest readings. We encourage you to go beyond the suggested readings and integrate broader literature. We particularly encourage engagement with First Nations scholarship to deepen your thinking.</li>\n<li>Each Module on Blackboard has suggested questions (located in the designated Module folder on Blackboard), and these are designed to support you to deepen your reflection. There is no single way to prepare a submission, they are entirely personal. The prompted questions will help you think and reflect along a particular ‘line of inquiry’ as you explore the theme or questions raised by each Module.</li>\n<li>Critically self-reflect and examine your own beliefs, values, biases, stereotypes, preconceptions, and/or assumptions in relation to concepts and learnings and define new modes of thinking as a result. Discuss connections between the new modes of thinking and the learning experience and materials from other courses; experience; and/or personal goals to your future cultural safe public health practice.(or experiment with) decolonising your writing and thinking in respectful ways. For example, the prioritising of First Nations scholarship is one way. An Acknowledgment of Country on your submission (which will not be included in your time limit) is another way. Be creative and learn appropriate and respectful ways to decolonise your work from First Nations scholars.</li>\n<li> Use APA7 style referencing.                                 </li>\n</ol>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><br/></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Health Equity Pitch: Using Strength-Based to Address Health Equity for First Nations Australians",
            "special_indicators": [],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 12/09/2024 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Oral, Product/ Artefact/ Multimedia",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>As a public health consultant, you have been invited to work with a ‘mainstream’ (non-Indigenous run/led) organisation. The organisation has heard of the newly launched ‘<a href=\"https://www.health.qld.gov.au/public-health/groups/atsihealth/making-tracks-together-queenslands-atsi-health-equity-framework\">Making Tracks Together</a>’ Queensland’s Aboriginal and Torres Strait Islander Health Equity Framework (click on the link) and have invited you to meet with the leaders of the organisation. You have been asked to showcase the potential value and opportunities of the Health Equity Framework for this organisation. </p>\n<p><strong>Purpose:</strong> To advocate for the value of the Health Equity Framework via an oral presentation to leaders of an organisation committed to health equity for Aboriginal and Torres Strait Islander peoples                                                                               </p>\n<p><strong>Audience and your role</strong>: <strong>Your role: </strong>Public Health Consultant <strong>Audience:</strong> A non-Aboriginal and Torres Strait Islander organisation (of your choosing) who are committed to the (chosen) health equity issue</p>\n<p><strong>Submission type</strong>: Recorded presentation (PowerPoint slides are suggested) with your camera on. </p>\n<p><strong>Format:</strong> </p>\n<ul>\n<li>Oral presentation limit: 8 minutes</li>\n<li>Referencing APA 7th (include a reference slide)</li>\n<li>Individual task</li>\n</ul>\n<p><strong>Learning Objectives Assessed: (1, 2, 3, 4, 5, 6)</strong></p>\n<p><strong>Getting Started:  Developing Your Health Equity Pitch </strong></p>\n<ol>\n<li> Choose a health equity issue that relates to Aboriginal and Torres Strait Islander peoples in the settler-state called Australia. </li>\n<li>You can select an issue of relevance to First Nations peoples outside of Queensland (but needs to be focused on the Australian context). </li>\n<li>This health equity issue could draw on wider determinants of health – e.g. housing, transport, livelihoods. </li>\n<li>Explain how this health issue is an equity issue.</li>\n<li> Choose an audience you will speak to who is invested in this health equity issue. </li>\n<li>This audience needs to be a ‘mainstream’ / non-Indigenous organisation, health service, not-for-profit, or non-governmental organisation that services First Nations peoples. If they are based outside of Queensland, that is fine, but the pitch needs to be tailored accordingly (i.e. it is a Framework for Queensland – so you may take the ‘what can be learned’ approach). </li>\n<li>Research the organisation so your pitch can be as tailored as possible. </li>\n<li>Drawing on peer-reviewed and grey literature (organisational reports), develop a case for this health equity issue. This can include:</li>\n<li>Take a strengths-based approach to ‘set the scene’ for the audience on this health equity issue. Do so while also acknowledging the broader determinants of health. Make the link between the equity issue and health and wellbeing (e.g. how housing relates to health and wellbeing). </li>\n<li>Introduce, define and contextualise health equity (particularly within Australia's historical/settler-colonial context).</li>\n<li> Introduce the Health Equity Framework and make it clear how this Framework holds value or opportunities for your audience.</li>\n<li>Introduce the health equity framework and briefly place it in the wider policy/health service delivery context for Australian health services/organisations</li>\n<li> Provide a critical analysis of this framework within the context of the topic and organisation you are presenting to. </li>\n<li>Make explicit the value this Framework holds for the organisation. For example, introduce the Health Equity Strategy Priority Areas and select ONE (that best fits this health equity issue and the chosen audience). Then link the Priority Area with the context using available data and evidence tell the story of how this Priority Area could be of value to this organisation. <em>Alternatively,</em> you could widen the lens to consider what can be learned from this Framework as a broader legislative milestone and how this relates to the organisation and topic at hand. </li>\n<li>Describe the opportunities for <em>implementation or learning</em> that this Framework brings for the selected audience. Make this explicit and develop an argument about how/why these opportunities might be of value in the short- and long-term. </li>\n<li> Propose (suggested) next steps based on the opportunities outlined. </li>\n<li>This is where you will succinctly wrap up the pitch and clearly articulate what you suggest as possible next steps for the organisation. </li>\n</ol>\n<p><strong> </strong></p>\n<p><strong>Preparing your presentation:</strong></p>\n<ol>\n<li>Prepare PowerPoint slides that are engaging and visually appealing. </li>\n<li>Reduce the amount of text on the slides (opting for visuals instead) and use large font size.</li>\n<li>Anything longer than 8 minutes will not be marked so be sure to keep your presentation under 8 mins.</li>\n</ol>\n<p><strong> Recording your presentation:</strong></p>\n<ul>\n<li>We strongly recommend using Zoom or Kaltura for recording for Pitch – see instructions in your Assessment 2 folder on Blackboard. </li>\n<li>Be sure to include the References slide in the recorded presentation, so that this can be marked. </li>\n</ul>\n<p> Use APA7 style referencing.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><br/></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>Students are encouraged to submit by the due date. </p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Written Meta-reflection",
            "special_indicators": [],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p> 4/11/2024 2:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>In the spirit of fine tuning your reflexive practice as a future health practitioner, scholar and advocate, this Assessment asks you to submit a visual and written documentation of your learning journey through INDH7002 which synthesises significant areas of personal learning and insight. </p>\n<p> </p>\n<p>Supported by your Reflexive Portfolio (Task 1), this meta-reflection allows you to pause and zoom out on your learning journey. It is worth considering <em>key themes</em> raised in the Modules, Lectorials and Tutorials, and that have featured in your Assessment. This meta-reflection allows the space for a <em>revised Standpoint</em> (as per Reflexive Portfolio submission 1) and a synthesis of your learning journey. This latter part will be supported a series of questions designed to prompt you to deepen an understanding of your journey in INDH7002.  <strong>Be sure to integrate peer-reviewed and grey literature in your writing.</strong> </p>\n<p><br/></p>\n<p> <strong>Purpose: </strong>To reflect</p>\n<p><strong>Text type: </strong>Written meta-reflection</p>\n<p><strong>Your role: </strong>Write from your own standpoint; as an INDH7002 student.</p>\n<p><strong>Audience: </strong>The INDH7002 Teaching Team</p>\n<p><strong>Conditions: </strong>1500 words; APA 7th, minimum 6 references; individual task</p>\n<p><br/></p>\n<p><strong>Getting Started:</strong></p>\n<p>This submission involves two parts – (1) a revised written Standpoint, and (2) a synthesis of your learning journey over the Semester. The following is designed to support you with both. Remember that these two ‘parts’ may be combined, rather than separated out or compartmentalised. In addition, visual elements to your submission may help elucidate that which is difficult to express in written English. See below for supportive prompts to help you with your submission.</p>\n<p><br/></p>\n<p>As you <em>revise your Standpoint</em> (from your Task 1a submission in your Reflexive Portfolio), consider the following:</p>\n<p>·       Aspects of your identity (social and cultural positioning), where and who you come from, your values/beliefs that guide you</p>\n<p>·       How these aspects of your identity shape your life, experiences and choices</p>\n<p>·       Your relationship to the discipline of public health – as a knowledge system that shapes how you move, think and act in the world.</p>\n<p><br/></p>\n<p>To support you in identifying <em>key themes</em> in your learning journey, consider topics that have struck a personal chord for you, including:</p>\n<p><br/></p>\n<p>·       Looking at your initial Standpoint (from Module 1a Reflexive Portfolio), reflect on what’s changed, what do you now wish to emphasise or explore that you didn’t early on, how has your relationship to the discipline of public health and Western knowledge systems shifted over this time?</p>\n<p>·       What aspects of the Modules resonated strongly with you? What aspects raised intrigue, surprise, confusion, frustration, anger etc, if any? How might your emotions here point you to something that could be of relevance to your own learning journey in this course? </p>\n<p>·       What have you learned for yourself about allyship and working in solidarity with Aboriginal and Torres Strait Islander peoples? </p>\n<p>·       What have been some key insights you’ve gained through these Modules, the readings/scholarship and the course as a whole (including the modality of delivery)? </p>\n<p><br/></p>\n<p>·       What have you learned about yourself in this course? How have these Modules (and the course) shaped you as a (whole) person, and as a future evidence-informed practitioner/scholar/advocate? </p>\n<p><br/></p>\n<p>You may wish to include visual element/s to your submission. This may include personal art, photograph/s, or conceptual mind-mapping. It may also include art produced by other people, in which case please properly acknowledge the source/s of all visual elements. </p>\n<p><br/></p>\n<p>Please note: This task is a <strong>written</strong> task and not to be presented as a video log (vlog).</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><br/></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1: Introduction to Aboriginal and Torres Strait Islander and Indigenous Health </strong><br/></p></div></td>",
            "topic_title": "<strong>Week 1: Introduction to Aboriginal and Torres Strait Islander and Indigenous Health </strong>",
            "topic_description": "Week 1: Introduction to Aboriginal and Torres Strait Islander and Indigenous Health",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2: Hidden Histories:  Aboriginal and Torres Strait Islander and Indigenous Perspectives of Resistance and Resilience in Pre- and Post-Colonial Context</strong><br/></p></div></td>",
            "topic_title": "<strong>Week 2: Hidden Histories:  Aboriginal and Torres Strait Islander and Indigenous Perspectives of Resistance and Resilience in Pre- and Post-Colonial Context</strong>",
            "topic_description": "Week 2: Hidden Histories:  Aboriginal and Torres Strait Islander and Indigenous Perspectives of Resistance and Resilience in Pre- and Post-Colonial Context",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2: Yarning-Up Circle (Tutorial 1)</strong><br/></p></div></td>",
            "topic_title": "<strong>Week 2: Yarning-Up Circle (Tutorial 1)</strong>",
            "topic_description": "Week 2: Yarning-Up Circle (Tutorial 1)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3: Identity &amp; Culture: Indigenous Ways of Knowing, Being and Doing</strong><br/></p></div></td>",
            "topic_title": "<strong>Week 3: Identity &amp; Culture: Indigenous Ways of Knowing, Being and Doing</strong>",
            "topic_description": "Week 3: Identity & Culture: Indigenous Ways of Knowing, Being and Doing",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(12 Aug - 18 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4:  Decolonising Aboriginal and Torres Strait Islander and Indigenous Health </strong><br/></p></div></td>",
            "topic_title": "<strong>Week 4:  Decolonising Aboriginal and Torres Strait Islander and Indigenous Health </strong>",
            "topic_description": "Week 4:  Decolonising Aboriginal and Torres Strait Islander and Indigenous Health",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(12 Aug - 18 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4: Yarning-Up Circle (Tutorial 2) </strong><br/></p></div></td>",
            "topic_title": "<strong>Week 4: Yarning-Up Circle (Tutorial 2) </strong>",
            "topic_description": "Week 4: Yarning-Up Circle (Tutorial 2)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(19 Aug - 25 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5: The Role of Social Determinants of Health to Address Health Inequity  </strong><br/></p></div></td>",
            "topic_title": "<strong>Week 5: The Role of Social Determinants of Health to Address Health Inequity  </strong>",
            "topic_description": "Week 5: The Role of Social Determinants of Health to Address Health Inequity",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6: Evidence Strength-Based Approach: Indigenous Community Controlled Health Services in Public Health Practice</strong><br/></p></div></td>",
            "topic_title": "<strong>Week 6: Evidence Strength-Based Approach: Indigenous Community Controlled Health Services in Public Health Practice</strong>",
            "topic_description": "Week 6: Evidence Strength-Based Approach: Indigenous Community Controlled Health Services in Public Health Practice",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6:  Yarning-Up Circle (Tutorial 3)</strong><br/></p></div></td>",
            "topic_title": "<strong>Week 6:  Yarning-Up Circle (Tutorial 3)</strong>",
            "topic_description": "Week 6:  Yarning-Up Circle (Tutorial 3)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(02 Sep - 08 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7: Evidence strength-Based Approach: Community-Based Programmes Using A Strength-Based to Improve Indigenous Health </strong><br/></p></div></td>",
            "topic_title": "<strong>Week 7: Evidence strength-Based Approach: Community-Based Programmes Using A Strength-Based to Improve Indigenous Health </strong>",
            "topic_description": "Week 7: Evidence strength-Based Approach: Community-Based Programmes Using A Strength-Based to Improve Indigenous Health",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8: Cultural Determinants of Health: Cultural Identity, Connection to Land, Culture, Language and  Self-Determination  </strong><br/></p></div></td>",
            "topic_title": "<strong>Week 8: Cultural Determinants of Health: Cultural Identity, Connection to Land, Culture, Language and  Self-Determination  </strong>",
            "topic_description": "Week 8: Cultural Determinants of Health: Cultural Identity, Connection to Land, Culture, Language and  Self-Determination",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8: Yarning-Up Circle (Tutorial 4)</strong><br/></p></div></td>",
            "topic_title": "<strong>Week 8: Yarning-Up Circle (Tutorial 4)</strong>",
            "topic_description": "Week 8: Yarning-Up Circle (Tutorial 4)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9: Leadership in Aboriginal and Torres Strait Islander and Indigenous Health </strong><br/></p></div></td>",
            "topic_title": "<strong>Week 9: Leadership in Aboriginal and Torres Strait Islander and Indigenous Health </strong>",
            "topic_description": "Week 9: Leadership in Aboriginal and Torres Strait Islander and Indigenous Health",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid Sem break(23 Sep - 29 Sep)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-Semester Break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-Semester Break</strong>",
            "topic_description": "Mid-Semester Break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10: Research with Aboriginal and Torres Strait Islander and Indigenous Communities </strong><br/></p></div></td>",
            "topic_title": "<strong>Week 10: Research with Aboriginal and Torres Strait Islander and Indigenous Communities </strong>",
            "topic_description": "Week 10: Research with Aboriginal and Torres Strait Islander and Indigenous Communities",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10:  Yarning-Up Circle (Tutorial 5)</strong><br/></p></div></td>",
            "topic_title": "<strong>Week 10:  Yarning-Up Circle (Tutorial 5)</strong>",
            "topic_description": "Week 10:  Yarning-Up Circle (Tutorial 5)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(07 Oct - 13 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11: Community Advocacy: Implications for Policy and Practice</strong><br/></p></div></td>",
            "topic_title": "<strong>Week 11: Community Advocacy: Implications for Policy and Practice</strong>",
            "topic_description": "Week 11: Community Advocacy: Implications for Policy and Practice",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12: Reflection on the Learning Journey and Advocacy Workshop</strong><br/></p></div></td>",
            "topic_title": "<strong>Week 12: Reflection on the Learning Journey and Advocacy Workshop</strong>",
            "topic_description": "Week 12: Reflection on the Learning Journey and Advocacy Workshop",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13: Q &amp; A on Assessment, Yarning Reflections and Course Evaluation </strong><br/></p></div></td>",
            "topic_title": "<strong>Week 13: Q &amp; A on Assessment, Yarning Reflections and Course Evaluation </strong>",
            "topic_description": "Week 13: Q & A on Assessment, Yarning Reflections and Course Evaluation",
            "learning_outcomes": []
        }
    ]
}