{
    "course_title": "Journalistic Investigation",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/JOUR1710-61554-7460",
    "full_course_code": "JOUR1710-61554-7460",
    "course_code": "JOUR1710",
    "class_code": "61554",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Source, construct and disseminate a piece of investigative journalism;"
        },
        {
            "number": "LO2.",
            "description": "Draft and submit a Freedom of Information  or Right To Information request;"
        },
        {
            "number": "LO3.",
            "description": "Act ethically in the sourcing, construction and dissemination of your story;"
        },
        {
            "number": "LO4.",
            "description": "Embed the traditions, theories, frameworks and codes of ethics in reporting practice."
        },
        {
            "number": "LO5.",
            "description": "Apply a wide range of journalistic research methods, including basic data-driven reporting, social media investigation, interviewing, observation and document-driven reporting."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Observation Task",
            "special_indicators": [],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 16/08/2024 4:00 pm</p></dd>",
            "learning_objectives": "L01, L03, L04",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Notebook/ Logbook, Portfolio, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The objective of this task is to develop your skills in observational journalism by immersing yourself in real-world environments, making detailed field notes, and using your observations to generate compelling story ideas. This exercise will help you hone your ability to recognise newsworthy events, trends, and human-interest stories from everyday experiences.</p>\n<p>Your task is to choose a location and conduct a journalistic observation. Your tutor needs to approve your observation to manage any possible risk to yourself, or to the public, or the environment. This will be done during the Week 2 tutorial, with any changes to be approved via email.</p>\n<p>The assessment is weighted at 20% of your final grade. The assessment task is in three parts:</p>\n<ol>\n<li><strong>Idea (up to 200 words; 35% of assessment grade):</strong> Describe what are you going to observe, and how you intend to observe it. Not all locations will be equally likely to yield results, so you'll need to be intentional in your location, topic, area of focus and methods. In your tutorial, you'll be given an opportunity to brainstorm and obtain feedback on your ideas. The more creative and original your idea, the higher your grade will be; you'll also be assessed on the appropriateness of your observation methods. If there are any privacy or ethical considerations, consider how you will eliminate or mitigate these issue in your approach to observation.</li>\n<li><strong>Field notes (no set length; 25% of assessment grade)</strong>: Spend time observing at your chosen location, using a range of senses to capture information. During this time, take detailed field notes. Depending on your location, topic and focus, your field notes could be: written notes, audio recordings, video, photographs, primary data or any combination of the above. Again, care should be taken to mitigate privacy and ethical risks. Be detailed and accurate in your field notes.</li>\n<li><strong>Summary, reflection and concept development (up to 400 words; 40% of assessment grade)</strong>: Briefly summarise your observations, highlighting the significance of your idea and findings. What is the value of what you observed? Is it newsworthy or in the public interest? What were the limits of your observation? What would you do differently next time? How could you (hypothetically) build this idea into a more substantial investigation? Where could you publish it, and who would be the audience? You may use dot points or sub-headings as required.</li>\n</ol>\n<p>Please note that although part of this task is to use observations to develop ideas for an investigation, this is a stand-alone assessment and you do not have to follow through with the idea outlined in Part 3. If you like, you can choose an entirely different topic for your major end-of-semester news story. However, if you wish to develop the idea from this task for the final assessment (Major News Investigation), you are able to do that.</p>\n<p><strong>Use of AI and MT:</strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit online via TurnItIn on Blackboard</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Practical Skills Portfolio",
            "special_indicators": [],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 20/09/2024 4:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Throughout the semester, collate the minor practical skills tasks you are assigned and submit them as a complete portfolio. The portfolio should include the following elements: </p>\n<ol>\n<li>Reflection on deep observation task</li>\n<li>Document-driven treasure hunt</li>\n<li>FOI or RTI request</li>\n<li>Fact-checking exercise</li>\n<li>Investigative research plan</li>\n<li>Interview plans</li>\n</ol>\n<p>Please note that while attendance at tutorials is not necessary to complete this assessment task, several of the portfolio elements are aligned with tutorial-based activities so regular attendance is important in order to develop the skillset that this portfolio will assess. Feedback, particularly on the research plan and interview plans, will also be provided within tutorials, and these tasks are designed to support the final assessment task (Major News Investigation). </p>\n<p><strong>Use of AI and MT:</strong></p>\n<p>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit online via TurnItIn on Blackboard</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Major News Investigation",
            "special_indicators": [],
            "weighting": "<dd>50% 800-1000 words </dd>",
            "due_date": "<dd><p> 22/10/2024 4:00 pm</p></dd>",
            "learning_objectives": "L01, L03, L04, L05",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This portfolio will require you to submit a substantive piece of investigative journalism. </p>\n<p>This assessment task requires you to go out and produce a substantive piece of investigative journalism. The portfolio must include two elements:</p>\n<ol>\n<li>A piece of written investigative journalism in either news or feature style.</li>\n<li>At least one visual or multimedia element, which could include a data visualisation, chart, map, photograph(s), audio, video or another approved visual or multimedia element. The visual elements should enhance and value-add to the investigative story you have produced, and more than one type of visual or multimedia element may be used. </li>\n</ol>\n<p>The investigative story should include a minimum of four primary sources (more is encouraged) and be 800-1000 words. Your tutor needs to approve your investigation to manage any possible risks to yourself, or to the public, or to the environment. In instances where the multimedia components of the submission are substantial (e.g. long-form audio or video, photographic essay), a reduction in the word count of the associated story may be approved by your tutor, but this must be negotiated prior to the end of Week 9. </p>\n<p>Your investigation should be presented digitally, using Shorthand or another approved platform. The text elements of your investigation must also be submitted via TurnItIn, alongside a sources page and research journal (templates available on Blackboard). </p>\n<p>In this course your tutors are prepared to read drafts for the Major News Investigation. However, several conditions apply:</p>\n<ol>\n<li>Only one draft will be read per student.</li>\n<li>Drafts for the Major News Investigation assessment must be submitted in class or at a drop-in session in or prior to Week 12. Any drafts received after this time will not be read.</li>\n<li>Draft reading is embedded in this course to replicate a newsroom environment and as a learning tool to help you develop journalistic writing.</li>\n<li>Drafts will not be considered over email.</li>\n</ol>\n<p>Detailed assessment criteria will be provided via Blackboard.</p>\n<p><strong>Use of AI and MT:</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Your investigation should be presented digitally, using Shorthand or another approved platform. The text elements of your investigation must also be submitted via TurnItIn, alongside a sources page and research journal (templates available on Blackboard). Include a link to the digital publication in your TurnItIn submission.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1 Lecture: Introduction to investigative journalism</strong><br/><p>This week we hit the ground running, exploring the principles of investigative journalism and the variety of ways they are applied in industry.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 1 Lecture: Introduction to investigative journalism</strong>",
            "topic_description": "Week 1 Lecture: Introduction to investigative journalism This week we hit the ground running, exploring the principles of investigative journalism and the variety of ways they are applied in industry.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1 Tutorial: Investigative methods</strong><br/><p>Introduction to the Research Matrix. Comparing investigative methods, and using different research methods and processes for different stories.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 1 Tutorial: Investigative methods</strong>",
            "topic_description": "Week 1 Tutorial: Investigative methods Introduction to the Research Matrix. Comparing investigative methods, and using different research methods and processes for different stories.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2 Lecture: Active witnessing </strong><br/><p>Active witnessing, and methods to cover unexpected stories in expected places. This week we explore the important role observation plays in journalism practice and key examples of its use in industry. </p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 2 Lecture: Active witnessing </strong>",
            "topic_description": "Week 2 Lecture: Active witnessing Active witnessing, and methods to cover unexpected stories in expected places. This week we explore the important role observation plays in journalism practice and key examples of its use in industry.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2 Tutorial: Putting observation into action</strong><br/><p>Observational journalism, and preparing for the first assessment - how observation methods can be strategically undertaken to deliver the best outcomes. Attendance in this week is critical.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 2 Tutorial: Putting observation into action</strong>",
            "topic_description": "Week 2 Tutorial: Putting observation into action Observational journalism, and preparing for the first assessment - how observation methods can be strategically undertaken to deliver the best outcomes. Attendance in this week is critical.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3 Lecture: The impacts of digital distruption</strong><br/><p>The lecture will explore the role and impact of digital disruption on investigative practice, and opportunities for more immersive reporting. </p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 3 Lecture: The impacts of digital distruption</strong>",
            "topic_description": "Week 3 Lecture: The impacts of digital distruption The lecture will explore the role and impact of digital disruption on investigative practice, and opportunities for more immersive reporting.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3 Tutorial: Deep witnessing</strong><br/><p>This week, we visit the UQ Art Museum for an exercise in critical, slow and deep witnessing, through a tour of selected worked in the Hoda Afshar's 'A Curve is a Broken Line' exhibit. Iranian-born, Melbourne-based Hoda Afshar examines the politics of image-making, using photography and moving image works that are deeply researched yet emotionally sensitive. Her work can be seen as a form of activism as much as an artistic inquiry. </p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 3 Tutorial: Deep witnessing</strong>",
            "topic_description": "Week 3 Tutorial: Deep witnessing This week, we visit the UQ Art Museum for an exercise in critical, slow and deep witnessing, through a tour of selected worked in the Hoda Afshar's 'A Curve is a Broken Line' exhibit. Iranian-born, Melbourne-based Hoda Afshar examines the politics of image-making, using photography and moving image works that are deeply researched yet emotionally sensitive. Her work can be seen as a form of activism as much as an artistic inquiry.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 4(12 Aug - 18 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4 Lecture: Assessment One Workshop</strong><br/><p>This week's lecture is a drop-in session to support development of Assessment 1.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 4 Lecture: Assessment One Workshop</strong>",
            "topic_description": "Week 4 Lecture: Assessment One Workshop This week's lecture is a drop-in session to support development of Assessment 1.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 4(12 Aug - 18 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4: NO TUTORIALS DUE TO PUBLIC HOLIDAY</strong><br/></p></div></td>",
            "topic_title": "<strong>Week 4: NO TUTORIALS DUE TO PUBLIC HOLIDAY</strong>",
            "topic_description": "Week 4: NO TUTORIALS DUE TO PUBLIC HOLIDAY",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(19 Aug - 25 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5 Lecture: Documents, social media and FOI reporting</strong><br/><p>Social media reporting tools and ethics, adopting a document mindset, and Freedom of Information requests. </p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 5 Lecture: Documents, social media and FOI reporting</strong>",
            "topic_description": "Week 5 Lecture: Documents, social media and FOI reporting Social media reporting tools and ethics, adopting a document mindset, and Freedom of Information requests.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5(19 Aug - 25 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5 Tutorial: Document-driven research and FOI and RTI reporting </strong><br/><p>Document-driven research application and drafting an FOI or RTI request.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 5 Tutorial: Document-driven research and FOI and RTI reporting </strong>",
            "topic_description": "Week 5 Tutorial: Document-driven research and FOI and RTI reporting Document-driven research application and drafting an FOI or RTI request.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6 Lecture: Fake News and Dark Digital</strong><br/><p>Reporting in a post-truth age; how to spot mis-, dis-and mal-information; disinformation agents and entering the deepfake era: perils and opportunities!</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 6 Lecture: Fake News and Dark Digital</strong>",
            "topic_description": "Week 6 Lecture: Fake News and Dark Digital Reporting in a post-truth age; how to spot mis-, dis-and mal-information; disinformation agents and entering the deepfake era: perils and opportunities!",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6 Tutorial: Fact-checking and verification</strong><br/><p>How to tell the difference between fact and fiction - a practical toolset for identifying dis-, mis- and mal-information, and fact-checking or verifying content.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 6 Tutorial: Fact-checking and verification</strong>",
            "topic_description": "Week 6 Tutorial: Fact-checking and verification How to tell the difference between fact and fiction - a practical toolset for identifying dis-, mis- and mal-information, and fact-checking or verifying content.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 7(02 Sep - 08 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7 Lecture: Best-practice reporting and journalistic ethics</strong><br/><p>Anonymous sources, vulnerable sources and other ethical issues in public-interest journalism. </p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 7 Lecture: Best-practice reporting and journalistic ethics</strong>",
            "topic_description": "Week 7 Lecture: Best-practice reporting and journalistic ethics Anonymous sources, vulnerable sources and other ethical issues in public-interest journalism.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 7(02 Sep - 08 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7 Tutorial: Conceptualising an investigation</strong><br/><p>Getting the most from your concept, by identifying quality sources and unexpected research angles. </p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 7 Tutorial: Conceptualising an investigation</strong>",
            "topic_description": "Week 7 Tutorial: Conceptualising an investigation Getting the most from your concept, by identifying quality sources and unexpected research angles.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8 Lecture: Complementary storytelling</strong><br/><p>Building a visual narrative: Visual storytelling is critical in investigative pieces. This lecture looks at the role of photojournalism and data visualisations in story production, as well as other multimedia elements.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 8 Lecture: Complementary storytelling</strong>",
            "topic_description": "Week 8 Lecture: Complementary storytelling Building a visual narrative: Visual storytelling is critical in investigative pieces. This lecture looks at the role of photojournalism and data visualisations in story production, as well as other multimedia elements.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8 Tutorial: Developing your investigation</strong><br/><p>Developing a comprehensive research plan. </p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 8 Tutorial: Developing your investigation</strong>",
            "topic_description": "Week 8 Tutorial: Developing your investigation Developing a comprehensive research plan.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9 Lecture: Advanced interviewing</strong><br/><p>Advanced interviewing techniques: asking critical questions; structuring an interview; approaching sources; asking difficult questions; trauma-informed interviewing.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 9 Lecture: Advanced interviewing</strong>",
            "topic_description": "Week 9 Lecture: Advanced interviewing Advanced interviewing techniques: asking critical questions; structuring an interview; approaching sources; asking difficult questions; trauma-informed interviewing.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9 Tutorial: Asking better questions</strong><br/><p>Interviewing in practice; developing interview plans.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 9 Tutorial: Asking better questions</strong>",
            "topic_description": "Week 9 Tutorial: Asking better questions Interviewing in practice; developing interview plans.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Mid Sem break(23 Sep - 29 Sep)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-Semester Break</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid-Semester Break</strong>",
            "topic_description": "Mid-Semester Break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10: NO LECTURE</strong><br/><p>Spend this week developing your investigation. </p></p></div></td>",
            "topic_title": "<strong>Week 10: NO LECTURE</strong>",
            "topic_description": "Week 10: NO LECTURE Spend this week developing your investigation.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10: NO TUTORIALS</strong><br/><p>Spend this week developing your investigation. </p></p></div></td>",
            "topic_title": "<strong>Week 10: NO TUTORIALS</strong>",
            "topic_description": "Week 10: NO TUTORIALS Spend this week developing your investigation.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(07 Oct - 13 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11 Lecture: Non-fiction storytelling techniques</strong><br/><p>Storytelling for impact; reaching audiences without overstepping notions of truth and fairness. </p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 11 Lecture: Non-fiction storytelling techniques</strong>",
            "topic_description": "Week 11 Lecture: Non-fiction storytelling techniques Storytelling for impact; reaching audiences without overstepping notions of truth and fairness.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 11(07 Oct - 13 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11 Tutorial: Storytelling workshop</strong><br/><p>Drafting and workshopping your investigations; using Shorthand.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 11 Tutorial: Storytelling workshop</strong>",
            "topic_description": "Week 11 Tutorial: Storytelling workshop Drafting and workshopping your investigations; using Shorthand.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12 Lecture: The Future of Investigative Journalism</strong><br/><p>Looking forward: the role and value of investigative reporting, industry case studies; the future of investigative journalism. Final tips for story submission. </p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 12 Lecture: The Future of Investigative Journalism</strong>",
            "topic_description": "Week 12 Lecture: The Future of Investigative Journalism Looking forward: the role and value of investigative reporting, industry case studies; the future of investigative journalism. Final tips for story submission.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12 Tutorial: Story workshop</strong><br/><p>This is your final chance to meet your tutor to discuss your assignment.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Week 12 Tutorial: Story workshop</strong>",
            "topic_description": "Week 12 Tutorial: Story workshop This is your final chance to meet your tutor to discuss your assignment.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13: NO LECTURE</strong><br/></p></div></td>",
            "topic_title": "<strong>Week 13: NO LECTURE</strong>",
            "topic_description": "Week 13: NO LECTURE",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13: NO TUTORIALS</strong><br/></p></div></td>",
            "topic_title": "<strong>Week 13: NO TUTORIALS</strong>",
            "topic_description": "Week 13: NO TUTORIALS",
            "learning_outcomes": []
        }
    ]
}