{
    "course_title": "Theories in Dispute Resolution",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/LAWS7841-64740-7460",
    "full_course_code": "LAWS7841-64740-7460",
    "course_code": "LAWS7841",
    "class_code": "64740",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "demonstrate knowledge of dispute resolution theory from different disciplinary and cultural perspectives;"
        },
        {
            "number": "LO2.",
            "description": "explain the nature, advantages and disadvantages of various dispute resolution processes, from both a theoretical and a practical perspective;"
        },
        {
            "number": "LO3.",
            "description": "select an appropriate type of process according to the circumstances of a particular case;"
        },
        {
            "number": "LO4.",
            "description": "demonstrate an understanding of practical, legal and ethical issues in dispute resolution; and"
        },
        {
            "number": "LO5.",
            "description": "develop a theoretical foundation for skills training in negotiation, mediation and arbitration (and other forms of alternative dispute resolution)."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Dispute Resolution Proposal",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 9/09/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Your task is to develop a proposal for a dispute resolution process to facilitate resolution of a conflict scenario. Three different conflict scenarios will be posted on Learn.UQ (Blackboard) at the start of the semester. You have to choose one of the three scenarios and develop a proposal for how to facilitate dispute resolution. Please note that not all possible DR processes that you may choose will have been discussed when this assignment is due. This means that you have to engage in independent reading and you may need to watch some of the lecture videos for subsequent modules to be able to choose the appropriate DR process. You are welcome to contact the lecturer with any questions you have and to discuss your approach.</p>\n<p>On the basis of relevant scholarly and practitioner literature develop a 2000 word dispute resolution proposal. Imagine that you are a dispute resolution consultant. A client has come to you with the conflict scenario that you have chosen. Develop a 2000 word case assessment for the client which recommends a particular dispute resolution process (for example integrative negotiation, facilitative mediation, conflict coaching, communication skills training, conciliation, arbitration or restorative conferencing) or a combination of processes.</p>\n<p>Explain why the suggested process is suitable for the particular conflict, what its advantages and disadvantages are and how you are going to deal with potential challenges and impasses. Base your recommendation on relevant scholarly and practitioner literature and reference this literature throughout the proposal. Ensure that you present a balanced proposal which acknowledges weaknesses and challenges but also makes a persuasive argument based on the merits of the process chosen and its underlying theories.</p>\n<p>If you recommend a third party process then explain how the third party will be selected and address issues such as neutrality or power imbalances.</p>\n<p>For further information on writing research essays and referencing please refer to A Guide to Citation of Sources in Assignments available from the TC Beirne School of Law website under 'Student Support' in 'Student Resources'. Please copy and paste the marking criteria sheet on the last page of your assignment.</p>\n<p><strong>Criteria for acceptance and marking:</strong></p>\n<ul>\n<li>The proposal must be written in a coherent fashion and within the word length specified. The total word length (excluding references and scenario) must be indicated on the first page of the assignment.</li>\n<li>Words in excess of the limit may not be taken into consideration when awarding a mark.</li>\n<li>The dispute resolution proposal must contain the assessment marking criteria sheet on the last page of the assignment.</li>\n<li>You have to submit the assignment via Assessment function on the Learn.UQ (Blackboard) site for the course. You do not have to submit a hardcopy of the assignment.</li>\n<li>Your assignment will be checked for signs of plagiarism by the Turnitin system and you will be able to view the Turnitin report.</li>\n<li>Your assignment will be marked using Turnitin and you will be able to view the comments, feedback and mark on the Blackboard website when they are released. It is essential that you copy and paste the marking criteria sheet on the last page of your assignment for this.</li>\n</ul>\n<p><br/></p>\n<p>Information on plagiarism detection system: Once you have submitted your assignment via Learn.UQ (Blackboard) the Turnitin anti-plagiarism system will check your assignment. Please review the plagiarism procedures of the University and the TC Beirne School of Law before you submit your first assignment and ensure that you comply with the policies. Turnitin will give you a percentage score for similarities to other documents. Sometimes the system identifies direct citations in quotation marks, parts of the reference list or the criteria sheet as similar documents. This is not considered plagiarism. The course co-ordinator will check every document with the Turnitin system. Please contact him if you have any concerns.</p>\n<p><br/></p>\n<p>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The assignment must be submitted electronically via the assessment submission link on the course Learn.UQ (Blackboard) site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Research Essay",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>60%</dd>",
            "due_date": "<dd><p> 4/11/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L04, L05",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Your task is to write a 4,000 word academic research essay on a current issue in dispute resolution. You may choose one of the four topics suggested below or you can choose your own topic. If you choose your own topic, you have to send a 200 word essay plan to the course co-ordinator and get approval before you can start on your topic.</p>\n<p><br/></p>\n<p>The paper must be based on current and relevant scholarly (and practitioner if appropriate) literature, include a clear hypothesis or research problem and present a balanced argument. This means that you are required to read and reference literature which supports and literature which criticises your hypothesis. You are also required to reference any thought which is not your own or is considered general knowledge. Research essays should be structured with an introduction, body and conclusion.</p>\n<p>Research essay topics:</p>\n<ol>\n<li>Compare facilitative and evaluative mediation. What are the advantages and disadvantages of both approaches when integrated into an adversarial justice system?</li>\n<li>What role does culture play in mediation? Discuss the cultural underpinnings of the facilitative mediation process and the implications of cultural difference for practice.</li>\n<li>What are the effects of the Singapore Convention on Mediation? Can mediation replace arbitration as the main DR process for international commercial disputes?</li>\n<li>What is the best way to mediate social conflict - in person, online (video or voice conference) or through other technologies? Discuss pros and cons of using different communication methods to conduct mediation processes.</li>\n<li>Choose your own topic (you have to get approval from the course co-ordinator).</li>\n</ol>\n<p>For further information on writing research essays and referencing please refer to \"A Guide to Citation of Sources\" available from the TC Beirne School of Law website under 'Student Support\" in \"Student Resources\". Please copy and paste the marking criteria on the last page of your assignment.</p>\n<p><strong>Criteria for acceptance and marking:</strong></p>\n<ul>\n<li>The research essay must be written in a coherent fashion and within the word length specified. The total word length (excluding references) must be indicated on the first page of the assignment.</li>\n<li>Words in excess of the limit may not be taken into consideration when awarding a mark.</li>\n<li>The research essay must contain the assessment marking criteria sheet on the last page of the assignment.</li>\n<li>You have to submit the assignment via the Turnitin function on the Learn.UQ (Blackboard) site for the course. You do not have to submit a hardcopy of the assignment.</li>\n<li>Your assignment will be checked for signs of plagiarism by the Turnitin system and you will be able to view the Turnitin report.</li>\n<li>Your assignment will be marked using Turnitin and you will be able to view the comments, feedback and mark on the Learn.UQ (Blackboard) website when they are released. It is essential that you copy and paste the marking criteria sheet on the last page of your assignment for this.</li>\n</ul>\n<p><br/></p>\n<p>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The assignment must be submitted electronically via the assessment submission link on the course Learn.UQ (Blackboard) site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 6 To Week 9(26 Aug - 22 Sep)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Seminars</strong><br><p>The programme of seminars for the course is set out in the course learning guide. This is available from the course Blackboard site.</p>\n<p>Seminar topics are:</p>\n<ol>\n<li>Course Overview and Understanding Conflict- Course overview Understanding conflicts and disputes Epistemologies of conflict resolution</li>\n<li>The Development of Dispute Resolution - The development of dispute resolution in Australia Facilitative, advisory and determinative DR processes The DR Matrix Values and goals of DR</li>\n<li>Negotiation Theory and Practice - Negotiation as the basis for constructive conflict resolution An analytical framework for negotiation Distributive and integrative approaches to negotiation</li>\n<li>Mediation and Conciliation - Mediation: concepts, definitions, approaches, values Conciliation and other advisory processes</li>\n<li>Determinative DR processes and common legal issues - Arbitration: history, domestic arbitration, international arbitration, critiques Case appraisal and expert determination Legal issues arising in DR: confidentiality, conduct, liability and enforceability of outcome</li>\n<li>Practical and theoretical issues in DR - Practitioner panel discussion: \"Working in dispute resolution in Queensland\" Cross-cutting issues in DR: neutrality, voluntariness, power, culture and gender</li>\n<li>The role of culture in Dispute Resolution - Indigenous approaches to DR Restorative Justice Understanding the cultural underpinnings of DR and critique of Euro-centric approaches to DR Case study: This is Our Story</li>\n<li>The future of Dispute Resolution - Value disputes, complex conflicts and public dialogue Conviviality and human connection in dispute resolution Collaborative law/practice Technology and dispute resolution</li>\n</ol></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Seminars</strong>",
            "topic_description": "Seminars The programme of seminars for the course is set out in the course learning guide. This is available from the course Blackboard site. Seminar topics are: Course Overview and Understanding Conflict- Course overview Understanding conflicts and disputes Epistemologies of conflict resolution The Development of Dispute Resolution - The development of dispute resolution in Australia Facilitative, advisory and determinative DR processes The DR Matrix Values and goals of DR Negotiation Theory and Practice - Negotiation as the basis for constructive conflict resolution An analytical framework for negotiation Distributive and integrative approaches to negotiation Mediation and Conciliation - Mediation: concepts, definitions, approaches, values Conciliation and other advisory processes Determinative DR processes and common legal issues - Arbitration: history, domestic arbitration, international arbitration, critiques Case appraisal and expert determination Legal issues arising in DR: confidentiality, conduct, liability and enforceability of outcome Practical and theoretical issues in DR - Practitioner panel discussion: \"Working in dispute resolution in Queensland\" Cross-cutting issues in DR: neutrality, voluntariness, power, culture and gender The role of culture in Dispute Resolution - Indigenous approaches to DR Restorative Justice Understanding the cultural underpinnings of DR and critique of Euro-centric approaches to DR Case study: This is Our Story The future of Dispute Resolution - Value disputes, complex conflicts and public dialogue Conviviality and human connection in dispute resolution Collaborative law/practice Technology and dispute resolution",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}