{
    "course_title": "Public International Law",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/LAWS3705-60541-7460",
    "full_course_code": "LAWS3705-60541-7460",
    "course_code": "LAWS3705",
    "class_code": "60541",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Undertake legal research in order to respond effectively to theoretical and practical questions involving rules and principles of international law;"
        },
        {
            "number": "LO2.",
            "description": "Resolve or provide legally defensible solutions (orally and in writing) to theoretical and/or practical questions arising from the application of the rules and principles of international law; and"
        },
        {
            "number": "LO3.",
            "description": "Identify, restate, explain and critically evaluate the most important approaches that are suggested by legal scholars when dealing with problems of international law."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Research Assignment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 20/09/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This component of the assessment is designed to test the ability of students to independently research and demonstrate (in writing) a critical understanding of a key area of international law.</p>\n<p>The essay topic will be released at the time of the first lecture. There will be one essay topic only and students will not be permitted to select their own topics.</p>\n<p><strong>Word count and penalty for exceeding the word limit</strong></p>\n<p>The word limit for the assignment is 2000 words including all headings, quotations and prose in footnotes, but excluding formal references in footnotes, the bibliography (if included) and self-reflection checklist. Students are required to state, on the front page of their essays, the word count of their essays.</p>\n<p>In cases where the Course Coordinator considers that a student may derive an unfair advantage over other students by exceeding the word limit the Course Coordinator will not assess material in excess of the prescribed essay word limit.</p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference AI use may constitute student misconduct under the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=145\">Student Code of Conduct Policy</a>.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI tools.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Essays must be submitted electronically via the submission link on the course Blackboard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "End-of-semester Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>60%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>2/11/2024 - 16/11/2024</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Any written or printed material is permitted in the exam; it may also be annotated. The examination will consist of problems and/or essay questions. The examination will be of 120 minutes duration. The perusal time will be 10 minutes. Students will be required to answer two from four questions.</p>\n<p>The examination will be designed to test knowledge and understanding of relevant international law rules and principles and the ability to apply such knowledge and understanding:</p>\n<p>- to given sets of facts; and/or</p>\n<p>- in consideration of essay questions.</p>\n<p>The principal focus of the end-of-semester examination will be on material that was not the subject of detailed consideration in the research assignment. Due to the foundational nature of the introductory material, however, it is impossible to avoid some overlap and students will be required to apply their knowledge and understanding of the introductory topics in the final examination.</p>\n<p>Any issues regarding the administration, timetabling and non attendance at final examinations need to be directed to the University of Queensland Examinations Section. These issues are not the responsibility of the individual Course Coordinator.</p>\n<p>This assessment task is to be completed in-person. The use of Artificial Intelligence (AI) tools will not be permitted. Any attempted use of AI may constitute student misconduct under the <a href=\"https://policies.uq.edu.au/document/view-current.php?id=145\">Student Code of Conduct Policy</a>.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(22 Jul - 27 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lectures</strong><br><p>The programme for lectures and tutorials is set out in the course Blackboard site (Learn.UQ).</p>\n<p>The lecture topics are:</p>\n<ol>\n<li>Introduction to international law I - Basic features;</li>\n<li>Introduction to international law II - Institutions and efficacy (and comparisons with Australian law);</li>\n<li>Introduction to international law III - Historical and theoretical issues;</li>\n<li>Sources of international law I - The sources of international legal obligations and rights (introduction to treaties, custom and general principles of law);</li>\n<li>Sources of international law II - The sources of international legal obligations and rights (custom, general principles of law, unilaterally assumed obligations, subsidiary sources and soft law);</li>\n<li>Sources of international law III - The law of treaties;</li>\n<li>International law and municipal law - How different national legal systems view international law;</li>\n<li>The subjects of international law I - States and intergovernmental organisations - personality, capacity and responsibility;</li>\n<li>The subjects of international law II - Natural persons - the protection of human rights under international law;</li>\n<li>The subjects of international law III - Natural persons and corporate entities - individual criminal responsibility under international law, and international economic law;</li>\n<li>Specialised areas of international law I - International environmental law, and international law of the sea, air and outer space; and</li>\n<li>Specialised areas of international law II and concluding observations - Use of force and the law of armed conflict, and concluding discussion of international law.</li>\n</ol>\n<p><br/></p></br></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Lectures</strong>",
            "topic_description": "Lectures The programme for lectures and tutorials is set out in the course Blackboard site (Learn.UQ). The lecture topics are: Introduction to international law I - Basic features; Introduction to international law II - Institutions and efficacy (and comparisons with Australian law); Introduction to international law III - Historical and theoretical issues; Sources of international law I - The sources of international legal obligations and rights (introduction to treaties, custom and general principles of law); Sources of international law II - The sources of international legal obligations and rights (custom, general principles of law, unilaterally assumed obligations, subsidiary sources and soft law); Sources of international law III - The law of treaties; International law and municipal law - How different national legal systems view international law; The subjects of international law I - States and intergovernmental organisations - personality, capacity and responsibility; The subjects of international law II - Natural persons - the protection of human rights under international law; The subjects of international law III - Natural persons and corporate entities - individual criminal responsibility under international law, and international economic law; Specialised areas of international law I - International environmental law, and international law of the sea, air and outer space; and Specialised areas of international law II and concluding observations - Use of force and the law of armed conflict, and concluding discussion of international law.",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        }
    ]
}