{
    "course_title": "Law Journals",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/LAWS5181-60129-7460",
    "full_course_code": "LAWS5181-60129-7460",
    "course_code": "LAWS5181",
    "class_code": "60129",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Manage the process of publishing an issue of a scholarly academic journal under the peer review process in academic publishing; edit academic articles, reviews and notes; and manage the practical aspects of timely, effective publication of the journal."
        },
        {
            "number": "LO2.",
            "description": "Recognise and reflect upon, and respond to, ethical issues that arise in the process of editing an academic journal including conflicts of interest and intellectual property issues."
        },
        {
            "number": "LO3.",
            "description": "Learn and work with autonomy, accountability and professionalism."
        },
        {
            "number": "LO4.",
            "description": "Reflect on and assess work of others, and make use of feedback as appropriate, to support personal and professional development."
        },
        {
            "number": "LO5.",
            "description": "Collaborate effectively with the Editor in Chief and the other members of the student editorial committee to manage the process of publishing the AILJ."
        },
        {
            "number": "LO6.",
            "description": "Communicate in ways that are effective, appropriate and persuasive with submitting authors, reviewers, the Editor in Chief and other members of the student editorial committee."
        },
        {
            "number": "LO7.",
            "description": "Undertake, use and synthesise international legal research."
        },
        {
            "number": "LO8.",
            "description": "Analyse and discuss the broad contours of international legal research relevant to the journal."
        },
        {
            "number": "LO9.",
            "description": "Perceive the diversity of what is generally classified as international legal research, including its underlying philosophies and approaches; and identify where your own personal legal views and approaches are placed relative to the relevant body of research; and express an informed and well-reasoned personal legal perspective or position relative to a discrete area of international legal research published in the journal."
        },
        {
            "number": "LO10.",
            "description": "Identify trends in international legal research, including what factors may influence those trends."
        },
        {
            "number": "LO11.",
            "description": "Write in a style suitable for a university international law journal publication."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Book review or Case note",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> pass or fail </dd>",
            "due_date": "<dd><p> 15/11/2024 2:00 pm</p></dd>",
            "learning_objectives": "L04, L07, L08, L09, L10",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Each student editor shall be required to:</p>\n<p>(a) Write and submit for publication in the <em>AILJ </em>a note on a recent judicial or arbitral decision involving issues of public or private international law that has implications beyond the decision in the case itself; or</p>\n<p>(b) Write and submit for publication in the <em>AILJ </em>a review of a recently published international legal book.</p>\n<p>The case or book must be approved by the Editor in Chief before the note or review is written. Each case note or book review written by a student should be 1500-2000 words.</p>\n<p>The case note or book review will count towards the pass/fail grade for LAWS5181<em> Law Journals</em>. These are also to be submitted for possible publication in the <em>AILJ</em>. The decision as to publication rests with the Editor in Chief and publication is not guaranteed. However, to improve the likelihood that the work will be published in the <em>AILJ</em>, student editors are encouraged to submit drafts of the notes or reviews to the Editor in Chief for comment and advice on how to improve the work.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Via email to the Editor in Chief.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Fulfillment of editorial responsibilities",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> pass or fail </dd>",
            "due_date": "<dd><p> 25/10/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L08, L09, L10, L11",
            "mode": "Written",
            "category": "Participation/ Student contribution",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>General Editing Responsibilities</strong></p>\n<p>These are threefold, involving <em>reports</em>, <em>editing</em> and <em>final proofing</em>.</p>\n<ul>\n<li><em>Reports - </em>Each student editor shall be required to write a report of approximately 500 words on a maximum of three (3) articles submitted for publication in the <em>AILJ</em>, depending on the number of submissions in the relevant year.</li>\n<li><em>Editing - </em>Each student editor shall be responsible for the editing of a maximum of three (3) articles accepted for publication by the Editor in Chief, depending again on the number accepted in the relevant year. The editing involves the formatting of the article, proof-reading, checking all quotations and references for accuracy, and advising where necessary regarding changes to substance or style.</li>\n<li><em>Final proofing - </em>For each article that a student editor has edited, he or she shall also be required to check the final proofs provided by the printer of the <em>AILJ</em> for accuracy, and to advise where corrections are necessary.</li>\n</ul>\n<p><strong>Individual Editing Responsibilities</strong></p>\n<p>Student editors are responsible for the administration of the review process of papers submitted for publication as <strong><em>articles</em></strong>. This responsibility includes liaising with the Editor in Chief in relation to the selection of referees, providing the Editor in Chief with student editors’ reports, requesting assessment of articles from referees, and reminding referees to provide reports when there is delay. Student editors are also responsible for the final formatting of all articles accepted for publication, to have them ready for transmission to the printer of the <em>AILJ</em> by a specified date in November (as determined by the Editor in Chief – a date after November may be specified where delays occur in the editorial process), and to check proofs produced by the printer for accuracy (including through the distribution of proofs to authors for final checking), and to advise where corrections are necessary.</p>\n<p>Student editors are also responsible for the final formatting of all <strong><em>book reviews</em></strong> accepted for publication, to have them ready for transmission to the printer of the <em>AILJ</em> by a specified date in November (as determined by the Editor in Chief – a date after November may be specified where delays occur in the editorial process), and to check proofs produced by the printer for accuracy (including through the distribution of proofs to authors for final checking), and to advise where corrections are necessary.</p>\n<p>Student editors also responsible for the final formatting of all <strong><em>case notes</em></strong> accepted for publication, to have the case notes ready for transmission to the printer of the <em>AILJ</em> by a specified date in November (as determined by the Editor in Chief – a date after November may be specified where delays occur in the editorial process), and to check proofs produced by the printer for accuracy (including through the distribution of proofs to authors for final checking), and to advise where corrections are necessary.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": null,
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Team Based Learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Meetings</strong><br><p>The student editors will be members of the AILJ Editorial Committee. The Editor in Chief and the members of the AILJ Editorial Committee will ordinarily meet in week 1 of second semester (in all likelihood using Zoom). Subsequent meetings will be held as and when required.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Meetings</strong>",
            "topic_description": "Meetings The student editors will be members of the AILJ Editorial Committee. The Editor in Chief and the members of the AILJ Editorial Committee will ordinarily meet in week 1 of second semester (in all likelihood using Zoom). Subsequent meetings will be held as and when required.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Team Based Learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Research, writing and editing</strong><br/><p>The primary responsibility of members of the AILJ Editorial Committee is to work under the direction and guidance of the Editor in Chief. This will largely entail responsibilities in three broad categories: (i) research and writing; (ii) general editing responsibilities; and (iii) individual editing responsibilities.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09, L10, L11</p></div></td>",
            "topic_title": "<strong>Research, writing and editing</strong>",
            "topic_description": "Research, writing and editing The primary responsibility of members of the AILJ Editorial Committee is to work under the direction and guidance of the Editor in Chief. This will largely entail responsibilities in three broad categories: (i) research and writing; (ii) general editing responsibilities; and (iii) individual editing responsibilities.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09",
                "L10",
                "L11"
            ]
        }
    ]
}