{
    "course_title": "Ethics and the Legal Profession",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/LAWS3703-60537-7460",
    "full_course_code": "LAWS3703-60537-7460",
    "course_code": "LAWS3703",
    "class_code": "60537",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate advanced knowledge of the law and regulatory processes applicable to the legal profession and practice (with particular reference to Queensland), its structures and its rules of conduct."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate knowledge of the legal requirements applicable to lawyers for dealing with trust money."
        },
        {
            "number": "LO3.",
            "description": "Apply knowledge of legal ethics to the practise of law, drawing on prominent philosophies and the moral and societal importance for ethical conduct by lawyers."
        },
        {
            "number": "LO4.",
            "description": "Reflect on your personal ethical framework, how it relates to and impacts on important aspects of legal practice."
        },
        {
            "number": "LO5.",
            "description": "Apply advanced decision-making skills to ethical issues arising in legal practice."
        },
        {
            "number": "LO6.",
            "description": "Critically analyse and apply law and regulatory processes within the context of contemporary legal practice."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Research essay and personal reflection",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 8/10/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment assesses your ability to independently research a topic related to legal professional ethics, and to demonstrate your ability to apply this research, as well as your learning from the course, in an in depth and critical way within an essay format. <em>And </em>I want your personal reflection on an issue. What do you think should be the practise, what would you do?</p>\n<p>This essay is therefore testing your ability to identify useful knowledge, explain it accurately and then apply these learnings to help you think about a topic in a critical but accurate and balanced way, and then provide your own conclusions about it. It is also asking you to apply the learnings in the course about how your personal convictions and experiences influence your approach to professional practice.</p>\n<p>You should apply your learning from the course, as well as your own views and the thoughts of others in scholarly writing and/or case law. You<strong> must</strong>:</p>\n<p> <strong>1. make some reference to, and reflect upon, the relevant law and/or professional norm associated with the topic; AND</strong></p>\n<p><strong> 2. provide a clear identification of the relevant ethical issue for a legal practitioner/law firm/legal profession; AND</strong></p>\n<p><strong> 3. demonstrate appropriate research undertaken for the subject of your essay; AND</strong></p>\n<p><strong> 4. reflect upon your own personal views on the ethical issue in the context of legal practice and how you might address it.</strong></p>\n<p>You should build on the topic and work undertaken in the first assessment, the research proposal. You are not permitted to change topic for the essay (from the proposal) unless you are given express permission. Further explanation of how to build on the work of the proposal will be provided in the seminars and on Blackboard. It is expected that you will conduct further research after your proposal is submitted, and develop your argument on this basis. There are marks associated with identifying appropriate research in the field as well as applying this in the body of our essay. You are permitted to change the structure of the essay from the proposed structure provided in your proposal. The personal reflection section will be developed here, where it is not an aspect of the proposal (except to have it as a section heading in the draft structure).</p>\n<p>The essay should reflect your independent and original take on a specified topic, clearly express your own views and apply scholarship/law/knowledge from your research on the topic. It should be more than a description of a particular debate or issue and while describing what others have said in the area is important, you need to build on this with your own thoughts and connections between ideas. Be critical, but accurate, in how you consider the research material found. You must put forward points that support <em>and oppose</em> your views, even where you might provide more words and weight to your own preference. Explain why the other side is not convincing. The essay then must also have a short section with a personal reflection.</p>\n<p>The total word count for the research essay must not be more than <strong>2,200 words </strong>(excluding footnotes (which must not contain substantive material)). Words in excess of the limit will not be taken into consideration in awarding a mark. Please state the total word count for your essay on the front page (excluding footnotes). Please provide a bibliography which is not included in the word count. Heading are not included in the word count. There is no minimum word length. However, you should be aware of the possibility that a significantly under-length piece submitted may indicate that the topic has not been covered in sufficient depth or with appropriate sophistication.</p>\n<p>You are welcome to discuss your topic with anyone during or after the course. However, the essay is an individual piece of work. It must be entirely your own work in composition, writing and research undertaken. As usual, anyone else's work referred to must be properly cited. As for any essay, the marker will expect appropriate referencing of sources and communication of information and ideas according to UQ conventions for legal essay writing. (Please refer to the marking criteria below and rubric on Blackboard.)</p>\n<p>There is no minimum or maximum number of cited articles/cases to satisfy the research element. However, to provide some general guidance, it is expected that more than two articles/secondary literature are used in your discussion. No marks are awarded for the number of articles referred to alone. Marks will be allocated for the use of the material found to add to your argument.</p>\n<p><strong>What does 'your own personal views' mean for the essay?</strong></p>\n<p>The personal reflection aspect of your essay means that you must explicitly refer to what you think about an issue, your personal values as they relate to the topic and (where relevant) what you would do in a situation. Essays that simply describe the situation or the law or literature, even expressing a view about the scholarly debate alone, will not be awarded any marks for this category. Refer to the marking rubric provided on Blackboard from week 1.</p>\n<p>Your personal views must be either provided in a separate section. The expectation is that the reflection be a genuine attempt to reflect on and discuss the issue and think about how you would act or solve the problem in your work.</p>\n<p>You are welcome to use \"I\" or, if you would prefer not to, you can use another third person way of expressing your views (eg. 'the author').</p>\n<p>If you have a query or concern about the content of your essay, you should speak to the course coordinator well before the due date for the essay.</p>\n<p>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit your answer in Word format to Blackboard essay submission folder by the deadline. All answers are required to be submitted using Turnitin. You can submit  a draft of your assignment to Turnitin prior to submission of the final assignment and receive a report.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "End-of-semester Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>2/11/2024 - 16/11/2024</p></dd>",
            "learning_objectives": "L01, L02, L05",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students must undertake the end-of-semester exam which is worth 50% of the marks for the course. The in person exam will be administered by central Examinations. Further details of the assessment dates and delivery will be provided during semester as advised by the University.</p>\n<p><strong>Examinable topics</strong></p>\n<p>All aspects of the course are potentially examinable in the final exam except:</p>\n<p>- general historical and demographic background discussed in Week 1; and</p>\n<p>- legal ethics theories discussed in the course.</p>\n<p>The material concerning ethical duties to other lawyers and third parties covered in Week 12 by the guest lecturer is examinable. All of the examinable topics are covered in the course Learning Guide. However, there is also an expectation that students read and refer to prescribed cases as well.</p>\n<p><strong>Format and allowable materials in the exam</strong></p>\n<p>Any written or printed material is permitted in the exam; it may also be annotated. Answers should refer to and cite relevant case law and legislation/rules but should not include footnotes or a bibliography. There will be two questions of different weighting.</p>\n<p>Students will be asked to consider two fictional scenarios and respond to the questions posed about them. The questions may ask students about legal liability and duty, as well as actions to be taken to respond to the facts or disciplinary process. There will be a total of 50 marks available.</p>\n<p>This assessment task is to be completed in-person. The use of Artificial Intelligence (AI) tools will not be permitted. Any attempted use of AI may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 12(29 Jul - 20 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lectures</strong><br><ul>\n<li>Who, what why lawyers? This lecture will begin with an introduction to the course. The lecture will refer to historical sources of the Australian legal profession, current contexts and outline the development of professional ethics and approaches to regulation.</li>\n<li>Lawyers' duties and theories - does ethics matter? This lecture will provide students with an overview of the key duties that must be observed by lawyers. The lecture will also link these duties to prominent ethical theories about lawyering. The lecture will outline how these duties and ethical concepts will underpin the learning in the course as we delve deeper into the specifics of professional practice.</li>\n<li>Admission to law and professional discipline This lecture will cover the practical requirements for admission and certification for legal practice, as well as the legislative provisions and common law relating to admission and lawyers' reserve of practice. This is necessarily a brief overview in the time available. We will continue to talk about professional discipline throughout the course as it provides the relevant case law for many of the specific areas of practice studied in later weeks.</li>\n<li>Understanding the lawyer-client relationship This lecture will examine the nature of the lawyer-client relationship, including the law relating to entering into and ending a lawyer-client relationship.</li>\n<li>Billing ethically - This lecture considers lawyers' legal rights in regards to being paid for professional services, the responsibilities and limitations imposed on them at law, and examines the ethics of billing clients.</li>\n<li>Confidentiality - This lecture examines duties imposed on lawyers to keep client confidences. It includes a specific discussion of legal professional privilege. The lecture will also consider the duty of confidence in the context of other duties imposed on practitioners to the court and other practitioners and with reference to key lawyers' ethical theories and modern technological challenges.</li>\n<li>Competent lawyering - This lecture examines ethical duties of care and diligence that must be provided by barristers and solicitors. A brief outline of the legal standard of care imposed on lawyers will be provided. It presupposes a knowledge of tort and contract law. The lecture will also provide a discussion of limitations and immunities to liability. The lecture examines the impact of technology on duties of competence and care.</li>\n<li>Trust money - dealing with others' money ethically - This lecture will examine the law relating to solicitors holding and dealing with trust money and trust accounts. There will be a longer lecture associated with this week to deliver learning around a heavily regulated aspect of legal practice. There is no seminar based on this material. This lecture will be pre-recorded to provided on Blackboard. There is no in person lecture this week.</li>\n<li>Advocates' ethical roles and duties - This lecture considers the law applying to and practises of lawyers doing advocacy in court and in other dispute resolution roles. This discussion covers advocacy in civil and criminal contexts. Note: this lecture will be pre-recorded and available on Blackboard. There will be no live lecture this week.</li>\n<li>Conflicting duties/loyalties- part 1 This lecture examines the lawyer's duty to act in the interests of the client and the difficulties that can arise when other duties or interests conflict with this. This week considers conflicts that arise as to duties owed to a client and the practitioner's own interests or those of another practitioner. It considers this in the civil and criminal context.</li>\n<li>Conflicting duties/loyalties - part 2 - This lecture will continue the consideration of conflicting duties. It considers the commonly arising issue of conflicts between duties to two current clients and between duties (of confidentiality) to a former client and a current client. It considers this in the civil and criminal context.</li>\n<li>Lawyers' duties to third parties and to all - This lecture considers duties of lawyers to other practitioners and third parties. It also provides a general overview of legal ethics. This lecture will be delivered by Stafford Shepherd, Director of the Ethics Centre, Queensland Law Society.</li>\n<li>Being ethical and doing justice, and some revision - This final lecture will draw together important aspects of the course and discuss how the course might be useful for students thinking about having an ethical career oriented to doing justice in the public interest (however you conceive of this).</li>\n</ul></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Lectures</strong>",
            "topic_description": "Lectures Who, what why lawyers? This lecture will begin with an introduction to the course. The lecture will refer to historical sources of the Australian legal profession, current contexts and outline the development of professional ethics and approaches to regulation. Lawyers' duties and theories - does ethics matter? This lecture will provide students with an overview of the key duties that must be observed by lawyers. The lecture will also link these duties to prominent ethical theories about lawyering. The lecture will outline how these duties and ethical concepts will underpin the learning in the course as we delve deeper into the specifics of professional practice. Admission to law and professional discipline This lecture will cover the practical requirements for admission and certification for legal practice, as well as the legislative provisions and common law relating to admission and lawyers' reserve of practice. This is necessarily a brief overview in the time available. We will continue to talk about professional discipline throughout the course as it provides the relevant case law for many of the specific areas of practice studied in later weeks. Understanding the lawyer-client relationship This lecture will examine the nature of the lawyer-client relationship, including the law relating to entering into and ending a lawyer-client relationship. Billing ethically - This lecture considers lawyers' legal rights in regards to being paid for professional services, the responsibilities and limitations imposed on them at law, and examines the ethics of billing clients. Confidentiality - This lecture examines duties imposed on lawyers to keep client confidences. It includes a specific discussion of legal professional privilege. The lecture will also consider the duty of confidence in the context of other duties imposed on practitioners to the court and other practitioners and with reference to key lawyers' ethical theories and modern technological challenges. Competent lawyering - This lecture examines ethical duties of care and diligence that must be provided by barristers and solicitors. A brief outline of the legal standard of care imposed on lawyers will be provided. It presupposes a knowledge of tort and contract law. The lecture will also provide a discussion of limitations and immunities to liability. The lecture examines the impact of technology on duties of competence and care. Trust money - dealing with others' money ethically - This lecture will examine the law relating to solicitors holding and dealing with trust money and trust accounts. There will be a longer lecture associated with this week to deliver learning around a heavily regulated aspect of legal practice. There is no seminar based on this material. This lecture will be pre-recorded to provided on Blackboard. There is no in person lecture this week. Advocates' ethical roles and duties - This lecture considers the law applying to and practises of lawyers doing advocacy in court and in other dispute resolution roles. This discussion covers advocacy in civil and criminal contexts. Note: this lecture will be pre-recorded and available on Blackboard. There will be no live lecture this week. Conflicting duties/loyalties- part 1 This lecture examines the lawyer's duty to act in the interests of the client and the difficulties that can arise when other duties or interests conflict with this. This week considers conflicts that arise as to duties owed to a client and the practitioner's own interests or those of another practitioner. It considers this in the civil and criminal context. Conflicting duties/loyalties - part 2 - This lecture will continue the consideration of conflicting duties. It considers the commonly arising issue of conflicts between duties to two current clients and between duties (of confidentiality) to a former client and a current client. It considers this in the civil and criminal context. Lawyers' duties to third parties and to all - This lecture considers duties of lawyers to other practitioners and third parties. It also provides a general overview of legal ethics. This lecture will be delivered by Stafford Shepherd, Director of the Ethics Centre, Queensland Law Society. Being ethical and doing justice, and some revision - This final lecture will draw together important aspects of the course and discuss how the course might be useful for students thinking about having an ethical career oriented to doing justice in the public interest (however you conceive of this).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 12(29 Jul - 20 Oct)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Seminars</strong><br/><ul>\n<li>What sort of lawyer do you want to be? This first seminar is designed as a friendly introduction to the course material and each other. We will participate in a few group discussions about some legal practice and ethical scenarios and begin to discuss the regulatory regime.</li>\n<li>Lawyers' duties and morals - do they match? This seminar will ask students to participate in scenario based discussions. These will provide a first exposure to the key ethical duties of lawyers and how they relate to prominent philosophical ideas about ethical lawyering. No specific knowledge of the professional rules is required. Students are asked to complete a short exercise prior to the seminar to be discussed in class (as advised on Blackboard). The research essay (due in Week 11) will also be explained.</li>\n<li>Being a 'fit and proper person' This seminar will reinforce the regulatory frameworks and case law principles discussed in the lecture. This will be done through class examination of a few case extracts and several discipline cases.</li>\n<li>Becoming the client's lawyer This seminar will reinforce the legal requirements associated with the establishment, and ending, of a lawyer-client relationship. The class will consider a number of scenarios based on cases. Those in a Weds seminar should attend an alternative seminar as 14 August is a public holiday.</li>\n<li>How to charge clients and still be a good person - This seminar will consider legal and ethical billing through class discussion of a number of scenarios and case extracts. In this class we will also try implementing values in practice.</li>\n<li>Keeping secrets - This seminar will consider the difficult ethical questions concerning lawyer confidentiality. Students will be shown a brief video to discuss. A number of recent cases will be discussed in class.</li>\n<li>It's all about a client's best interests - What do we mean by working in the 'best interests of the client'? We will discuss cases relating to barristers and solicitors and how they should respond to a varied range of clients they encounter.</li>\n<li>To be a zealous advocate or not to be? This seminar will consider the ethical rules applying to barristers and solicitors concerning appropriate advocacy. Considering a number of cases, we will also draw on the ethical theories introduced in Week 2 and talk about conflicting interests/duties.</li>\n<li>Identifying and balancing competing interests - This seminar will draw on the law and ethical obligations discussed throughout the course, and consider a range of scenarios where personal interests clash with duties to the client or to administration of justice.</li>\n<li>Conflicts - manage or avoid? This seminar revises the case law considering duty-duty conflicts and considers scenarios where the line might be hard to discern.</li>\n<li>Should we care about anyone other than the client? This seminar will consider duties to third parties and whether lawyers have obligations to consider interests beyond the client and the court.</li>\n<li>Revision session for end-of-semester exam - This seminar will revise the course. A number of questions from previous end-of-semester exams will be studied. The class will engage in a final discussion about implementing one's values and doing justice in the practise of law.</li>\n</ul>\n<p><br/></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Seminars</strong>",
            "topic_description": "Seminars What sort of lawyer do you want to be? This first seminar is designed as a friendly introduction to the course material and each other. We will participate in a few group discussions about some legal practice and ethical scenarios and begin to discuss the regulatory regime. Lawyers' duties and morals - do they match? This seminar will ask students to participate in scenario based discussions. These will provide a first exposure to the key ethical duties of lawyers and how they relate to prominent philosophical ideas about ethical lawyering. No specific knowledge of the professional rules is required. Students are asked to complete a short exercise prior to the seminar to be discussed in class (as advised on Blackboard). The research essay (due in Week 11) will also be explained. Being a 'fit and proper person' This seminar will reinforce the regulatory frameworks and case law principles discussed in the lecture. This will be done through class examination of a few case extracts and several discipline cases. Becoming the client's lawyer This seminar will reinforce the legal requirements associated with the establishment, and ending, of a lawyer-client relationship. The class will consider a number of scenarios based on cases. Those in a Weds seminar should attend an alternative seminar as 14 August is a public holiday. How to charge clients and still be a good person - This seminar will consider legal and ethical billing through class discussion of a number of scenarios and case extracts. In this class we will also try implementing values in practice. Keeping secrets - This seminar will consider the difficult ethical questions concerning lawyer confidentiality. Students will be shown a brief video to discuss. A number of recent cases will be discussed in class. It's all about a client's best interests - What do we mean by working in the 'best interests of the client'? We will discuss cases relating to barristers and solicitors and how they should respond to a varied range of clients they encounter. To be a zealous advocate or not to be? This seminar will consider the ethical rules applying to barristers and solicitors concerning appropriate advocacy. Considering a number of cases, we will also draw on the ethical theories introduced in Week 2 and talk about conflicting interests/duties. Identifying and balancing competing interests - This seminar will draw on the law and ethical obligations discussed throughout the course, and consider a range of scenarios where personal interests clash with duties to the client or to administration of justice. Conflicts - manage or avoid? This seminar revises the case law considering duty-duty conflicts and considers scenarios where the line might be hard to discern. Should we care about anyone other than the client? This seminar will consider duties to third parties and whether lawyers have obligations to consider interests beyond the client and the court. Revision session for end-of-semester exam - This seminar will revise the course. A number of questions from previous end-of-semester exams will be studied. The class will engage in a final discussion about implementing one's values and doing justice in the practise of law.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        }
    ]
}