{
    "course_title": "Law Moot B",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/LAWS5209-64759-7460",
    "full_course_code": "LAWS5209-64759-7460",
    "course_code": "LAWS5209",
    "class_code": "64759",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Formulate and present coherent and correct legal arguments suitable for a mooting or similar environment;"
        },
        {
            "number": "LO2.",
            "description": "Present oral presentations of legal arguments coherently and persuasively in a mooting or similar context; and"
        },
        {
            "number": "LO3.",
            "description": "Draft, explain and defend extensive written memorials in support of arguments advanced through oral advocacy."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Active Participation in Mooting Competition",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p> 22/07/2024 - 21/10/2024</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Activity/ Performance",
            "category": "Participation/ Student contribution",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Throughout the duration of the mooting competition, you are required to actively participate in the activities of the student team as required by the rules of the moot competition.</p>\n<p>Your Academic Advisor and/or coaches will be responsible for guiding the team in the competition and may allocate responsibilities or tasks to ensure equitability of opportunity and contribution by each student. The Faculty Advisor/coach will mark this assessment item.</p>\n<p>As an active participant in a student team, you are expected to act in accordance with the ethical expectations of legal professionalism as well as UQ’s values. Your active participation will be <strong>individually assessed</strong> based on the following principles and tasks:</p>\n<ul>\n<li>Participation in induction activities for the mooting competition to introduce you to expectations for communication, organisation, time management, conflict resolution, reflection and collaboration;</li>\n<li>Participation in all competition requirements (unless otherwise authorised), including attending practice moots (even when not a speaker) and competition round moots;</li>\n<li>Engagement in team meetings and team communications across the course of the competition;</li>\n<li>Following all reasonable instructions of the Faculty Advisor and coach, leading to the completion of allocated tasks to a reasonable standard and in a timely way; and</li>\n<li>Observation of the ethical expectations of legal professionalism, including collegiality, civility and abiding by competition rules;</li>\n</ul>\n<p>A marking sheet is provided on the course website. Should your participation be judged to be in compliance with these expectations, you will receive the full 15 marks. If you do not adequately participate in the competition according to the above expectations, you will receive no marks for this assessment item. </p>\n<p><strong>Further Instructions:</strong></p>\n<p>Where you are not in compliance with the above requirements, the Faculty Adviser will provide you with a warning and directions as to required participation. Should you fail to comply with these instructions or otherwise fail to comply with the prescribed expectations for participation after this time, this will result in mark of zero (0) for this assessment item.</p>\n<p>This assessment task evaluates your abilities, skills and knowledge without the aid of Artificial Intelligence (AI). The use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the UQ Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": null,
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Written Memorials (group assessment)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 22/07/2024 - 21/10/2024</p></dd>",
            "learning_objectives": "L01, L03",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Your student team will be assessed on the overall quality and effectiveness of the final written memorials drafted in association with the relevant mooting competition. Please refer to the marking criteria sheet available on the course website.</p>\n<p>The final written memorials that you are assessed on are a team product and a group mark will be awarded (except as provided for below). Consequently, each student team member is expected to <strong>contribute equally </strong>towards the final written memorials. </p>\n<p>To help you succeed with this task, your Faculty Advisor and coaches will be in contact with each student team member over the course of the competition to ensure their contribution to the team and consult with the student team to provide assurance of equity of student contributions throughout the competition.</p>\n<p><strong>Further instructions</strong></p>\n<p>As this is a group assessment task, all student team members will typically receive the same grade.  If you are deemed not to be in compliance with group work requirements, including contributing equally, a warning and direction as to proper compliance with expectations for group work will be provided by the Faculty Advisor.</p>\n<p><strong>Failure to comply with these instructions and/or prescribed expectations for group work after this warning may result in you being assessed individually.</strong> If so, you will be required to provide your own written materials as advised by the Faculty Advisor.</p>\n<p>This assessment task evaluates your abilities, skills and knowledge without the aid of Artificial Intelligence (AI). The use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the UQ Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The final written memorials produced by the student team will be assessed.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": null,
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Oral advocacy during practice moot (Presentation Recorded)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>45%</dd>",
            "due_date": "<dd><p> 22/07/2024 - 21/10/2024</p>\n<p>\n</p><p>The date of this assessment will be set by the faculty advisor for the individual competition.</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You are required to present oral argument in an assessed practice moot.* The faculty advisor or coach, in consultation with the student team, will assign oral presentations including the one being assessed. Each assessable presentation will be approximately 20 minutes of duration including questions from the judging panel. The oral argument will be recorded in accordance with the UQ policies and procedures and the faculty advisor and coach will take notes. The faculty advisor will assess your oral advocacy and also provide oral feedback.</p>\n<p>This assessment task evaluates your abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Your are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": null,
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(22 Jul - 27 Oct)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Moot</strong><br><p>Students undertake independent research individually and as a team in preparation for the selected moot competition under the supervision of a faculty advisor and coach.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Moot</strong>",
            "topic_description": "Moot Students undertake independent research individually and as a team in preparation for the selected moot competition under the supervision of a faculty advisor and coach.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Induction session</strong><br/><p>All students must attend an induction session to discuss the nature of course activities, expected behaviours and student supports available.<br/>Date to be advised by the course coordinator for each competition team.</p></p></div></td>",
            "topic_title": "<strong>Induction session</strong>",
            "topic_description": "Induction session All students must attend an induction session to discuss the nature of course activities, expected behaviours and student supports available. Date to be advised by the course coordinator for each competition team.",
            "learning_outcomes": []
        }
    ]
}