{
    "course_title": "Current Issues in Legal Practice",
    "study_period": "Sem 2 2024",
    "location": "External",
    "attendance": "Online",
    "url": "https://course-profiles.uq.edu.au/course-profiles/LAWS7725-60165-7460",
    "full_course_code": "LAWS7725-60165-7460",
    "course_code": "LAWS7725",
    "class_code": "60165",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "State and accurately explain the underlying drivers, macro forces and key concepts that you appreciate the reasons for the growing importance and polarisation."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate that you can describe and critically analyse the taxonomy."
        },
        {
            "number": "LO3.",
            "description": "Identify and explore the risks and opportunities for businesses, including critical analysis of real-life case studies."
        },
        {
            "number": "LO4.",
            "description": "Formulate, share and assist in implementing a strategy in response to risks and opportunities."
        },
        {
            "number": "LO5.",
            "description": "Apply your acquired knowledge of the key concepts effectively, in a variety of contexts and settings (different corporate structures, industries and jurisdictions)."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Oral presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 23/09/2024 - 27/09/2024</p>\n<p>\n</p><p>Students will be required to present during the mid-semester break and will be advised by the course coordinator. Specific details will be discussed in the seminars and provided on Blackboard.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The mid-course assessment will be an oral presentation based on a topic given in advance. Students will be expected to demonstrate their ability to analyse, identify and explain the ESG backdrop and key considerations (eg drivers, stakeholders, varied viewpoints, risks, opportunities etc).</p>\n<p> </p>\n<p>Assessment tasks evaluate students’ abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Client Memo",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>60%</dd>",
            "due_date": "<dd><p> 7/11/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The second assessment will be a 2000 word, written internal memo, based on a detailed fictional case study. </p>\n<p>Students will conduct initial analysis, and focus their response on concisely explaining key ESG developments relevant to the organisation, as well as recommendations to mitigate risk and embody best practice. The word count is lower than a typical assessment of this weighting, however this is in order to promote effective, direct and clear, written communication – a critical skill in a commercial context.</p>\n<p><br/></p>\n<p>Assessment tasks evaluate students abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The assignment must be submitted electronically via the assessment submission link on the course Learn.UQ (Blackboard) site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 11",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Seminars</strong><br><p>The programme of seminars for the course is set out in the course learning guide. This is available from the course Blackboard site.</p>\n<p>Seminar topics are:</p>\n<ol>\n<li>Evolution of ESG - Drivers, macro forces, key concepts, major players, business imperative. <strong>Presenters</strong> Tim Power, Kirsten Sugden, Mikaylie Page</li>\n<li>Environmental fundamentals - Resource and energy use, waste management, nature based solutions, IPCC findings mitigation and adaptation strategies, circularity. <strong>Presenters</strong> Seth Kerschner, Taylor Gillespie</li>\n<li>Social fundamentals - Guiding principles, evolving definitions, ethical trade and labor rights across the supply chain, conflict zones, grievance mechanisms, debunking the myth S is hard to measure. <strong>Presenters</strong> Clare Connellan, Emiko Singh</li>\n<li>Governance fundamentals - Shareholder to stakeholder primacy, ESG legal frameworks (CSDDD, CSRD, SEC climate disclosure rules), internal structure, policies and processes, reporting, net zero commitments, SBTs, D&amp;I. <strong>Presenters</strong> Taylor Pullins, Jessica Lynd</li>\n<li>Energy transition - Decarbonisation, renewables, battery storage, carbon capture, utilization and storage, hydrogen, green LNG, disputes. <strong>Presenters</strong> Michael Watson, Michael Polkinghorne, Petra Kistner, Fiona Curl</li>\n<li>Climate change disputes - Greenwashing, tort, rights-based claims, directory liability, shareholder activism, governmental planning, separation of powers. <strong>Presenters</strong> Kirsten Odynski, William De Catelle, Janina Moutia-Bloom</li>\n<li>Financing ESG - Taxonomies, structures, ESG investment criteria, carbon credits, green and social bonds, sustainability linked loans, responsible investment funds. <strong>Presenters</strong> Xuan Jin, William Grazebrook</li>\n<li>Future of ESG - Continued increase in disclosure rules and mandatory reporting, data issues, shareholder activism, litigation, upskilling the next generation of ESG lawyers and business professionals. <strong>Presenters</strong> Chris McGarry, Clarissa Marazzi</li>\n</ol></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Seminars</strong>",
            "topic_description": "Seminars The programme of seminars for the course is set out in the course learning guide. This is available from the course Blackboard site. Seminar topics are: Evolution of ESG - Drivers, macro forces, key concepts, major players, business imperative. Presenters Tim Power, Kirsten Sugden, Mikaylie Page Environmental fundamentals - Resource and energy use, waste management, nature based solutions, IPCC findings mitigation and adaptation strategies, circularity. Presenters Seth Kerschner, Taylor Gillespie Social fundamentals - Guiding principles, evolving definitions, ethical trade and labor rights across the supply chain, conflict zones, grievance mechanisms, debunking the myth S is hard to measure. Presenters Clare Connellan, Emiko Singh Governance fundamentals - Shareholder to stakeholder primacy, ESG legal frameworks (CSDDD, CSRD, SEC climate disclosure rules), internal structure, policies and processes, reporting, net zero commitments, SBTs, D&I. Presenters Taylor Pullins, Jessica Lynd Energy transition - Decarbonisation, renewables, battery storage, carbon capture, utilization and storage, hydrogen, green LNG, disputes. Presenters Michael Watson, Michael Polkinghorne, Petra Kistner, Fiona Curl Climate change disputes - Greenwashing, tort, rights-based claims, directory liability, shareholder activism, governmental planning, separation of powers. Presenters Kirsten Odynski, William De Catelle, Janina Moutia-Bloom Financing ESG - Taxonomies, structures, ESG investment criteria, carbon credits, green and social bonds, sustainability linked loans, responsible investment funds. Presenters Xuan Jin, William Grazebrook Future of ESG - Continued increase in disclosure rules and mandatory reporting, data issues, shareholder activism, litigation, upskilling the next generation of ESG lawyers and business professionals. Presenters Chris McGarry, Clarissa Marazzi",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}