{
    "course_title": "Surgery",
    "study_period": "Sem 2 2024",
    "location": "Herston",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MEDI7311-60902-7460",
    "full_course_code": "MEDI7311-60902-7460",
    "course_code": "MEDI7311",
    "class_code": "60902",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (17/06/2024 - 16/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate understanding of pathophysiological processes and the natural history of treated and untreated surgical diseases."
        },
        {
            "number": "LO2.",
            "description": "Incorporate knowledge of normal anatomy, physiology, pathology, pharmacology, biochemistry and other basic sciences into the management of clinical surgical problems."
        },
        {
            "number": "LO3.",
            "description": "Recognise common urgent and non-urgent surgical conditions, systematically evaluate these conditions, assess priorities for treatment, and initiate appropriate investigation, treatment and /or referral."
        },
        {
            "number": "LO4.",
            "description": "Understand the indications for and interpretation of basic laboratory, radiological and other investigations in the surgical patient."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate manual skills necessary to initiate emergency treatment."
        },
        {
            "number": "LO6.",
            "description": "Undertake pre- and post-operative care at the level of skill appropriate to someone commencing work as an intern."
        },
        {
            "number": "LO7.",
            "description": "Demonstrate familiarity with the workings of surgical units and demonstrate an understanding of aspects of surgical care that are germane to all surgical units."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Clinical Case Presentations (CCP 1 and CCP 2)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": null,
            "due_date": "<dd><p>HP CCP 1: Week 4 Mon - Week 5 Fri</p>\n<p>HP CCP 2: Week 8 Mon - Week 8 Fri</p>\n<p>HP+ RSM CCP 1: Week 4 Mon - Week 5 Fri</p>\n<p>HP+ RSM CCP 2: Week 10 Mon - Week 11 Fri</p>\n<p>HP+ SMR CCP 1: Week 4 Mon - Week 5 Fri</p>\n<p>HP+ SMR CCP 2: Week 16 Mon - Week 17 Fri</p>\n<p>HP+ MRS CCP 1: Week 10 Mon - Week 11 Fri</p>\n<p>HP+ MRS CCP 2: Week 16 Mon - Week 17 Fri</p>\n<p>\n</p><p>Two (2) to be completed and submitted as noted in the assessment due dates.</p>\n<p><strong><em>For HP students, please note that your due dates are referenced against the 9-week Block.</em></strong></p>\n<p><strong><em>For HP+ students, please note that your due dates are referenced against the 18-week Semester (3x 6 week blocks).</em></strong></p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Activity/ Performance",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Clinical Case Presentation (CCP) is a clinical assessment in which you demonstrate your skills in assessing a patient's problem/s, with specific emphasis on the relevant clinical and investigative findings, the diagnosis and the current and potential future management plans. Furthermore, you are expected to read around the surgically relevant or related aspects of the case and be expected to discuss these with the examiner during the presentation.</p>\n<p>The CCP is designed to further develop your skills in clinical reasoning (i.e. thinking about patient problems in a critical and deductive manner) in a clinical format with a surgeon and amongst colleagues. The time limited format is designed to reflect real world clinical practice where patients need to be assessed, their case briefly written up, appropriately read around and discussed in a succinct and efficient manner.</p>\n<p>The CCP format is as follows:</p>\n<ol>\n<li>You are directed to assess a patient by the surgeon assessing your CCP.</li>\n<li>You will have a minimum of 2 hours and a maximum of 4 hours to assess the patient (take a history, examine the patient and review any relevant investigations, progress notes or correspondence) and prepare your notes for presentation as specified on the CCP template document. During this time you are expected to do appropriate reading for related aspects of the case which are surgically relevant.</li>\n<li>You must not discuss the case in any way (i.e. clinical findings, investigation results or management) with other students or medical, nursing or allied health staff.</li>\n<li>You will present and discuss the case with the assessing surgeon (and peers, where applicable). The surgeon will be free to ask any form of questions relevant to the case, including leading the discussion on the interesting/related aspect and provide appropriate feedback to your answers. The total time for the presentation and questions will be 20-25 minutes and will be at the discretion of the examining surgeon.</li>\n</ol>\n<p>It is recommended that, wherever able, a different surgeon assessor be used for the two CCPs.</p>\n<p>The Associate Dean (Academic), Faculty of Medicine has waived the requirement for the CCP to be recorded. The CCP marking sheet (available on the course Learn.UQ (Blackboard) site) will be used to document student performance through the provision of comments and use of a criterion referenced rating scale.</p>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p>The passing standard for this assessment task is 60% based on the combined score from the CCP 1 and CCP 2. The CCP is marked as a percentage out of 100%. CCP 2 is weighted twice as much as CCP 1. </p>\n<p>There are six (6) components (criteria) to the CCP assessment, with varying levels of value:</p>\n<ol>\n<li>History 10%</li>\n<li>Examination 10%</li>\n<li>Investigations 10%</li>\n<li>Working diagnosis 10%</li>\n<li>Management 20%</li>\n<li>General Questions 40%</li>\n</ol>\n<p>Your performance on each criterion is marked as one of:</p>\n<ul>\n<li>Well Below Expectations (receives 40% of the total available mark for that criterion)</li>\n<li>Below Expectations (receives 50% of the total available mark for that criterion)</li>\n<li>Meets Expectations (receives 60% of the total available mark for that criterion)</li>\n<li>Above Expectations (receives 80% of the total available mark for that criterion)</li>\n<li>Well Above Expectations (receives 100% of the total available mark for that criterion)</li>\n</ul>\n<p>The overall score for this assessment task is the sum of all the scores awarded in each component (percentage for relevant standard x total marks available for relevant criterion). Your performance on each criterion is marked by the assessor on a rubric scale from well below expectations to well above expectations. </p>\n<p>You need to achieve the overall passing standard across the combined CCP scores in order to pass this course. This combined score is used to determine if the student has passed this assessment task as per the course grading guidelines.</p>\n<p>If you fail to achieve a passing score of 60% in either CCP 1 or CCP 2, you can resit the CCP assessment item a maximum of two (2) times; with a maximum of three (3) attempts each for CCP 1 and CCP 2.</p>\n<ul>\n<li>Provided a passing standard is achieved in a CCP resit, then the maximum score awarded is 60% for that assessment item.</li>\n<li>If the passing standard has not been met in a CCP resit; in either or both CCPs; then the CCP score awarded is the maximum score of any of the 3 attempts.</li>\n<li>In consultation with clinical unit staff, you are responsible for ensuring the expeditious arrangement of any CCP assessment resit. </li>\n<li>The CCP resit must be completed prior to the end of the Surgery / Rural-Surgery Block you are enrolled in.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The CCP must be submitted electronically to the UQ electronic WBA platform and must be presented at the time directed by the assessing surgeon.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>All submission dates for Assessment are Brisbane time - Australian Eastern Standard time (AEST).</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Clinical Participation Assessment - Surgery",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": null,
            "due_date": "<dd><p>HP CPA 1: Week 4, Fri 5:00 pm</p>\n<p>HP CPA 2: Week 9, Fri 5:00 pm</p>\n<p>HP+ RSM CPA 1: Week 6, Fri 5:00 pm</p>\n<p>HP+ RSM CPA 2: Week 12, Fri 5:00 pm</p>\n<p>HP+ SMR CPA 1: Week 6, Fri 5:00 pm</p>\n<p>HP+ SMR CPA 2: Week 18, Fri 5:00 pm</p>\n<p>HP+ MRS CPA 1: Week 12, Fri 5:00 pm</p>\n<p>HP+ MRS CPA 2: Week 18, Fri 5:00 pm</p>\n<p>\n</p><p>Two (2) CPAs to be completed and submitted.</p>\n<p><strong><em>For HP students, please note that your due dates are referenced against the 9-week Block.</em></strong></p>\n<p><strong><em>For HP+ students, please note that your due dates are referenced against the 18-week Semester (3x 6 week blocks).</em></strong></p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07",
            "mode": "Activity/ Performance",
            "category": "Participation/ Student contribution, Placement",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Participation and engagement in clinical placements are fundamental aspects of the MD Program, consistent with the framework of self-directed and life-long learning and indicative of the need for clinical competence and professional conduct in addition to theoretical knowledge. </p>\n<p>In all courses during Years 3 and 4 of the MD program, you are assessed on your professional conduct and clinical skills and the extent to which you have contributed and engaged in your clinical placement and clinical learning activities. The nature of these activities will vary according to the placement, but may include admitting/clerking patients, assessing patients at outpatient clinics, presenting at ward rounds and demonstrating initiative in attending other activities such as grand rounds. </p>\n<p>Scoring in the Clinical Participation Assessment (CPA) is based on conduct and contribution during ward rounds and case discussions, initiative in seeking learning opportunities, behaviour towards peers and medical (and all other) colleagues, patient assessment, ability to succinctly present a patient case including differential diagnosis, and awareness of social and ethical issues including risk assessment. </p>\n<p>The CPA components are: </p>\n<ul>\n<li>Clinical Communication </li>\n<li>History Taking </li>\n<li>Examination Skills </li>\n<li>Clinical Reasoning </li>\n<li>Engagement in Practice </li>\n<li>Professional Practice </li>\n<li>Reflective Practice </li>\n<li>Social/Cultural Competence and Safety </li>\n</ul>\n<p>There is also a Student Flag component which allows a supervisor to report a student with concerning unprofessional or unsafe behaviour. The Student Flag component also provides a mechanism for notifying exemplary performance to the School. </p>\n<p>To maximise your learning, you are encouraged to actively seek feedback from your clinical teacher/s during your clinical placement. This will assist in identifying any areas requiring further improvement before your final Clinical Participation Assessment is completed. Active engagement in the clinical setting is a requirement to pass this assessment task. </p>\n<p>The CPA rubric can be found in the Learn.UQ (Blackboard) Course Site for guidance so that you are familiar with marking criteria for each component. </p>\n<p><strong>Criteria &amp; Marking:</strong> </p>\n<p>The CPA is a global assessment of professional and clinical practice and contributes to your overall performance in the following ways: </p>\n<ol>\n<li>If you are enrolled concurrently in the WLP course, four components contribute to this MEDI7311 course (Clinical Communication, History Taking, Examination Skills, Clinical Reasoning) and the remaining components (Engagement in Practice, Professional Practice, Reflective Practice, Social/Cultural Competence and Safety and Student Flag) contribute to the WLP course. </li>\n<li>If you are not enrolled concurrently in the WLP course all components contribute to this MEDI7311 course. </li>\n</ol>\n<p>Additional information may be received by staff from clinical placement site/s where you completed this course. This will be reviewed by the Course Coordinator and ratings completed by your supervisor in the CPA may be revised. For example, if your supervisor rated you as satisfactory related to professional conduct but the Medical School has other information available, the supervisor’s ratings may be moderated based on this additional information. </p>\n<p>Your performance will also be reviewed at the End of Semester Examiner’s meeting and following discussion you may receive a non-graded fail for the course, if: </p>\n<ul>\n<li>There are any unsatisfactory results recorded in any of the CPA components contributing to this course (including moderations made by the Course Coordinator) </li>\n<li>There are four or more borderline results recorded in any of the CPA components contributing to this course (including moderations made by the Course Coordinator) </li>\n<li>The required number of CPAs have not been submitted to your supervisor for completion by the due date. </li>\n</ul>\n<p>Factors that will be taken into account during the review undertaken at the End of Semester Examiner’s meeting include: </p>\n<ul>\n<li>Evidence of temporal improvement in performance across the course (if applicable) </li>\n<li>Completion and content of the WLP Task Review in response to unsatisfactory or borderline ratings </li>\n<li>Relative opportunity available across the semester </li>\n<li>Other factors relevant to your performance </li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>A function of the CPA discussion and form completion is to consider information from the whole placement.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>If you fail to meet the submission deadline for any CPA without an approved extension, it will not be accepted and may result in course failure regardless of whether the supervisor has rated your participation at a satisfactory or proficient level in the related course components. </p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Short Answer (SAQ) and Multiple Choice (MCQ) exams",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": null,
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>2/11/2024 - 16/11/2024</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The <strong>Short Answer Question </strong>paper for this course consists of questions selected from 12 subject areas, weighted equally, from the list below (marked out of 144). The three subject areas not covered in the SAQ exam will be assessed within the MCQ exam. </p>\n<ol>\n<li>Perioperative</li>\n<li>Surgical skill</li>\n<li>Hernia </li>\n<li>Breast</li>\n<li>Endocrine (Thyroid / parathyroid / spleen / adrenal)</li>\n<li>ENT</li>\n<li>Upper GI</li>\n<li>HPB</li>\n<li>Colorectal</li>\n<li>Urology</li>\n<li>Vascular</li>\n<li>Neurosurgery</li>\n<li>Cardiothoracic surgery</li>\n<li>Skin Cancer / Burns / Plastics</li>\n<li>Trauma</li>\n</ol>\n<p>The <strong>Multiple Choice Question </strong>paper for this course consists of 36 questions, worth two marks each. Subject areas for the 36 questions will be selected from the list below. There will be two questions from each of the 12 Subject areas covered in the SAQ and four questions from the three subject areas not covered in the SAQ exam (i.e. 2x12 + 4x3 = 36 questions). </p>\n<ol>\n<li>Perioperative</li>\n<li>Surgical skill</li>\n<li>Hernia </li>\n<li>Breast</li>\n<li>Endocrine (Thyroid / parathyroid / spleen / adrenal)</li>\n<li>ENT</li>\n<li>Upper GI</li>\n<li>HPB</li>\n<li>Colorectal</li>\n<li>Urology</li>\n<li>Vascular</li>\n<li>Neurosurgery</li>\n<li>Cardiothoracic surgery</li>\n<li>Skin Cancer / Burns / Plastics</li>\n<li>Trauma</li>\n</ol>\n<p><strong>Criteria &amp; Marking:</strong></p>\n<p>These tasks assess common and important conditions (diagnosis and management) that you should have encountered during clinical placement, the tutorial program and the core lectures, housed on the MEDI7311 Surgery Learn.UQ (Blackboard) site.</p>\n<p>The End of Semester Exam consists of the Short Answer Question (SAQ) and the Multiple Choice Question (MCQ) papers combined. Calculation of combined MCQ-SAQ written examination score:</p>\n<ul>\n<li>MCQ 72 marks (36 questions, 2 marks per question)</li>\n<li>SAQ 144 marks (12 questions, 12 marks per question)</li>\n</ul>\n<p>Formula for calculation of written examination score: (MCQ+SAQ)/216*100% = ___%</p>\n<p>The End of Semester Exam pass mark will be calculated on the combined SAQ and MCQ weighted scores. The pass mark for this assessment is 60%. The pass mark may be modified in accordance with standard setting methods. Pass marks for examinations will be available, after the results for that examination have been released.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Surgery clinical placement</strong><br><p>Nine week period within dates shown. General surgery (breast / endocrine, upper gastrointestinal, hepato-pancreatobiliary, colorectal, trauma and acute surgery) and some subspecialties including burns and plastics, urology, vascular, neurosurgery, cardiothoracic surgery and ear/nose/throat surgery.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Surgery clinical placement</strong>",
            "topic_description": "Surgery clinical placement Nine week period within dates shown. General surgery (breast / endocrine, upper gastrointestinal, hepato-pancreatobiliary, colorectal, trauma and acute surgery) and some subspecialties including burns and plastics, urology, vascular, neurosurgery, cardiothoracic surgery and ear/nose/throat surgery.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Integrated Hospital Practice tutorials</strong><br/><p>A series of tutorials will be provided which demonstrate integration of medical and surgical issues around common health problems seen in an acute hospital setting.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06, L07</p></div></td>",
            "topic_title": "<strong>Integrated Hospital Practice tutorials</strong>",
            "topic_description": "Integrated Hospital Practice tutorials A series of tutorials will be provided which demonstrate integration of medical and surgical issues around common health problems seen in an acute hospital setting.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06",
                "L07"
            ]
        }
    ]
}