{
    "course_title": "Effective Stakeholder Engagement",
    "study_period": "Sem 2 2024",
    "location": "External",
    "attendance": "Online",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MGTS7976-64594-7460",
    "full_course_code": "MGTS7976-64594-7460",
    "course_code": "MGTS7976",
    "class_code": "64594",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Appreciate and assess the needs and interests of stakeholders"
        },
        {
            "number": "LO2.",
            "description": "Underpin engagement processes with a detailed understanding and appreciation of engagement principles and values"
        },
        {
            "number": "LO3.",
            "description": "Plan and conduct appropriate multi stakeholder engagement processes"
        },
        {
            "number": "LO4.",
            "description": "Manage specific issues in engagement such as conflict, engagement with specific stakeholder groups and advocacy"
        },
        {
            "number": "LO5.",
            "description": "Evaluate and continuously improve engagement processes"
        },
        {
            "number": "LO6.",
            "description": "Examine power, values and trust issues within engagement"
        },
        {
            "number": "LO7.",
            "description": "Examine the key communication issues impacting on engagement and develop appropriate strategies for appropriate communication"
        },
        {
            "number": "LO8.",
            "description": "Engage ethically with others"
        },
        {
            "number": "LO9.",
            "description": "Understand the complexity of stakeholder relationships and integrate multiple viewpoints"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Learning Project Plan",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p> 23/08/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L09",
            "mode": "Written",
            "category": "Product/ Design",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<h4>Objective:</h4>\n<p>The goal of this assignment is to enable you to practically apply concepts, methods, and approaches of stakeholder engagement in a real-world context. This involves creating a detailed plan for your learning project that outlines what you intend to focus on, how you will conduct it, your learning goals, and the logistics of your activities. This plan will help you select an engagement topic and specify the engagement problem you want to address with your learning project.</p>\n<p>Your plan should be a maximum of 1500 words and should follow the guidelines provided below.</p>\n<h4>Plan Format:</h4>\n<p><strong>Title:</strong></p>\n<p>The title should indicate that the document is a plan for the proposed learning project.</p>\n<p><strong>Author:</strong></p>\n<p>Student name and number</p>\n<p><strong>Introduction:</strong></p>\n<p>A detailed description of the situation and/or background to the issue you are addressing.</p>\n<p>Clearly define the engagement problem you want to address with your learning project. Explain why this problem is important and relevant to the stakeholders involved.</p>\n<p><strong>Objectives:</strong></p>\n<p>The specific engagement objectives of your project (i.e., what you aim to achieve with your learning project, not the objectives of a project you might be part of).</p>\n<p><strong>Methodology:</strong></p>\n<p>A description of how you intend to conduct your learning project to meet your objectives. This should include:</p>\n<ul>\n<li>Methods of stakeholder engagement (e.g., review documents, personal interviews, observation of group activities).</li>\n<li>A schedule of activities.</li>\n</ul>\n<p><strong>Managing Challenges:</strong></p>\n<p>A brief description of any potential difficulties or risks involved and how you plan to manage these. For example, how you might select people to talk with, or issues involved in observing a community activity.</p>\n<p><strong>References:</strong></p>\n<p>References are essential if you use material from other sources. Please avoid using websites if possible. Use APA for referencing.</p>\n<p><strong>Length:</strong></p>\n<p>A maximum of 4 pages (1500 words, not including references), single spaced, including diagrams, maps, and references.</p>\n<h4>Topic Selection:</h4>\n<p>Choose a comprehensive case that involves direct interaction with stakeholders and meets the following criteria:</p>\n<p><strong>Real-world Interaction:</strong></p>\n<ul>\n<li>The topic should involve direct interaction with stakeholders through methods such as interviews, focus groups, workshops, or participation in stakeholder meetings.</li>\n</ul>\n<p><strong>Active Participation:</strong></p>\n<ul>\n<li>Ensure that you can actively participate in the stakeholder engagement process. Avoid topics that are purely observational or based solely on secondary data.</li>\n</ul>\n<p><strong>Contextual Relevance:</strong></p>\n<ul>\n<li>Select a topic relevant to current issues in stakeholder engagement within your field of interest. This ensures that your learning is applicable and valuable.</li>\n</ul>\n<p><strong>Feasibility:</strong></p>\n<ul>\n<li>Consider the feasibility of the project in terms of time, resources, and accessibility. Ensure you can realistically complete the project within the given timeframe and with the resources available to you.</li>\n</ul>\n<h3>Examples of Suitable Projects:</h3>\n<p><strong>Review a Practical Engagement Process:</strong></p>\n<ul>\n<li>This could be an engagement process in your workplace or any other practical context you are familiar with.</li>\n</ul>\n<p><strong>Review an Engagement Process You Have Been Involved In:</strong></p>\n<ul>\n<li>Analyze an engagement process you have personally participated in, reflecting on your experience and the overall effectiveness of the engagement.</li>\n</ul>\n<p><strong>Apply an Engagement Approach and Review Its Application:</strong></p>\n<ul>\n<li>Choose an engagement approach, implement it in a real-world context, and review its application and outcomes.</li>\n</ul>\n<p><strong>Observe and Analyze an Engagement Process:</strong></p>\n<ul>\n<li>Observe an existing engagement process and conduct a thorough analysis of its components, stakeholders, and effectiveness.</li>\n</ul>\n<h4>Examples from Earlier Years:</h4>\n<ul>\n<li><strong>Community Engagement in Environmental Projects: </strong>Work with a local environmental group to engage the community in a conservation or sustainability project. Participate in planning meetings, conduct surveys, and facilitate community workshops.</li>\n<li><strong>Corporate Social Responsibility (CSR) Initiatives:</strong>Partner with a company to support their CSR efforts. Engage with employees, customers, and community members to understand their perspectives and contribute to CSR activities.</li>\n<li><strong>Extension Programs: </strong>Join an extensionist or non-profit organization in developing and implementing extension programs. Engage with growers, graziers, and other stakeholders to gather feedback and improve program effectiveness.</li>\n<li><strong>Urban Planning and Development:</strong>Work with a local government or urban planning agency to engage residents in planning and development projects. Participate in or conduct public meetings, gather input through surveys, and facilitate stakeholder workshops.</li>\n</ul>\n<p><br/></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. </p>\n<p><br/></p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. </p>\n<p><br/></p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. </p>\n<h4><br/></h4>\n<h4>Submission and Feedback</h4>\n<ul>\n<li><strong>Submission</strong>: Submit your report through the designated platform by the due date.</li>\n<li><strong>Marking criteria: </strong>see rubric on Blackboard</li>\n<li><strong>Feedback</strong>: Grades and feedback will be available in the Grade Centre on Blackboard. You can request additional feedback by contacting the course coordinator.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Blackboard site:  Submit your plan via Turnitin on the course Blackboard site.  Instructions will be provided as the course progresses.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Literature Review with Expert Interview (group work)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>35%</dd>",
            "due_date": "<dd><p> 20/09/2024 2:00 pm</p></dd>",
            "learning_objectives": "L04, L06, L07, L08",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<h4>Group Formation and Topic Assignment</h4>\n<ol>\n<li><strong>Group Formation:</strong></li>\n</ol>\n<ul>\n<li>The instructor will form groups of 5-8 students.</li>\n<li>Each group will be assigned a specific topic related to stakeholder engagement by the instructor.</li>\n</ul>\n<h4>Part 1: Literature Review</h4>\n<ol>\n<li><strong>Literature Review:</strong></li>\n</ol>\n<ul>\n<li>Each group must conduct a comprehensive literature review on their assigned topic.</li>\n<li>The review should cover at least 15 academic sources, including peer-reviewed articles, books, and reputable journals.</li>\n<li>The literature review should include:</li>\n<li>A summary of key findings, theories, and debates within the literature.</li>\n<li>Critical analysis of gaps or areas where the literature diverges or lacks consensus.</li>\n</ul>\n<h4>Part 2: Expert Interview</h4>\n<ol>\n<li><strong>Identifying an Expert:</strong></li>\n</ol>\n<ul>\n<li>Each group must identify and contact an expert in the field of stakeholder engagement related to their topic.</li>\n<li>The expert can be an academic, industry professional, or a practitioner with significant experience.</li>\n</ul>\n<ol>\n<li><strong>Preparing for the Interview:</strong></li>\n</ol>\n<ul>\n<li>Develop a list of 10-15 questions that address gaps, controversies, and practical applications of the literature.</li>\n<li>Questions should be open-ended and designed to elicit detailed responses.</li>\n</ul>\n<ol>\n<li><strong>Conducting the Interview:</strong></li>\n</ol>\n<ul>\n<li>Conduct the interview, taking detailed notes or recording (with the expert’s permission).</li>\n<li>Summarize the expert’s responses, focusing on how their insights relate to the literature reviewed.</li>\n</ul>\n<h4>Part 3: Synthesis and Presentation</h4>\n<ol>\n<li><strong>Synthesis Paper:</strong></li>\n</ol>\n<ul>\n<li>Write a 3500 word paper that synthesizes the literature review and the expert’s insights.</li>\n<li>The paper should include:</li>\n<li>An introduction to the topic and its significance.</li>\n<li>A literature review section that critically analyses key findings and identifies gaps and/or debates.</li>\n<li>An expert interview section: 1) including a short, to the point justification for the expert interviewed; 2) elaborate summary of the key insights from the interview.</li>\n<li>A synthesis section discussing how the interview informs or challenges the literature.</li>\n<li>Practical implications and recommendations based on the combined insights from the literature and the expert.</li>\n<li>Appendix with the interview questions</li>\n</ul>\n<h3>Tips for Success</h3>\n<ul>\n<li><strong>Collaboration:</strong> Ensure all group members contribute actively to both the literature review and the expert interview.</li>\n<li><strong>Time Management:</strong> Start early to allow sufficient time for reviewing literature, contacting experts, and preparing the synthesis paper and presentation.</li>\n<li><strong>Critical Thinking:</strong> Go beyond summarizing sources; analyze and critically evaluate the literature and the expert’s insights.</li>\n<li><strong>Referencing: </strong>Please use APA style for referencing.</li>\n</ul>\n<p><br/></p>\n<p>This task has been designed to be challenging, authentic and complex.  Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. </p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. </p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. </p>\n<p><br/></p>\n<h4>Submission and Feedback</h4>\n<ul>\n<li><strong>Submission</strong>: Submit your report through the designated platform by the due date.</li>\n<li><strong>Marking criteria: </strong>see rubric on Blackboard</li>\n<li><strong>Feedback</strong>: Grades and feedback will be available in the Grade Centre on Blackboard. You can request additional feedback by contacting the course coordinator.</li>\n</ul>\n<p><br/></p>\n<h3>Important Note on Group Work Commitment</h3>\n<p>Group work is a crucial component of this course and requires active participation and collaboration from all members, regardless of whether you are an internal or external student. Successful completion of group assignments not only enhances your learning experience but is essential for achieving course objectives.</p>\n<p><strong>Experiential Learning in Stakeholder Engagement:</strong> It is no coincidence that group work is a part of this course on effective stakeholder engagement. Working in groups provides a practical, hands-on opportunity to develop and refine your stakeholder engagement skills and competencies. Through group activities, you will experience firsthand the dynamics of managing diverse opinions and interests, mirroring real-world stakeholder engagement scenarios. This experiential learning is fundamental in helping you understand and apply the principles of effective communication, negotiation, and collaboration.</p>\n<p><strong>Availability and Scheduling:</strong> All students must make a concerted effort to be available for group meetings and work sessions. While we understand that external students and those with other commitments may have scheduling challenges, it is vital that you prioritize and make accommodations to ensure you can contribute effectively to your group.</p>\n<p><strong>Responsibility and Communication:</strong> Being part of a group requires commitment. This means regularly communicating your availability, staying engaged with group activities, and being responsive to your teammates. If conflicts arise, it is your responsibility to inform your group members well in advance and work together to find a suitable solution.</p>\n<p><strong>Planning and Flexibility:</strong> We encourage all groups to plan their activities early and consider using a variety of communication tools (such as email, online chat, video calls) to facilitate collaboration. This flexibility is key to accommodating different schedules and ensuring that all members can participate fully.</p>\n<p><strong>Consideration and Fairness:</strong> Please be considerate of your peers' time and contributions. Active and equitable participation in group work is crucial for the fair assessment of all students involved. Inability to participate actively without valid reasons may impact your assessment outcomes for the project.</p>\n<p>Your proactive involvement and dedication to group work are crucial for the smooth execution and success of group projects. Thank you for your cooperation and commitment to making your group experiences productive and rewarding.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit your essay via Turnitin on the course elearning Blackboard site by the due date. Always keep a record of your submission.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Presentation of project",
            "special_indicators": [],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p> 14/10/2024</p></dd>",
            "learning_objectives": "L01, L03, L05, L06, L09",
            "mode": "Activity/ Performance",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Overview:</strong> At the end of the semester, you will deliver a presentation to the class, showcasing the knowledge and insights you have gained from your learning project. This presentation will account for 10% of your overall grade for the course.</p>\n<p><strong>Presentation Guidelines:</strong></p>\n<p><strong>•\tDuration</strong>: The presentation should be exactly 15 minutes long. This includes time for 1-2 questions from the audience. Therefore, plan for a 12-minute presentation followed by a 3-minute Q&amp;A session.</p>\n<p><strong>•\tFormat</strong>: You may use board displays, PowerPoint slides, or any other visual aids to enhance your presentation.</p>\n<p><strong>•\tPrintout</strong>: A digital copy of your presentation must be submitted on the day of your presentation. This will not be formally assessed but is required.</p>\n<p>•\t<strong>Delivery</strong>: Engage the audience by speaking directly to them. Do not read from a fully written-out text. You may use notes to guide your presentation, but reliance on extensive reading will be penalized.</p>\n<p><strong>Feedback and Results:</strong></p>\n<p>•\t<strong>Publication: </strong>Results will be published in Grade Centre.</p>\n<p><strong>•\tFeedback</strong>: Availability of marks and feedback will be announced on Blackboard. For additional feedback, you may contact the course coordinator.</p>\n<p><strong>Important Note: </strong>Practice your presentation to ensure you stay within the allotted time and are prepared to handle questions confidently.</p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. </p>\n<p><br/></p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. </p>\n<p><br/></p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. Submission and Feedback</p>\n<p><br/></p>\n<ul>\n<li><strong>Submission</strong>: Submit your report through the designated platform by the due date.</li>\n<li><strong>Marking criteria: </strong>see rubric on Blackboard</li>\n<li><strong>Feedback</strong>: Grades and feedback will be available in the Grade Centre on Blackboard. You can request additional feedback by contacting the course coordinator.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>This assessment is completed in class.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Learning Project Report",
            "special_indicators": [],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 25/10/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L03, L05, L06, L09",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<h4>Overview</h4>\n<p>For this major assessment, you are required to develop a comprehensive stakeholder engagement plan, including an evaluation strategy. This will build upon the project plan outlined in Assignment 1.</p>\n<h4>Objectives</h4>\n<ul>\n<li>Develop and articulate a stakeholder engagement strategy for a given scenario.</li>\n<li>Critically apply theoretical concepts from the course to analyze stakeholder dynamics and propose engagement strategies.</li>\n<li>Reflect critically on the engagement process and outcomes to provide insights and recommendations for future initiatives.</li>\n</ul>\n<h4>Requirements</h4>\n<ul>\n<li><strong>Word Count</strong>: The report should be 4,000 words in length, excluding references.</li>\n<li><strong>Format</strong>: You must pass this learning project report to pass the course. The report should be written clearly and concisely in the first person, reflecting your personal insights and critical analysis.</li>\n<li><strong>Referencing:</strong> please use the APA referencing style</li>\n<li><strong>Feedback Incorporation</strong>: Integrate feedback from Assignment 1 where relevant to enhance the depth and quality of your analysis.</li>\n</ul>\n<h4><br/></h4>\n<h3>Preparation Guidelines for Designing a Stakeholder Engagement Plan</h3>\n<p>Before you begin designing your stakeholder engagement plan, consider the following key aspects that will influence your approach and effectiveness. Reflect on each point and how it applies to your case study.</p>\n<p><strong>Purpose/Goal of Stakeholder Engagement:</strong></p>\n<ul>\n<li>Define what you aim to achieve through engaging stakeholders. Is the goal to inform, consult, involve, collaborate, or empower? Your objectives will shape the entire engagement strategy.</li>\n</ul>\n<p><strong>Scale:</strong></p>\n<ul>\n<li>Consider the scale of the engagement process. Is this a local, regional, national, or international project? The scale will impact the number and diversity of stakeholders involved, as well as the methods of engagement.</li>\n</ul>\n<p><strong>Who Should be Involved?</strong></p>\n<ul>\n<li>Identify key stakeholders who should be part of the engagement process. Consider including a broad range of participants such as local communities, government agencies, NGOs, industry experts, and funders. Think about why each stakeholder is important for the project's success.</li>\n</ul>\n<p><strong>At What Stage in a Project Should Stakeholders be Engaged?</strong></p>\n<ul>\n<li>Determine the optimal timing for stakeholder involvement. Early engagement can help in shaping project directions and objectives, while later involvement might focus more on implementation and evaluation.</li>\n</ul>\n<p><strong>Institutional and Community Capacity:</strong></p>\n<ul>\n<li>Assess the capacity of both institutional and community stakeholders to engage effectively. Consider resources, knowledge, skills, and the ability to participate. How might capacity gaps affect engagement, and how can these gaps be addressed?</li>\n</ul>\n<p><strong>Degree of Power to be Shared:</strong></p>\n<ul>\n<li>Decide how much decision-making power will be shared with stakeholders. Will stakeholders have a consultative role, or will they be involved in making decisions? This decision will influence stakeholders’ expectations and the project’s governance structure.</li>\n</ul>\n<h4><br/></h4>\n<h4>Report Structure</h4>\n<p><strong>Context</strong></p>\n<ul>\n<li>Provide an analysis of the background and context of your learning project, emphasizing why it is significant in your work or study environment.</li>\n<li>Identify the engagement problem and specify how you are going to address this</li>\n</ul>\n<p><strong>Objectives</strong></p>\n<ul>\n<li>Clearly state your objectives for your learning project.</li>\n</ul>\n<p><strong>Theory Used</strong></p>\n<ul>\n<li>Outline 3-5 key concepts and theoretical approaches from the course material and additional readings that have informed your engagement strategy.</li>\n</ul>\n<p><strong>Method</strong></p>\n<ul>\n<li>Describe the methods used to collect your data.</li>\n</ul>\n<p><strong>Results</strong></p>\n<p>Report the development and execution of your stakeholder engagement plan in detail through the following eight steps:</p>\n<p><strong>Formulate Engagement Goals</strong>:</p>\n<ul>\n<li>Detail the specific objectives you aim to achieve through your stakeholder engagement. These should align with both your overall project goals and the needs of the stakeholders.</li>\n</ul>\n<p><strong>Stakeholder Analysis</strong>:</p>\n<ul>\n<li>Identify key stakeholders and analyze their interests, influence, and potential impact on the project. Explain how these insights shaped your engagement strategy.</li>\n</ul>\n<p><strong>Negotiables and Non-negotiables</strong>:</p>\n<ul>\n<li>Clearly delineate what aspects of the project or process are negotiable and what must remain fixed. Discuss how this clarity helped in managing stakeholder expectations.</li>\n</ul>\n<p><strong>Risk Analysis</strong>:</p>\n<ul>\n<li>Assess potential risks associated with stakeholder interactions and their impact on the project. Describe the strategies employed to mitigate these risks.</li>\n</ul>\n<p><strong>Levels of Engagement</strong>:</p>\n<ul>\n<li>Determine and justify the levels of engagement appropriate for different stakeholders based on their interest and influence. Provide examples of how differing engagement levels were implemented.</li>\n</ul>\n<p><strong>Schedule of Engagement Activities</strong>:</p>\n<ul>\n<li>Develop and present a detailed schedule of engagement activities tailored for each stakeholder group. Include timelines, modes of engagement, and responsible parties.</li>\n</ul>\n<p><strong>Feedback to Stakeholders</strong>:</p>\n<ul>\n<li>Outline the mechanisms put in place for providing feedback to stakeholders throughout the project. Describe how this feedback has been used to adjust the engagement strategy and improve stakeholder relations.</li>\n<li>Each of these steps should be described with enough detail to demonstrate your understanding and application of the stakeholder engagement process, showcasing your ability to integrate theoretical concepts with practical application.</li>\n</ul>\n<p><strong>Evaluation framework</strong></p>\n<ul>\n<li>Evaluation Objectives: Define what you intend to achieve with the evaluation. Depending on your objectives, this might include assessing the degree of stakeholder satisfaction, the quality of interactions, the extent of stakeholder influence on decision-making, or the overall impact of engagement on project outcomes.</li>\n<li>Criteria and indicators: Identify specific indicators that will be used to measure the success of the engagement process.</li>\n<li>Data collection methods: Outline the methods for gathering data relevant to your KPIs. This could involve surveys, interviews, focus groups, observation, or document analysis. Consider the appropriateness of each method in relation to your stakeholder groups and the feasibility of data collection.</li>\n</ul>\n<p><strong>Discussion</strong></p>\n<ul>\n<li>Reflect on the engagement process and results. Provide a critical analysis comparing your experiences with the theoretical principles discussed in class. Highlight what you learned and suggest improvements for future engagements.</li>\n</ul>\n<p><strong>References</strong></p>\n<ul>\n<li>Cite all sources using the Harvard Gatton style as detailed on the UQ Library website.</li>\n</ul>\n<p><br/></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. </p>\n<p><br/></p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. </p>\n<p><br/></p>\n<h3>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. </h3>\n<h4>Submission and Feedback</h4>\n<ul>\n<li><strong>Submission</strong>: Submit your report through the designated platform by the due date.</li>\n<li><strong>Marking criteria: </strong>see rubric on Blackboard</li>\n<li><strong>Feedback</strong>: Grades and feedback will be available in the Grade Centre on Blackboard. You can request additional feedback by contacting the course coordinator.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit your learning project report via Turnitin onto the course elearning Blackboard site by the due date. Always keep a record of your submission.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 2(22 Jul - 04 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 1: Engagement principles and approaches</strong><br/></p><p><strong>Learning outcomes:</strong> L02, L08</p></div></td>",
            "topic_title": "<strong>Module 1: Engagement principles and approaches</strong>",
            "topic_description": "Module 1: Engagement principles and approaches",
            "learning_outcomes": [
                "L02",
                "L08"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 3 To Week 4(05 Aug - 18 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 2: Understanding stakeholders</strong><br/></p><p><strong>Learning outcomes:</strong> L01, L09</p></div></td>",
            "topic_title": "<strong>Module 2: Understanding stakeholders</strong>",
            "topic_description": "Module 2: Understanding stakeholders",
            "learning_outcomes": [
                "L01",
                "L09"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 5 To Week 6(19 Aug - 01 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 3: Planning engagement processes</strong><br/></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Module 3: Planning engagement processes</strong>",
            "topic_description": "Module 3: Planning engagement processes",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 7 To Week 9(02 Sep - 22 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 4: Conducting and managing engagement</strong><br/></p><p><strong>Learning outcomes:</strong> L04</p></div></td>",
            "topic_title": "<strong>Module 4: Conducting and managing engagement</strong>",
            "topic_description": "Module 4: Conducting and managing engagement",
            "learning_outcomes": [
                "L04"
            ]
        },
        {
            "learning_period": "Mid Sem break(23 Sep - 29 Sep)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In-Semester break</strong><br><p>Use this time to catch up on reading and completion of assignments.</p></br></p></div></td>",
            "topic_title": "<strong>In-Semester break</strong>",
            "topic_description": "In-Semester break Use this time to catch up on reading and completion of assignments.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 10 To Week 12(30 Sep - 20 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Module 5: Reviewing and sustaining engagement</strong><br/></p><p><strong>Learning outcomes:</strong> L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Module 5: Reviewing and sustaining engagement</strong>",
            "topic_description": "Module 5: Reviewing and sustaining engagement",
            "learning_outcomes": [
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Course conclusion</strong><br/></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Course conclusion</strong>",
            "topic_description": "Course conclusion",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        }
    ]
}