{
    "course_title": "Management Frameworks",
    "study_period": "Sem 2 2024",
    "location": "Brisbane City",
    "attendance": "Weekend",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MGTS7801-60288-7460",
    "full_course_code": "MGTS7801-60288-7460",
    "course_code": "MGTS7801",
    "class_code": "60288",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 31/08/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Recognise personal strengths and weaknesses."
        },
        {
            "number": "LO2.",
            "description": "Design a personal action plan that relates to development in the MBA demonstrating professional and effective writing skills."
        },
        {
            "number": "LO3.",
            "description": "Engage in structured reflection as a way to leverage personal learning."
        },
        {
            "number": "LO4.",
            "description": "Conduct peer coaching conversations."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate appropriate and professional collaboration skills in a team setting towards the presentation of ideas, analysis and conclusions."
        },
        {
            "number": "LO6.",
            "description": "Discuss ethical implications of decision making."
        },
        {
            "number": "LO7.",
            "description": "Analyse personal and organisational situations from multiple perspectives and demonstrate a detailed understanding of social responsibility."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Team presentation (in class)",
            "special_indicators": [],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 24/08/2024 5:00 pm</p>\n<p>\n</p><p>Group presentations will run throughout the day.</p></dd>",
            "learning_objectives": "L03, L07",
            "mode": "Activity/ Performance",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will present in teams on a topic (self-allocated by your team in class) using a four frames analysis. Topics can include any reasonably well known success or more likely, business failures, catastrophies or disasters, which can be reviewed using the four frames. The presentation cannot use traditional business presentation methods such as PowerPoint, but rather must use novel role-play, vignette or other mediums. Both topics and media for presentation will be thoroughly elucidated in class. Presentations will be in-class however remote students will participate either through pre-recoding or livestream methods.</p>\n<p><strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct. </strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Four frames case study analysis",
            "special_indicators": [],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 30/08/2024 2:00 pm</p></dd>",
            "learning_objectives": "L06, L07",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The primary purpose of this assignment is to develop your skills and understanding in applying the four organisational frames, as well as other relevant models and concepts from the <em>Management Frameworks course, </em>to analyse and solve organisational problems. The assignment will also further develop your written communication skills.</p>\n<p>Objectives</p>\n<ul>\n<li>To develop skills in organisational diagnosis and analysis</li>\n<li>To develop a deeper understanding of, and skills in applying, the four organisational frames and related course concepts</li>\n<li>To develop written communication skills</li>\n</ul>\n<p>Your Task:</p>\n<p>Use the four organizational frames and related concepts and literature to identify, analyse and offer a solution to an organisational issue that you have personally experienced . It is recommended that you choose an issue or problem which is complete (even if it was never successfully resolved), and which you see there is scope for learning by reflection. For example, you may have been involved in a change management process (e.g. a restructure, change of strategy, merger, acquisition etc), that did not work well, or you may choose an ongoing problem or issue that has never been successfully addressed (e.g. high turnover). Note: you are free to choose the issue.</p>\n<p>You will need to:</p>\n<ul>\n<li>Clearly describe the issue and the organisational context.</li>\n<li>Critically analyse and evaluate the issue from the perspective of each of the four organisational frames: structural, HR, political and symbolic. In so doing, identify which frame(s) were dominant.</li>\n<li>Draw on your knowledge of the four frames to make specific recommendations for how the issue or problem could have been more effectively addressed or resolved.</li>\n<li>Support your analysis and demonstrate your insight into your issue by integrating relevant academic literature.</li>\n<li>Consider how you can support your claims and key points by using examples or data. Data could include for example, informal interviews or brief surveys with key players or archival data (e.g. company statistics, reports, employee opinion polls, organisational charts etc).</li>\n</ul>\n<p><strong>Format for the report: </strong>The report should not exceed <strong>2,000 words</strong>. Appendices and the reference list are not included in the word count.; however you cannot assume that the appendices will be read in detail. Please put a word count on the front page of your assignment and ensure that you reference appropriately. Assignments exceeding the word limit by more than 10% will be penalised. All referencing should follow either the APA guidelines (available through the library) or the AMJ guidelines (available at http://journals.aomonline.org/amj/style_guide.pdf).</p>\n<p><strong>Confidentiality: </strong>The report is for educational purposes only and will be treated as confidential.</p>\n<p><strong>Optional Progress report</strong></p>\n<p> The objective of the progress report is to ensure you’re on track with the assignment and have chosen an appropriate issue. The progress report is recommended but is optional and not assessed. It need be only a brief description (one page maximum) of the following;</p>\n<ul>\n<li>A clear description of the issue (e.g. high turnover), the organisational context and the focus of the analysis (e.g. analysis of the causes and consequences of high turnover)</li>\n<li>A brief, bullet point analysis indicating critical aspects of the issue from the perspective of each relevant frame. This will indicate whether your selected issue is scoped appropriately for a frame analysis.</li>\n</ul>\n<p><strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct. </strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The assignment must be submitted electronically through Turn-it-in in the Blackboard Assessments link.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Personal development plan",
            "special_indicators": [],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 4/10/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You have recently enrolled in an MBA program and this is an ideal time to reflect on what you want to achieve from the program to derive maximum benefit. In addition to gaining functional knowledge and skills in a range of subject areas, what do you hope to achieve both personally and professionally? What is your vision for your future? How is your overall sense of direction aligned with your vision? How will you assess your progress during and at the end of your MBA program?</p>\n<p>The purpose of this assignment is to write yourself a comprehensive development plan that references the relevant academic literature. There are a range of capabilities that you might consider (in addition to knowledge). For example, leadership capability including a deeper understanding of your personal style and personality preferences, your strengths and weaknesses, your values and beliefs, managing yourself and relating to others, becoming a more effective communicator with a range of people from different backgrounds and with different styles, learning effectively, and managing your own career. There are many more.</p>\n<p>You will read peer reviewed scholarly articles in quality journals to ascertain not only the value of developing such a plan, but also to understand the cutting edge thought related to the area(s) you have selected for your own development.</p>\n<p>This assignment which also has a 3000 word limit, is in five parts as follows:</p>\n<p><strong><em>Part One: Introduction</em></strong></p>\n<p> An introduction provides the reader with some insight into the topic (of leadership development) and an overview of the assignment. Let the reader know what to expect and which aspects of development are relevant to you.</p>\n<p>In a second paragraph provide a plan of your assignment to guide the reader’s expectation of what follows. Often this is written last and will constitute 10% of the total word count of the assignment.</p>\n<p><strong><em>Part Two: My current reality </em></strong></p>\n<p> In this section, you will provide a snap shot of your current role and non-work commitments. Then report on your analysis of your current reality that you have drawn from the self-assessment and 360-degree instruments used on this course and your personal career experience.</p>\n<ol>\n<li>Briefly identify the key points from each instrument (do NOT describe the instrument, just your key results), either that were new learning for you or reminders of elements that you may have forgotten or overlooked. You can reference literature that supports the value of the instruments or the way that they may contribute to leadership development.</li>\n<li>Identify the major <strong>themes </strong>that emerge from your overall perspective on these results. When possible insert examples from your experience to provide evidence for your claims.</li>\n<li>What are the <strong>implications </strong>of these themes - particularly in terms of your work experience and career aspirations that may heighten your wish for development in a particular area to achieve your future reality. The detail will be explored in the next section.</li>\n</ol>\n<p><strong><em>Part Three: Working towards my future reality</em></strong></p>\n<p> In this section, begin with a brief description and meaning associated with the photo you selected to illustrate your future reality. How does it portray your vision for your future and your leadership?</p>\n<ol>\n<li>Identify the key areas that you need to develop in order to achieve your vision. Examples may include emotional intelligence, change management, self-esteem and confidence, negotiation and conflict management, strategic thinking etc.</li>\n<li>Demonstrate your understanding of the key themes from relevant and contemporary academic literature that supports your focus on the selected areas.</li>\n</ol>\n<p><strong><em>Part Four: My action plan</em></strong></p>\n<p> In this section you will draw up a table</p>\n<p><strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct. </strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The assignment must be submitted electronically through Turn-it-in in the Blackboard Assessments link.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Organisational Analysis: The four frames</strong><br><p><strong>Saturday 10 August - Sunday 11 August 2024</strong></p>\n<p>Introduction to the course including an overview of the essential reading, cases and self-assessment tasks. Introduction to Bolman and Deal's four frames as an analytic tool for understanding organizations and solving organizational problems. Students will analyse situations from multiple perspectives including structural, political, symbolic and HR frames. Case analysis to integrate and apply frames.</p></br></p><p><strong>Learning outcomes:</strong> L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Organisational Analysis: The four frames</strong>",
            "topic_description": "Organisational Analysis: The four frames Saturday 10 August - Sunday 11 August 2024 Introduction to the course including an overview of the essential reading, cases and self-assessment tasks. Introduction to Bolman and Deal's four frames as an analytic tool for understanding organizations and solving organizational problems. Students will analyse situations from multiple perspectives including structural, political, symbolic and HR frames. Case analysis to integrate and apply frames.",
            "learning_outcomes": [
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Group Presentations</strong><br><p><strong>Saturday 24 August 2024</strong></p>\n<p>Group presentations on four frame analysis. Leadership and the Frames. Introduction to the PDP Process.</p></br></p><p><strong>Learning outcomes:</strong> L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Group Presentations</strong>",
            "topic_description": "Group Presentations Saturday 24 August 2024 Group presentations on four frame analysis. Leadership and the Frames. Introduction to the PDP Process.",
            "learning_outcomes": [
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Personal Development Planning</strong><br><p><strong>Saturday 7 September - Sunday 8 September 2024</strong></p>\n<p>Peer coaching and the Personal Development Plan. 360 degree Leadership debrief; Executive Coaching.Course integration and conclusion.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L07</p></div></td>",
            "topic_title": "<strong>Personal Development Planning</strong>",
            "topic_description": "Personal Development Planning Saturday 7 September - Sunday 8 September 2024 Peer coaching and the Personal Development Plan. 360 degree Leadership debrief; Executive Coaching.Course integration and conclusion.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L07"
            ]
        }
    ]
}