{
    "course_title": "Music and Human Behaviour",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MUSC2300-64814-7460",
    "full_course_code": "MUSC2300-64814-7460",
    "course_code": "MUSC2300",
    "class_code": "64814",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate an understanding of music and human behaviour from lifespan and domain focused psychological perspectives."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate an understanding of music and human behaviour from different socio-cultural and disciplinary perspectives."
        },
        {
            "number": "LO3.",
            "description": "Critically evaluate and discuss research in music and human behaviour from different perspectives."
        },
        {
            "number": "LO4.",
            "description": "Reflect on and apply your learning to different contexts."
        },
        {
            "number": "LO5.",
            "description": "Identify, critically analyse and synthesise research, and report on research in music and human behaviour in spoken and written forms."
        },
        {
            "number": "LO6.",
            "description": "Demonstrate an ability to work effectively and collaboratively as part of a group."
        },
        {
            "number": "LO7.",
            "description": "Demonstrate an ability to work collaboratively and effectively with others towards common/project goals."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Online Quizzes",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> Week 2 - Week 12</p>\n<p>\n</p><p>Due Friday 17:00</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p> The online quizzes will occur weekly from Weeks 2-7 and 9-12 of the semester.</p>\n<p><br/></p>\n<p> The questions in the quizzes are based on the weekly course readings and lecture material.</p>\n<p><br/></p>\n<p>The multiple choice questions test your knowledge and understanding of course content. Short answer questions examine your knowledge, understanding and ability to apply knowledge.</p>\n<p><br/></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The online quizzes are completed through Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Individual Report on Music in Your Life",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 27/08/2024 5:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L04, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students are asked to prepare an individual report on the key ways in which music is experienced in your everyday life. Using the experience sampling (daily diary) method, students are asked to monitor where and when they are exposed to music, and report on their thoughts, feelings and behaviours in relation to the music and/or environment in the particular moment. Students will aggregate their own data and a musical playlist for use in the individual report.</p>\n<p> </p>\n<p><strong>Report Length</strong></p>\n<p>1,600 words </p>\n<p> </p>\n<p><strong>Report Structure</strong></p>\n<p>1. Introduction and literature review: Introduce the topic of music in everyday life. Review pertinent literature that outlines the functions of music in our everyday lives and our mental, emotional and behavioural responses to it. Include at least 7 recent (e.g. within the last 10 years) scholarly book chapters and journal articles.</p>\n<p>2. Observational data collection and analysis: Here you outline the experience sampling (daily diary) method for recording your daily experiences of music. Present a concise summary of results from analysis of the data collected. Include a playlist (in a table in the report) of a selection of key pieces of music that are important to your everyday uses or engagement with music (between 3 and 10).</p>\n<p>3. Discussion: Discuss how the data on your everyday experiences and uses of music relates to the research introduced in the introductory section of the report. </p>\n<p>4. References: APA 7th edition style (in-text citations and reference list) </p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<p> </p>\n<p><strong>Presentation</strong></p>\n<p>The assessment task must include a cover sheet. The cover sheet must include:</p>\n<ul>\n<li>The project title</li>\n<li>Student name and number</li>\n<li>Course code</li>\n<li>Course coordinator's name</li>\n</ul>\n<p>Format the document as follows:</p>\n<ul>\n<li>Include page numbers in the top right-hand corner, beginning with the title page</li>\n<li>Include your name and student number as a header on each page</li>\n<li>Referencing style must use the APA system 7th edition style guide (in-text citation and reference list)</li>\n<li>Use 12 pt Times New Roman font, or equivalent</li>\n<li>Margins must be 2.54cm (top, bottom, right, left)</li>\n</ul>\n<p>For each assessment task, use an appropriate scholarly writing style and ensure that material is appropriately referenced. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit your assignment via Turnitin by the due date. Check that you receive a submission receipt for your assignment.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Presentation and Reflection",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 25/10/2024 5:00 pm</p>\n<p>\n</p><p>Presentation occurs during Week 13 class time.</p></dd>",
            "learning_objectives": "L03, L04, L05, L06, L07",
            "mode": "Oral, Written",
            "category": "Presentation, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This is a collaborative group-based assessment. Students are asked to self-enroll in a project group (of 3-4 members) (sign-up available through Blackboard). </p>\n<p>The assessment is designed to provide students with opportunities to develop teamwork skills that are transferable to future study and career paths.</p>\n<p> </p>\n<p>The scenario-based group project investigates the use of music in common public spaces.</p>\n<p>Task: As expert consultants in music and human behaviour, create a proposal and argument for the effective use of music in a particular public space/context to present to the officials who have the authority to implement your recommendations (e.g. the owners of a retail store, or the government officials responsible for a public space). The argument could be to attract people to or deter people from a particular space/context. </p>\n<p> </p>\n<p>Choose one of the following types of public spaces/contexts around which to focus your project:</p>\n<ul>\n<li>Retail stores (e.g. a sports shoe store, a bath products store, etc.)</li>\n<li>Public outdoor areas (e.g. a city square/park)</li>\n<li>Shopping centres</li>\n<li>Waiting/reception areas in public buildings</li>\n<li>Mass public transport stations</li>\n<li>Other in consultations with the course coordinator</li>\n</ul>\n<p>Topics must be confirmed with the lecturer by Week 9 of the course.</p>\n<p> </p>\n<p>Each group chooses a topic and formulates an action plan. Group members work individually to identify and contribute a minimum of 2 relevant research papers, and collect and analyse some observational data in the real world. The group comes together to join their background research and data together in preparing a presentation for the class. The research and data/evidence collected provides the support for your argument to officials.</p>\n<p> </p>\n<p>Advice and activities are incorporated into lecture sessions to assist you with the assessment.</p>\n<p> </p>\n<p>Students complete a peer- and self-assessment task on two occasions during the group project period (beginning-middle and end – dates will be advised via Blackboard). These brief tasks do not individually count towards assessment. They provide the course coordinator in information on group members’ individual effort and contributions to the group work. This allows the course coordinator to identify and help groups who might need more assistance. The final peer- and self-assessment task provides students with the opportunity to reflect on how their group functioned over the group-work period leading up to the spoken presentation. The course coordinator will use this feedback to moderate marks for the group project presentation.</p>\n<p>Artificial Intelligence (AI) provides emerging tools that may support students in completing this assessment task. Students may appropriately use AI in completing this assessment task. Students must clearly reference any use of AI in each instance.</p>\n<p>A failure to reference generative AI use may constitute student misconduct under the Student Code of Conduct.</p>\n<p> </p>\n<p><strong>Presentation during Week 13 class time </strong></p>\n<p>The spoken presentation is 5 minutes in duration, followed by 2 minutes of questions. To ensure equity for all students, there will be strict adherence to the time limits. Each member of the group is required to speak.</p>\n<p> </p>\n<p>Each group prepares a PowerPoint presentation (maximum 6 slides) to support their spoken presentation.</p>\n<p> </p>\n<p>The presentation incorporates background information about the public space/context, a review of relevant scholarly literature, an outline of the method of data collection (context, participants, materials, the procedure for collecting the data)</p>\n<p><br/></p>\n<p>The presentations will take place in the Week 13 lecture session. Students will upload their group presentation slides and reference list for marking by the due date.</p>\n<p>Students also submit a written critical reflection (approx. 400 words) by the due date about their contributions and learning through the group project process and in-class presentation. The reflection should note the following:</p>\n<ul>\n<li>What they have learned through the group project process, on what skills and knowledge developed that they will take forward into future study and/or career endeavours. Include a brief self-assessment of the individual contribution made to the group - noting personal strengths, weaknesses, opportunities for greater participation/to engage more fully, and elements that threatened your participation/ability to engage fully.</li>\n</ul>\n<p><br/></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>1. In-class group presentations during Week 13 class time. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction and overview</strong><br><p>Each weekly lecture involves group work.</p>\n<p>This lecture introduces you to music and human behaviour and overviews the lifespan and domain (cognitive, social, emotional, physical) psychological perspectives underpinning the course. We will overview the course topics and assessment items.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Introduction and overview</strong>",
            "topic_description": "Introduction and overview Each weekly lecture involves group work. This lecture introduces you to music and human behaviour and overviews the lifespan and domain (cognitive, social, emotional, physical) psychological perspectives underpinning the course. We will overview the course topics and assessment items.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Music in everyday life</strong><br><p>This lecture explores how we engage with music in everyday life, across the lifespan, and in different social and cultural contexts. This week also involves active learning through participation in an experiment investigating audience responses to music.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Music in everyday life</strong>",
            "topic_description": "Music in everyday life This lecture explores how we engage with music in everyday life, across the lifespan, and in different social and cultural contexts. This week also involves active learning through participation in an experiment investigating audience responses to music.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Music and social processes</strong><br><p>There is a pre-recorded lecture only this week due to the public holiday. The lecture focusses on the role that music plays in our social lives - from cultural activities and ceremonies through to how music can motivate pro- or anti-social behaviour.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Music and social processes</strong>",
            "topic_description": "Music and social processes There is a pre-recorded lecture only this week due to the public holiday. The lecture focusses on the role that music plays in our social lives - from cultural activities and ceremonies through to how music can motivate pro- or anti-social behaviour.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 4(12 Aug - 18 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Music, work and study</strong><br><p>In this lecture we investigate how music can influence work or study behaviours. We also overview music as work and the role of musician in society.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Music, work and study</strong>",
            "topic_description": "Music, work and study In this lecture we investigate how music can influence work or study behaviours. We also overview music as work and the role of musician in society.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 5(19 Aug - 25 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Music and exercise</strong><br><p>In this lecture, we explore the role of music in exercise and how it relates to physical and psychological outcomes.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Music and exercise</strong>",
            "topic_description": "Music and exercise In this lecture, we explore the role of music in exercise and how it relates to physical and psychological outcomes.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Music and consumer behaviour</strong><br/><p>In this lecture we how music can influence consumer emotions and behaviour.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Music and consumer behaviour</strong>",
            "topic_description": "Music and consumer behaviour In this lecture we how music can influence consumer emotions and behaviour.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 7(02 Sep - 08 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Music and highly skilled behaviour</strong><br/><p>This lecture focusses on the development of expert behaviour, such as driving or elite sport, and how music can help or hinder performance.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Music and highly skilled behaviour</strong>",
            "topic_description": "Music and highly skilled behaviour This lecture focusses on the development of expert behaviour, such as driving or elite sport, and how music can help or hinder performance.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Music performance as highly skilled behaviour</strong><br/><p>This lecture examines the variety of bodily, social, emotional and cognitive processes and play in producing and communicating music performance.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Music performance as highly skilled behaviour</strong>",
            "topic_description": "Music performance as highly skilled behaviour This lecture examines the variety of bodily, social, emotional and cognitive processes and play in producing and communicating music performance.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Music and recreation</strong><br/><p>This lecture focuses on music as a recreational activity, as well as how music is integrated with other recreational activities, such as dance, video games, and gambling.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Music and recreation</strong>",
            "topic_description": "Music and recreation This lecture focuses on music as a recreational activity, as well as how music is integrated with other recreational activities, such as dance, video games, and gambling.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 11(07 Oct - 13 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Music, brain and behaviour</strong><br/><p>This lecture focuses on brain structure and function in relation to music and human behaviour.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Music, brain and behaviour</strong>",
            "topic_description": "Music, brain and behaviour This lecture focuses on brain structure and function in relation to music and human behaviour.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Music and wellbeing</strong><br/><p>This lecture overviews different perspectives on connections between music and human behaviour with wellbeing outcomes. We explore professional practices of music medicine, therapy, education, and performing arts medicine, and how individuals engage with music for wellbeing goals.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Music and wellbeing</strong>",
            "topic_description": "Music and wellbeing This lecture overviews different perspectives on connections between music and human behaviour with wellbeing outcomes. We explore professional practices of music medicine, therapy, education, and performing arts medicine, and how individuals engage with music for wellbeing goals.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In-Class Group Presentations</strong><br/></p><p><strong>Learning outcomes:</strong> L05, L06, L07</p></div></td>",
            "topic_title": "<strong>In-Class Group Presentations</strong>",
            "topic_description": "In-Class Group Presentations",
            "learning_outcomes": [
                "L05",
                "L06",
                "L07"
            ]
        }
    ]
}