{
    "course_title": "Teaching Music",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MUSC3780-60637-7460",
    "full_course_code": "MUSC3780-60637-7460",
    "course_code": "MUSC3780",
    "class_code": "60637",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Investigate recent theories and research on learning in music education"
        },
        {
            "number": "LO2.",
            "description": "Demonstrate an in-depth understanding of pedagogy and curriculum development specific to teaching music"
        },
        {
            "number": "LO3.",
            "description": "Design and implement meaningful, authentic and engaging music learning experiences using a range of approaches"
        },
        {
            "number": "LO4.",
            "description": "Demonstrate an ability to investigate the application of relevant theory to the practice of music education"
        },
        {
            "number": "LO5.",
            "description": "Work collaboratively with peers to identify problems, create solutions, innovate and improve teaching practices."
        },
        {
            "number": "LO6.",
            "description": "Develop a personal appreciation of the philosophical and social contexts of music education."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Team-teaching using innovative repertoire",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 13/08/2024 1:00 pm</p>\n<p>\n</p><p>This assessment will be conducted throughout during class in weeks four and five. The written component is due (for all students) in Week 4, prior to class.</p></dd>",
            "learning_objectives": "L02, L03, L05",
            "mode": "Activity/ Performance",
            "category": "Practical/ Demonstration",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>\n</p>\n<p>In pairs, you are to teach a 15-minute learning sequence appropriate for students in Years 7 or 8.</p>\n<ol>\n<li>You should select one engaging piece of music or resource to form the basis of the lesson.</li>\n<li>Your teaching should investigate and build on this repertoire/resource to develop student musical understanding through 'making' and/or 'responding' learning experiences.</li>\n<li>Our class will be your students for this team-teaching exercise.</li>\n</ol>\n<p>You are required to supply your peers with the following documentation on the Blackboard Discussion Board prior to teaching:</p>\n<ol>\n<li>1 page (maximum) justification of your use of (i) the repertoire/resource and (ii) the teaching strategy employed. The justification should refer to at least four recent different academic sources and the relevant Australian Curriculum Syllabus. Full bibliographic details of sources and repertoire employed should be included in a short reference list (APA7).</li>\n<li>1 page lesson plan</li>\n</ol>\n<p>To enable both self and peer reflection, you are to organise a video recording of your teaching on the day, and also provide enough groupwork feedback sheets for your class to fill out after your presentation.</p>\n<p>Although feedback will be provided by peers (verbal and written), this assignment will be marked by the lecturer. Each student will be marked separately on their presentation, but the 1-page justification will be marked together.  Any issues arising from working in pairs should be made known to the lecturer <em>in good time </em>before the scheduled presentation date.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission of written component via TurnItIn. Keep a copy of your video until the end of semester to be submitted if requested.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Critical Reflection",
            "special_indicators": [],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 4/10/2024 1:00 pm</p>\n<p>\n</p><p>This assessment involves completing weekly activities throughout the course.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L06",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>As a future teacher of music, you will benefit from understanding music learning and development in various educational contexts. You are required to write a critical reflection essay on an activity from each of the four categories below. Each activity should examine at least 3 course readings. A critical reflection discusses your personal experience and opinion by connecting to course readings, content and practical activities. While you are only required to respond to four activities in this assessment, you are strongly encouraged to complete <strong>all activities</strong> as this will benefit your development as a future music educator, and enhance your capacity to achieve the course outcomes. Complete the tasks throughout the semester to allow appropriate time for reflection. Some activities will require contact with external providers and will take time to organise.</p>\n<p>1750-2000 words total.</p>\n<p>A suggested essay structure is outlined below:</p>\n<p><em>Introduction: 100 words.</em></p>\n<p>Introduce the activities you chose and why (include references).</p>\n<p><em>Category 1 activity reflection: 400 words</em></p>\n<p>Describe your observations and critically reflect about what you have learnt against the course readings and content.</p>\n<p><em>Category 2 activity reflection: 400 words</em></p>\n<p>As above</p>\n<p><em>Category 3 activity reflection: 400 words</em></p>\n<p>As above</p>\n<p><em>Category 4 activity reflection: 400 words</em></p>\n<p>As above</p>\n<p><em>Concluding reflection: 300 words.</em></p>\n<p>The concluding synthesis of your reflections, including implications for your future practice.</p>\n<p>Ensure you consult the assessment criteria in crafting your response. </p>\n<p><strong>Category 1: School Music Education Observation</strong></p>\n<ol>\n<li>Attend at least three classroom or instrumental music lessons in the same class at a school over the semester. Report on what you learned about music learning and development that you could apply to your practice as a music teacher (refer to relevant sources, and link these to your experience). Your lecturer will discuss how to contact schools and teachers. You must let your lecturer know the details of your school observation (school, teacher, year level, dates). <strong>Note: This is not a practicum. It is extremely important that you communicate with your lecturer about your plans prior to embarking on any contact with schools, and you must follow the instructions provided on Blackboard to the letter.</strong></li>\n<li>From the field trip organised in this course, report on what you learned about a whole-school approach to music learning and development, and the importance of the classroom music teacher (refer to relevant sources, and link these to your experience).</li>\n</ol>\n<p><strong>Category 2: Observation of Music Learning Beyond the School Music Classroom</strong></p>\n<ol>\n<li>Attend at least two rehearsals of any of the ensembles from UQ Music. Observe, identify and analyse three music learning strategies employed within rehearsals.  Detail how you could utilise them in your practice as a teacher. Suggest how these strategies could be adapted for appropriate age-level learning experiences and engaging repertoire (refer to relevant sources, and link these to your experience).</li>\n<li>Attend a concert for school-aged children (e.g. https://qso.com.au/education/events). Observe the interactions between the children and the ensemble, and report on what you learn about engaging children with live music and how you could apply this to your practice as a music teacher (refer to relevant sources, and link these to your experience).</li>\n</ol>\n<p><strong>Category 3: Engaging with Music Learners</strong></p>\n<ol>\n<li>Visit an early childhood centre at least three times over the semester and actively engage children in making music. Report on your observations of learning and development and how you could apply this to your practice as a secondary music teacher (refer to relevant sources, and link these to your experience). <strong>Note: This is not a practicum. It is extremely important that you follow the instructions provided on Blackboard to the letter.</strong></li>\n<li>Interview 3 school-age children whom you already know. Find out about 1. What music they like 2. What they think about school music 3. What they would like to learn in relation to music. Reflect on how music education in schools could cater to these students’ musical aspirations (refer to relevant sources, and link these to your interviews). </li>\n<li>Engage some school-aged children that you already know (e.g. family) in informal learning of music. You could use an iPad, instruments, a music game, a recording. The options are endless, but you must NOT guide it – they need to guide themselves. Report on what you learned about their motivation for learning (refer to relevant sources, and link these to your experience).</li>\n</ol>\n<p><strong>Category 4: Designing Music Learning</strong></p>\n<ol>\n<li>Watch the series, <em>Don’t Stop the Music</em> and choose a child as a case study. Report on what you learned about children you could apply to your practice as a music teacher. Provide a brief outline of a learning experience you could implement for this child at the beginning of secondary school (i.e. Year 7), justifying your approach using relevant sources.</li>\n<li>Select or design a composition-based musical activity/game. Discuss how you would use it for 3-5-year-olds, 6-8-year-olds, 9-12-year-olds, and 13-14-year-olds, based on your knowledge of psychological and social development at these ages. Discuss how your adjustment of the game makes it appropriate for each age group (refer to relevant sources to justify your design).</li>\n<li>Investigate an online music learning course (e.g. <a href=\"https://learningmusic.ableton.com/\">https://learningmusic.ableton.com/</a>). Report on the principles of learning design that intersect with the theories/readings from this course.</li>\n</ol>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Music Education Philosophy",
            "special_indicators": [],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 25/10/2024</p></dd>",
            "learning_objectives": "L01, L04, L06",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You are to develop a personalised and research-informed contemporary philosophy of music education. Your essay should:</p>\n<ol>\n<li>Articulate your beliefs and values about music learning and development with connection to at least 10 course readings, and discuss the implications for your future practice.</li>\n<li>Draw upon your own music education experiences to date, including activities from this course.</li>\n</ol>\n<p>In addition to 10 course readings in your reference list (APA7), you are also encouraged to read and cite beyond the course literature.</p>\n<p>It is anticipated your philosophy of music education may evolve throughout your studies and that this assignment will serve as a useful resource for you in the future.</p>\n<p>1750-2000 words</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(22 Jul - 27 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lectures</strong><br><p>Lectures will be conducted each week, and will cover topics such as:<br/>\nDeveloping your own understandings of music education.<br/>\nConstructivist music education<br/>\nPhilosophies and approaches to music education<br/>\nCreativity in music education<br/>\nMusical development and abilities<br/>\nPlanning for music learning.</p>\n<p>Workshops and excursions will also occur during these times. Students should consult the outline on Blackboard and the timetable for more details.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Lectures</strong>",
            "topic_description": "Lectures Lectures will be conducted each week, and will cover topics such as: Developing your own understandings of music education. Constructivist music education Philosophies and approaches to music education Creativity in music education Musical development and abilities Planning for music learning. Workshops and excursions will also occur during these times. Students should consult the outline on Blackboard and the timetable for more details.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 13(29 Jul - 27 Oct)",
            "activity_type": "Excursion",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Excursions</strong><br><p>Students will observe some classroom music lessons. These observations will be held 'off-campus'. Students are also encouraged to take part in independent observations outside of these times. Opportunities will be provided by the lecturer, but students may also self-select into alternative opportunities for professional development. </p>\n<p>Blue Cards are compulsory in this course. Bring your Blue Cards with you to schools and always dress professionally.</p></br></p><p><strong>Learning outcomes:</strong> L04</p></div></td>",
            "topic_title": "<strong>Excursions</strong>",
            "topic_description": "Excursions Students will observe some classroom music lessons. These observations will be held 'off-campus'. Students are also encouraged to take part in independent observations outside of these times. Opportunities will be provided by the lecturer, but students may also self-select into alternative opportunities for professional development. Blue Cards are compulsory in this course. Bring your Blue Cards with you to schools and always dress professionally.",
            "learning_outcomes": [
                "L04"
            ]
        }
    ]
}