{
    "course_title": "Museum Learning and Outreach",
    "study_period": "Sem 2 2024",
    "location": "QLD Art Gallery - Modern Art",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MUSM7030-64163-7460",
    "full_course_code": "MUSM7030-64163-7460",
    "course_code": "MUSM7030",
    "class_code": "64163",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand and analyse research on museum education and learning in the context of contemporary museums."
        },
        {
            "number": "LO2.",
            "description": "Evaluate the effectiveness of a museum learning program against current museum learning research."
        },
        {
            "number": "LO3.",
            "description": "Apply discipline-based knowledge and understanding to practice in a work place environment."
        },
        {
            "number": "LO4.",
            "description": "Develop museum learning outreach for inclusive and diverse audiences."
        },
        {
            "number": "LO5.",
            "description": "Communicate and interact appropriately for audience and purpose."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Assessment 1: essay evaluating a learning program",
            "special_indicators": [],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 21/08/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Assessment 1: an essay evaluating an existing museum learning program of student’s choice within Queensland (e.g. regional museums, QAGOMA MoB UQAM); 1500 words including references.</p>\n<p>Your first course work essay is intended as a concise critical evaluation of ONE learning program of your choice in a museum or gallery. This could be a learning program in a small museum, a regional museum or at state or national / level. It’s up to you to choose. It doesn’t have to be in Australia. Examine the overall strategy of your chosen Learning program and critcally analyse its aims, content and intended audience.</p>\n<p>Some aspects to consider: is the learning program linked to the museum’s current exhibitions or to its collection, or is it independent of these? You could pick one element of the learning program to explore in detail if the program you choose is an expansive one. How does it reference one of the fours fields of learning? What type of learning is it? How does it motivate the audience participation and engagement to learn? How does it sit in relation to that museum’s strategic plan? How is the program accessed?</p>\n<p>Some questions you might ask (suggestions only - not compulsory) include; based on what we have covered in the course to date what kind of learning program is it? Can you discern if the program is successful and if so why/ why not? How is success measured? Can you suggest how the program could be improved? Is it best practice? In what way? Can you suggest another program that is a better example and would develop your chosen learning program?</p>\n<p>Your essay needs an introduction where you discuss what you will do in the essay and why. Your essay also needs a conclusion where you sum up your main arguments.</p>\n<p>Use references from the course and find your own. Uses sources including and beyond those suggested in class. Do use some refereed scholarly articles to support your arguments.</p>\n<p>See the School of Social Science essay writing guide for basic essay questions.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>Use of AI: </strong>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Assessment 2 : new Learning program and report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 14/10/2024 2:00 pm</p>\n<p>\n</p><p>Group presentations will take place in week 12's class.</p>\n<p> The hand-in of individual learning program proposals based on your group work is the following Monday giving you the weekend to update your document in the light of workshop feedback.</p></dd>",
            "learning_objectives": "L03, L05",
            "mode": "Activity/ Performance, Oral, Written",
            "category": "Participation/ Student contribution, Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Assessment 2: group project proposing a new learning program to increase audience participation for a museum of your choice (can include for QAGOMA) using audio visual presentation in week 11. Individual project proposals submitted as text; 1000 words <strong>excluding </strong>references.</p>\n<p>Working in groups of 3-4 devise a new Learning program. Your brief is to expand audience participation for the museum and pitch a new program. Use your learning from this course (i.e. the four fields learning) to suggest the new program. Your program should combine two or more of the four fields of learning; for example digital and well-being.</p>\n<p>Why is your proposed Learning program needed? What does it consist of? How would you do it? Who are your partners? Do you have an audience sector in mind? What will the experience of participating be?</p>\n<p>Group Presentations in week 11. Maximum presentation time per group 12 minutes (TBC). Each member of your group must present for an equal amount of time. 20% of your marks for this project are for your personal presentation and contribution as part of the group project and presentation.</p>\n<p><strong>Presentation Hints</strong>:</p>\n<p>Presentation practice runs before-hand are essential. Time your delivery and make edits to the material to present concise but thorough material. You are persuading your potential partners and your gallery manager to get your proposal up and running. It’s a pitch so be persuasive. Your proposal might be participatory in itself.</p>\n<p>Your written submission of 1000 words including references is your own individual work about the group proposal. This will work best if divided into sub sections and written as a pitch in a report style. You should start your document with an executive summary. This is one paragraph summarising the need for the program and its aims and expected outcomes.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>Use of AI: </strong>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Assessment 3 : written reflection on group project",
            "special_indicators": [],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 24/10/2024 2:00 pm</p>\n<p>\n</p><p>Students should be working on their reflective diary from week 5 onwards when the group projects begin.</p></dd>",
            "learning_objectives": "L03, L05",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Assessment 3: an individual written reflection on the group project focusing on the application of current research and work place skills in the field of museum learning and outreach; 1000 words <strong>excluding </strong>references.</p>\n<p>This assignment offers students the opportunity to reflect on the research and workplace skills that they applied to the group project work. In week 12’s class we will also revisit these. Students will submit their reflections in the journal section of blackboard. Reflections on your group project may be added throughout the group project process until the assessment deadline.</p>\n<p>As this is a reflective assignment, students are encouraged to write in a less formal way than in an essay. Using the first person ‘I’ is acceptable. Use scholarly work and websites to support your writing.</p>\n<p>Some themes you could reflect on in this assessment include: What did you learn about the process of designing a learning program in a group? What kind of research did you use to create the program, which field was it in? How is your proposal aligned with current research in museum learning? Which work place skills did you draw on and develop? What were the advantages (and disadvantages) of working as a team? What did you learn from the process? How did the proposal develop your work place skills. How did your proposal align with industry standards in learning and outreach? Which ones are these?</p>\n<p>UQ offer a student guide to using the Blackboard Journal:  <a href=\"https://web.library.uq.edu.au/library-services/it/learnuq-blackboard-help/collaborative-tools/blogs-and-journals/blogging-and-journaling\">https://web.library.uq.edu.au/library-services/it/learnuq-blackboard-help/collaborative-tools/blogs-and-journals/blogging-and-journaling</a></p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>Use of AI: </strong>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students will submit their reflections in the journal section of Blackboard. Reflections on your group project may be added throughout the group project process until the assessment deadline.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1 Course overview and Introduction Arts Learning and Creative generation</strong><br/><p>At QAGOMA we meet with Terry Deen Head of Learning and go through the learning activities in this course, the assessments and expectations.</p>\n<p>Developing programs Terry Deen</p>\n<p>QAGOMA Library introduction</p>\n<p>Tour of Creative Generation Rachel Ryan</p></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Week 1 Course overview and Introduction Arts Learning and Creative generation</strong>",
            "topic_description": "Week 1 Course overview and Introduction Arts Learning and Creative generation At QAGOMA we meet with Terry Deen Head of Learning and go through the learning activities in this course, the assessments and expectations. Developing programs Terry Deen QAGOMA Library introduction Tour of Creative Generation Rachel Ryan",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2 Cultural learning   Aboriginal and Torres Strait</strong><br/><p>Through a First Nations first approach, the course moves from general orientation into an in-depth study of cultural learning specific to Aboriginal and Torres Strait Islander history and culture. Three QAGOMA case studies explores Design Tracks. This week will highlight the contributions that QAGOMA Learning makes to reconciliation within and beyond the Gallery. UQ staff; Assoc Prof Fiona Foley</p></p></div></td>",
            "topic_title": "<strong>Week 2 Cultural learning   Aboriginal and Torres Strait</strong>",
            "topic_description": "Week 2 Cultural learning   Aboriginal and Torres Strait Through a First Nations first approach, the course moves from general orientation into an in-depth study of cultural learning specific to Aboriginal and Torres Strait Islander history and culture. Three QAGOMA case studies explores Design Tracks. This week will highlight the contributions that QAGOMA Learning makes to reconciliation within and beyond the Gallery. UQ staff; Assoc Prof Fiona Foley",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3 Wellbeing  Art and Dementia</strong><br/><p>Accessibility sits at the heart of all Learning and Outreach initiatives. Overview, background and deep dive into Art and Dementia program with Debbie Brittain</p></p></div></td>",
            "topic_title": "<strong>Week 3 Wellbeing  Art and Dementia</strong>",
            "topic_description": "Week 3 Wellbeing  Art and Dementia Accessibility sits at the heart of all Learning and Outreach initiatives. Overview, background and deep dive into Art and Dementia program with Debbie Brittain",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4(12 Aug - 18 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4 Arts Learning and Digital</strong><br/><p>QAGOMA Learning staff will unpack formal learning programs and resources for schools and teachers through initiatives that demonstrate how an Education unit within a Gallery impacts outcomes through bridging relationships between the art industry and the education system.</p>\n<p>Debrief from last week DY/TD</p></p></div></td>",
            "topic_title": "<strong>Week 4 Arts Learning and Digital</strong>",
            "topic_description": "Week 4 Arts Learning and Digital QAGOMA Learning staff will unpack formal learning programs and resources for schools and teachers through initiatives that demonstrate how an Education unit within a Gallery impacts outcomes through bridging relationships between the art industry and the education system. Debrief from last week DY/TD",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(19 Aug - 25 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5 Digital Learning </strong><br/><p>Formation of student groups for project.</p>\n<p>Exploring current trends in Museum Learning and Outreach is inherently connected with the design of digital learning across Gallery platforms. This week takes a close look at major shifts in the use of emerging technologies with the simultaneous aims of elevating marginalised voices in unison with increasing access to institutionally authored content.</p>\n<p>QAGOMA case studies and Digital Transformation talks from Morgan Strong and Team Lightning topics leading to “student design jam”.</p>\n<p>4 x 15 min presentations followed by a workshop</p></p></div></td>",
            "topic_title": "<strong>Week 5 Digital Learning </strong>",
            "topic_description": "Week 5 Digital Learning Formation of student groups for project. Exploring current trends in Museum Learning and Outreach is inherently connected with the design of digital learning across Gallery platforms. This week takes a close look at major shifts in the use of emerging technologies with the simultaneous aims of elevating marginalised voices in unison with increasing access to institutionally authored content. QAGOMA case studies and Digital Transformation talks from Morgan Strong and Team Lightning topics leading to “student design jam”. 4 x 15 min presentations followed by a workshop",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6 Group projects</strong><br/><p>This week we focus on your group projects. </p>\n<p>Assessment discussion lead by Diana Young.</p>\n<p>Groups develop projects with access to Gallery spaces. Groups reconvene to share progress</p></p></div></td>",
            "topic_title": "<strong>Week 6 Group projects</strong>",
            "topic_description": "Week 6 Group projects This week we focus on your group projects. Assessment discussion lead by Diana Young. Groups develop projects with access to Gallery spaces. Groups reconvene to share progress",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7(02 Sep - 08 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7 Well being</strong><br/><p>The social model, inclusive language, universal design</p>\n<p>QAGOMA case studies: disability tours, tactile experiences</p>\n<p>1.00pm Debrief from last week DY/TD </p>\n<p>Lecture: Approaching Universal Design with Michael O’Sullivan and team (using QAGOMA specific case studies) </p>\n<p>Lecture: Overview of QAGOMA Access programs and approach to programming </p>\n<p> Talk and Tour: An audio description experience Jan Pyke</p></p><p><strong>Learning outcomes:</strong> L01, L03, L05</p></div></td>",
            "topic_title": "<strong>Week 7 Well being</strong>",
            "topic_description": "Week 7 Well being The social model, inclusive language, universal design QAGOMA case studies: disability tours, tactile experiences 1.00pm Debrief from last week DY/TD Lecture: Approaching Universal Design with Michael O’Sullivan and team (using QAGOMA specific case studies) Lecture: Overview of QAGOMA Access programs and approach to programming Talk and Tour: An audio description experience Jan Pyke",
            "learning_outcomes": [
                "L01",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8 Arts Learning; play</strong><br/><p>Visit to the children's art centre.</p>\n<p>Workshop on volunteer guides at QAGOMA</p></p></div></td>",
            "topic_title": "<strong>Week 8 Arts Learning; play</strong>",
            "topic_description": "Week 8 Arts Learning; play Visit to the children's art centre. Workshop on volunteer guides at QAGOMA",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9 Arts learning APT</strong><br/><p>Debrief from last week </p>\n<p> Introduction to APT (context, history, evolution,)</p>\n<p>Case studies, artists and communities </p>\n<p>tour of APT11, QAG,</p></p></div></td>",
            "topic_title": "<strong>Week 9 Arts learning APT</strong>",
            "topic_description": "Week 9 Arts learning APT Debrief from last week Introduction to APT (context, history, evolution,) Case studies, artists and communities tour of APT11, QAG,",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid Sem break(23 Sep - 29 Sep)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid semester break No class</strong><br/></p></div></td>",
            "topic_title": "<strong>Mid semester break No class</strong>",
            "topic_description": "Mid semester break No class",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10 Regional partnerships   </strong><br/><p>QAGOMA was established as a statutory body under the Queensland Art Gallery Act 1987 (the Act). A core objective for QAGOMA under the Act is to contribute to the cultural, social and intellectual development of all Queenslanders . This week will look closely at the work that the QAGOMA Learning department invests into one the guiding principles through which this objective is achieved: There should be responsiveness to the needs of communities in regional and outer metropolitan areas.</p>\n<p>Partnerships in a decentralised State QAGOMA case study: Art as Exchange, Regional Touring, KoT</p></p></div></td>",
            "topic_title": "<strong>Week 10 Regional partnerships   </strong>",
            "topic_description": "Week 10 Regional partnerships QAGOMA was established as a statutory body under the Queensland Art Gallery Act 1987 (the Act). A core objective for QAGOMA under the Act is to contribute to the cultural, social and intellectual development of all Queenslanders . This week will look closely at the work that the QAGOMA Learning department invests into one the guiding principles through which this objective is achieved: There should be responsiveness to the needs of communities in regional and outer metropolitan areas. Partnerships in a decentralised State QAGOMA case study: Art as Exchange, Regional Touring, KoT",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11(07 Oct - 13 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11; All-ages Learning Centre (AALC)</strong><br/><p>This week will provide students with unique insight into the future of the QAGOMA Learning department. Senior staff will share the latest information on the proposed All-ages Learning Centre at the Queensland Art Gallery.</p>\n<p>Debrief from last week </p>\n<p>Learning Centre presentation Simon Wright </p>\n<p> Workshop group presentations</p></p></div></td>",
            "topic_title": "<strong>Week 11; All-ages Learning Centre (AALC)</strong>",
            "topic_description": "Week 11; All-ages Learning Centre (AALC) This week will provide students with unique insight into the future of the QAGOMA Learning department. Senior staff will share the latest information on the proposed All-ages Learning Centre at the Queensland Art Gallery. Debrief from last week Learning Centre presentation Simon Wright Workshop group presentations",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12 Group presentations</strong><br/><p>Group project proposing a new Learning program to increase audience participation using audio visual presentation. The major assessment item is presented in the Lecture Theatre at the Queensland Art Gallery.</p></p></div></td>",
            "topic_title": "<strong>Week 12 Group presentations</strong>",
            "topic_description": "Week 12 Group presentations Group project proposing a new Learning program to increase audience participation using audio visual presentation. The major assessment item is presented in the Lecture Theatre at the Queensland Art Gallery.",
            "learning_outcomes": []
        }
    ]
}