{
    "course_title": "Thesis (full-time study)",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/NUMW6003-62992-7460",
    "full_course_code": "NUMW6003-62992-7460",
    "course_code": "NUMW6003",
    "class_code": "62992",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Conduct a research investigation guided by a well founded research proposal."
        },
        {
            "number": "LO2.",
            "description": "Demonstrate knowledge of the conventions of thesis preparation."
        },
        {
            "number": "LO3.",
            "description": "Analyse, interpret and synthesise research findings and present the research in an academic thesis."
        },
        {
            "number": "LO4.",
            "description": "Prepare an academic paper of a quality commensurate with publication in an academic journal."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Honours Thesis",
            "special_indicators": [],
            "weighting": "<dd>100%</dd>",
            "due_date": "<dd><p> 4/11/2024</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Thesis",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<h2>Task Description:</h2>\n<p>The final format may take the form of a traditional thesis, or as a thesis by publication. This should be discussed and agreed upon with your supervisor in the early stages of candidature.</p>\n<p>The thesis will be formatted according to the <a href=\"https://my.uq.edu.au/information-and-services/higher-degree-research/my-thesis/1-thesis-preparation\">Thesis Preparation Guidel</a> ines available on the UQ Graduate School website although journal formatting can be preserved should you include a manuscript as a chapter of your thesis. You should seek guidance from your advisors. See the course Blackboard for further information about the format of your thesis.</p>\n<p>The thesis will generally be presented in chapters.</p>\n<p>The thesis must contain:</p>\n<ul>\n<li>an introduction that contextualises your research project in relation to the present state of knowledge in the field, this could be your Literature Review;</li>\n<li>a methodology that establishes how the research was conducted, this could be your Research Proposal;</li>\n<li>a report of the findings and a discussion which places them in the context of the wider literature, this could be your Research paper/manuscript submitted for publication.</li>\n</ul>\n<p> </p>\n<p>Thesis chapters should must be in a logical and cogent sequence leading to an argument that supports the main findings of the thesis (generally introduction, literature, methodology, results, discussion/conclusion [results and discussion may be replaced with a manuscript – where this occurs a conclusion chapter will generally be required]).</p>\n<p>Where the papers/manuscripts have multiple authors, you must include a statement for each publication, within the preliminary pages, that clearly specifies the extent to which the original research was undertaken by yourself rather than the co-authors, the extent to which you authored the papers, and give full acknowledgement to the contributions of others. You should seek guidance from your advisors and co-authors.</p>\n<p>As the sole author of the thesis you are the copyright holder and therefore you are fully responsible for everything contained in it. If the thesis contains third-party material (for example photographs, maps, drawings), you must obtain permission to reproduce copyright material if permission has not already been granted as part of the publication process by the copyright holder. If copyright on a publication or third-party material has been assigned to a publisher, permission must be sought to reproduce the work in the thesis.  </p>\n<p>Submission via Turnitin in Blackboard.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>This assessment requires students to submit an electronic version of their assignment via Blackboard. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(22 Jul - 27 Oct)",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Thesis Template and format decided</strong><br><p>Read the information avaialble on Blackboard for Thesis assessment details and requirement and marking rubric.</p></br></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Thesis Template and format decided</strong>",
            "topic_description": "Thesis Template and format decided Read the information avaialble on Blackboard for Thesis assessment details and requirement and marking rubric.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(22 Jul - 27 Oct)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Conduct planned research and report on findings</strong><br/><p>Conduct research as planned in research protocol, including data collection, analysis and presentation and discussion of findings.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Conduct planned research and report on findings</strong>",
            "topic_description": "Conduct planned research and report on findings Conduct research as planned in research protocol, including data collection, analysis and presentation and discussion of findings.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(22 Jul - 27 Oct)",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Supervisor meetings</strong><br/><p>Meet with supervisory team regarding roles and responsibilities. Set clear meeting times and agenda items and plan of work for the semester and submitting your thesis.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Supervisor meetings</strong>",
            "topic_description": "Supervisor meetings Meet with supervisory team regarding roles and responsibilities. Set clear meeting times and agenda items and plan of work for the semester and submitting your thesis.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(22 Jul - 27 Oct)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Prepare Honours work for publication as negotiated</strong><br/><p>Prepare Honours work as a manuscript to submit for publication in peer reviewed journal. Details to be negotiated with supervisory team.</p></p><p><strong>Learning outcomes:</strong> L04</p></div></td>",
            "topic_title": "<strong>Prepare Honours work for publication as negotiated</strong>",
            "topic_description": "Prepare Honours work for publication as negotiated Prepare Honours work as a manuscript to submit for publication in peer reviewed journal. Details to be negotiated with supervisory team.",
            "learning_outcomes": [
                "L04"
            ]
        }
    ]
}