{
    "course_title": "Clinical Nursing Practice 7",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/NUMW3214-64795-7460",
    "full_course_code": "NUMW3214-64795-7460",
    "course_code": "NUMW3214",
    "class_code": "64795",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate safe and professional nursing practice commensurate with the year level of study aligned to the Nursing and Midwifery Board of Australia's Professional Standards."
        },
        {
            "number": "LO2.",
            "description": "Assess, plan, implement and evaluate evidence-based nursing care that respects and acknowledges the values of patient- and family-centred care."
        },
        {
            "number": "LO3.",
            "description": "Implement effective professional and interprofessional written, verbal, non-verbal and digital communication skills to inform, educate and empower individuals, their family and colleagues towards safe and expected healthcare outcome."
        },
        {
            "number": "LO4.",
            "description": "Demonstrate the pharmacological principles including safe use of medicines and monitoring of individual response under the direct supervision of the registered nurse."
        },
        {
            "number": "LO5.",
            "description": "Develop interprofessional practice skills in conflict management and collaborate leadership and enhance skills in role clarification, team functioning, interprofessional communication, client centred care."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Medication Calculation Assessment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> Non graded pass/fail </dd>",
            "due_date": "<dd><p> 23/07/2024 1:00 pm</p>\n<p>\n</p><p>Assessment due on the 23rd of July. Students to upload the completed Medication safety certificate via the Blackboard assessment link.</p></dd>",
            "learning_objectives": "L01, L04, L05",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment consists of one online medication quiz which will examine and extend your preparedness for clinical placement.</p>\n<p><strong>Medication Safety exam</strong> - This part will examine your knowledge regarding medication safety which includes medication calculations and the “rights” of medication administration. The link to the medication safety exams will be available in the companion course site:</p>\n<ul>\n<li><strong>Medication Calculations:</strong> Customised assessment #6</li>\n<li>Download the certificate at the end of the quiz and upload certificate via assessment link in Blackboard</li>\n</ul>\n<p>Students are required to achieve 100% accuracy for the nominated medication safety exam. While there is the opportunity for ongoing repeat attempts at the exams, <strong>100% accuracy must be achieved.</strong></p>\n<p>Any students unable to achieve 100% accuracy by the due date will not proceed to clinical placement. Students unsuccessful in the assessment attempt will be informed via their UQ email of the requirements and due date of the second attempt. Students are to refer to the course Blackboard site Assessment tab for additional details. </p>\n<p><strong> Students must undertake and be successful in their medication safety exam. This must be completed prior to undertaking medication administration.</strong></p>\n<p>Medication administration under direct RN supervision is an expected scope of practice for all undergraduate students.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students to upload the completed Medication Safety certificate via the Blackboard assessment link.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Clinical Placement completion",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p>Clinical placement may be scheduled outside of the semester.</p>\n<p>Due dates are dependent on allocated clinical placement dates. </p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Activity/ Performance",
            "category": "Placement, Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The aim of this assessment is to leverage the clinical placement experience as a platform for integrating theoretical knowledge into practical applications. Students will be tasked with demonstrating the progression of their clinical knowledge, skills, and proficiency in alignment with their current year of study. Throughout the clinical placement, the emphasis will be on students demonstrating adherence to professional standards and conduct expected of a registered nurse, while staying within the confines of their specified scope of practice.</p>\n<ul>\n<li>Midpoint (Formative) ANSAT: To be completed at the midpoint (50% of clinical placement completed) and documented in Myprogress (ePad).</li>\n<li>Final (Summative) ANSAT: To be completed on the final two clinical shifts of the clinical placement and documented in Myprogress (ePad).</li>\n<li>Timesheets to be completed in Myprogress; ePad at the conclusion of each shift.</li>\n</ul>\n<p><br/></p>\n<p><em>Formative ANSAT:</em></p>\n<ul>\n<li>Midpoint (Formative) ANSAT: To be completed at the midpoint (50% of clinical placement completed) and documented in Myprogress (ePad).</li>\n<li>You must receive a score of 3 or above on every criteria (failure to do so will result in a learning plan being implemented).</li>\n<li>You must show evidence/reflection of achieving your learning goals OR evidence of amended learning goals.</li>\n<li>New learning goals need to be formulated during this meeting.</li>\n</ul>\n<p><br/></p>\n<p><em>Summative ANSAT:</em></p>\n<ul>\n<li>Completion due within the final two rostered shifts of clinical placement.</li>\n<li>To be completed by a UQ Clinical Supervisor, Preceptor, Nurse Educator or Buddy RN via ePAD.</li>\n<li>You must receive a score of 3 or above on every criterion (failure to do so will result in a fail grade for the course).</li>\n<li>You must show evidence/reflection of achieving your learning goals OR evidence of amended learning goals.</li>\n</ul>\n<p><br/></p>\n<p><em>Timesheet:</em></p>\n<ul>\n<li>Students enrolled in this course are required to complete 360 hours clinical placement.</li>\n<li>The Clinical Practicum Timesheet must be signed off by the student's Registered Nurse Preceptor / UQ Practice Educator every shift via a declaration in MyProgress ePAD. From your MyProgress home page, you can click ‘Timesheet’. The timesheet appears for you to complete; placement, location, activity type, date, duration and enter a name into ‘approved by’. Students must ensure they choose the correct location and type of shifts from the dropdown boxes. Once you have completed the form, hand your device to your Registered Nurse Preceptor / UQ Practice Educator. They will officially verify your entry by choosing the ‘Approved by’ section and entering their name and work email address. Once completed, click \"submit\". Information on ePAD will be provided to students prior to placement. </li>\n</ul>\n<p><br/></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students are to submit clinical hours, formative and summative ANSAT via ePAD.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Exam - during Exam Period (Central)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> Non-graded pass/fail </dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>2/11/2024 - 16/11/2024</p>\n<p>\n</p><p>Exam is a multiple choice exam on Inspera</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The aim of this assessment is to assess student ability to prioritise clinical care and articulate an understanding of pathophysiological responses, accurately assess and implement evidence-based interventions in the context of clinical deterioration.</p>\n<p><br/></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>Exams submitted after the end of the submission time will incur a <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/requesting-late-penalty-exemption-online-exam\">late penalty</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Clinical Placement </strong><br><p>Students undertaking NUMW3214 are required to complete 320 hours of clinical placement. Clinical placement allocations are accessible via Inplace.</p>\n<p><br/></p>\n<p>The primary objective of the clinical placement is to provide students with hands-on experience in a real-world healthcare setting. This experience allows students to apply the theoretical knowledge they have gained on campus to practical situations, develop clinical skills, and gain insights into the day-to-day operations of healthcare facilities.</p>\n<p>Students can complete their clinical placements in various settings, such as hospitals, clinics, and community health centres.</p>\n<p>During the clinical practice phase, students engage in supervised practice, working under the guidance of experienced healthcare professionals. They participate in patient care activities such as taking medical histories, conducting physical exams, administering medications, and assisting with procedures. Students also join patient rounds, team meetings, and case discussions. This phase focuses on skill development, allowing students to practice clinical skills, including injections, wound care, catheter insertion, and other procedures relevant to their field. Students also develop their communication skills through patient interactions, team collaboration, and documentation. Reflective practice is an integral part of this phase, with students maintaining a reflective journal to document their daily experiences, challenges, and learning outcomes. Regular feedback sessions with supervisors help discuss progress and areas for improvement.</p>\n<p>The evaluation and feedback phase includes performance assessment based on clinical competencies, professional behaviour, and adherence to ethical standards. Assessment tools such as clinical evaluation forms, direct observation, and patient feedback are used.</p>\n<p>Upon completion of the clinical placement, students are expected to achieve several learning outcomes. They will integrate theoretical knowledge with clinical practice and understand the healthcare environment and the roles of various healthcare professionals. Students will demonstrate proficiency in clinical skills specific to their field and enhance their communication, teamwork, and critical thinking skills. Additionally, they will exhibit professionalism and ethical behaviour in clinical practice, adopt an empathy and patient-centred care approach, and gain confidence in their clinical abilities and decision-making.</p>\n<p>Note: placement may be scheduled outside of the semester.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Clinical Placement </strong>",
            "topic_description": "Clinical Placement Students undertaking NUMW3214 are required to complete 320 hours of clinical placement. Clinical placement allocations are accessible via Inplace. The primary objective of the clinical placement is to provide students with hands-on experience in a real-world healthcare setting. This experience allows students to apply the theoretical knowledge they have gained on campus to practical situations, develop clinical skills, and gain insights into the day-to-day operations of healthcare facilities. Students can complete their clinical placements in various settings, such as hospitals, clinics, and community health centres. During the clinical practice phase, students engage in supervised practice, working under the guidance of experienced healthcare professionals. They participate in patient care activities such as taking medical histories, conducting physical exams, administering medications, and assisting with procedures. Students also join patient rounds, team meetings, and case discussions. This phase focuses on skill development, allowing students to practice clinical skills, including injections, wound care, catheter insertion, and other procedures relevant to their field. Students also develop their communication skills through patient interactions, team collaboration, and documentation. Reflective practice is an integral part of this phase, with students maintaining a reflective journal to document their daily experiences, challenges, and learning outcomes. Regular feedback sessions with supervisors help discuss progress and areas for improvement. The evaluation and feedback phase includes performance assessment based on clinical competencies, professional behaviour, and adherence to ethical standards. Assessment tools such as clinical evaluation forms, direct observation, and patient feedback are used. Upon completion of the clinical placement, students are expected to achieve several learning outcomes. They will integrate theoretical knowledge with clinical practice and understand the healthcare environment and the roles of various healthcare professionals. Students will demonstrate proficiency in clinical skills specific to their field and enhance their communication, teamwork, and critical thinking skills. Additionally, they will exhibit professionalism and ethical behaviour in clinical practice, adopt an empathy and patient-centred care approach, and gain confidence in their clinical abilities and decision-making. Note: placement may be scheduled outside of the semester.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Online Module Series of 4</strong><br><p>The primary objective the online modules is to supplement and enhance students' understanding of clinical concepts and practices. These modules offer flexible and accessible learning resources that reinforce classroom teaching and clinical experiences, ensuring a comprehensive educational experience. The online modules provide students with the flexibility to learn at their own pace and on their own schedule. This is particularly beneficial for students with varied commitments, allowing them to balance their studies with clinical placements, part-time work, and personal responsibilities. The online modules include interactive elements such as quizzes, videos, and case studies. These features engage students actively in their learning process, helping to reinforce knowledge and improve retention.</p></br></p><p><strong>Learning outcomes:</strong> L01, L05</p></div></td>",
            "topic_title": "<strong>Online Module Series of 4</strong>",
            "topic_description": "Online Module Series of 4 The primary objective the online modules is to supplement and enhance students' understanding of clinical concepts and practices. These modules offer flexible and accessible learning resources that reinforce classroom teaching and clinical experiences, ensuring a comprehensive educational experience. The online modules provide students with the flexibility to learn at their own pace and on their own schedule. This is particularly beneficial for students with varied commitments, allowing them to balance their studies with clinical placements, part-time work, and personal responsibilities. The online modules include interactive elements such as quizzes, videos, and case studies. These features engage students actively in their learning process, helping to reinforce knowledge and improve retention.",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        },
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Orientation/Clinical Lecture</strong><br><p>Orientation to the course inclusive of assessment and expectations. Student are advised to review the orientation lecture, this session will provide you valuable information to understand your course requirements and commitments.</p>\n<p>The lecture is designed to provide students with all relevant information about the course.</p>\n<p>During the orientation lecture, several important topics will be covered, including:</p>\n<p>- An introduction to the course objectives and structure.</p>\n<p>- An overview of the key topics.</p>\n<p>- An explanation of assessments and grading criteria.</p>\n<p>- A discussion on course policies and expectations.</p></br></p><p><strong>Learning outcomes:</strong> L01, L05</p></div></td>",
            "topic_title": "<strong>Orientation/Clinical Lecture</strong>",
            "topic_description": "Orientation/Clinical Lecture Orientation to the course inclusive of assessment and expectations. Student are advised to review the orientation lecture, this session will provide you valuable information to understand your course requirements and commitments. The lecture is designed to provide students with all relevant information about the course. During the orientation lecture, several important topics will be covered, including: - An introduction to the course objectives and structure. - An overview of the key topics. - An explanation of assessments and grading criteria. - A discussion on course policies and expectations.",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Clinical Lecture</strong><br><p>The primary objective of the clinical lecture is to enhance students' understanding of specific nursing topics through detailed presentations and discussions. This learning activity aims to deepen theoretical knowledge, clarify complex concepts, and relate them to practical clinical scenarios.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Clinical Lecture</strong>",
            "topic_description": "Clinical Lecture The primary objective of the clinical lecture is to enhance students' understanding of specific nursing topics through detailed presentations and discussions. This learning activity aims to deepen theoretical knowledge, clarify complex concepts, and relate them to practical clinical scenarios.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Transition to Graduate Nursing Practice Workshop</strong><br><p>This workshop will help you develop knowledge and skills to support self-care, and personal and professional wellbeing during the transition to graduate nursing practice.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Transition to Graduate Nursing Practice Workshop</strong>",
            "topic_description": "Transition to Graduate Nursing Practice Workshop This workshop will help you develop knowledge and skills to support self-care, and personal and professional wellbeing during the transition to graduate nursing practice.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}