{
    "course_title": "Creating Inclusive Communities:  OT Practices for Promoting Inclusion (of People with Disability)",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/OCTY7834-61762-7460",
    "full_course_code": "OCTY7834-61762-7460",
    "course_code": "OCTY7834",
    "class_code": "61762",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Compare and contrast different frameworks of health and implications for OT practice."
        },
        {
            "number": "LO2.",
            "description": "Analyse the person and their relationship to the environment using existing OT and health-related models and frameworks."
        },
        {
            "number": "LO3.",
            "description": "Critique the political, legislative and social contexts to identify mechanisms for discrimination and inclusion."
        },
        {
            "number": "LO4.",
            "description": "Apply effective communication strategies to gather and summarise older peoples/people with disabilities perspectives and lived experiences of environmental facilitators and barriers to inclusion in the community."
        },
        {
            "number": "LO5.",
            "description": "Evaluate the impacts of specific environmental factors on community inclusion for older people and people with disabilities."
        },
        {
            "number": "LO6.",
            "description": "Use objective data and technical references to carry out an access audit of a physical or virtual environment."
        },
        {
            "number": "LO7.",
            "description": "Evaluate a range of services and resources that promote inclusion for older people and people with disabilities in the community."
        },
        {
            "number": "LO8.",
            "description": "Use relevant legislation, services and resources within the OT practice process to limit discrimination and promote the inclusion of older people and people with disabilities."
        },
        {
            "number": "LO9.",
            "description": "Create an inclusive learning community that supports own and peer/colleague knowledge acquisition and skill development."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "SHRS NDIS & Private Practice Online Quiz",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> Pass/Fail (MUST PASS) </dd>",
            "due_date": "<dd><p> 30/07/2024 - 12/08/2024</p></dd>",
            "learning_objectives": "L01, L03",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This is an online quiz provided in the Learn.UQ Blackboard platform that should ideally be completed one week after finishing the SHRS NDIS and Private Practice online modules. The quiz can be completed anytime between <strong>5:00pm Tuesday the 30th of July and 5:00pm on Monday the 12th of August 2024</strong>. It will include <strong>20 randomised questions</strong> (10 from NDIS and 10 from Private Practice content) and will need to be <strong>completed within 30 minutes of opening the quiz</strong>. The <strong>pass rate is 80% </strong>and students may have up to <strong>three (3) attempts</strong> to reach this percentage correct to pass. </p>\n<p><strong>Details, Marking and Feedback: </strong>The details of each of the SHRS NDIS &amp; Private Practice Online Quiz can be found on Learn.UQ (Blackboard). Feedback (i.e., scores) for the online quiz will be provided immediately back to students via the relevant assessment platform and final pass/fail result will be available through grade centre once all submissions are finalised.  </p>\n<p><strong>Generative AI (ChatGPT): </strong>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies answer questions is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<p><strong>Criteria &amp; Marking: </strong>UQ Students: Please access the profile from <a href=\"https://learn.uq.edu.au/\">Learn.UQ</a> or <a href=\"https://www.sinet.uq.edu.au/\">mySI-net</a> to access marking criteria held in this profile.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission to occur online via Learn.UQ (Blackboard).</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Access Audit Report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>35% NOT MUST PASS </dd>",
            "due_date": "<dd><p> 13/08/2024 - 11/09/2024</p>\n<p>\n</p><p>Please note submissions will be required as per dates outlined in the Task Description, Hurdle Requirements, and the Course Timetable.</p></dd>",
            "learning_objectives": "L02, L05, L06, L08, L09",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Access Audit Assignment will be completed in small <strong>pairs/</strong><strong>groups (3)</strong><strong> </strong>(where necessary) and will require students to compile and submit a report based on an access audit conducted on a physical (built) environment on the St Lucia campus (i.e., Private/Public Sites and Services that are accessible by the general public) to which students are assigned. Students who participate in the accessibility audit of a physical environment will utilise a wheelchair as part of their audit to gain perspectives of the environment from the view of people who use wheelchairs.</p>\n<p>The Assignment Preparation, Access Audit, and associated Report Submission dates are as follows:</p>\n<ul>\n<li><strong>Access Audit Preparation (ALL STUDENTS):</strong> Tuesday 13th August 2024 @ 2:00pm (<strong><em>Compulsory attendance</em></strong>)   </li>\n<li><strong>Access Audit Date: </strong>Monday, 19th of August 2024 from 1:00 - 5:00pm +<strong> Report Submission Date: </strong>Monday,<strong> </strong>9th of September 2024 @ 2:00pm</li>\n</ul>\n<p> <strong>Pass/Fail Requirements (Hurdles): </strong>To successfully be able to complete this assessment all students must:</p>\n<ol>\n<li><strong><em>Individual Hurdle - Access Audit Preparation:</em></strong> Attend a compulsory Access Audit preparation session during Week 4 Tuesday workshop (Ekka Public Holiday on Wednesday). If students are unable to attend this compulsory session due to medical or extenuating circumstances, they are required to complete the <strong>SHRS Absentee Form</strong>. The completed form along with the <strong>required evidence </strong>must be emailed to the School of Health and Rehabilitation Sciences Student and Academic Support Unit (SASU - enquiries.shrs@uq.edu.au) within <strong>three calendar days of the scheduled activity</strong>. The SHRS Absentee Form can be found on the relevant Course Blackboard site. If the absence is due to a non-permissible circumstance (as per the SHRS Absentee Form), then attendance at the session is expected. Please note, it is expected that students will notify their course coordinator (chloe.bryant@uq.edu.au) prior to or on the day of the session and as soon as is possible to advise of the absence, in addition to submitting the above information to SASU. <strong>Implications for lack of attendance - </strong> If a students are not able to attend this session an additional summary activity will be required to ensure that they have engaged with the information related to safety, wheelchair use, and the assessment in preparation for participating in the access audit. <strong>Relevant students will not be able to participate in the access audit until this summary activity has been completed in full. </strong></li>\n<li><strong><em>Individual Hurdle - Wheelchair Safety Quiz: </em></strong>Complete the Wheelchair Safety Quiz online by no later than midday (12pm) on the day that the access audit is due to be completed (i.e., Monday, 19th of August 2024). Multiple attempts are available for this quiz, however, students must achieve 100% to pass this quiz and to be permitted to attend/participate in the access audit.</li>\n<li><strong><em>Individual Hurdle - Access Audit: </em></strong>Attend a compulsory access audit practical with pair/group members on relevant chosen access audit date. If students are unable to attend this compulsory access audit due to medical or extenuating circumstances, they are required to complete the <strong>SHRS Absentee Form</strong>. The completed form along with the required evidence must be emailed to the School of Health and Rehabilitation Sciences Student and Academic Support Unit (SASU - enquiries.shrs@uq.edu.au) within <strong>three calendar days of the scheduled activity.</strong> The SHRS Absentee Form can be found on the relevant Course Blackboard site. If the absence is due to a non-permissible circumstance (as per the SHRS Absentee Form), then attendance at the access audit practical is expected. Please note, it is expected that students will notify their course coordinator (chloe.bryant@uq.edu.au) prior to or on the day of the practical and as soon as is possible to advise of the absence, in addition to submitting the above information to SASU. <strong>Implications for lack of attendance</strong> - If students are not able to attend the scheduled access audit practical then the students will be required to attend an alternative scheduled access audit OR complete an alternative activity to ensure that they have participated in an access audit and that necessary audit related information has been collected for the completion of the report.</li>\n<li><strong><em>Individual Hurdle - Peer Evaluation (Buddycheck): </em></strong>Within 48 hours of the Access Audit Report submission date/time (i.e., on Wednesday 11th September 2024 @ 2:00pm), all students are expected to complete a Peer Evaluation via Buddycheck for each member of their pair/group, including themselves, to record the contributions of each of the group members to the assessment. This Peer Evaluation is formative to provide students with feedback about their contributions to the group assessment.</li>\n</ol>\n<p><strong>Peer Evaluation (Buddycheck):</strong> Formative peer evaluation is completed for the <em>Access Audit Report </em>using Buddycheck. Buddycheck is a peer evaluation tool, that calculates student contributions to a group project and enables peer feedback. Information about Buddycheck can be accessed here - <a href=\"https://web.library.uq.edu.au/library-services/it/learnuq-blackboard-help/learnuq-assessment/buddycheck\">https://web.library.uq.edu.au/library-services/it/learnuq-blackboard-help/learnuq-assessment/buddycheck</a>. Using student ratings and feedback, Buddycheck calculates a Peer Assessment Factor (PAF) which can be applied to the group assessment mark. This PAF is a percentage which can be multiplied by the group mark to calculate your individual final PAF-adjusted assessment mark. For example, if a group received 25/30 for an assessment and then one member of the group received a 0.9 (90%) for the PAF that student would receive 25 x 0.90 = 22.5 as their final PAF-adjusted assessment mark. Student marks following attribution of the PAF are unable to be adjusted to fall below the pass mark for that item of assessment, or above the maximum mark for that item of assessment (i.e., marks can only be within 55% and 100%) on the basis of the PAF.</p>\n<p>A fail on the individual hurdles above may result in the student/s being given an additional activity in lieu of missed or incomplete work or failing the corresponding assessment item (i.e. if fail attending the Access Audit preparation session, participating Access Audit, or completing of the formative Buddycheck may result in failing the Access Audit Report). </p>\n<p><strong>Details, Marking and Feedback: </strong>The details of each of the Access Audit Report can be found on Learn.UQ (Blackboard). Feedback for the Access Audit Report will be provided back to students via the relevant assessment platform and final marks for the assignment will be available through grade centre once the marking has been completed.  </p>\n<p><strong>Generative AI (ChatGPT): </strong>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<p><strong>Criteria &amp; Marking: </strong>UQ Students: Please access the profile from <a href=\"https://learn.uq.edu.au/\">Learn.UQ</a> or <a href=\"https://www.sinet.uq.edu.au/\">mySI-net</a> to access marking criteria held in this profile.</p>\n<p><strong>Use of Reports:</strong> In the spirit of \"Creating Inclusive Communities\" access audit reports produced in this course may be de-identified (of students details) and submitted to The University of  Queensland Disability Inclusion Group for use in making recommendations to facilitate improved access and inclusion on UQ campuses.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Access Audit Reports will be submitted via an online platform (TurnItIn). Please remember when you submit your assignment online to keep an evidence record (e.g. receipt/screenshot) as proof of the details of your submission.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Case Study Assignment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>35% MUST PASS </dd>",
            "due_date": "<dd><p> 21/10/2024 2:00 pm</p></dd>",
            "learning_objectives": "L02, L03, L04, L05, L07, L08, L09",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>In <strong>pairs or small groups</strong> (as necessary), students will source an an older person or a person with disability to interview (interviewee). Students will complete the following tasks:</p>\n<ul>\n<li>Establish contact with the interviewee to gather information about them and their context.</li>\n<li>Devise an interview schedule for the interview, become familiar with CHIEF assessment to be conducted, contact the interviewee and organise convenient time and place to conduct the interview in Weeks 8 - 9. Interviews may be conducted face to face or online via zoom.</li>\n<li>After the interview is completed and you have drafted a first copy of your assignment, you have the option to attend a 30 minute debrief/discussion about the interview/case study and your preliminary thoughts for the services/resources of the identified relevant area of participation (Week 11).</li>\n<li>Write and submit and assignment report detailing the environmental barriers and facilitators to this interviewee's inclusion in the community, including housing and participation in employment/productivity, education, leisure and accessing community services and activities (including transport), as relevant to the interviewee. This report will also include a review of two services/resources that the interviewee may engage with or use to overcome barriers in one of the areas of participation (i.e.,. housing, employment, education, leisure, or accessing the community/using transport) and an associated reflection on the experience and learnings.</li>\n</ul>\n<p><strong>Peer Evaluation (Buddycheck):</strong> Peer Evaluation is completed for the <em>Case Study Assignment</em> using Buddycheck. Buddycheck is a peer evaluation tool, that calculates student contributions to a group project and enables peer feedback. Information about Buddycheck can be accessed here - <a href=\"https://web.library.uq.edu.au/library-services/it/learnuq-blackboard-help/learnuq-assessment/buddycheck\">https://web.library.uq.edu.au/library-services/it/learnuq-blackboard-help/learnuq-assessment/buddycheck</a>.</p>\n<p>Using student ratings and feedback, Buddycheck calculates a Peer Assessment Factor (PAF) which is then applied to the group assessment mark. This PAF is a percentage which is multiplied by the group mark to calculate your individual final PAF-adjusted assessment mark. For example, if a group received 25/30 for an assessment and then one member of the group received a 0.9 (90%) for the PAF that student would receive 25 x 0.90 = 22.5 as their final PAF-adjusted assessment mark. Student marks following attribution of the PAF are unable to be adjusted to fall below the pass mark for that item of assessment, or above the maximum mark for that item of assessment (i.e., marks can only be within 55% and 100%) on the basis of the PAF.</p>\n<p>This Peer Evaluation is summative and will be used to calculate to the students final grade for the Case Study Assignment. If a student does not complete the Peer Evaluation the penalty for non-completion is inherent in the Buddycheck system. This means that failure to complete the allocation may impact on your overall mark for the Case Study Assignment as your perception of your contribution to the assessment will be absent from the overall calculation of contribution to the group work.</p>\n<p><strong>Details, Marking and Feedback: </strong>The details of each of the Case Study Assignment can be found on Learn.UQ (Blackboard). Feedback for the Case Study Assignment will be provided back to students via the relevant assessment platform and final marks for the assignment will be available through grade centre once the marking has been completed.  </p>\n<p><strong>Generative AI (ChatGPT): </strong>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<p><strong>Criteria &amp; Marking: </strong>UQ Students: Please access the profile from <a href=\"https://learn.uq.edu.au/\">Learn.UQ</a> or <a href=\"https://www.sinet.uq.edu.au/\">mySI-net</a> to access marking criteria held in this profile.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The Case Study Assignment, the interview schedule used in the interview (i.e., the questions asked - do not required interviewee responses), and the completed CHIEF assessment (i.e., filled out) will be submitted online via TurnItIn. Please remember when you submit your assignment online to keep an evidence record (e.g. receipt/screenshot) as proof of the details of your submission. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "End of Semester Exam (Inspera)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30% MUST PASS </dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>2/11/2024 - 16/11/2024</p>\n<p>\n</p><p>This End of Semester Examination will be a closed book Inspera exam conducted in-person on the St Lucia campus.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L08, L09",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>A written exam, provided and submitted online via Inspera, comprised of short answer and short essay questions covering content provided and gained through all learning activities (self-directed, workshops,  intensives etc.), assessments and assessment-related activities (including case study debrief with supervisor) completed between weeks 1 - 13. The questions will also require students to reflect on their learnings and experiences associated with the access audit report and the experiences of their interviewee from case study assignment. This exam will be scheduled in the End of Semester exam period and the relevant date and time scheduled will be advised on the end of semester examination timetable. This assessment task is to be completed in-person on the St Lucia campus unless otherwise specified. </p>\n<p><strong>Generative AI (ChatGPT): </strong>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<p><strong>Criteria &amp; Marking: </strong>UQ Students: Please access the profile from <a href=\"https://learn.uq.edu.au/\">Learn.UQ</a> or <a href=\"https://www.sinet.uq.edu.au/\">mySI-net</a> to access marking criteria held in this profile. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Students will complete the exam on their own device via Inspera with the use of Safe Exam Browser.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom O-week To Week 13",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Self directed learning in preparation for workshop</strong><br><p>Self directed learning activities in preparation for workshops. This will include watching short pre-recorded lectures and media, researching online, reviewing relevant readings, and participating in online interactive activities.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Self directed learning in preparation for workshop</strong>",
            "topic_description": "Self directed learning in preparation for workshop Self directed learning activities in preparation for workshops. This will include watching short pre-recorded lectures and media, researching online, reviewing relevant readings, and participating in online interactive activities.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 2",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Monday and Tuesday Intensive Workshops</strong><br><p>Intensive workshops (3 hours on Monday and Tuesday) in Weeks 1 and 2 are provided to prepare students for the following weeks of OCTY7834 content. These cover frameworks of health and understanding how this influences practice, critical thinking, occupational justice, working with communities and populations and an introduction to the National Disability Insurance Scheme (NDIS) and Private Practice.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05, L08, L09</p></div></td>",
            "topic_title": "<strong>Monday and Tuesday Intensive Workshops</strong>",
            "topic_description": "Monday and Tuesday Intensive Workshops Intensive workshops (3 hours on Monday and Tuesday) in Weeks 1 and 2 are provided to prepare students for the following weeks of OCTY7834 content. These cover frameworks of health and understanding how this influences practice, critical thinking, occupational justice, working with communities and populations and an introduction to the National Disability Insurance Scheme (NDIS) and Private Practice.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05",
                "L08",
                "L09"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Wednesday Workshops</strong><br><p>Weekly workshops will examine the current state of disability rights and discrimination in Australia and then explore how the environment, including the built environment, attitudes, services, systems and policies facilitate or impede participation and inclusion in society (particularly in the areas of housing, education, employment, transport, and leisure). These sessions will then consider the clinical applicability of these for OT practice, with particular consideration given to service availability/implementation under the National Disability Insurance Scheme (NDIS) and My Aged Care. Please note the compulsory attendance for the <strong>Week 4</strong> <strong>Tuesday</strong> workshop (scheduled on Tuesday due to Ekka Public Holiday). This is to ensure that students receive critical content and training associated with the completion of the Access Audit Report. Please also note that these workshops are not scheduled for Weeks 11 or 12 to allow for Case Study Assignment activities.</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Wednesday Workshops</strong>",
            "topic_description": "Wednesday Workshops Weekly workshops will examine the current state of disability rights and discrimination in Australia and then explore how the environment, including the built environment, attitudes, services, systems and policies facilitate or impede participation and inclusion in society (particularly in the areas of housing, education, employment, transport, and leisure). These sessions will then consider the clinical applicability of these for OT practice, with particular consideration given to service availability/implementation under the National Disability Insurance Scheme (NDIS) and My Aged Care. Please note the compulsory attendance for the Week 4 Tuesday workshop (scheduled on Tuesday due to Ekka Public Holiday). This is to ensure that students receive critical content and training associated with the completion of the Access Audit Report. Please also note that these workshops are not scheduled for Weeks 11 or 12 to allow for Case Study Assignment activities.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 3",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>SHRS Online Modules - NDIS &amp; Private Practice</strong><br><p>As part of the course intensive and independent study in Weeks 2 &amp; 3 students will complete three online modules which introduce students to the NDIS and Private Practice. The modules are 1) Introduction to the NDIS, 2) NDIS Module 1 - Understanding the participant's journey through the NDIS, and 3) Private Practice Module 1 - Introduction to Private Practice. These modules have content, videos, and activities that will support students to expand their knowledge for these two practice contexts.</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L07</p></div></td>",
            "topic_title": "<strong>SHRS Online Modules - NDIS &amp; Private Practice</strong>",
            "topic_description": "SHRS Online Modules - NDIS & Private Practice As part of the course intensive and independent study in Weeks 2 & 3 students will complete three online modules which introduce students to the NDIS and Private Practice. The modules are 1) Introduction to the NDIS, 2) NDIS Module 1 - Understanding the participant's journey through the NDIS, and 3) Private Practice Module 1 - Introduction to Private Practice. These modules have content, videos, and activities that will support students to expand their knowledge for these two practice contexts.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L07"
            ]
        },
        {
            "learning_period": "Week 5(19 Aug - 25 Aug)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Access Audit Activity (Associated with Access Audit Report)</strong><br><p>Students must attend a compulsory access audit practical with group members on Monday, 19th of August 2024 from 1:00pm - 5:00pm. In this practical students will undertake an access audit of an assigned UQ building against the Australian Standards and using a wheelchair within the site consider the implications of the buildings specifications and features for people who use a wheelchair and/or a mobility device/aid.   </p></br></p><p><strong>Learning outcomes:</strong> L02, L05, L06, L08, L09</p></div></td>",
            "topic_title": "<strong>Access Audit Activity (Associated with Access Audit Report)</strong>",
            "topic_description": "Access Audit Activity (Associated with Access Audit Report) Students must attend a compulsory access audit practical with group members on Monday, 19th of August 2024 from 1:00pm - 5:00pm. In this practical students will undertake an access audit of an assigned UQ building against the Australian Standards and using a wheelchair within the site consider the implications of the buildings specifications and features for people who use a wheelchair and/or a mobility device/aid.",
            "learning_outcomes": [
                "L02",
                "L05",
                "L06",
                "L08",
                "L09"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 8 To Week 9",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Service User Interview (Associated with Case Study Assignment)</strong><br/><p>Students in pairs will arrange and conduct an interview and complete a CHIEF assessment with a service user to understand their experiences of the environment and impacts on community inclusion and participation.</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L07, L08, L09</p></div></td>",
            "topic_title": "<strong>Service User Interview (Associated with Case Study Assignment)</strong>",
            "topic_description": "Service User Interview (Associated with Case Study Assignment) Students in pairs will arrange and conduct an interview and complete a CHIEF assessment with a service user to understand their experiences of the environment and impacts on community inclusion and participation.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L07",
                "L08",
                "L09"
            ]
        }
    ]
}