{
    "course_title": "Creating Inclusive Communities to Promote Occupational Performance & Participation",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/OCTY2207-62614-7460",
    "full_course_code": "OCTY2207-62614-7460",
    "course_code": "OCTY2207",
    "class_code": "62614",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Critique the political, legislative, and social contexts to identify mechanisms for discrimination and inclusion."
        },
        {
            "number": "LO2.",
            "description": "Evaluate the impacts of specific environmental factors on community inclusion for older people and people with disabilities."
        },
        {
            "number": "LO3.",
            "description": "Use objective data and technical references to carry out an access audit of a physical or virtual environment."
        },
        {
            "number": "LO4.",
            "description": "Identify a range of services and resources that promote inclusion for older people and people with disabilities in the community."
        },
        {
            "number": "LO5.",
            "description": "Use relevant legislation, services, and resources within the OT practice process to limit discrimination and promote the inclusion of older people and people with disabilities."
        },
        {
            "number": "LO6.",
            "description": "Create an inclusive learning community that supports own and peer/colleague knowledge acquisition and skill development."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Theory to Practice Exercises",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>60% (MUST PASS) </dd>",
            "due_date": "<dd><p>Please note submissions will  be required as per dates outlined in the Task Description, Hurdle Requirements, and the Course Timetable. 9/08/2024 - 25/10/2024</p>\n<p>\n</p><p>Please note submissions will be required as per dates outlined in the Task Description, Hurdle Requirements, and the Course Timetable.</p></dd>",
            "learning_objectives": null,
            "mode": "Activity/ Performance, Written",
            "category": "Tutorial/ Problem Set",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>There are 7 practical workshop sessions scheduled across the semester (Weeks 1, 3, 5, 7, 9, 11, &amp; 13). Associated with each workshop and the associated self-directed learning are \"Theory to Practice\" Exercises that students will complete and submit for marking as outlined in the points summarised below.</p>\n<p><strong>Paired/Group Theory to Practice Exercises:</strong> The first six (6) exercises are paired together as three (3) submissions and will be completed within<strong> pairs/small groups (3) </strong>(where necessary). These exercises are to be submitted within one (1) week after the last relevant workshop and at latest by the Friday at 2:00pm or 4:00pm (dependent on workshop group) in Weeks 4, 8, and 12 respectively. They can be completed by the pair/group at any mutually convenient time during this period, however, once commenced the pair/group will have 120 minutes (2 hours) to compile, finalise, and submit responses.</p>\n<p><strong>Individual Theory to Practice Exercise: </strong>The final exercise is to be submitted individually and will be completed in lieu of the Week 13 workshop, face-to-face on the St Lucia campus. The duration will be 150 minutes (2.5 hours) and it will be completed under exam conditions. Please note that for all exercises late submissions will not be accepted. </p>\n<p>These Theory to Practice exercises are completed and weighted as follows:</p>\n<ol>\n<li>Week 4 - Workshops 1 &amp; 2 - Completed by Pair/Group - Weighting 10% - Due Date 16th August 2024</li>\n<li>Week 8 - Workshops 3 &amp; 4 - Completed by Pair/Group - Weighting 10% - Due Date 13th September 2024</li>\n<li>Week 12 - Workshops 5 &amp; 6 - Completed by Pair/Group - Weighting 10% - Due Date 18th October 2024</li>\n<li>Week 13 - Workshops 1 - 7 - Completed Individually (MUST PASS) - Weighting 30% - Due Date 25th October 2024</li>\n</ol>\n<p><strong><em>Students MUST PASS the Individual Tutorial Exercise (i.e., Week 13, achieve 55% of 30 – 16.5%) and the assessment overall (i.e., achieve 55% of 50 - 33%) but DO NOT need to pass every single paired/group submitted tutorial exercise.</em></strong></p>\n<p><strong>Individual Hurdle:</strong> By Wednesday, 21st of August 2024 @ 12:00pm AND Monday, 21st of October 2024 @ 12:00pm, all students are expected to have completed a Peer Evaluation via Buddycheck for each member of their pair/group, including themselves, to record the contributions of each of the members to the assessment. The first Peer Evaluation is formative to provide students with feedback about their contributions to the pair/group assessment, the second is summative and will be used in the final calculation of marks for this assessment item.</p>\n<p><strong>Peer Evaluation (Buddycheck): </strong>Peer Evaluation is completed for the Paired/Group submitted Theory to Practice exercises using Buddycheck. Buddycheck is a peer evaluation tool, that calculates student contributions to a group project and enables peer feedback. Information about Buddycheck can be accessed here - <a href=\"https://web.library.uq.edu.au/library-services/it/learnuq-blackboard-help/learnuq-assessment/buddycheck\">https://web.library.uq.edu.au/library-services/it/learnuq-blackboard-help/learnuq-assessment/buddycheck</a>. Using student ratings and feedback, Buddycheck calculates a Peer Assessment Factor (PAF) which is then applied to the group assessment mark. This PAF is a percentage which is multiplied by the group mark to calculate your individual final PAF-adjusted assessment mark. For example, if a group received 25/30 for an assessment and then one member of the group received a 0.9 (90%) for the PAF that student would receive 25 x 0.90 = 22.5 as their final PAF-adjusted assessment mark. Student marks following attribution of the PAF are unable to be adjusted to fall below the pass mark for that item of assessment, or above the maximum mark for that item of assessment (i.e., marks can only be within 55% and 100%) on the basis of the PAF.</p>\n<p><strong><em>For the Theory to Practice Exercises one PAF will be applied to all three (3) weighted Pair/Group submitted exercises.</em></strong></p>\n<p>If students do not complete the individual hurdle (i.e., Peer Evaluations) then no additional activity will be requested. Students who do not attend to the completion of these peer evaluations by the relevant due dates forfeit the opportunity to rate/comment on the contributions of all group members (i.e., peer/s and themselves). The penalty for non-completion is inherent in the Buddycheck system. This means that failure to complete the allocation may impact on your overall mark for the Theory to Practice exercises as your perception of your contribution to the assessment will be absent from the overall calculation of contribution to the group work.</p>\n<p><strong>Details, Marking, and Feedback: </strong>The details of each of the Theory to Practice exercises can be found on Learn.UQ (Blackboard). Feedback for the Theory to Practice exercises will be provided back to students via the relevant assessment platform and final marks for the assignment will be available through Grade Centre once the marking has been completed. </p>\n<p><strong>Generative AI (ChatGPT): </strong>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<p><strong>Criteria &amp; Marking: </strong>UQ Students - Please access the profile from <a href=\"https://learn.uq.edu.au/\">Learn.UQ</a> or <a href=\"https://www.sinet.uq.edu.au/\">mySI-net</a> to access marking criteria held in this profile.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Theory to Practice Exercises will be submitted via an online platform (Inspera). Please remember when you submit your assignment online to keep an evidence record (e.g. receipt/screenshot) as proof of the details of your submission.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>Exams submitted after the end of the submission time will incur a <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/requesting-late-penalty-exemption-online-exam\">late penalty</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Access Audit Report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 23/08/2024 - 20/09/2024</p>\n<p>\n</p><p>Please note submissions will be required as per dates outlined in the Task Description, Hurdle Requirements, and the Course Timetable.</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Access Audit Report will be completed in small <strong>groups (3)/pairs </strong>(where necessary) and will require students to compile and submit a report based on an access audit conducted on a physical (built) environment on the St Lucia campus (i.e., Private/Public Sites and Services that are accessible by the general public) to which students are assigned. Students who participate in the accessibility audit of a physical environment will utilise a wheelchair as part of their audit to gain perspectives of the environment from the view of people who use wheelchairs.</p>\n<p>The Assignment Preparation, Access Audit, and associated Report Submission dates are as follows:</p>\n<ul>\n<li><strong>Access Audit Preparation (ALL STUDENTS):</strong> Friday 23rd August 2024 @ either 12:00pm or 2:00pm (<strong><em>Compulsory attendance</em></strong>)   </li>\n</ul>\n<ol>\n<li><strong>Group 1 - Access Audit Date: </strong>Monday, 26th of August 2024 from 1:00 - 5:00pm + <strong>Report Submission Date: </strong>Wednesday,<strong> </strong>11th of September 2024 @ 12:00pm</li>\n<li><strong>Group 2 - </strong><strong>Access Audit Date: </strong>Friday, 30th of August 2024 from 1:00 - 5:00pm + <strong>Report</strong><strong> Submission Date: </strong>Monday, 16th of September 2024 @ 12:00pm</li>\n<li><strong>Group 3 - Access Audit Date: </strong>Monday, 2nd of September 2024 from 1:00 - 5:00pm +<strong> Report Submission Date: </strong>Wednesday,<strong> </strong>18th of September 2024 @ 12:00pm</li>\n</ol>\n<p> <strong>Pass/Fail Requirements (Hurdles): </strong>To successfully be able to complete this assessment all students must:</p>\n<ol>\n<li><strong><em>Individual Hurdle - Access Audit Preparation:</em></strong> Attend a compulsory Access Audit preparation session during Week 5 Friday workshops. If students are unable to attend this compulsory session due to medical or extenuating circumstances, they are required to complete the <strong>SHRS Absentee Form</strong>. The completed form along with the <strong>required evidence </strong>must be emailed to the School of Health and Rehabilitation Sciences Student and Academic Support Unit (SASU - enquiries.shrs@uq.edu.au) within <strong>three calendar days of the scheduled activity</strong>. The SHRS Absentee Form can be found on the relevant Course Blackboard site. If the absence is due to a non-permissible circumstance (as per the SHRS Absentee Form), then attendance at the session is expected. Please note, it is expected that students will notify their course coordinator (m.hoyle@uq.edu.au) prior to or on the day of the session and as soon as is possible to advise of the absence, in addition to submitting the above information to SASU. <strong>Implications for lack of attendance - </strong> If a students are not able to attend this session an additional summary activity will be required to ensure that they have engaged with the information related to safety, wheelchair use, and the assessment in preparation for participating in the access audit. <strong>Relevant students will not be able to participate in the access audit until this summary activity has been completed in full. </strong></li>\n<li><strong><em>Individual Hurdle - Wheelchair Safety Quiz: </em></strong>Complete the Wheelchair Safety Quiz online by no later than midday (12pm) on the day that the access audit is due to be completed. Multiple attempts are available for this quiz, however, students must achieve 100% to pass this quiz and to be permitted to attend/participate in the access audit.</li>\n<li><strong><em>Individual Hurdle - Access Audit: </em></strong>Attend a compulsory access audit practical with group members on relevant chosen access audit date. If students are unable to attend this compulsory access audit due to medical or extenuating circumstances, they are required to complete the <strong>SHRS Absentee Form</strong>. The completed form along with the required evidence must be emailed to the School of Health and Rehabilitation Sciences Student and Academic Support Unit (SASU - enquiries.shrs@uq.edu.au) within <strong>three calendar days of the scheduled activity.</strong> The SHRS Absentee Form can be found on the relevant Course Blackboard site. If the absence is due to a non-permissible circumstance (as per the SHRS Absentee Form), then attendance at the access audit practical is expected. Please note, it is expected that students will notify their course coordinator (m.hoyle@uq.edu.au) prior to or on the day of the practical and as soon as is possible to advise of the absence, in addition to submitting the above information to SASU. <strong>Implications for lack of attendance</strong> - If students are not able to attend the scheduled access audit practical then the students will be required to attend an alternative scheduled access audit OR complete an alternative activity to ensure that they have participated in an access audit and that necessary audit related information has been collected for the completion of the report.</li>\n<li><strong><em>Individual Hurdle - Peer Evaluation (Buddycheck): </em></strong>Within 48 hours of the relevant Access Audit Report submission date/time, all students are expected to complete a Peer Evaluation via Buddycheck for each member of their group, including themselves, to record the contributions of each of the group members to the assessment. </li>\n</ol>\n<p><strong>Peer Evaluation (Buddycheck):</strong> Peer Evaluation is completed for the <em>Access Audit Report </em>using Buddycheck. Buddycheck is a peer evaluation tool, that calculates student contributions to a group project and enables peer feedback. Information about Buddycheck can be accessed here - <a href=\"https://web.library.uq.edu.au/library-services/it/learnuq-blackboard-help/learnuq-assessment/buddycheck\">https://web.library.uq.edu.au/library-services/it/learnuq-blackboard-help/learnuq-assessment/buddycheck</a>. Using student ratings and feedback, Buddycheck calculates a Peer Assessment Factor (PAF) which is then applied to the group assessment mark. This PAF is a percentage which is multiplied by the group mark to calculate your individual final PAF-adjusted assessment mark. For example, if a group received 25/30 for an assessment and then one member of the group received a 0.9 (90%) for the PAF that student would receive 25 x 0.90 = 22.5 as their final PAF-adjusted assessment mark. Student marks following attribution of the PAF are unable to be adjusted to fall below the pass mark for that item of assessment, or above the maximum mark for that item of assessment (i.e., marks can only be within 55% and 100%) on the basis of the PAF.</p>\n<p>A fail on the first three (3) individual hurdles above may result in the student/s being given an additional activity in lieu of missed or incomplete work or failing the corresponding assessment item (i.e. if fail attending the Access Audit preparation session or Access Audit may result in failing the Access Audit Report). However, for the Peer Evaluation the penalty for non-completion is inherent in the Buddycheck system. This means that failure to complete the allocation may impact on your overall mark for the Field Report as your perception of your contribution to the assessment will be absent from the overall calculation of contribution to the group work.</p>\n<p><strong>Details, Marking and Feedback: </strong>The details of each of the Access Audit Report can be found on Learn.UQ (Blackboard). Feedback for the Access Audit Report will be provided back to students via the relevant assessment platform and final marks for the assignment will be available through grade centre once the marking has been completed.  </p>\n<p><strong>Generative AI (ChatGPT): </strong>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<p><strong>Criteria &amp; Marking: </strong>UQ Students: Please access the profile from <a href=\"https://learn.uq.edu.au/\">Learn.UQ</a> or <a href=\"https://www.sinet.uq.edu.au/\">mySI-net</a> to access marking criteria held in this profile.</p>\n<p><strong>Use of Reports:</strong> In the spirit of \"Creating Inclusive Communities\" access audit reports produced in this course may be de-identified (of students details) and submitted to The University of  Queensland Disability Inclusion Group for use in making recommendation to facilitate improved access and inclusion on UQ campuses.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Access Audit Reports will be submitted via an online platform (TurnItIn). Please remember when you submit your assignment online to keep an evidence record (e.g. receipt/screenshot) as proof of the details of your submission.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom O-week To Week 13",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Self directed learning in preparation for workshop</strong><br><p>Self directed learning activities in preparation for workshops. This will include watching short pre-recorded lectures and media, researching online, reviewing relevant readings, and participating in online interactive activities.</p></br></p></div></td>",
            "topic_title": "<strong>Self directed learning in preparation for workshop</strong>",
            "topic_description": "Self directed learning in preparation for workshop Self directed learning activities in preparation for workshops. This will include watching short pre-recorded lectures and media, researching online, reviewing relevant readings, and participating in online interactive activities.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Friday workshops</strong><br><p>Fortnightly friday workshops (Weeks 1, 3, 5, 7, 9, 11, &amp; 13) will examine the current state of disability rights and discrimination in Australia and then explore how the environment, including the built environment, attitudes, services, systems and policies facilitate or impede participation and inclusion in society (particularly in the areas of housing, education, employment, transport, and leisure). These sessions will then consider the clinical applicability of these for OT practice, with particular consideration given to service availability/implementation under the National Disability Insurance Scheme (NDIS) and My Aged Care. Please note the compulsory attendance for the third workshop in Week 5 - This is to ensure that students receive critical content and training associated with the completion of the Access Audit Assignment.</p></br></p></div></td>",
            "topic_title": "<strong>Friday workshops</strong>",
            "topic_description": "Friday workshops Fortnightly friday workshops (Weeks 1, 3, 5, 7, 9, 11, & 13) will examine the current state of disability rights and discrimination in Australia and then explore how the environment, including the built environment, attitudes, services, systems and policies facilitate or impede participation and inclusion in society (particularly in the areas of housing, education, employment, transport, and leisure). These sessions will then consider the clinical applicability of these for OT practice, with particular consideration given to service availability/implementation under the National Disability Insurance Scheme (NDIS) and My Aged Care. Please note the compulsory attendance for the third workshop in Week 5 - This is to ensure that students receive critical content and training associated with the completion of the Access Audit Assignment.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 6 To Week 7",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Access Audit Activity (Associated with Access Audit Report)</strong><br><p>Students must attend a compulsory access audit practical with group members on relevant chosen access audit date/time. In this practical students will undertake an access audit of an assigned UQ building against the Australian Standards and using a wheelchair within the site consider the implications of the buildings specifications and features for people who use a wheelchair and/or a mobility device/aid.   </p></br></p></div></td>",
            "topic_title": "<strong>Access Audit Activity (Associated with Access Audit Report)</strong>",
            "topic_description": "Access Audit Activity (Associated with Access Audit Report) Students must attend a compulsory access audit practical with group members on relevant chosen access audit date/time. In this practical students will undertake an access audit of an assigned UQ building against the Australian Standards and using a wheelchair within the site consider the implications of the buildings specifications and features for people who use a wheelchair and/or a mobility device/aid.",
            "learning_outcomes": []
        }
    ]
}