{
    "course_title": "Introduction to Ethics",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/PHIL1013-63188-7460",
    "full_course_code": "PHIL1013-63188-7460",
    "course_code": "PHIL1013",
    "class_code": "63188",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand the basic terminology of ethical theory"
        },
        {
            "number": "LO2.",
            "description": "Understand the central debates in ethics (breadth and depth)"
        },
        {
            "number": "LO3.",
            "description": "Demonstrate effective communication and inquiry skills in the context of group discussion on issues in ethics"
        },
        {
            "number": "LO4.",
            "description": "Conduct independent philosophical research and inquiry"
        },
        {
            "number": "LO5.",
            "description": "Identify, analyse and evaluate arguments or points of view"
        },
        {
            "number": "LO6.",
            "description": "Understand the role of ethics in everyday life, including some characterisations of the philosophical questions: Why by moral? What is a good life?"
        },
        {
            "number": "LO7.",
            "description": "Demonstrate a capacity for creative thought, effective communication and high quality of written expression in the context of research and essay writing"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Participation in activities at Tutorials",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p> Week 2 Wed - Week 13 Thu</p></dd>",
            "learning_objectives": "L01, L02, L05",
            "mode": "Activity/ Performance",
            "category": "Participation/ Student contribution",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Tutorials will include activities that record and assess participation. These will take the form of submitting questions based on the required reading, answering reflective prompts, participation in class debates and/or other collaborative group activities. Additional details about allocation of points towards the participation total will be made available via the Blackboard Page and/or by your tutors at tutorials.</p>\n<p><strong><em>Use of AI Prohibited</em></strong></p>\n<p>This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) tools will not be permitted. Any attempted use of Generative AI may constitute student misconduct under the Student Code of Conduct.</p>\n<p><strong><em>Criteria</em></strong></p>\n<p>Your tutorial participation will be assessed according to the following criteria: </p>\n<p> </p>\n<p>1.             Evidence of participation in discussions.</p>\n<p>2.             Evidence of preparation for the tutorial, most notably through completing the set readings.</p>\n<p>3.             Quality of contributions to discussions.</p>\n<p>4.             Fostering of group discussions, through courteous and respectful interactions with staff and students.</p>\n<p>5.             Attendance is necessary to fulfill the above criteria, as per the course requirements, but marks cannot be awarded for attendance alone.</p>\n<p> </p>\n<p>To achieve a grade of 7 (High Distinction, 85-100%), your attendance will be flawless and your participation exceptional. This grade reflects exceptional levels of preparation, mastery of course materials, and very high quality contributions to, and fostering of, group discussions. You should be able to engage with your peers very effectively.</p>\n<p> </p>\n<p>To achieve a grade of 6 (Distinction, 75-84) your attendance will be excellent and your participation very substantial. This grade reflects excellent levels of preparation, knowledge of course materials, and high quality contributions to, and fostering of, group discussions. You should be able to engage with your peers effectively.</p>\n<p> </p>\n<p>To achieve a grade of 5 (Credit, 65 – 74%), your attendance and participation will be good. This grade reflects proficient levels of preparation, good knowledge of course materials, and good quality contributions to, and fostering of, group discussions.</p>\n<p> </p>\n<p>To achieve a grade of 4 (Pass, 50 – 64%) your attendance and participation will be satisfactory. This grade reflects adequate levels of preparation and knowledge of course materials, and an acceptable quality of contributions to, and fostering of, group discussions.</p>\n<p> </p>\n<p>To achieve a grade of 3 (Marginal Fail, 45 – 49%) your attendance and participation will be unsatisfactory. This grade reflects irregular attendance and/or participation and superficial knowledge of course materials and basic levels of preparation. However, when in attendance, there is evidence of your ability to demonstrate developing achievement in contributions to, and fostering of, group discussions.</p>\n<p> </p>\n<p>To achieve a grade of 2 (Fail, 25-44%), your attendance and participation will be very unsatisfactory. This grade reflects irregular attendance and/or participation, minimal knowledge of course materials, little evidence of preparation, and mixed to low quality of contributions to, and fostering of, group discussions.</p>\n<p> </p>\n<p>To achieve a grade of 1 (Low Fail, 0-24%), your attendance and participation will be unsatisfactory. This grade reflects irregular attendance and/or participation, an no evidence of preparation, and little or no evidence of quality of contributions to, and fostering of, group discussions.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission instructions will vary according to the participation activity. In general, these will occur via Blackboard's quiz and poll functions, Padlet, and some activities submitted in class on paper.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>Students must be in class during the activity to accrue participation points, unless alternative arrangements with appropriate documentation is approved. The number of participation activities available is such that it is possible for students to achieve full marks and still be absent occasionally (up to 3 weeks). </p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Analytical Essay",
            "special_indicators": [],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 10/09/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong><em>Task</em></strong></p>\n<p>Students will be provided with a choice of topics via the Assessment Instructions Section of the Blackboard page. Students will need to address the topic in an essay of 1,200 words (A word count that is within ±10% of the set length (word limit) is acceptable. Word count does not include footnotes; however, discursive footnotes are included in the word count. A word count that is outside these 10% will receive a proportionate penalty and will be graded against the grading criteria.)</p>\n<p>Each topic will be associated with particular reading material covered in class, understanding of which must be reflected in the essay. Further instructions will be provided along with the topics at least one month before the due date in the Assessment Instructions Section of Blackboard.</p>\n<p><strong><em>Formatting</em></strong></p>\n<ul>\n<li>Do not use fancy fonts. Use Times New Roman 12pt or equivalent.</li>\n<li>All essays <strong>must</strong> have an essay title at the top of page 1 and your name directly underneath the title. Choose a title that reflects your argument.</li>\n<li>Do NOT include the wording of the assigned question within your submission.</li>\n<li>Do include a word count minus any referencing or bibliographic information.</li>\n<li>In your Turnitin Submission, your title should include your name and the topic number you have chosen.</li>\n</ul>\n<p><strong><em>Referencing and bibliography</em></strong></p>\n<ul>\n<li>There is no standard referencing style for this course. Check the referencing style guides: https://web.library.uq.edu.au/research-tools-techniques/referencing/referencing-style-guides. You are permitted any recognized referencing style you wish, so long as it includes page numbers where possible (i.e. where the source itself includes page numbers, and where the reference is for specific points attributable to other authors, page numbers must be included).</li>\n<li>Include all cited works in a bibliography.</li>\n</ul>\n<p><strong><em>Use of AI Prohibited</em></strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<p><br/></p>\n<p><strong><em>Criteria</em></strong></p>\n<p>1. Ability to define the topic or philosophical issue under debate. (Topic definition.)</p>\n<p>2. Ability to construct a well-reasoned argument for a certain point of view. (Argument and Structure.)</p>\n<p>3. Depth and breadth of understanding of the various positions in a philosophical debate. (Scope and Depth of Treatment)</p>\n<p>4. Insight and/or originality in interpreting texts or constructing a point of view or argument. (Originality)</p>\n<p>5. Capacity to produce a polished, well-written and appropriately referenced essay. (Presentation)</p>\n<p> </p>\n<p>To achieve a grade of 7 (High Distinction, 85-100%), your essay should reflect an exceptional level of achievement. It should demonstrate that you have undertaken extensive, high-level research, that you are able to form a very rigorous, well-organised argument, and that your discussion is original and creative. It should also demonstrate that you are able to evaluate and organise data and/or evidence in a critical manner and that you have a sophisticated and insightful understanding of problems and issues. Your essay will be very well written, clear and concise, pay strict attention to discipline conventions and have minimal, if any errors in referencing, expression, grammar, spelling and punctuation: <em>This grade is assigned for a total (sum of all the assessment components) in the range 85-100%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>To achieve a grade of 6 (Distinction, 75-84%), your essay should reflect an advanced level of achievement. It should demonstrate that you have undertaken wide research, that you are able to form a rigorous, well-organised argument, and that your discussion is coherent and convincing. It should also demonstrate that you are able to evaluate data and/or evidence in a perceptive manner, and that your understanding of problems and issues is perceptive and insightful. Your essay will be well written, clear and concise, follow discipline conventions and have few errors in referencing, expression, grammar, spelling and punctuation: <em>This grade is assigned for a total (sum of all the assessment components) in the range 75-84%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>To achieve a grade of 5 (Credit, 65 – 74%) your essay should reflect a proficient level of achievement. It should demonstrate that you have undertaken the expected level of research, that you are able to develop or adapt convincing arguments and justify them adequately, that you are able to evaluate data and/or evidence in a proficient manner, and that you have a good understanding of problems and issues. The presentation and referencing of your essay will largely follow discipline conventions, perhaps have some errors in grammar, spelling and punctuation, and demonstrate your ability to communicate effectively: <em>This grade is assigned for a total (sum of all the assessment components) in the range 65-74%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>To achieve a grade of 4 (Pass, 50 – 64%) your essay should reflect functional achievement. It should demonstrate that you are able to apply fundamental concepts and skills, that you have undertaken a basic level of research and have the basic ability to evaluate data and/or evidence, to identify problems and issues, to offer insights and to develop routine arguments. Your organisation, writing, referencing, spelling and grammar will be adequate and use some of the discipline conventions to communicate appropriately: <em>This grade is assigned for a total (sum of all the assessment components) in the range 50-64%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>To achieve a grade of 3 (Marginal Fail, 45 – 49%), your essay should reflect developing levels of achievement. It should demonstrate that you have a superficial knowledge of fundamental concepts and skills, that you have undertaken a basic level of research, made some attempt to evaluate data and/or evidence, to identify problems and issues, and to offer insights. Your arguments, while underdeveloped, show your emerging ability to apply knowledge and skills. Your organisation, writing, spelling and grammar will be adequate, perhaps poor, and your referencing and use of discipline conventions poor/and or inconsistent: <em>This grade is assigned for a total (sum of all the assessment components) in the range 45-49%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>To achieve a grade of 2 (Fail, 25-44%) your essay will reflect deficiencies in skill acquisition and in your understanding of the fundamental concepts of the course. It will demonstrate that you have not undertaken adequate research, that you are unable to evaluate data and/or evidence, to identify problems and issues, or to offer insights adequately. Your arguments will be unsupported and/or inappropriate, your organisation and writing will be poor and/or inappropriate, and referencing and use of discipline conventions poor/and or inconsistent: <em>This grade is assigned for a total (sum of all the assessment components) in the range 25-44%. See assessment components for specific grading criteria</em></p>\n<p> </p>\n<p>To achieve a grade of 1 (Low Fail, 0-24%), your essay will reflect minimal evidence of achievement, and exhibit deficiencies in skill acquisition and in your understanding of the fundamental concepts of the course. It will demonstrate that you have not undertaken adequate research, that you are unable to evaluate data and/or evidence, to identify problems and issues, and/or to offer insights adequately. Your arguments will be unsupported and/or inappropriate, your organisation and writing will be poor and/or inappropriate, and referencing and use of discipline conventions poor/and or inconsistent: <em>This grade is assigned for a total (sum of all the assessment components) in the range 1-24%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>Grade X: No assessable work received. </p>\n<p><br/></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong><em>Submission</em></strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Final Philosophical Essay",
            "special_indicators": [],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 25/10/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong><em>Task</em></strong></p>\n<p>Select ONE from among a set of assigned topic options and write a 1,500 argumentative essay. (A word count that is within ±10% of the set length (word limit) is acceptable. Word count does not include footnotes; however, discursive footnotes are included in the word count. A word count that is outside these 10% will receive a proportionate penalty and will be graded against the grading criteria.)</p>\n<p>Topics and further instructions will be available at least one month before the due date in the Assignment Instructions Section of Blackboard.</p>\n<p><strong><em>Formatting</em></strong></p>\n<ul>\n<li>Do not use fancy fonts. Use Times New Roman 12pt or equivalent.</li>\n<li>All essays <strong>must</strong> have an essay title at the top of page 1 and your name directly underneath the title. Choose a title that reflects your argument.</li>\n<li>Do NOT include the wording of the assigned question within your submission.</li>\n<li>Do include a word count minus any referencing or bibliographic information.</li>\n<li>In your Turnitin Submission, your title should include your name and the topic number you have chosen.</li>\n</ul>\n<p><strong><em>Referencing and bibliography</em></strong></p>\n<ul>\n<li>There is no standard referencing style for this course. Check the referencing style guides: https://web.library.uq.edu.au/research-tools-techniques/referencing/referencing-style-guides. You are permitted any recognized referencing style you wish, so long as it includes page numbers where possible (i.e. where the source itself includes page numbers, and where the reference is for specific points attributable to other authors, page numbers must be included).</li>\n<li>Include all cited works in a bibliography.</li>\n</ul>\n<p><br/></p>\n<p><strong><em>Use of AI Prohibited</em></strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<p><br/></p>\n<p><strong><em>Criteria</em></strong></p>\n<p>1. Ability to define the topic or philosophical issue under debate. (Topic definition.)</p>\n<p>2. Ability to construct a well-reasoned argument for a certain point of view. (Argument and Structure.)</p>\n<p>3. Depth and breadth of understanding of the various positions in a philosophical debate. (Scope and Depth of Treatment)</p>\n<p>4. Insight and/or originality in interpreting texts or constructing a point of view or argument. (Originality)</p>\n<p>5. Capacity to produce a polished, well-written and appropriately referenced essay. (Presentation)</p>\n<p> </p>\n<p>To achieve a grade of 7 (High Distinction, 85-100%), your essay should reflect an exceptional level of achievement. It should demonstrate that you have undertaken extensive, high-level research, that you are able to form a very rigorous, well-organised argument, and that your discussion is original and creative. It should also demonstrate that you are able to evaluate and organise data and/or evidence in a critical manner and that you have a sophisticated and insightful understanding of problems and issues. Your essay will be very well written, clear and concise, pay strict attention to discipline conventions and have minimal, if any errors in referencing, expression, grammar, spelling and punctuation: <em>This grade is assigned for a total (sum of all the assessment components) in the range 85-100%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>To achieve a grade of 6 (Distinction, 75-84%), your essay should reflect an advanced level of achievement. It should demonstrate that you have undertaken wide research, that you are able to form a rigorous, well-organised argument, and that your discussion is coherent and convincing. It should also demonstrate that you are able to evaluate data and/or evidence in a perceptive manner, and that your understanding of problems and issues is perceptive and insightful. Your essay will be well written, clear and concise, follow discipline conventions and have few errors in referencing, expression, grammar, spelling and punctuation: <em>This grade is assigned for a total (sum of all the assessment components) in the range 75-84%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>To achieve a grade of 5 (Credit, 65 – 74%) your essay should reflect a proficient level of achievement. It should demonstrate that you have undertaken the expected level of research, that you are able to develop or adapt convincing arguments and justify them adequately, that you are able to evaluate data and/or evidence in a proficient manner, and that you have a good understanding of problems and issues. The presentation and referencing of your essay will largely follow discipline conventions, perhaps have some errors in grammar, spelling and punctuation, and demonstrate your ability to communicate effectively: <em>This grade is assigned for a total (sum of all the assessment components) in the range 65-74%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>To achieve a grade of 4 (Pass, 50 – 64%) your essay should reflect functional achievement. It should demonstrate that you are able to apply fundamental concepts and skills, that you have undertaken a basic level of research and have the basic ability to evaluate data and/or evidence, to identify problems and issues, to offer insights and to develop routine arguments. Your organisation, writing, referencing, spelling and grammar will be adequate and use some of the discipline conventions to communicate appropriately: <em>This grade is assigned for a total (sum of all the assessment components) in the range 50-64%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>To achieve a grade of 3 (Marginal Fail, 45 – 49%), your essay should reflect developing levels of achievement. It should demonstrate that you have a superficial knowledge of fundamental concepts and skills, that you have undertaken a basic level of research, made some attempt to evaluate data and/or evidence, to identify problems and issues, and to offer insights. Your arguments, while underdeveloped, show your emerging ability to apply knowledge and skills. Your organisation, writing, spelling and grammar will be adequate, perhaps poor, and your referencing and use of discipline conventions poor/and or inconsistent: <em>This grade is assigned for a total (sum of all the assessment components) in the range 45-49%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>To achieve a grade of 2 (Fail, 25-44%) your essay will reflect deficiencies in skill acquisition and in your understanding of the fundamental concepts of the course. It will demonstrate that you have not undertaken adequate research, that you are unable to evaluate data and/or evidence, to identify problems and issues, or to offer insights adequately. Your arguments will be unsupported and/or inappropriate, your organisation and writing will be poor and/or inappropriate, and referencing and use of discipline conventions poor/and or inconsistent: <em>This grade is assigned for a total (sum of all the assessment components) in the range 25-44%. See assessment components for specific grading criteria</em></p>\n<p> </p>\n<p>To achieve a grade of 1 (Low Fail, 0-24%), your essay will reflect minimal evidence of achievement, and exhibit deficiencies in skill acquisition and in your understanding of the fundamental concepts of the course. It will demonstrate that you have not undertaken adequate research, that you are unable to evaluate data and/or evidence, to identify problems and issues, and/or to offer insights adequately. Your arguments will be unsupported and/or inappropriate, your organisation and writing will be poor and/or inappropriate, and referencing and use of discipline conventions poor/and or inconsistent: <em>This grade is assigned for a total (sum of all the assessment components) in the range 1-24%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>Grade X: No assessable work received. </p>\n<p><br/></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong><em>Submission</em></strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction</strong><br><p>(1) Course Introduction, and (2) Introduction to ethics: 'Why be moral?' Levels of Ethics: metaethics, normative ethics, applied ethics and applied ethics Empirical vs non-empirical investigation, some key relevant empirical areas for moral theory; Relationship between law, religion, and ethics. The Divine Command theory and The Euthyphro problem.</p>\n<p>There are no tutorials in Week 1.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Introduction</strong>",
            "topic_description": "Introduction (1) Course Introduction, and (2) Introduction to ethics: 'Why be moral?' Levels of Ethics: metaethics, normative ethics, applied ethics and applied ethics Empirical vs non-empirical investigation, some key relevant empirical areas for moral theory; Relationship between law, religion, and ethics. The Divine Command theory and The Euthyphro problem. There are no tutorials in Week 1.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Relativism</strong><br><p>Relativism: Is morality relative? If so, what is it relative to? Is relativism required for tolerance?</p>\n<p>Tutorials begin in Week 2. To prepare for your tutorial, check the tutorial set reading/instructions on Blackboard and Talis Reading List.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05, L06</p></div></td>",
            "topic_title": "<strong>Relativism</strong>",
            "topic_description": "Relativism Relativism: Is morality relative? If so, what is it relative to? Is relativism required for tolerance? Tutorials begin in Week 2. To prepare for your tutorial, check the tutorial set reading/instructions on Blackboard and Talis Reading List.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Subjectivism</strong><br><p>Hume on the Passions and the Will; Is and Ought; Subjectivity in Reasoning and Values. </p>\n<p>To prepare for your tutorial, check the tutorial set reading/instructions on Blackboard and Talis Reading List.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05, L06</p></div></td>",
            "topic_title": "<strong>Subjectivism</strong>",
            "topic_description": "Subjectivism Hume on the Passions and the Will; Is and Ought; Subjectivity in Reasoning and Values. To prepare for your tutorial, check the tutorial set reading/instructions on Blackboard and Talis Reading List.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Kantian Ethics</strong><br><p>Deontology as an objectivist position; The Nature of Reasons; A Good Will; Categorical Imperative and universalizability; Being Treated as Means and Ends; The Kingdom of Ends. </p>\n<p>This lecture time is TBA for an alternative time due to the Show Day Holiday. </p>\n<p>There are no tutorials in Week 4 due to the Show Day Holiday.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05, L06</p></div></td>",
            "topic_title": "<strong>Kantian Ethics</strong>",
            "topic_description": "Kantian Ethics Deontology as an objectivist position; The Nature of Reasons; A Good Will; Categorical Imperative and universalizability; Being Treated as Means and Ends; The Kingdom of Ends. This lecture time is TBA for an alternative time due to the Show Day Holiday. There are no tutorials in Week 4 due to the Show Day Holiday.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Kantian Ethics: Critique and Application</strong><br><p>Criticisms of Kant's Theory; the nature of the self and free will presumed in Kant's theory; Deontology in application: Lying, Duties to the Poor, Human Rights, Voluntary Assisted Dying; Punishment. </p>\n<p>To prepare for your tutorial, check the tutorial set reading/instructions on Blackboard and/or Talis Reading List.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Kantian Ethics: Critique and Application</strong>",
            "topic_description": "Kantian Ethics: Critique and Application Criticisms of Kant's Theory; the nature of the self and free will presumed in Kant's theory; Deontology in application: Lying, Duties to the Poor, Human Rights, Voluntary Assisted Dying; Punishment. To prepare for your tutorial, check the tutorial set reading/instructions on Blackboard and/or Talis Reading List.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Utilitarianism</strong><br><p>Consequentialism; Types of Consequentialism and Utilitarianism; The Value Theory, Aggregative Maximisation; Equality. </p>\n<p>To prepare for your tutorial, check the tutorial set reading/instructions on Blackboard and Talis Reading List.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05, L06</p></div></td>",
            "topic_title": "<strong>Utilitarianism</strong>",
            "topic_description": "Utilitarianism Consequentialism; Types of Consequentialism and Utilitarianism; The Value Theory, Aggregative Maximisation; Equality. To prepare for your tutorial, check the tutorial set reading/instructions on Blackboard and Talis Reading List.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Utilitarianism: Critique and Application</strong><br><p>Criticisms of Utilitarianism and Replies; The Self Presupposed in Utilitarianism; Utilitarianism in application: Lying, Duties to the Poor, Human Rights, Voluntary Assisted Dying, Punishment.</p>\n<p>To prepare for your tutorial, check the tutorial set reading/instructions on Blackboard and Talis Reading List.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05, L06</p></div></td>",
            "topic_title": "<strong>Utilitarianism: Critique and Application</strong>",
            "topic_description": "Utilitarianism: Critique and Application Criticisms of Utilitarianism and Replies; The Self Presupposed in Utilitarianism; Utilitarianism in application: Lying, Duties to the Poor, Human Rights, Voluntary Assisted Dying, Punishment. To prepare for your tutorial, check the tutorial set reading/instructions on Blackboard and Talis Reading List.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Aristotle and Virtue ethics</strong><br><p>Teleology; Human function and purpose; The nature of virtues and human flourishing; Doctrine of the mean; Rationality of the passions; Distinctive features of virtue ethics as opposed to reductionistic ethics. </p>\n<p>To prepare for your tutorial, check the tutorial set reading/instructions on Blackboard and Talis Reading List.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05, L06</p></div></td>",
            "topic_title": "<strong>Aristotle and Virtue ethics</strong>",
            "topic_description": "Aristotle and Virtue ethics Teleology; Human function and purpose; The nature of virtues and human flourishing; Doctrine of the mean; Rationality of the passions; Distinctive features of virtue ethics as opposed to reductionistic ethics. To prepare for your tutorial, check the tutorial set reading/instructions on Blackboard and Talis Reading List.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Virtue Ethics: Critique and Application</strong><br><p>Criticisms of Virtue Ethics; Virtue Ethics in Application: Honesty, Compassion, Generosity, Virtues in Christianity and Buddhism, Professional Virtues. </p>\n<p>There are no tutorials in Week 9.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Virtue Ethics: Critique and Application</strong>",
            "topic_description": "Virtue Ethics: Critique and Application Criticisms of Virtue Ethics; Virtue Ethics in Application: Honesty, Compassion, Generosity, Virtues in Christianity and Buddhism, Professional Virtues. There are no tutorials in Week 9.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Feminist Approaches</strong><br><p>Introduction to the variety of feminist thought; Feminine and Feminist Ethics, Ethics of Care, Epistemological Questions in Feminism. </p>\n<p>To prepare for your tutorial, check the tutorial set reading/instructions on Blackboard and Talis Reading List.</p></br></p><p><strong>Learning outcomes:</strong> L02, L03, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Feminist Approaches</strong>",
            "topic_description": "Feminist Approaches Introduction to the variety of feminist thought; Feminine and Feminist Ethics, Ethics of Care, Epistemological Questions in Feminism. To prepare for your tutorial, check the tutorial set reading/instructions on Blackboard and Talis Reading List.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Indigenous Approaches</strong><br/><p>Key features in indigenous world views; relational and place-based approaches; understandings of the self in indigenous thinking; custodial ethic. </p>\n<p>To prepare for your tutorial, check the tutorial set reading/instructions on Blackboard and Talis Reading List.</p></p><p><strong>Learning outcomes:</strong> L02, L03, L05, L06</p></div></td>",
            "topic_title": "<strong>Indigenous Approaches</strong>",
            "topic_description": "Indigenous Approaches Key features in indigenous world views; relational and place-based approaches; understandings of the self in indigenous thinking; custodial ethic. To prepare for your tutorial, check the tutorial set reading/instructions on Blackboard and Talis Reading List.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Non-Human Animals and the Environment</strong><br/><p>Moral Standing of Animals and Nature; Singer's Equal Consideration of Interests; The Argument from Marginal Cases; Utilitarian, Deontological and virtue approaches to animal welfare; the alleged incompatibility of moral attitudes to animals across different applied contexts. </p>\n<p>To prepare for your tutorial, check the tutorial set reading/instructions on Blackboard and Talis Reading List.</p></p><p><strong>Learning outcomes:</strong> L02, L03, L05, L06</p></div></td>",
            "topic_title": "<strong>Non-Human Animals and the Environment</strong>",
            "topic_description": "Non-Human Animals and the Environment Moral Standing of Animals and Nature; Singer's Equal Consideration of Interests; The Argument from Marginal Cases; Utilitarian, Deontological and virtue approaches to animal welfare; the alleged incompatibility of moral attitudes to animals across different applied contexts. To prepare for your tutorial, check the tutorial set reading/instructions on Blackboard and Talis Reading List.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>The Pragmatic Turn in Ethics</strong><br/><p>Dewey and imagination; Decentralising rules and principles in ethical decision-making. </p>\n<p>To prepare for your tutorial, check the tutorial set reading/instructions on Blackboard and Talis Reading List.</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>The Pragmatic Turn in Ethics</strong>",
            "topic_description": "The Pragmatic Turn in Ethics Dewey and imagination; Decentralising rules and principles in ethical decision-making. To prepare for your tutorial, check the tutorial set reading/instructions on Blackboard and Talis Reading List.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        }
    ]
}