{
    "course_title": "Philosophy Today",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/PHIL3002-63202-7460",
    "full_course_code": "PHIL3002-63202-7460",
    "course_code": "PHIL3002",
    "class_code": "63202",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Reflect and report on a range of key concepts and debates in contemporary philosophy."
        },
        {
            "number": "LO2.",
            "description": "Apply theoretical insights to real-world scenarios."
        },
        {
            "number": "LO3.",
            "description": "Demonstrate advanced skills of effective thinking and communication."
        },
        {
            "number": "LO4.",
            "description": "Conduct independent philosophical research and inquiry."
        },
        {
            "number": "LO5.",
            "description": "Identify, analyze and evaluate complex arguments or points of view."
        },
        {
            "number": "LO6.",
            "description": "Develop an appreciation of diverse reasoned perspectives and engage in collaborative reasoning."
        },
        {
            "number": "LO7.",
            "description": "Develop skills in strategic approaches to decision-making."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Tutorial participation and discussion",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p>Module 1 essays are due in week 8 (Monday 9th September @ 4PM)</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07",
            "mode": "Activity/ Performance",
            "category": "Participation/ Student contribution",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>There are NINE tutorials, held in Weeks 3 - 5; and 7-12.</p>\n<p>Each week, students are required to participate in tutorials, to read required readings, and to actively participate in discussion and debate about those readings.</p>\n<p>Your tutorial participation will be assessed according to the following criteria:</p>\n<p>1.             Evidence of participation in discussions.</p>\n<p>2.             Evidence of preparation for the tutorial, most notably through completing the set readings.</p>\n<p>3.             Quality of contributions to discussions.</p>\n<p>4.             Fostering of group discussions, through courteous and respectful interactions with staff and students.</p>\n<p>5.             Attendance is necessary to fulfill the above criteria, as per the course requirements, but marks cannot be awarded for attendance alone.</p>\n<p> </p>\n<p>To achieve a grade of 7 (High Distinction, 85-100%), your attendance will be flawless and your participation exceptional. This grade reflects exceptional levels of preparation, mastery of course materials, and very high quality contributions to, and fostering of, group discussions. You should be able to engage with your peers very effectively.</p>\n<p><br/></p>\n<p>To achieve a grade of 6 (Distinction, 75-84) your attendance will be excellent and your participation very substantial. This grade reflects excellent levels of preparation, knowledge of course materials, and high quality contributions to, and fostering of, group discussions. You should be able to engage with your peers effectively.</p>\n<p> </p>\n<p>To achieve a grade of 5 (Credit, 65 – 74%), your attendance and participation will be good. This grade reflects proficient levels of preparation, good knowledge of course materials, and good quality contributions to, and fostering of, group discussions.</p>\n<p> </p>\n<p>To achieve a grade of 4 (Pass, 50 – 64%) your attendance and participation will be satisfactory. This grade reflects adequate levels of preparation and knowledge of course materials, and an acceptable quality of contributions to, and fostering of, group discussions.</p>\n<p> </p>\n<p>To achieve a grade of 3 (Marginal Fail, 45 – 49%) your attendance and participation will be unsatisfactory. This grade reflects irregular attendance and/or participation and superficial knowledge of course materials and basic levels of preparation. However, when in attendance, there is evidence of your ability to demonstrate developing achievement in contributions to, and fostering of, group discussions.</p>\n<p> </p>\n<p>To achieve a grade of 2 (Fail, 25-44%), your attendance and participation will be very unsatisfactory. This grade reflects irregular attendance and/or participation, minimal knowledge of course materials, little evidence of preparation, and mixed to low quality of contributions to, and fostering of, group discussions.</p>\n<p> </p>\n<p>To achieve a grade of 1 (Low Fail, 0-24%), your attendance and participation will be unsatisfactory. This grade reflects irregular attendance and/or participation, an no evidence of preparation, and little or no evidence of quality of contributions to, and fostering of, group discussion.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>Late submission of assessment will incur a penalty of 10% of the marks available for the assessment item, per calendar day or part-day after the due date, for a maximum of 7 days, after which a mark of zero will be recorded.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Short assignment 1 Op-Ed, or Essay",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>30% 1300 words </dd>",
            "due_date": "<dd><p>Module 1 essays are due in week 8 (Monday 9th September @ 4PM)</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Either: 1) Write an Op-Ed for a newspaper or an article for the Conversation (http://theconversation.com/au) on a current issue in the media related to the themes of autonomy and paternalism, or autonomy and adaptive preferences. Possible topics to consider might include:</p>\n<ul>\n<li>Can we justify making covid vaccinations mandatory? </li>\n<li>Should the victims of intimate partner violence be prevented from returning to their partners, even if they want to?</li>\n</ul>\n<p>The aim of this exercise is to apply the theoretical knowledge you have acquired in Module 1 to a relevant contemporary issue, and to communicate this knowledge in a way that sheds light on the issue. </p>\n<p><br/></p>\n<p>Your op-ed will be assessed according to the following criteria:</p>\n<p>1.             Ability to construct a well-defined, well-reasoned, and persuasive argument.</p>\n<p>2.             Depth and breadth of knowledge and understanding of central issues.</p>\n<p>3.             Critical engagement with academic sources and evidence.</p>\n<p>4.             Clear and concise written expression, ability to communicate an argument effectively and in the form of an opinion piece, well presented.</p>\n<p>5.             Provision of a bibliography using discipline conventions.</p>\n<p> </p>\n<p>To achieve a grade of 7 (High Distinction, 85–100%), your op-ed should demonstrate that you have an exceptional and nuanced knowledge and understanding of the subject in question. Your argument should be clearly defined, sophisticated, and highly persuasive, demonstrating an exceptional level of critical engagement with primary and secondary source materials. Your writing will be very clear and concise and there will be minimal, if any, errors of referencing, expression, grammar, spelling, and punctuation. Your writing style and tone will be highly appropriate for an opinion piece.</p>\n<p> </p>\n<p>To achieve a grade of 6 (Distinction, 75–84%), your op-ed should demonstrate that you have an advanced knowledge and understanding of the subject in question. Your argument should be clearly defined and persuasive, demonstrating an advanced level of critical engagement with primary and secondary source materials. Your writing will be clear and concise and have few errors of referencing, expression, grammar, spelling, and punctuation. Your writing style and tone will be appropriate for an op-ed piece.</p>\n<p> </p>\n<p>To achieve a grade of 5 (Credit, 65–74%), your op-ed should demonstrate that you have a proficient knowledge and understanding of the subject in question. Your argument should be largely well-defined, demonstrating some critical engagement with primary and secondary source materials. Your writing will be largely clear and concise with few/some errors of referencing, expression, grammar, spelling, and punctuation. Your writing style and tone will be largely appropriate for an op-ed piece.</p>\n<p> </p>\n<p>To achieve a grade of 4 (Pass, 50–64%), your op-ed should demonstrate that you have a functional knowledge and understanding of the subject in question. Your argument will be reasonably well-defined, demonstrating a basic level of engagement with primary and secondary source materials. Your writing will be adequate with some errors of referencing, expression, grammar, spelling, and punctuation. Your writing style and tone will be adequate for an op-ed piece.</p>\n<p> </p>\n<p>To achieve a grade of 3 (Marginal Fail, 45–49%), your op-ed should reflect a developing knowledge and understanding of the subject in question. Your argument, while underdeveloped, will have some definition, and demonstrate a superficial level of engagement with primary and secondary source materials. Your writing will be adequate, perhaps poor, with several errors of referencing, expression, grammar, spelling, and punctuation. Your writing style and tone will be poor and/or inappropriate for an op-ed piece.</p>\n<p> </p>\n<p>To achieve a grade of 2 (Fail, 25-44%), your op-ed will reflect an inadequate knowledge and understanding of concepts fundamental to the subject in question. Your argument will be unsupported and/or inappropriate and lacking in coherency. It will demonstrate that you have not undertaken adequate research, that you are unable to evaluate evidence, to identify problems and issues, or to offer insights adequately. You writing will be poor with frequent errors of referencing, expression, grammar, spelling, and punctuation. Your writing style and tone will be inappropriate for an op-ed piece.</p>\n<p> </p>\n<p>To achieve a grade of 1 (Low Fail, 0–24%), your op-ed will reflect that you have failed to meet the minimum learning requirements and skill acquisition for this course. Your op-ed will demonstrate an absence of research, evaluation of evidence, and lack of argumentation. Written expression and style will be poor or inappropriate.</p>\n<p><br/></p>\n<p>Or 2) Write a philosophical essay on selected topics.</p>\n<p><br/></p>\n<p>Your essay will be assessed according to the following criteria: </p>\n<p>1. Ability to define the topic or philosophical issue under debate. (Topic definition.)</p>\n<p>2. Ability to construct a well-reasoned argument for a certain point of view. (Argument and Structure.)</p>\n<p>3. Depth and breadth of understanding of the various positions in a philosophical debate. (Scope and Depth of Treatment)</p>\n<p>4. Insight and/or originality in interpreting texts or constructing a point of view or argument. (Originality)</p>\n<p>5. Capacity to produce a polished, well-written and appropriately referenced article. (Presentation)</p>\n<p><br/></p>\n<p>To achieve a grade of 7 (High Distinction, 85-100%), your essay should reflect an exceptional level of achievement. It should demonstrate that you have undertaken extensive, high-level research, that you are able to form a very rigorous, well-organised argument, and that your discussion is original and creative. It should also demonstrate that you are able to evaluate and organise data and/or evidence in a critical manner and that you have a sophisticated and insightful understanding of problems and issues. Your essay will be very well written, clear and concise, pay strict attention to discipline conventions and have minimal, if any errors in referencing, expression, grammar, spelling and punctuation: <em>This grade is assigned for a total (sum of all the assessment components) in the range 85-100%. See assessment components for specific grading criteria.</em></p>\n<p><br/></p>\n<p>To achieve a grade of 6 (Distinction, 75-84%), your essay should reflect an advanced level of achievement. It should demonstrate that you have undertaken wide research, that you are able to form a rigorous, well-organised argument, and that your discussion is coherent and convincing. It should also demonstrate that you are able to evaluate data and/or evidence in a perceptive manner, and that your understanding of problems and issues is perceptive and insightful. Your essay will be well written, clear and concise, follow discipline conventions and have few errors in referencing, expression, grammar, spelling and punctuation: <em>This grade is assigned for a total (sum of all the assessment components) in the range 75-84%. See assessment components for specific grading criteria.</em></p>\n<p><br/></p>\n<p>To achieve a grade of 5 (Credit, 65 – 74%) your essay should reflect a proficient level of achievement. It should demonstrate that you have undertaken the expected level of research, that you are able to develop or adapt convincing arguments and justify them adequately, that you are able to evaluate data and/or evidence in a proficient manner, and that you have a good understanding of problems and issues. The presentation and referencing of your essay will largely follow discipline conventions, perhaps have some errors in grammar, spelling and punctuation, and demonstrate your ability to communicate effectively: <em>This grade is assigned for a total (sum of all the assessment components) in the range 65-74%. See assessment components for specific grading criteria.</em></p>\n<p><br/></p>\n<p>To achieve a grade of 4 (Pass, 50 – 64%) your essay should reflect functional achievement. It should demonstrate that you are able to apply fundamental concepts and skills, that you have undertaken a basic level of research and have the basic ability to evaluate data and/or evidence, to identify problems and issues, to offer insights and to develop routine arguments. Your organisation, writing, referencing, spelling and grammar will be adequate and use some of the discipline conventions to communicate appropriately: <em>This grade is assigned for a total (sum of all the assessment components) in the range 50-64%. See assessment components for specific grading criteria.</em></p>\n<p><br/></p>\n<p>To achieve a grade of 3 (Marginal Fail, 45 – 49%), your essay should reflect developing levels of achievement. It should demonstrate that you have a superficial knowledge of fundamental concepts and skills, that you have undertaken a basic level of research, made some attempt to evaluate data and/or evidence, to identify problems and issues, and to offer insights. Your arguments, while underdeveloped, show your emerging ability to apply knowledge and skills. Your organisation, writing, spelling and grammar will be adequate, perhaps poor, and your referencing and use of discipline conventions poor/and or inconsistent: <em>This grade is assigned for a total (sum of all the assessment components) in the range 45-49%. See assessment components for specific grading criteria.</em></p>\n<p><br/></p>\n<p>To achieve a grade of 2 (Fail, 25-44%) your essay will reflect deficiencies in skill acquisition and in your understanding of the fundamental concepts of the course. It will demonstrate that you have not undertaken adequate research, that you are unable to evaluate data and/or evidence, to identify problems and issues, or to offer insights adequately. Your arguments will be unsupported and/or inappropriate, your organisation and writing will be poor and/or inappropriate, and referencing and use of discipline conventions poor/and or inconsistent: <em>This grade is assigned for a total (sum of all the assessment components) in the range 25-44%. See assessment components for specific grading criteria</em></p>\n<p><br/></p>\n<p>To achieve a grade of 1 (Low Fail, 0-24%), your essay will reflect minimal evidence of achievement, and exhibit deficiencies in skill acquisition and in your understanding of the fundamental concepts of the course. It will demonstrate that you have not undertaken adequate research, that you are unable to evaluate data and/or evidence, to identify problems and issues, and/or to offer insights adequately. Your arguments will be unsupported and/or inappropriate, your organisation and writing will be poor and/or inappropriate, and referencing and use of discipline conventions poor/and or inconsistent: <em>This grade is assigned for a total (sum of all the assessment components) in the range 1-24%. See assessment components for specific</em></p>\n<p><br/></p>\n<p>Grade X. No assessable work received.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit to Turnitin before 4PM on the due date</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>Late submission of assessment will incur a penalty of 10% of the marks available for the assessment item, per calendar day or part-day after the due date, for a maximum of 7 days, after which a mark of zero will be recorded.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Short assignment 2",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>30% 1300 words </dd>",
            "due_date": "<dd><p>submit to turnitin in Week 11 (Thursday 10th October @ 4PM).</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Write a mission statement and strategy document for a hospital's attempt to review its ethics code, making of the skills and techniques of social philosophy. </p>\n<p><br/></p>\n<p>Your mission statement/ essay will be assessed according to the following criteria: </p>\n<p>1.  Ability to define the topic or philosophical issue under debate. (Topic definition.)</p>\n<p>2. Ability to construct a well-reasoned argument for a certain point of view. (Argument and Structure.)</p>\n<p>3. Depth and breadth of understanding of the various positions in a philosophical debate. (Scope and Depth of Treatment)</p>\n<p>4. Insight and/or originality in interpreting texts or constructing a point of view or argument. (Originality)</p>\n<p>5. Capacity to produce a polished, well-written and appropriately referenced essay. (Presentation)</p>\n<p> </p>\n<p>To achieve a grade of 7 (High Distinction, 85-100%), your essay should reflect an exceptional level of achievement. It should demonstrate that you have undertaken extensive, high-level research, that you are able to form a very rigorous, well-organised argument, and that your discussion is original and creative. It should also demonstrate that you are able to evaluate and organise data and/or evidence in a critical manner and that you have a sophisticated and insightful understanding of problems and issues. Your essay will be very well written, clear and concise, pay strict attention to discipline conventions and have minimal, if any errors in referencing, expression, grammar, spelling and punctuation: <em>This grade is assigned for a total (sum of all the assessment components) in the range 85-100%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>To achieve a grade of 6 (Distinction, 75-84%), your essay should reflect an advanced level of achievement. It should demonstrate that you have undertaken wide research, that you are able to form a rigorous, well-organised argument, and that your discussion is coherent and convincing. It should also demonstrate that you are able to evaluate data and/or evidence in a perceptive manner, and that your understanding of problems and issues is perceptive and insightful. Your essay will be well written, clear and concise, follow discipline conventions and have few errors in referencing, expression, grammar, spelling and punctuation: <em>This grade is assigned for a total (sum of all the assessment components) in the range 75-84%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>To achieve a grade of 5 (Credit, 65 – 74%) your essay should reflect a proficient level of achievement. It should demonstrate that you have undertaken the expected level of research, that you are able to develop or adapt convincing arguments and justify them adequately, that you are able to evaluate data and/or evidence in a proficient manner, and that you have a good understanding of problems and issues. The presentation and referencing of your essay will largely follow discipline conventions, perhaps have some errors in grammar, spelling and punctuation, and demonstrate your ability to communicate effectively: <em>This grade is assigned for a total (sum of all the assessment components) in the range 65-74%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>To achieve a grade of 4 (Pass, 50 – 64%) your essay should reflect functional achievement. It should demonstrate that you are able to apply fundamental concepts and skills, that you have undertaken a basic level of research and have the basic ability to evaluate data and/or evidence, to identify problems and issues, to offer insights and to develop routine arguments. Your organisation, writing, referencing, spelling and grammar will be adequate and use some of the discipline conventions to communicate appropriately: <em>This grade is assigned for a total (sum of all the assessment components) in the range 50-64%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>To achieve a grade of 3 (Marginal Fail, 45 – 49%), your essay should reflect developing levels of achievement. It should demonstrate that you have a superficial knowledge of fundamental concepts and skills, that you have undertaken a basic level of research, made some attempt to evaluate data and/or evidence, to identify problems and issues, and to offer insights. Your arguments, while underdeveloped, show your emerging ability to apply knowledge and skills. Your organisation, writing, spelling and grammar will be adequate, perhaps poor, and your referencing and use of discipline conventions poor/and or inconsistent: <em>This grade is assigned for a total (sum of all the assessment components) in the range 45-49%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>To achieve a grade of 2 (Fail, 25-44%) your essay will reflect deficiencies in skill acquisition and in your understanding of the fundamental concepts of the course. It will demonstrate that you have not undertaken adequate research, that you are unable to evaluate data and/or evidence, to identify problems and issues, or to offer insights adequately. Your arguments will be unsupported and/or inappropriate, your organisation and writing will be poor and/or inappropriate, and referencing and use of discipline conventions poor/and or inconsistent: <em>This grade is assigned for a total (sum of all the assessment components) in the range 25-44%. See assessment components for specific grading criteria</em></p>\n<p> </p>\n<p>To achieve a grade of 1 (Low Fail, 0-24%), your essay will reflect minimal evidence of achievement, and exhibit deficiencies in skill acquisition and in your understanding of the fundamental concepts of the course. It will demonstrate that you have not undertaken adequate research, that you are unable to evaluate data and/or evidence, to identify problems and issues, and/or to offer insights adequately. Your arguments will be unsupported and/or inappropriate, your organisation and writing will be poor and/or inappropriate, and referencing and use of discipline conventions poor/and or inconsistent: <em>This grade is assigned for a total (sum of all the assessment components) in the range 1-24%. See assessment components for specific grading criteria.</em></p>\n<p> </p>\n<p>Grade X: No assessable work received. </p>\n<p> </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit to turnitin before 4PM on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>Late submission of assessment will incur a penalty of 10% of the marks available for the assessment item, per calendar day or part-day after the due date, for a maximum of 7 days, after which a mark of zero will be recorded.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Short Assignment 3",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>30% 1300 words </dd>",
            "due_date": "<dd><p>Assignments are due on Monday 11th November.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>It's 2035 and the world is facing another pandemic. In your groups, identify two 'uncertainties' and conduct a scenario planning exercise to construct 4 plausible scenarios describing how the pandemic might play out relative to those uncertainties in Australia given the broader geopolitical context. Draw on megatrends and other data sources in constructing your scenarios. Collectively formulate a strategy for preparing now to chart a course to a preferred outcome among the set of plausible future outcomes. </p>\n<p>Note: This is a team assignment as befitting strategic planning in organisational contexts, but teams will be required to delegate tasks to individual members and document individual contributions.</p>\n<p> </p>\n<p><br/></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit to Turnitin before 4PM on the due date.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>Late submission of assessment will incur a penalty of 10% of the marks available for the assessment item, per calendar day or part-day after the due date, for a maximum of 7 days, after which a mark of zero will be recorded.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": []
}