{
    "course_title": "Pharmacy Practice and Medicines Management 3B",
    "study_period": "Sem 2 2024",
    "location": "Dutton Park",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/PHRM3102-60040-7460",
    "full_course_code": "PHRM3102-60040-7460",
    "course_code": "PHRM3102",
    "class_code": "60040",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 16/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Apply clinical and therapeutic knowledge, using integrated case-based learning for the following: geriatrics, paediatrics, cancer and cancer therapies, pain management, palliative care and voluntary assisted dying, as well as common poisonings and toxicities, and medication management of patients in the critical care setting"
        },
        {
            "number": "LO2.",
            "description": "Apply relevant legal and ethical frameworks in pharmacy practice"
        },
        {
            "number": "LO3.",
            "description": "Undertake systematic medication reconciliation, synthesise and apply clinical and professional knowledge to resolve medication related problems and collaboratively optimise patient health outcomes"
        },
        {
            "number": "LO4.",
            "description": "Dispense medications safely, effectively and legally and provide a tailored consultation to patients and carers with complex needs"
        },
        {
            "number": "LO5.",
            "description": "Provide patient-centred, socially, and culturally appropriate care in a range of pharmacy practice contexts (including over-the-counter and prescription medication management, and medication review)"
        },
        {
            "number": "LO6.",
            "description": "Demonstrate interprofessional collaborative care"
        },
        {
            "number": "LO7.",
            "description": "Administer injectable formulations in accordance with current jurisdiction-specific legislation, scope of practice and PharmBA Guidelines"
        },
        {
            "number": "LO8.",
            "description": "Demonstrate development of professional competence and expertise through reflective practice in a work-integrated learning environment"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Engagement Tasks",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>20% (5% for each engagement task) </dd>",
            "due_date": "<dd><p>There will be four engagement tasks in this course, with the due dates varying according to your group. See Learn.UQ (Blackboard) for your assessment schedule. The first engagement task is scheduled to be released in teaching week 1. </p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L06",
            "mode": "Activity/ Performance, Product/ Artefact/ Multimedia, Written",
            "category": "Paper/ Report/ Annotation, Role play/ Simulation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>There are four engagement tasks for PHRM3102. These engagement tasks are designed to be completed in groups. We will use case-based discussions (i.e. mini clinical medication reviews and questions) for you and your group to collaboratively complete during the semester. Time to work on your engagement task will be provided during specified tutorials. <strong>It is strongly recommended that students attend these tutorials. </strong>Additionally, you can meet with your group members to work on engagement tasks during your PAS sessions on Monday mornings, and via discussion on MS Teams.</p>\n<p>Together with your peers, you will work as a group on clinical problems and/or case-based scenarios that will enable you to clarify, explain and/or apply concepts and key information, and subsequently create (and share) resources (for example, medication review, counselling on medications/ a medical device and knowledge of different therapeutic/prophylactic regimens e.g. in cancer). This collaborative learning will enable you to explore and articulate your understanding of key concepts with your peers. Engagement Tasks stem help consolidate your knowledge in medication review and patient education, and provide a key opportunity to prepare for assessments (and attract up to 5% per activity for satisfactory completion).</p>\n<p>Please see UQ Blackboard for details on the engagement tasks, which will be released as you progress through the course. Engagement tasks will be described in UQ Blackboard, completed through group collaboration and engagement in MS Teams, and submitted for assessment via MS Teams (or as otherwise advised).</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The engagement tasks will be made available via UQ Blackboard and conducted via Microsoft Teams for group discussions and also submitted via Teams.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Professional Practice Portfolio and Reflection",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>10% (5% for each professional skills task) </dd>",
            "due_date": "<dd><p>There will be two professional skills tasks, with the due dates varying according to your group. See UQ Blackboard for your assessment schedule.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Activity/ Performance",
            "category": "Practical/ Demonstration",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>During weeks 1 to 12 there will be TWO tutorials that will include a professional practice task (i.e. Communication, dispensing, counselling and reflection component). Each tutorial is 3 hours long.<strong> It is strongly recommended that students attend these tutorials </strong>(refer to your PHRM3102 timetable for details).</p>\n<p>During the tutorial you will consider one or more prescriptions. The student must assess whether the script is legal and whether the medication and/or dosage is appropriate for the patient:</p>\n<ol>\n<li>If the script is not legal and/or the dosage is not appropriate, the script is not to be dispensed</li>\n<li>If the script is legal and the dosage is appropriate for the patient, the script is to be dispensed using FRED to produce a dispensing label. The dispensing label with appropriate ancillary labels will be inserted in the “PHRM3102 Label Upload Sheet”, a photo taken of this sheet, and this photo uploaded into the Dispensing ePortfolio - Dispensing submission. The dispensing task will be marked by your tutor.</li>\n</ol>\n<p>Students will be required to submit their professional skills task assessment as the following items:</p>\n<ul>\n<li>original prescription with third party labels</li>\n<li>labelled product(s) with ancillary labels as per current APF</li>\n<li>answer associated questions and reflections (see Learn.UQ for details)</li>\n</ul>\n<p>More information on professional skills tasks and due dates can be found on Learn.UQ in the assessment section.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission: Students are required to submit each professional practice task within 1 hour of the end of the tutorial of the associated module.</strong> Dispensing labels, key counselling points and reflective statements will be uploaded to / completed within the student ePortfolio.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Work-Integrated Learning Portfolio",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p>Submit within 2 weeks of completing your placement. See Learn.UQ (Blackboard) for your placement and assessment schedule.</p></dd>",
            "learning_objectives": "L08",
            "mode": "Written",
            "category": "Placement, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>All students are to submit within 2 weeks of completing their placement: </strong></p>\n<ul>\n<li>A. Community Pharmacy placement WIL portfolio AND</li>\n<li>B. Students allocated to the Hospital Pharmacy placement (half of the cohort) must complete this component of the WIL portfolio, OR</li>\n<li>C. Students allocated to the two-day Residential Aged Care placement (half of cohort) must complete this component of the WIL portfolio.</li>\n</ul>\n<p>PHRM3102 placements are sourced by the WIL Partnerships Coordinator in the School of Pharmacy.</p>\n<p><strong>A.    Community Pharmacy placement WIL portfolio (all students)</strong></p>\n<p>This is a week-long block placement (37.5 hours; 7.5 hours/day). At placement, students are expected to consult with consumers regarding common OTC requests, and take a medication history either from a patient new to the pharmacy or an existing patient presenting with a new medicine and educate a patient on a new medication, all with direct, proactive supervision. Preceptors will make an entrustment decision on EPAs based on student activities across the placement. </p>\n<p>The following components must be fulfilled for the community pharmacy WIL portfolio:</p>\n<p>1.Entrustable Professional Activities (EPAs):</p>\n<ul>\n<li>Provision of OTC Medicines (for relevant clinical area(s) covered in second year late Semester 2 or early semester 1 in third year) (community pharmacy).</li>\n<li>Taking a medication history either from a new patient to the pharmacy or an existing patient presenting with a new medicine.</li>\n<li>Educating a patient on their new medication(s).</li>\n<li><strong>The entrustment decisions can only be made over a full 5-day placement, failure to attend all 5 days will result in no entrustment decision and the student will have to arrange to make up for the missed days</strong> so that an entrustment decision can be made.</li>\n</ul>\n<p>2.Individual Learning Plan (ILP) and Placement Reflection.</p>\n<p>Students must attend the timetabled placement debriefing tutorial in the week following their placement in order to facilitate ILP and Placement Reflection.</p>\n<p><em>Individual learning Plan (ILP): </em>Complete the templates for two learning goals (goals 1 and 2) in the ePortfolio (see templates and Learn.UQ for further instructions). Completing the templates that make up your ILP requires you to provide brief answers to the following questions:</p>\n<ul>\n<li>What do you want to work towards at your next community pharmacy placement?</li>\n<li>How will you and your preceptor know you are making progress toward achieving these goals?</li>\n<li>Which skills, knowledge or experiences do you need to further develop to achieve these goals?</li>\n<li>How will working towards this goal help you develop as a pharmacist and how long do you expect it will take you to reach these goals?</li>\n</ul>\n<p><em>Reflection: </em>The reflection should be a maximum of 500 words, taking into consideration your newly created learning plan. Identify key learning moments or challenges during your placement and discuss self-observation and/or feedback that has informed your performance in relation to these key learning moments. Use the reflection template in the ePortfolio to complete your reflection.</p>\n<p>After the debriefing tutorial, submit your EPAs, ILP and reflection to the ePortfolio via the assessment link in the PHRM3102 Learn.UQ site.</p>\n<p><strong>B.    Hospital Pharmacy placement WIL portfolio (allocated students only)</strong></p>\n<p>This is a week-long block placement (37.5 hours; 7.5 hours/day). Students are allocated to a specific hospital site for their placement. At placement, students are expected to consult with patients, carers, pharmacy staff and other members of the healthcare team to take a best possible medication history, educate a patient on their medication(s) and a chart review that may follow on from the medication history, all with direct, proactive supervision. Preceptors will make an entrustment decision on EPAs based on student activities across the placement.</p>\n<p>For assessment, students must produce self-assessment of Entrustable Professional Activities (EPAs), as well as Placement Reflection and Individual Learning Plan for the next hospital pharmacy placement. The following components MUST be fulfilled for the hospital pharmacy WIL portfolio:</p>\n<p>1.Entrustable Professional Activities (EPAs).</p>\n<ul>\n<li>Taking a medication history.</li>\n<li>Educating a patient on their medication(s).</li>\n<li>Chart review that may follow on from the medication history.</li>\n<li><strong>The entrustment decisions can only be made over a full 5-day placement, failure to attend all 5 days will result in no entrustment decision and the student will have to arrange to make up for the missed days</strong> so that an entrustment decision can be made. Ensure the EPAs are submitted along with the Individual Learning Plan (ILP) and placement reflection.</li>\n</ul>\n<p>2.Individual Learning Plan (ILP) and Placement Reflection.</p>\n<p>Students must attend the timetabled placement debriefing tutorial in the week following their placement in order to facilitate ILP and Placement Reflection.</p>\n<p><em>Individual learning Plan (ILP): </em>Complete the templates for two learning goals (goals 1 and 2) in the ePortfolio (see templates and Learn.UQ for further instructions). These are your learning goals for your ILP and you should fill in the two goal setting templates in the ePortfolio for these. Completing the templates that make up your ILP requires you to provide brief answers to the following questions:</p>\n<ul>\n<li>What do you want to work towards at your next hospital placement?</li>\n<li>How will you and your preceptor know you are making progress toward achieving these goals?</li>\n<li>Which skills, knowledge or experiences do you need to further develop to achieve these goals?</li>\n<li>How will working towards this goal help you develop as a pharmacist and how long do you expect it will take you to reach these goals?</li>\n</ul>\n<p><em>Reflection: </em>The reflection should be a maximum of 500 words, taking into consideration your newly created learning plan. Identify key learning moments or challenges during your placement and discuss self-observation and/or feedback that has informed your performance in relation to these key learning moments. Use the reflection template in the ePortfolio to complete your reflection.</p>\n<p>After the debriefing tutorial, submit your EPAs, ILP and reflection to the ePortfolio via the assessment link in the PHRM3102 Learn.UQ site. </p>\n<p><strong>C.    Residential Aged Care placement WIL portfolio (allocated students only)</strong></p>\n<p>This is a week-long block placement. Students are allocated to a specific residential aged care facility for their placement. The following components MUST be fulfilled for the residential aged care WIL portfolio. <strong>Prior to the end of the placement</strong>, complete an Aged-Care Observation template in the ePortfolio. This template includes:</p>\n<ol>\n<li>Aged care health professional team roles and responsibilities: Identify the roles and responsibilities of the team members you shadowed during the aged care placement.</li>\n<li>Medication Management Process: Describe the medicine management process in a maximum of 300 words.</li>\n<li>Reflection: Students must attend the timetabled placement debriefing tutorial in the week following their placement. Bring along your completed Aged Care Observation template. After the debriefing tutorial, write a 600-word reflection on your experience and the potential opportunities for pharmacists in the residential aged care setting.</li>\n</ol>\n<p>After the debriefing tutorial, submit your completed Aged-Care Observation template and reflection to the ePortfolio via the assessment link in the PHRM3102 Learn.UQ site. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>After the debriefing tutorial, submit the required documents to the ePortfolio via the assessment link in the PHRM3102 Learn.UQ site. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Vaccination training",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p>Vaccination Quiz 4/10/2024 5:00 pm</p>\n<p>Vaccination Workshop 9/10/2024 5:00 pm</p>\n<p>\n</p><p>The vaccination module and quiz will open in teaching week 4. Pass the quiz prior to the end of week 10 to be eligible to attend the vaccination workshop in week 11.</p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L06",
            "mode": "Activity/ Performance, Written",
            "category": "Practical/ Demonstration",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This task involves completing the following items in this order:</p>\n<ol>\n<li>Complete the online learning (in UQ Extend)</li>\n<li>Complete the online quiz (in UQ BlackBoard) - multiple attempts are allowed until you achieve 80% or greater to pass. This must be completed prior to the end of teaching week 10.</li>\n<li>Attend a practical vaccination workshop where you will practice vaccination administration skills and demonstrate these skills in the workshop (you can only complete this workshop if you have successfully completed the online quiz).</li>\n</ol>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission:</strong> Complete the quiz in UQ Blackboard, and complete the vaccination practical assessment during the vaccination workshop.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>Exams submitted after the end of the submission time will incur a <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/requesting-late-penalty-exemption-online-exam\">late penalty</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-4",
            "assessment_title": "Written Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>35%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>2/11/2024 - 16/11/2024</p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L06",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This exam will be an open book written exam that will be completed at home at a set time and date.</p>\n<p>You will be asked to provide a structured clinically appropriate response to integrated case scenario(s) involving patients experiencing conditions discussed throughout the course.</p>\n<p>In your response you will be required to:</p>\n<ul>\n<li>Apply evidence and best-practice guidance regarding management of the condition to the individual.</li>\n<li>Provide a structured response to one or more integrated cases. You will identify and prioritise any clinical problems (in the context of their medications) for the patient and provide a plan with appropriate monitoring and counselling points for resolving the medication-related problem.</li>\n<li>Justify the management plan</li>\n<li>Consider monitoring needs in the context of each problem that you have identified</li>\n<li>Appropriately interpret the role of the pharmacist and other health professionals in supporting the patient</li>\n<li>Consider the ways in which individual patient factors and social situation affect treatment and outcomes</li>\n<li>Prepare the document as a communication of your review to another health professional (e.g. general practitioner, specialist, nurse, or pharmacist)</li>\n</ul>\n<p>Responses will be marked according to a rubric (see UQ Blackboard).</p>\n<p><br/></p>\n<p><em>T</em><strong><em>his task has been designed to be challenging, authentic and complex. </em></strong><em>Whilst students may use Artificial Intelligence (AI) and/or Machine Learning (MT) technologies, successful completion of assessment in this course will require students to use critical thinking to engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools and writing must use appropriate terms used in this course.</em></p>\n<p><strong>Please also note information produced by generative AI may provide responses that are the intellectual property of others and/or incorrect. </strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submitted as a word document via the Turnitin in UQ Blackboard. A submission link will be provided.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>Exams submitted after the end of the submission time will incur a <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/requesting-late-penalty-exemption-online-exam\">late penalty</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-5",
            "assessment_title": "OSCE Oral Consultation Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>35%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>2/11/2024 - 16/11/2024</p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L06",
            "mode": "Oral",
            "category": "Examination, Role play/ Simulation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The oral consultation examination is a school-based exam that is scheduled during the examination period. The exam will likely run over two days; students will be notified of their allocated session via Blackboard prior to the exam revision period.</p>\n<p>The skills and competencies assessed at each station are mapped to Entrustable Professional Activities (EPAs) that will underpin your clinical placements as you progress through the degree.</p>\n<p><strong>OSCE Station [A, Medication History and identification of clinical issues; B, Resolving clinical issues and communication; C, Patient Education] [20-minute exam; 35% overall]: </strong></p>\n<p>This OSCE station has 3 key parts all on the same case, in a community OR hospital setting.</p>\n<p><strong>Part A. Information gathering and history taking, identification of clinical issues and reasoning [15 %]:</strong></p>\n<ul>\n<li>On presentation of a prescription/ hospital medication chart, <strong>complete a full medication history with the patient</strong>. Determine the use of existing and new medication/s. Ensure both pharmacological and non-pharmacological aspects such as difficulties with taking medications, lifestyle, cultural, and social concerns are ascertained.</li>\n<li><strong>Identify clinical issues</strong>. There may be multiple patient-centred clinical issues that are to be identified (in part A) and addressed (in parts B and C).</li>\n</ul>\n<p><strong>Part B. Interprofessional Collaboration - Discussion with the Doctor to resolve any clinical issues [10% ]:</strong></p>\n<ul>\n<li>You are required to explain, and communicate with a doctor, any potential clinical issues that are identified as the pharmacist. You will need to make appropriate recommendations and resolve any clinical issues you identify working collaboratively with the doctor.</li>\n</ul>\n<p><strong>Part C. Patient Education and Medicines Management [10%]:</strong></p>\n<ul>\n<li>After resolution of the issue(s), students will then provide patient counselling to the 'patient' for the solution that was agreed to with the 'doctor’.</li>\n<li>During this interaction the student will need to explain to the patient any medication changes and how to use the medication(s), including: dose; frequency; duration; adverse effects and their management; monitoring and lifestyle issues in patient centred manner.</li>\n<li>Lifestyle advice should also be offered ensuring a holistic, patient centred approach. Consider the ways in which individual patient factors and social situation affect treatment and outcomes.</li>\n</ul>\n<p><br/></p>\n<p><strong>Resources:</strong> Students are permitted to have ONLY a pen and blank paper and may bring an approved calculator into the exam (you may need a calculator to check doses). Students are NOT permitted to bring any other resources into the exam; this includes but is not limited to, notes, phones, textbooks or watches. You will have access to key clinical resources (AMH, APF, MIMS), ensure you are familiar with these resources prior to the exam.</p>\n<p>This oral exam will be recorded and retained as per university policy. The recording will be stored in a secure manner and will only be accessed if required for the purposes of moderation of marking, provision of feedback to the student, and/or re-marking following a successful re-mark application.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission:</strong> The OSCE will be completed in person at the School of Pharmacy during the central exam period.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(22 Jul - 27 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshop Topics</strong><br><p>Module 1: Medication assessment and review skills, Critical thinking and clinical problem solving</p>\n<p>Modules 2 to 4: Geriatric medication management </p>\n<p>Modules 5 and 6: Medication management in chronic conditions using integrated cases</p>\n<p>Module 7: Paediatric medication management</p>\n<p>Module 8: Clinical toxicology and critical care</p>\n<p>Module 9: Pain management</p>\n<p>Module 10: Cancer care</p>\n<p>Module 11: Palliative care and voluntary assisted dying</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Workshop Topics</strong>",
            "topic_description": "Workshop Topics Module 1: Medication assessment and review skills, Critical thinking and clinical problem solving Modules 2 to 4: Geriatric medication management Modules 5 and 6: Medication management in chronic conditions using integrated cases Module 7: Paediatric medication management Module 8: Clinical toxicology and critical care Module 9: Pain management Module 10: Cancer care Module 11: Palliative care and voluntary assisted dying",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(22 Jul - 27 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorials</strong><br><p>Tutorial 1- Community pharmacy medication review and management, introduction to engagement task-1</p>\n<p>Tutorial 2- Hospital medication history taking, reconciliation, and review</p>\n<p>Tutorial 3- Geriatric integrated case and professional practice skills assessment</p>\n<p>Tutorial 4- Geriatric integrated case</p>\n<p>Tutorial 5- OSCE practice, and introduction to engagement task-2</p>\n<p>Tutorial 6- Integrated case-based medication review </p>\n<p>Tutorial 7- Paediatric case(s) and professional skills assessment</p>\n<p>Tutorial 8- Toxicology and critical care case(s), introduction to engagement task-3</p>\n<p>Tutorial 9- Vaccination workshop</p>\n<p>Tutorial 10- Cancer cases, introduction to engagement task-4</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Tutorials</strong>",
            "topic_description": "Tutorials Tutorial 1- Community pharmacy medication review and management, introduction to engagement task-1 Tutorial 2- Hospital medication history taking, reconciliation, and review Tutorial 3- Geriatric integrated case and professional practice skills assessment Tutorial 4- Geriatric integrated case Tutorial 5- OSCE practice, and introduction to engagement task-2 Tutorial 6- Integrated case-based medication review Tutorial 7- Paediatric case(s) and professional skills assessment Tutorial 8- Toxicology and critical care case(s), introduction to engagement task-3 Tutorial 9- Vaccination workshop Tutorial 10- Cancer cases, introduction to engagement task-4",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(22 Jul - 27 Oct)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>UQ Extend active online learning</strong><br><p>Module 1: Medication assessment and review skills, Critical thinking and clinical problem solving</p>\n<p>Modules 2 to 4: Geriatric medication management and Vaccination training</p>\n<p>Modules 5 and 6: Medication management in chronic conditions using integrated cases</p>\n<p>Module 7: Paediatric medication management</p>\n<p>Module 8: Clinical toxicology and critical care</p>\n<p>Module 9: Pain management</p>\n<p>Module 10: Cancer care</p>\n<p>Module 11: Palliative care and voluntary assisted dying</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>UQ Extend active online learning</strong>",
            "topic_description": "UQ Extend active online learning Module 1: Medication assessment and review skills, Critical thinking and clinical problem solving Modules 2 to 4: Geriatric medication management and Vaccination training Modules 5 and 6: Medication management in chronic conditions using integrated cases Module 7: Paediatric medication management Module 8: Clinical toxicology and critical care Module 9: Pain management Module 10: Cancer care Module 11: Palliative care and voluntary assisted dying",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 3 To Week 10(05 Aug - 06 Oct)",
            "activity_type": "Placement",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Work Integrated Learning </strong><br><p>Students will undertake two placement blocks according to their PHRM3102 groups as follows:</p>\n<p>A. Community Pharmacy WIL Placement Portfolio AND</p>\n<p>B. Students allocated to the Hospital Pharmacy placement (half of the cohort) must complete this component of the WIL Portfolio, OR</p>\n<p>C. Students allocated to the two-day Residential Aged Care Placement (remaining half of cohort) must complete this component of the WIL Portfolio.</p>\n<p> </p></br></p><p><strong>Learning outcomes:</strong> L08</p></div></td>",
            "topic_title": "<strong>Work Integrated Learning </strong>",
            "topic_description": "Work Integrated Learning Students will undertake two placement blocks according to their PHRM3102 groups as follows: A. Community Pharmacy WIL Placement Portfolio AND B. Students allocated to the Hospital Pharmacy placement (half of the cohort) must complete this component of the WIL Portfolio, OR C. Students allocated to the two-day Residential Aged Care Placement (remaining half of cohort) must complete this component of the WIL Portfolio.",
            "learning_outcomes": [
                "L08"
            ]
        },
        {
            "learning_period": "Week 11(07 Oct - 13 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Vaccination Workshop</strong><br/><p>Students attend 1 vaccination workshop, scheduled in week 11</p></p><p><strong>Learning outcomes:</strong> L06</p></div></td>",
            "topic_title": "<strong>Vaccination Workshop</strong>",
            "topic_description": "Vaccination Workshop Students attend 1 vaccination workshop, scheduled in week 11",
            "learning_outcomes": [
                "L06"
            ]
        }
    ]
}