{
    "course_title": "Applied Pharmacy Practice 2",
    "study_period": "Sem 2 2024",
    "location": "External",
    "attendance": "Online",
    "url": "https://course-profiles.uq.edu.au/course-profiles/PHRM7082-61806-7460",
    "full_course_code": "PHRM7082-61806-7460",
    "course_code": "PHRM7082",
    "class_code": "61806",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (08/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Practise legally and ethically by complying with and maintaining contemporary knowledge of the legal, professional and ethical framework of pharmacy, including legislation, pharmacy practice standards, codes and guidelines"
        },
        {
            "number": "LO2.",
            "description": "Implement and deliver professional services according to the needs of consumers, taking account of the consumers rights and expectations, thus delivering person-centred care"
        },
        {
            "number": "LO3.",
            "description": "Promote and advocate both the best interests and safety of patients and the public, including engaging in risk management to minimise harm and maximise patient and public safety"
        },
        {
            "number": "LO4.",
            "description": "Apply effective critical thinking to the analysis of issues"
        },
        {
            "number": "LO5.",
            "description": "Demonstrate problem solving skills, application of professional judgement and individual and shared decision-making in a range of areas including but not limited to: primary healthcare, prescription problems, therapeutic problems, and legal and ethical problems, including the ability to recognise and work within personal and legal limitations"
        },
        {
            "number": "LO6.",
            "description": "Apply evidence-based principles to the practice of pharmacy"
        },
        {
            "number": "LO7.",
            "description": "Demonstrate the principles of information literacy to effectively research, review, analyse and share information to enhance practice"
        },
        {
            "number": "LO8.",
            "description": "Promote and contribute to quality use of medicines"
        },
        {
            "number": "LO9.",
            "description": "Apply clinical and contemporary pharmacy knowledge and deliver person-centred care"
        },
        {
            "number": "LO10.",
            "description": "Provide primary health care (identify symptoms, recommend pharmacological and non-pharmacological therapy, and refer where appropriate)"
        },
        {
            "number": "LO11.",
            "description": "Take an accurate patient history as part of overall medication management"
        },
        {
            "number": "LO12.",
            "description": "Effectively and appropriately communicate medication and health-related information with a socially and culturally diverse range of people, including Aboriginal and Torres Strait Islander people"
        },
        {
            "number": "LO13.",
            "description": "Demonstrate interprofessional collaboration"
        },
        {
            "number": "LO14.",
            "description": "Consistently make accurate arithmetic calculations"
        },
        {
            "number": "LO15.",
            "description": "Adopt the principles of life-long learning, including demonstration of reflective practice and applying change where required in order to remain fit-to-practise"
        },
        {
            "number": "LO16.",
            "description": "Engage in self-management, leadership and management of others commensurate with their scope of practice and experience"
        },
        {
            "number": "LO17.",
            "description": "Act as a role-model consistently demonstrating professional and ethical behaviour"
        },
        {
            "number": "LO18.",
            "description": "Contribute to the education and development of others"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Seminar block activities",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 8/07/2024 - 10/07/2024</p>\n<p>\n</p><p>The seminar is held at the School of Pharmacy building face-to-face in person. There is no capacity for online involvement.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L08, L09, L10, L11, L12, L13, L14, L15, L16, L17",
            "mode": "Activity/ Performance",
            "category": "Participation/ Student contribution",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Seminar 3 will be held on Monday 8th, Tuesday 9th and Wednesday 10th July with optional days on Thursday 11th and Friday 12th July.</strong></p>\n<ul>\n<li>The seminar is held at the School of Pharmacy PACE building face-to-face in person. There is no capacity for online involvement.</li>\n<li><strong>Day one to three</strong> of the seminar is a course requirement, and participation in the small group activities and workshops is expected and will be observed and monitored by the course coordinator and tutors. Failure to participate to a satisfactory level may result in an additional assignment to ensure you reach the competencies required for general registration as a pharmacist.</li>\n<li>If you cannot attend days 1-3 of the seminar you must notify the Intern Program Coordinator prior to or on the day of the seminar and provide satisfactory documentation to support your absence (e.g. medical certificate) within 48 hours. You will be required to undertake additional activities to cover the topics missed in the seminars.</li>\n<li><strong>Day three</strong> of the seminar includes a simulated patient interaction.</li>\n<li>The patient interaction simulation will consist of questions in line with requirements for the Pharmacy Board of Australia oral examination.</li>\n<li>Part A addresses primary healthcare, Part B addresses legal and ethical issues and Part C involves a problem solving case.</li>\n<li>Communication is assessed within all three parts of the simulation</li>\n<li>Reference material will only be allowed for part C of the simulation.</li>\n<li>Further information including marking criteria will be provided via Blackboard.</li>\n<li><strong>Day four</strong> of the seminar is optional and provides an opportunity for you to complete LPE 6 (Extemporaneously Prepared Product). Completion of this activity is a Pharmacy Board Intern registration requirement.</li>\n<li><strong>Day five</strong> of the seminar is optional and provides an opportunity for you to either renew your CPR certificate or complete a full First Aid course. The holding of a current FA inc CPR certificate is a Pharmacy Board Intern registration requirement. Day five also provides an opportunity to attain your Mental Health First Aid (MHFA) certificate</li>\n<li>The time you spend attending the seminar can be claimed towards your supervised practice hours and documentation will be provided. </li>\n</ul>\n<p><em>The use of Artificial Intelligence (AI) tools will not be permitted. Any attempted use of AI may constitute student misconduct under the Student Code of Conduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission:</strong> Attend and participate in the small group activities and workshops, including the simulated patient interaction.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>If the submission does not reach the required standard to achieve a pass in the element, the student is permitted to resubmit the element.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "e-Portfolio",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p> 8/11/2024 5:00 pm</p>\n<p>\n</p><p>Interns are encouraged to submit the exercises continuously through semester.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L08, L09, L10, L11, L12, L13, L14, L15, L16, L17, L18",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Throughout the semester you will continue adding to your e-portfolio by completing Learning Portfolio Exercises (LPE 1-6), some CPD activities (CAs 1-4) and Case-based discussions (CbD 1-4). These activities must be completed as part of your requirements for the Intern Training Program. These are completed in the workplace in conjunction with and under supervision from your preceptor. Several of these activities are compulsory Pharmacy Board of Australia intern requirements (e.g. LPE 6). Other activities that will be commenced throughout this semester include additional Continual Professional Development (CPD) activities.</p>\n<ul>\n<li>If you have already completed PHRM7081, you are required to submit the completed <em>'Preceptor feedback and intern performance assessment (Week 26) and </em>'<em>Preceptor feedback and intern performance assessment (Final). </em></li>\n<li>If commencing as a mid-year entry into the program, and you have not yet completed PHRM7081, you must submit the completed <em>Preceptor feedback and intern performance assessment (Week 13).</em></li>\n<li>If you have already completed PHRM7081, you are required to submit all remaining activities to fulfil this requirement.</li>\n<li>If commencing as a mid-year entry into the program, evidence of progress through the course is required – you are required to submit at least 6 activities to your e-portfolio consisting of LPE1, LPE2, 2xCbDs and 2 others.</li>\n</ul>\n<p><em>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Documentary evidence of these exercises will be uploaded to ePortfolio via the portal in Blackboard via the ITP templates provided.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>If the submission does not reach the required standard to achieve a pass in the element, the student is permitted to resubmit the element.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Team Discussion Reports",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p>Discussion 1: 29/07/2024 1:00 pm</p>\n<p>Discussion 2: 16/09/2024 1:00 pm</p>\n<p>\n</p><p><strong>Group response</strong> is due by 1pm on the day immediately following the close of the discussion.</p>\n<p><strong>Peer feedback</strong> is due by 5pm three days following the close of the discussion.</p>\n<p><strong>Team leader reflection</strong> is due by 5pm five days following the close of the discussion. </p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L08, L09, L10, L11, L12, L13, L14, L15, L16, L17, L18",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The purpose of the small group online team discussion series is to generate discussion and debate among interns about professional pharmacy practice issues. There are two small team discussions this semester, one in late July and another in September. They consist of practice-related topics.</p>\n<ul>\n<li>For the dates of the online discussions please consult the timetable on Blackboard.</li>\n<li>Interns are expected to work within their team to produce a team response to the posed questions. The quality of the group response will be assessed (see rubric for marking criteria). </li>\n<li>Refer to the '<em>Intern Guide to Team Discussions</em>' available on Blackboard for additional information.</li>\n<li><strong>Group response:</strong> The group response is due by 1pm on the day immediately following the close of the discussion. It is the team leader's responsibility to ensure submission. Late submissions will not be accepted except under exceptional circumstances considered on a case-by-case basis.</li>\n<li>Feedback will be provided for on-time submissions. </li>\n<li><strong>Peer feedback:</strong> peer feedback is required and is due by 5pm three days following the close of the discussion.</li>\n<li><strong>Team leader reflection:</strong> Team leader for the discussion must submit a reflection on their experience by 5pm five days following the close of the discussion. Team leader reflection only needs to be completed once across the courses PHRM7081/7082.</li>\n</ul>\n<p>Interns who are unable to participate in a team discussion for acceptable reasons and who follow the guidelines for late submission will be offered an opportunity to demonstrate their knowledge and understanding of the material by undertaking a written assignment.</p>\n<p><em>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission:</strong> submit documents via the link provided in Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Online Quiz series",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> Pass/Fail </dd>",
            "due_date": "<dd><p>APC-style 2hr quiz: 26/08/2024 4:30 pm</p>\n<p>Module quizzes: 8/11/2024 5:00 pm</p>\n<p>\n</p><p>The APC-style quiz will be available for completion any time during the 7 days prior to the due date.</p>\n<p>The self-directed learning modules with associated quizzes are available to complete throughout semester.</p></dd>",
            "learning_objectives": "L01, L04, L05, L06, L07, L09, L10, L14",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Self-directed learning modules:</strong> A series of self-directed modules must be completed, and associated quizzes passed (achieve a mark of 65% or more). The quizzes consist of clinical questions and patient profile questions specific to the topic.</p>\n<p><strong>APC-style quiz:</strong> The 2-hr online MCQ quiz will consist of clinical questions, calculations, and forensic (law/privacy/ethics) questions.</p>\n<ul>\n<li>The duration and composition of the quiz and the question types used are based on the format and type used in the Australian Pharmacy Council (APC) written examination that you must successfully pass in order to gain general registration as a pharmacist.</li>\n<li>This is an open book quiz, conducted offsite on your own device at any time during a 7 day period.</li>\n</ul>\n<p><em>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission:</strong> The quiz will be conducted online using Inspera. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 1(08 Jul - 14 Jul)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Seminar block on site at the School of Pharmacy</strong><br><p>This seminar is held face-to-face, in person at the UQ School of Pharmacy, Dutton Park campus during Week 1. </p>\n<p><strong>Monday - Wednesday:</strong> this is a compulsory seminar held over three days commencing each day at 8am and concluding at 5pm. There are three 2-hr workshops each day covering preparation for the national registration written and oral examinations, calculations, mental health conditions and treatments, self-care, interprofessional collaboration and a simulated patient interaction. Guest lecturers will present on contemporary topics.</p>\n<p><strong>Thursday:</strong> this is an optional day that provides an opportunity to complete LPE 6 (Extemporaneously Prepared Product) requirements.</p>\n<p><strong>Friday:</strong> this is an optional day that provides an opportunity to renew your CPR certificate or complete a full First Aid course, and to obtain a Mental Health First Aid certificate.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09, L10, L11, L12, L13, L14, L15, L16, L17, L18</p></div></td>",
            "topic_title": "<strong>Seminar block on site at the School of Pharmacy</strong>",
            "topic_description": "Seminar block on site at the School of Pharmacy This seminar is held face-to-face, in person at the UQ School of Pharmacy, Dutton Park campus during Week 1. Monday - Wednesday: this is a compulsory seminar held over three days commencing each day at 8am and concluding at 5pm. There are three 2-hr workshops each day covering preparation for the national registration written and oral examinations, calculations, mental health conditions and treatments, self-care, interprofessional collaboration and a simulated patient interaction. Guest lecturers will present on contemporary topics. Thursday: this is an optional day that provides an opportunity to complete LPE 6 (Extemporaneously Prepared Product) requirements. Friday: this is an optional day that provides an opportunity to renew your CPR certificate or complete a full First Aid course, and to obtain a Mental Health First Aid certificate.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09",
                "L10",
                "L11",
                "L12",
                "L13",
                "L14",
                "L15",
                "L16",
                "L17",
                "L18"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 16(08 Jul - 24 Nov)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>CPD Activities (CAs) - Workplace</strong><br><p>Complete a health promotion, a continuing education presentation in the workplace, cultural competency awareness and a medicines utilisation evaluation.</p></br></p><p><strong>Learning outcomes:</strong> L01, L04, L05, L06, L07, L08, L12, L13, L15, L17, L18</p></div></td>",
            "topic_title": "<strong>CPD Activities (CAs) - Workplace</strong>",
            "topic_description": "CPD Activities (CAs) - Workplace Complete a health promotion, a continuing education presentation in the workplace, cultural competency awareness and a medicines utilisation evaluation.",
            "learning_outcomes": [
                "L01",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L12",
                "L13",
                "L15",
                "L17",
                "L18"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 15(08 Jul - 27 Oct)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Learning Portfolio Exercises (LPEs)- workplace</strong><br><p>Complete activities on medication safety dispensing accuracy, counselling, conflict resolution management, medicines information enquiry, ADR reporting and extemporaneous product preparation.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09, L10, L11, L12, L13, L14, L15, L16, L17, L18</p></div></td>",
            "topic_title": "<strong>Learning Portfolio Exercises (LPEs)- workplace</strong>",
            "topic_description": "Learning Portfolio Exercises (LPEs)- workplace Complete activities on medication safety dispensing accuracy, counselling, conflict resolution management, medicines information enquiry, ADR reporting and extemporaneous product preparation.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09",
                "L10",
                "L11",
                "L12",
                "L13",
                "L14",
                "L15",
                "L16",
                "L17",
                "L18"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 15(08 Jul - 27 Oct)",
            "activity_type": "Problem-based learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Self-Directed Learning Modules (SDLMs)</strong><br/><p>Select from mouth conditions, ear conditions, eye conditions, respiratory conditions, neurological conditions, smoking cessation, gastrointestinal conditions, travel health, HIV, vaccinations.</p></p><p><strong>Learning outcomes:</strong> L04, L05, L06, L07, L08, L09, L10, L15</p></div></td>",
            "topic_title": "<strong>Self-Directed Learning Modules (SDLMs)</strong>",
            "topic_description": "Self-Directed Learning Modules (SDLMs) Select from mouth conditions, ear conditions, eye conditions, respiratory conditions, neurological conditions, smoking cessation, gastrointestinal conditions, travel health, HIV, vaccinations.",
            "learning_outcomes": [
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09",
                "L10",
                "L15"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 15(08 Jul - 27 Oct)",
            "activity_type": "Case-based learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Case-based discussion (CbD)</strong><br/><p>This activity is undertaken in the workplace and is on the topic of diabetes, cardiovascular conditions or infectious diseases.</p></p><p><strong>Learning outcomes:</strong> L01, L04, L05, L06, L07, L08, L09, L10, L11, L13, L16, L18</p></div></td>",
            "topic_title": "<strong>Case-based discussion (CbD)</strong>",
            "topic_description": "Case-based discussion (CbD) This activity is undertaken in the workplace and is on the topic of diabetes, cardiovascular conditions or infectious diseases.",
            "learning_outcomes": [
                "L01",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09",
                "L10",
                "L11",
                "L13",
                "L16",
                "L18"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 15(08 Jul - 27 Oct)",
            "activity_type": "Case-based learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Case-based discussion (CbD)</strong><br/><p>This activity is undertaken in the workplace and is on a case involving a patient with complex medical and pharmacological needs.</p></p><p><strong>Learning outcomes:</strong> L01, L04, L05, L06, L07, L08, L09, L10, L11, L13, L16, L18</p></div></td>",
            "topic_title": "<strong>Case-based discussion (CbD)</strong>",
            "topic_description": "Case-based discussion (CbD) This activity is undertaken in the workplace and is on a case involving a patient with complex medical and pharmacological needs.",
            "learning_outcomes": [
                "L01",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09",
                "L10",
                "L11",
                "L13",
                "L16",
                "L18"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 4(08 Jul - 04 Aug)",
            "activity_type": "Team Based Learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Team Discussion (TD) 4</strong><br><p>Small groups work together to address a range of healthcare and practice scenarios.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09, L10, L11, L12, L13, L15, L16, L17, L18</p></div></td>",
            "topic_title": "<strong>Team Discussion (TD) 4</strong>",
            "topic_description": "Team Discussion (TD) 4 Small groups work together to address a range of healthcare and practice scenarios.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09",
                "L10",
                "L11",
                "L12",
                "L13",
                "L15",
                "L16",
                "L17",
                "L18"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 5 To Week 11(05 Aug - 22 Sep)",
            "activity_type": "Team Based Learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Team Discussion (TD) 5</strong><br><p>Small groups work together to address a range of healthcare and practice scenarios.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08, L09, L10, L11, L12, L13, L15, L16, L17, L18</p></div></td>",
            "topic_title": "<strong>Team Discussion (TD) 5</strong>",
            "topic_description": "Team Discussion (TD) 5 Small groups work together to address a range of healthcare and practice scenarios.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08",
                "L09",
                "L10",
                "L11",
                "L12",
                "L13",
                "L15",
                "L16",
                "L17",
                "L18"
            ]
        }
    ]
}