{
    "course_title": "Professional Practice 3",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/PHTY4403-64177-7460",
    "full_course_code": "PHTY4403-64177-7460",
    "course_code": "PHTY4403",
    "class_code": "64177",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (10/06/2024 - 12/07/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate ethical and professional decision making and behaviour appropriate to physiotherapy while applying knowledge and understanding of standards of physiotherapy practice, relevant codes of conduct, and client rights"
        },
        {
            "number": "LO2.",
            "description": "Demonstrate a competent level of effective verbal, non-verbal and written communication skills applied to all aspects of practice including interactions with clients, professionals and the community."
        },
        {
            "number": "LO3.",
            "description": "Demonstrate a competent understanding of the presentation and management of a wide range of clinical problems across the lifespan while being respectful and sensitive to individual client needs."
        },
        {
            "number": "LO4.",
            "description": "Demonstrate a competent ability to appropriately, safely, accurately, systematically and efficiently assess a client to determine and prioritise problems via gathering, integrating and interpreting appropriate data related to the patient."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate an appropriate process of clinical reasoning in making decisions related to the client such as developing a hypothesis, determining patient outcomes."
        },
        {
            "number": "LO6.",
            "description": "Demonstrate an understanding of the importance of goal-setting with clients and self-management for return of function, work and leisure activities."
        },
        {
            "number": "LO7.",
            "description": "Demonstrate to a competent standard of ability to interpret, analyse and integrate the assessment findings in the development of a hypothesis."
        },
        {
            "number": "LO8.",
            "description": "Select, develop and implement safe, appropriate and effective physiotherapy and other intervention plan to a competent standard using problem solving skills such as critical thinking and judgement while aiming to achieve client treatment goals."
        },
        {
            "number": "LO9.",
            "description": "Develop an integrative and holistic physiotherapy intervention of patients, acknowledging individual differences."
        },
        {
            "number": "LO10.",
            "description": "Evaluate the effectiveness and efficiency of interventions using appropriate re-evaluation and / or valid and reliable outcome measures."
        },
        {
            "number": "LO11.",
            "description": "Demonstrate the ability to provide advice and education relevant to interventions and formulated hypothesis."
        },
        {
            "number": "LO12.",
            "description": "Demonstrate accurate and appropriate documentation that meets ethical and legal requirements depending on the context."
        },
        {
            "number": "LO13.",
            "description": "Demonstrate the integration of evidence-based practice into the practice setting."
        },
        {
            "number": "LO14.",
            "description": "Demonstrate appreciation of the diverse roles and scope of physiotherapy practice in a range of settings eg community, industry, regional/rural, public, private."
        },
        {
            "number": "LO15.",
            "description": "Demonstrate an appreciation of the roles of other disciplines and participate as a member of an interdisciplinary/ multi-professional team including delegation to staff under physiotherapy supervision."
        },
        {
            "number": "LO16.",
            "description": "Demonstrate an ability to reflect on ones own professional development and physiotherapy practice."
        },
        {
            "number": "LO17.",
            "description": "Demonstrate commitment to wellness, health promotion and injury prevention with clients."
        }
    ],
    "assessments": [],
    "learning_activities": []
}