{
    "course_title": "Politics of Environmental Change",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/POLS7115-62640-7460",
    "full_course_code": "POLS7115-62640-7460",
    "course_code": "POLS7115",
    "class_code": "62640",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Reflection-1 (800-1000 words)",
            "special_indicators": [],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 30/08/2024 1:45 pm</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Reflection Assignments in Politics of Environmental Change are primarily aimed at providing you with an opportunity to record your experiences, insights gained, and questions raised during two phases of the course. </p>\n<p>Think about whether the lectures and seminars provided you with new or surprising insights, or whether issues, materials and literatures discussed rather confirmed or consolidated things you already knew, or perhaps expected.     </p>\n<p>Think also about what practical and organizational problems come into view, and how these affect attempts to devise, project, and implement political solutions to anthropogenic ecological problems.</p>\n<p>A very good way to organize your reflections is to identify problems, formulate questions about these, and sketch potential pathways and strategies towards answering or addressing them. As you do this, make sure that you focus on what was particularly important for you. Rather than provide lengthy, generic summaries for what was raised in the lectures, or during the seminars, you should concentrate on recording what was particularly worthwhile, intriguing, or challenging from your perspective. Identifying questions that the sessions, readings or discussions have raised for you is an excellent way to conclude your reflection, and to help you achieve the ‘learning-feedback-loop' we are aiming for: Doing this exercise by producing a well-written and coherent text will not only attract 'a good mark' ( :-) ), but will also leave you with a document that helps you recall and process the learning experiences from the course.</p>\n<p>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Please submit via the dedicated Turnitin Portal (\"REFLECTION 1\") under the 'Assessment'-tab on the Blackboard Site for POLS7115.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Reflection-2 (800-1000 words)",
            "special_indicators": [],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 20/09/2024 1:45 pm</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The Reflection Assignments in Politics of Environmental Change are primarily aimed at providing you with an opportunity to record your experiences, insights gained, and questions raised during two phases of the course.</p>\n<p>Think about whether the lectures and seminars provided you with new or surprising insights, or whether issues, materials and literatures discussed rather confirmed or consolidated things you already knew, or perhaps expected.</p>\n<p>Think also about what practical and organizational problems come into view, and how these affect attempts to devise, project, and implement political solutions to anthropogenic ecological problems.</p>\n<p>A very good way to organize your reflections is to identify problems, formulate questions about these, and sketch potential pathways and strategies towards answering or addressing them. As you do this, make sure that you focus on what was particularly important for you. Rather than provide lengthy, generic summaries for what was raised in the lectures, or during the seminars, you should concentrate on recording what was particularly worthwhile, intriguing, or challenging from your perspective. Identifying questions that the sessions, readings or discussions have raised for you is an excellent way to conclude your reflection, and to help you achieve the ‘learning-feedback-loop' we are aiming for: Doing this exercise by producing a well-written and coherent text will not only attract 'a good mark' ( :-) ), but will also leave you with a document that helps you recall and process the learning experiences from the course.</p>\n<p>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Please submit via the dedicated Turnitin Portal (\"REFLECTION 2\") under the 'Assessment'-tab on the Blackboard Site for POLS7115.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Long Essay (3000 words)",
            "special_indicators": [],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 25/10/2024 1:45 pm</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You will write a 3000 word argumentative research essay on one question you choose from the list of topics (available from Week 8 via Blackboard).</p>\n<p>More information and advice available on the Blackboard site for the course (under the \"Assessments\" tab).</p>\n<p>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>Submission:</strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Opening and Survey of Ecological Challenges</strong><br><p>Climate change, Soil loss, Insectageddon, Biodiversity Loss, Pollution (Plastic Oceans, Atmospheric ), Fresh water decline/shortages, Declining Cryosphere</p></br></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Opening and Survey of Ecological Challenges</strong>",
            "topic_description": "Opening and Survey of Ecological Challenges Climate change, Soil loss, Insectageddon, Biodiversity Loss, Pollution (Plastic Oceans, Atmospheric ), Fresh water decline/shortages, Declining Cryosphere",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Approach I: Global problems, transnational solution</strong><br><p>We look at contemporary attempts to make sense of transnational (including global) efforts to address issues related to environmental degradation. International diplomatic activities and institution-building are the focus of research projects such as the Earth Systems Governance (ESG) network. The lecture explores this as one instance of attempts to get to grips with normative and analytical challenges posited by the politics of environmental change in international and global settings.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Approach I: Global problems, transnational solution</strong>",
            "topic_description": "Approach I: Global problems, transnational solution We look at contemporary attempts to make sense of transnational (including global) efforts to address issues related to environmental degradation. International diplomatic activities and institution-building are the focus of research projects such as the Earth Systems Governance (ESG) network. The lecture explores this as one instance of attempts to get to grips with normative and analytical challenges posited by the politics of environmental change in international and global settings.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Approach II: Political Ecology the bottom-up</strong><br><p>This lecture introduces and develops the Political Ecology approach as counter-balance to globally scoped theoretical and practical conceptions of environmental politics such as ESG. Political Ecology emerged from human geography and has been concerned with studying and understanding the impacts and implications of the framing of environmental politics at levels above the biomes and landscapes inhabited by human communities. This complements approaches like ESG, but also raises important criticisms of the latter.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Approach II: Political Ecology the bottom-up</strong>",
            "topic_description": "Approach II: Political Ecology the bottom-up This lecture introduces and develops the Political Ecology approach as counter-balance to globally scoped theoretical and practical conceptions of environmental politics such as ESG. Political Ecology emerged from human geography and has been concerned with studying and understanding the impacts and implications of the framing of environmental politics at levels above the biomes and landscapes inhabited by human communities. This complements approaches like ESG, but also raises important criticisms of the latter.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 5(19 Aug - 25 Aug)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Approach III: Ecology as integral to Politics</strong><br><p>The third and final instalment of our Approaches segment is dedicated to exploring what we may call relational ways: In many indigenous philosophical systems, law, politics, and ethics are integrally connected with land, place and all the life it sustains, without inhibiting the pursuit of human needs and objectives. The lecture covers some examples and reconstructs some key reasons why political thought couched in (broadly) Eurocentric, science-oriented registers has such difficulties understanding such relational ways of knowing and acting. The final section of the lecture draws the three Approaches together as each representing different political and analytical possibilities.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Approach III: Ecology as integral to Politics</strong>",
            "topic_description": "Approach III: Ecology as integral to Politics The third and final instalment of our Approaches segment is dedicated to exploring what we may call relational ways: In many indigenous philosophical systems, law, politics, and ethics are integrally connected with land, place and all the life it sustains, without inhibiting the pursuit of human needs and objectives. The lecture covers some examples and reconstructs some key reasons why political thought couched in (broadly) Eurocentric, science-oriented registers has such difficulties understanding such relational ways of knowing and acting. The final section of the lecture draws the three Approaches together as each representing different political and analytical possibilities.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Three Approaches in Context: 'Extractivism'</strong><br><p>Dependence on mineral resources of different kinds has driven a rapid expansion of mining activities around the world, with some projecting future mining explorations in space. In this lecture, we use the three approaches lens we developed during the first part of the course to investigate political and policy tensions around such operations. The example of the Galilei Basin in Queensland provides one backdrop to the analysis, as we ask how differential interests, power, and political outlooks confront each other. We also address the question of the futures of mining, particularly in the context of technological change, and the need for new resources in post-fossil-fuel economies.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Three Approaches in Context: 'Extractivism'</strong>",
            "topic_description": "Three Approaches in Context: 'Extractivism' Dependence on mineral resources of different kinds has driven a rapid expansion of mining activities around the world, with some projecting future mining explorations in space. In this lecture, we use the three approaches lens we developed during the first part of the course to investigate political and policy tensions around such operations. The example of the Galilei Basin in Queensland provides one backdrop to the analysis, as we ask how differential interests, power, and political outlooks confront each other. We also address the question of the futures of mining, particularly in the context of technological change, and the need for new resources in post-fossil-fuel economies.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 7(02 Sep - 08 Sep)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Three Approaches in Context: The Example of Climate Mitigation</strong><br><p>In this lecture, we focus on the politics of climate change, using our three approaches frame. ESG envisages international institutional transformations and a realignment of policy-priorities globally that would be facilitated through such reforms. Political Ecology considers the consequences and implications of such attempts at coordinated action and poses the question of who is burdened with having to change against the backdrop of ecological impacts. Indigenous political thought instead offers different institutional ideas and ways of reconfiguring what could be done to address both, the implications of climate change, and the dynamics that keep contributing to it.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Three Approaches in Context: The Example of Climate Mitigation</strong>",
            "topic_description": "Three Approaches in Context: The Example of Climate Mitigation In this lecture, we focus on the politics of climate change, using our three approaches frame. ESG envisages international institutional transformations and a realignment of policy-priorities globally that would be facilitated through such reforms. Political Ecology considers the consequences and implications of such attempts at coordinated action and poses the question of who is burdened with having to change against the backdrop of ecological impacts. Indigenous political thought instead offers different institutional ideas and ways of reconfiguring what could be done to address both, the implications of climate change, and the dynamics that keep contributing to it.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Three Approaches in Context: Fisheries</strong><br><p>Marine and fresh-water fisheries are an important food-source, but also pose significant challenges in terms of environmental impacts. Well take the three framings to investigate how fisheries resources are configured within each and consider what conflicts might arise when different political orientations towards managing these confront each other in practical settings. The ESG approach is consistent with sustainable intensification, political ecology stresses the dilemmas into which local fisheries are forced by national and transnational regulation and competition, and indigenous or artisanal approaches stress the co-dependencies of fish, humans and maintenance of habitat integrity. All three have implications for what may or may not be done to address policy problems with environmental impacts of fisheries.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Three Approaches in Context: Fisheries</strong>",
            "topic_description": "Three Approaches in Context: Fisheries Marine and fresh-water fisheries are an important food-source, but also pose significant challenges in terms of environmental impacts. Well take the three framings to investigate how fisheries resources are configured within each and consider what conflicts might arise when different political orientations towards managing these confront each other in practical settings. The ESG approach is consistent with sustainable intensification, political ecology stresses the dilemmas into which local fisheries are forced by national and transnational regulation and competition, and indigenous or artisanal approaches stress the co-dependencies of fish, humans and maintenance of habitat integrity. All three have implications for what may or may not be done to address policy problems with environmental impacts of fisheries.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ecology and Political Conflict</strong><br><p>We turn to Peace and Conflict, and to question about what ecological change and society/nature relations have to do with this. It seems intuitive that inter-community conflicts have environmental impacts and implications. Conversely, though, there seems to be much less general appreciation of how human relations with the natural world may drive such conflicts. In this lecture we explore this by focusing on how different ways of organizing and institutionalizing societal relations with nature may drive politics of conflict and/or confrontation. We look at two examples, one more, one less obvious, with an aim to develop an understanding of the challenges of analysing and resolving such conflicts. In this context, a we develop a deeper understanding of the limitations of received conceptions of politics, complementing our three approaches learnings.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Ecology and Political Conflict</strong>",
            "topic_description": "Ecology and Political Conflict We turn to Peace and Conflict, and to question about what ecological change and society/nature relations have to do with this. It seems intuitive that inter-community conflicts have environmental impacts and implications. Conversely, though, there seems to be much less general appreciation of how human relations with the natural world may drive such conflicts. In this lecture we explore this by focusing on how different ways of organizing and institutionalizing societal relations with nature may drive politics of conflict and/or confrontation. We look at two examples, one more, one less obvious, with an aim to develop an understanding of the challenges of analysing and resolving such conflicts. In this context, a we develop a deeper understanding of the limitations of received conceptions of politics, complementing our three approaches learnings.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Mid Sem break(23 Sep - 29 Sep)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-Semester Break</strong><br><p>No Lectures/Seminars</p></br></p></div></td>",
            "topic_title": "<strong>Mid-Semester Break</strong>",
            "topic_description": "Mid-Semester Break No Lectures/Seminars",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Managing Ecological Change: Reformism in Internati</strong><br/><p>In this session, we discuss and investigate the politics of economic choices in more detail. It is clear and well-established that the dominant capitalist model of economic development and accumulation has accelerated and exacerbated many of the negative trends we now experience in environmental change and crisis. Today, we look at those attempts to green global economic activities that work from the premises of the current system and aim to include additional environmental safeguards and components. One of these attempts, The Economics of Ecosystems and Biodiversity (TEEB) initiative, argues that valuing nature is key to protecting it. We unpack that approach and probe its potentials and problems.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Managing Ecological Change: Reformism in Internati</strong>",
            "topic_description": "Managing Ecological Change: Reformism in Internati In this session, we discuss and investigate the politics of economic choices in more detail. It is clear and well-established that the dominant capitalist model of economic development and accumulation has accelerated and exacerbated many of the negative trends we now experience in environmental change and crisis. Today, we look at those attempts to green global economic activities that work from the premises of the current system and aim to include additional environmental safeguards and components. One of these attempts, The Economics of Ecosystems and Biodiversity (TEEB) initiative, argues that valuing nature is key to protecting it. We unpack that approach and probe its potentials and problems.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 11(07 Oct - 13 Oct)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Alternatives?</strong><br/><p>We continue with the theme of ecology and political economy. Are there alternatives to contemporary growth imperatives? We consider three: 1) Ecological Modernization Theory, which effectively argues for technology-driven, rapid, greened modernization by way of escalating efficiency. 2) Social Ecology, which draws from ideas about ecologically embedded political autonomy, and has been put into practice in part by Kurdish followers of Abdullah Ocalan. 3) Restorative Ecology/Agriculture, which comprises projects directed at reversing damaged landscapes or improving biodiversity. What economies and economics do such alternatives require?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Alternatives?</strong>",
            "topic_description": "Alternatives? We continue with the theme of ecology and political economy. Are there alternatives to contemporary growth imperatives? We consider three: 1) Ecological Modernization Theory, which effectively argues for technology-driven, rapid, greened modernization by way of escalating efficiency. 2) Social Ecology, which draws from ideas about ecologically embedded political autonomy, and has been put into practice in part by Kurdish followers of Abdullah Ocalan. 3) Restorative Ecology/Agriculture, which comprises projects directed at reversing damaged landscapes or improving biodiversity. What economies and economics do such alternatives require?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Political Institutions &amp; Political Theories</strong><br/><p>Building on the previous sessions, we revisit the three approaches from the first part of the course. This time, we concern ourselves with the question of political institutions and their justifications. Political theories are concerned with how, and about what, rules should be made that may be considered binding, legitimate, and comprehensive. In different ways, the contemporary ecological crisis has laid open the inadequacies of competing political theories. What may we take from the three approaches towards more adequate expressions of justified political organization, both with regard to the Social Question, and the Ecological Question?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Political Institutions &amp; Political Theories</strong>",
            "topic_description": "Political Institutions & Political Theories Building on the previous sessions, we revisit the three approaches from the first part of the course. This time, we concern ourselves with the question of political institutions and their justifications. Political theories are concerned with how, and about what, rules should be made that may be considered binding, legitimate, and comprehensive. In different ways, the contemporary ecological crisis has laid open the inadequacies of competing political theories. What may we take from the three approaches towards more adequate expressions of justified political organization, both with regard to the Social Question, and the Ecological Question?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Essay Writing Week :-)</strong><br/><p>Reading and Writing Week.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Essay Writing Week :-)</strong>",
            "topic_description": "Essay Writing Week :-) Reading and Writing Week.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Summary</strong><br/><p>The final lecture begins where we left off in the previous week, and looks back at the course, and the topics we have covered. Our main objective is to establish in what ways our entry into the Politics of Environmental Change has only allowed us to explore some important aspects of what is at stake. How should we prepare ourselves as researchers to take our interest in this field further?</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Summary</strong>",
            "topic_description": "Summary The final lecture begins where we left off in the previous week, and looks back at the course, and the topics we have covered. Our main objective is to establish in what ways our entry into the Politics of Environmental Change has only allowed us to explore some important aspects of what is at stake. How should we prepare ourselves as researchers to take our interest in this field further?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        }
    ]
}