{
    "course_title": "Conceptions of World Politics",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/POLS3208-63086-7460",
    "full_course_code": "POLS3208-63086-7460",
    "course_code": "POLS3208",
    "class_code": "63086",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand different ways of thinking about international politics."
        },
        {
            "number": "LO2.",
            "description": "Apply different traditions of thinking about international relations to the examination of practical dilemmas in world politics."
        },
        {
            "number": "LO3.",
            "description": "Demonstrate advanced skills of critical analysis and reflection."
        },
        {
            "number": "LO4.",
            "description": "Demonstrate enhanced skills in written communication."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Tutorial Participation and Blog Entries",
            "special_indicators": [],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p>Blog One Week 5 Mon - Week 5 Fri</p>\n<p>Blog Two Week 7 Mon - Week 7 Fri</p>\n<p>Blog Three Week 10 Fri - Week 11 Fri</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Activity/ Performance",
            "category": "Participation/ Student contribution",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The tutorial program is comprised of two components: 5% of your overall mark will be allocated for participating in five tutorial seminars and 15% for submitting three blog entries.</p>\n<p>Students will receive one mark for participation in each of five tutorials if they:</p>\n<ul>\n<li>Attend</li>\n<li>Listen to others</li>\n<li>Illustrate a willingness to speak or participate in-class activities</li>\n<li>Engage other students respectfully.</li>\n</ul>\n<p>In addition to attending tutorials, students are required to submit three blog entries on the course Blackboard site. These entries will involve addressing a key question posted by the course coordinator for that blog. Each entry will be assessed on the quality of your engagement and critical interaction with the weekly readings, lecture material and key questions. You are required to post the entry on a blog on the Blackboard site so students can learn from each other. Each blog entry is worth 5% of your overall grade.</p>\n<p>Each blog will open at the start of the teaching week and close at the end of the week.</p>\n<p><strong>The first blog opens on 19 August and closes on 23 August at 2pm</strong></p>\n<p><strong>The second blog opens on 2 September and closes on 6 September at 2pm.</strong></p>\n<p><strong>The third blog opens on 4 October and closes on 11 October at 2pm. </strong></p>\n<p>Further information concerning the purpose and structure of the blog are available in the Blog Guidelines and Blog Marking Criteria that form part of their Electronic Course Profile. They are also available on Blackboard. If you have further questions, please put them up on the Discussion Board.</p>\n<p><strong>Artificial Intelligence</strong> </p>\n<p>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments for this course will be submitted electronically via Blackboard and using <em>Turnitin</em> by 2pm.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Take-Home Assignment (1000 words)",
            "special_indicators": [],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 16/08/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The take-home assignment explores key concepts and theories. It also asks students to compare different theoretical traditions and employ their own analytical skills to examine key issues in global politics. You will be expected to write one essay of 1,000 words. You will have 76 hours to complete the take-home assignment.</p>\n<p><strong>Students receive the questions for the Take-Home Assignment on Monday 12 August at 10am and must submit their answer via Turnitin on Blackboard by 2pm on Friday 16 August.</strong></p>\n<p><strong>Artificial Intelligence</strong> </p>\n<p>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments for this course will be submitted electronically via Blackboard and using <em>Turnitin</em>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Research Assignment (2500 words)",
            "special_indicators": [],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 18/10/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You will be expected to submit an essay of 2,500 words (word processed, double-line spaced and properly referenced with full bibliography). Topics and further instructions will be assigned in due course.</p>\n<p>Note that the essays must do more than merely present factual evidence. They must be analytical in nature and integrate knowledge derived from lectures, the required readings, the tutorials / zoom sessions and additional research. The POLSIS Essay Guide is available at <a href=\"https://polsis.uq.edu.au/student-support\">https://polsis.uq.edu.au/student-support</a>. Please follow either of the referencing styles outlined in the Essay Guide. Students may also want to consult the following sources: Brigid Ballard and John Clanchy, Essay Writing for Students: A Practical Guide (South Melbourne: Longman, 1997) and Lionel Menasche, Writing a Research Paper (Ann Arbour: The University of Michigan Press, 1997).</p>\n<p><strong>Students must submit their essays via Turnitin on Blackboard by 2pm on Friday 18 October.</strong></p>\n<p><strong>Artificial Intelligence</strong> </p>\n<p>Assessment tasks are intended to evaluate a student’s abilities, skills, and knowledge. Unless explicitly stated otherwise in the assessment instructions, assessments are to be completed without the aid of Artificial Intelligence (AI) and Machine Translation (MT). Failure to comply with this direction may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Assignments for this course will be submitted electronically via Blackboard and using <em>Turnitin</em>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>1. Introduction and Course Outline</strong><br><p>The purpose of this opening lecture is to give students a broad idea of the content and format of the course. The main themes will be introduced and the key learning objectives outlined. We will, in particular, explore why theory is a useful   indeed necessary   \"tool\" for understanding international politics. We will, for instance, discuss how different traditions of thought provide different ways of thinking about key political issues, such as war, violence, conflict resolution, the role of states, sovereignty and the media. </p>\n<p>The final part of the session will provide a very brief overview of the key theories we will study during the semester. The second part of the session will then explain in detail the organisation of the course, including our learning activities. </p>\n<p>Students can engage the required reading below either before the lecture or after. But, as with any of the required reading, it is absolutely essential that it is read very carefully. You should also summarize the reading, noting its key arguments and elaborating on your own reactions to them. Make sure you are using these engagements with the readings, together with what you have learned from the lectures as well as from the further readings, when engaging with fellow students in your tutorials.<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>1. Introduction and Course Outline</strong>",
            "topic_description": "1. Introduction and Course Outline The purpose of this opening lecture is to give students a broad idea of the content and format of the course. The main themes will be introduced and the key learning objectives outlined. We will, in particular, explore why theory is a useful   indeed necessary   \"tool\" for understanding international politics. We will, for instance, discuss how different traditions of thought provide different ways of thinking about key political issues, such as war, violence, conflict resolution, the role of states, sovereignty and the media. The final part of the session will provide a very brief overview of the key theories we will study during the semester. The second part of the session will then explain in detail the organisation of the course, including our learning activities. Students can engage the required reading below either before the lecture or after. But, as with any of the required reading, it is absolutely essential that it is read very carefully. You should also summarize the reading, noting its key arguments and elaborating on your own reactions to them. Make sure you are using these engagements with the readings, together with what you have learned from the lectures as well as from the further readings, when engaging with fellow students in your tutorials. .",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 1</strong><br><p>Student Questions:<br/>\n \tWhat is theory? What is the purpose of theory? Does it reflect or shape reality? What is the difference between problem-solving and critical theories?<br/>\n \tWhat do the following terms mean: epistemology, ontology, foundationalism, paradigm, level of analysis, incommensurability, rationalism, reflectivism, empiricism, positivism, post-positivism, cosmopolitanism and communitarianism?<br/>\n \tWhat do first, second and third image of analysis refer to?<br/>\n \tWhat are the \"great debates\" in international relations theory? What did they discuss? When did they take place?<br/>\n \tWhat are the main theoretical traditions in the study of world politics? What is their image of the world? At what levels of analysis do they operate? What implicit ethical assumptions do they have?<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Tutorial 1</strong>",
            "topic_description": "Tutorial 1 Student Questions: What is theory? What is the purpose of theory? Does it reflect or shape reality? What is the difference between problem-solving and critical theories? What do the following terms mean: epistemology, ontology, foundationalism, paradigm, level of analysis, incommensurability, rationalism, reflectivism, empiricism, positivism, post-positivism, cosmopolitanism and communitarianism? What do first, second and third image of analysis refer to? What are the \"great debates\" in international relations theory? What did they discuss? When did they take place? What are the main theoretical traditions in the study of world politics? What is their image of the world? At what levels of analysis do they operate? What implicit ethical assumptions do they have? .",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>2. Theory and World Politics</strong><br><p>This is an important preliminary session on the role and nature of theories. We start by exploring what theories are. We note, in particular, that theories are not juxtaposed to reality. Rather, they are an essential element of making sense of the \"real\" life of politics. Indeed, the notion of \"theory\" is derived of the original Greek word   theoria − which means \"to see\". Theories, then, are ways of \"seeing\" the world. </p>\n<p>The lecture will then introduce the key conceptual terms and issues necessary to understand theories. We will discuss what epistemologies are, talking about positivism and post-positivism, for instance. We will talk about ontologies and distinguish among different levels of analysis. We will juxtapose problem-solving and critical theories, and we will also explore the key nature of the so-called great debates in international relations theory.</p>\n<p>Throughout the semester we will ask four key questions of each theory we study:<br/>\n1.\tWhat is the broad image of the world? (conflict, harmony, anarchy, hierarchy, etc.)<br/>\n2.\tHow can we know this world? (nature and limit of knowledge; the role of the theorist, etc.)<br/>\n3.\tWho are the main actors in this world? (states, individuals, groups, companies, etc.)<br/>\n4.\tWhat possibilities for ethics and peace exist in this world? (constant conflict, possibility for collaboration, etc.)<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>2. Theory and World Politics</strong>",
            "topic_description": "2. Theory and World Politics This is an important preliminary session on the role and nature of theories. We start by exploring what theories are. We note, in particular, that theories are not juxtaposed to reality. Rather, they are an essential element of making sense of the \"real\" life of politics. Indeed, the notion of \"theory\" is derived of the original Greek word   theoria − which means \"to see\". Theories, then, are ways of \"seeing\" the world. The lecture will then introduce the key conceptual terms and issues necessary to understand theories. We will discuss what epistemologies are, talking about positivism and post-positivism, for instance. We will talk about ontologies and distinguish among different levels of analysis. We will juxtapose problem-solving and critical theories, and we will also explore the key nature of the so-called great debates in international relations theory. Throughout the semester we will ask four key questions of each theory we study: 1.\tWhat is the broad image of the world? (conflict, harmony, anarchy, hierarchy, etc.) 2.\tHow can we know this world? (nature and limit of knowledge; the role of the theorist, etc.) 3.\tWho are the main actors in this world? (states, individuals, groups, companies, etc.) 4.\tWhat possibilities for ethics and peace exist in this world? (constant conflict, possibility for collaboration, etc.) .",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 2</strong><br><p>Student Questions:<br/>\n \tTo what extent can the prevailing Western theories of international relations be relevant to understanding the experience of non-Western people?<br/>\n \tWhat is Orientalism?<br/>\n \tWhat role does culture and language play in theories of the international? What are the main critiques advanced by post-colonial scholars?<br/>\n \tWhat is the difference between postcolonialism and decolonial theory?<br/>\n \tWhat is the contribution of Indigenous approaches to the Theory and Practice of World Politics?<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Tutorial 2</strong>",
            "topic_description": "Tutorial 2 Student Questions: To what extent can the prevailing Western theories of international relations be relevant to understanding the experience of non-Western people? What is Orientalism? What role does culture and language play in theories of the international? What are the main critiques advanced by post-colonial scholars? What is the difference between postcolonialism and decolonial theory? What is the contribution of Indigenous approaches to the Theory and Practice of World Politics? .",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>3. Postcolonial and Decolonial Theories</strong><br><p>Most courses on international relations theories start with the two most influential conventional theories: realism and liberalism. This course pursues a different route. We start, instead, with two theories that explicitly challenge the worldviews upheld by realism and liberalism: postcolonialism and feminism. We do so in order to question, in a more critical way, how theories both help us understand the world and, in doing so, also shape it.</p>\n<p>Postcolonialism engages questions of power and shows how ways of thinking about politics can engender patterns of inclusion and exclusion. One key concern here lies with how the theory and practice of international relations has been dominated by Western approaches. We engage the key theories that scrutinize the consequences of this cultural dominance, such as Edward Said s deconstruction of Orientalism.</p>\n<p>After this we will engage decolonial theories. They go beyond critiquing the legacies of colonialism and seek to validate non-Western ways of knowing and being on their own terms. Among the approaches we examine here are those that seek to explore Indigenous forms of knowledge.<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>3. Postcolonial and Decolonial Theories</strong>",
            "topic_description": "3. Postcolonial and Decolonial Theories Most courses on international relations theories start with the two most influential conventional theories: realism and liberalism. This course pursues a different route. We start, instead, with two theories that explicitly challenge the worldviews upheld by realism and liberalism: postcolonialism and feminism. We do so in order to question, in a more critical way, how theories both help us understand the world and, in doing so, also shape it. Postcolonialism engages questions of power and shows how ways of thinking about politics can engender patterns of inclusion and exclusion. One key concern here lies with how the theory and practice of international relations has been dominated by Western approaches. We engage the key theories that scrutinize the consequences of this cultural dominance, such as Edward Said s deconstruction of Orientalism. After this we will engage decolonial theories. They go beyond critiquing the legacies of colonialism and seek to validate non-Western ways of knowing and being on their own terms. Among the approaches we examine here are those that seek to explore Indigenous forms of knowledge. .",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Royal Queensland Show public holiday </strong><br><p>No Lecture</p></br></p></div></td>",
            "topic_title": "<strong>Royal Queensland Show public holiday </strong>",
            "topic_description": "Royal Queensland Show public holiday No Lecture",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5(19 Aug - 25 Aug)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>4. Feminism</strong><br><p>We now deal with feminism. Here we outline different approaches to feminist theory, including liberal, standpoint, postmodern and postcolonial feminism. We then discuss key conceptual issues, such as the masculine nature of prevailing theories or the need to distinguish between sex and gender. The issues at stake are illustrated through a number of investigations, such as the emergence of a feminist consciousness or the relevance of feminist theory to understanding contemporary security issues.<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>4. Feminism</strong>",
            "topic_description": "4. Feminism We now deal with feminism. Here we outline different approaches to feminist theory, including liberal, standpoint, postmodern and postcolonial feminism. We then discuss key conceptual issues, such as the masculine nature of prevailing theories or the need to distinguish between sex and gender. The issues at stake are illustrated through a number of investigations, such as the emergence of a feminist consciousness or the relevance of feminist theory to understanding contemporary security issues. .",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 3</strong><br><p>Student Questions:<br/>\n \tWhat are the key components of classical realism? What are the key components of neorealism? What are the key differences between them? At what levels of analysis do realists and neorealists operate?<br/>\n \tWhy did Hans Morgenthau argue that  universal moral principles cannot be applied to the actions of states ?<br/>\n \tWhat is the prime cause of interstate war according to Kenneth Waltz?<br/>\n \tWhat is the relationship between realism and historical events, such as World War II and the Cold War?<br/>\n \tAre unipolar, bipolar or multipolar worlds the most stable and peaceful?<br/>\n \tWhat do the following terms mean: power, national interest, Realpolitik, balance of power, anarchy and the security dilemma?<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Tutorial 3</strong>",
            "topic_description": "Tutorial 3 Student Questions: What are the key components of classical realism? What are the key components of neorealism? What are the key differences between them? At what levels of analysis do realists and neorealists operate? Why did Hans Morgenthau argue that  universal moral principles cannot be applied to the actions of states ? What is the prime cause of interstate war according to Kenneth Waltz? What is the relationship between realism and historical events, such as World War II and the Cold War? Are unipolar, bipolar or multipolar worlds the most stable and peaceful? What do the following terms mean: power, national interest, Realpolitik, balance of power, anarchy and the security dilemma? .",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>5. Realism and Neo-Realism</strong><br><p>Having explored approaches that challenge the Western and gendered nature of theories, we now enter more conventional narrative about conceptions of world politics. We first engage realism, which is the oldest and most influential theory of international relations. It is so old and so influential that at times it is not even seen as a theory: it is seen as a realistic description of reality. In this lecture we explore how and why this theory has become so influential. Given the complexity of realism we can only provide a broad overview.</p>\n<p>Both the readings and the lecture will trace the emergence of realism, particularly in international relations. Here we focus on the dilemma about how to deal with the rise of Nazi Germany. We will then discuss the key pillars of realist thought, comparing the classical versions   via E. H. Carr and Hans Morgenthau   with the structural or neorealist version, mostly through exploring the work of Kenneth Waltz.<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>5. Realism and Neo-Realism</strong>",
            "topic_description": "5. Realism and Neo-Realism Having explored approaches that challenge the Western and gendered nature of theories, we now enter more conventional narrative about conceptions of world politics. We first engage realism, which is the oldest and most influential theory of international relations. It is so old and so influential that at times it is not even seen as a theory: it is seen as a realistic description of reality. In this lecture we explore how and why this theory has become so influential. Given the complexity of realism we can only provide a broad overview. Both the readings and the lecture will trace the emergence of realism, particularly in international relations. Here we focus on the dilemma about how to deal with the rise of Nazi Germany. We will then discuss the key pillars of realist thought, comparing the classical versions   via E. H. Carr and Hans Morgenthau   with the structural or neorealist version, mostly through exploring the work of Kenneth Waltz. .",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 7(02 Sep - 08 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>6. Liberalism and Neo-Liberalism</strong><br><p>We now explore the most influential set of theories that exist in opposition to realism: liberalism and neoliberalism. We discuss the historical emergence of liberal internationalism, focusing on the ideas of Immanuel Kant and then on Woodrow Wilson and the League of Nations. Here we juxtapose liberal ideas of international relations with those of realism. We engage the seeming triumph of realism over liberalism in the post-War period, and then engage the re-emergence of liberalism as a major theoretical force   first as part of regime theory in the 1970s and 1980s, and then after the collapse of the Cold War.</p>\n<p>Equipped with this historical knowledge, we then identify the key components of liberal approaches. To do so we discuss the role of interdependence and international regimes, the importance of international law, the prospects for peace in a liberal world, and the nature of democratic peace theory.<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>6. Liberalism and Neo-Liberalism</strong>",
            "topic_description": "6. Liberalism and Neo-Liberalism We now explore the most influential set of theories that exist in opposition to realism: liberalism and neoliberalism. We discuss the historical emergence of liberal internationalism, focusing on the ideas of Immanuel Kant and then on Woodrow Wilson and the League of Nations. Here we juxtapose liberal ideas of international relations with those of realism. We engage the seeming triumph of realism over liberalism in the post-War period, and then engage the re-emergence of liberalism as a major theoretical force   first as part of regime theory in the 1970s and 1980s, and then after the collapse of the Cold War. Equipped with this historical knowledge, we then identify the key components of liberal approaches. To do so we discuss the role of interdependence and international regimes, the importance of international law, the prospects for peace in a liberal world, and the nature of democratic peace theory. .",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 4</strong><br><p>Student Questions:</p>\n<p>On the English School<br/>\n \tWhat are the key components of English School scholarship?<br/>\n \tHow does the English School compare to realism and liberalism?<br/>\n \tWhat is international society? How is it different from the international system?<br/>\n \tWhat tensions exist between conceptions of order and justice in world politics?</p>\n<p>On Marxism and Neo-Marxism<br/>\n \tWhat are the key components of classical Marxism?<br/>\n \tWhat role do economic factors play in Marxist theories? How do liberalism and realism deal with these factors?<br/>\n \tWhat are the key components of the dependency theory? How does its view of the world compare to realism and liberalism?<br/>\n \tWhat are the key components of hegemony, and how can it help us explain social change?<br/>\n \tWhat are the key components of neo-Marxist theories? And why do they draw a difference between problem-solving and critical theories?<br/>\n \tWhat role does emancipation play in Marxism? And why did Marx say:  The philosophers have only interpreted the world, in various ways; the point is to change it ?<br/>\n \tWhat is an ideal speech situation?<br/>\n \tWhat do these terms mean: production, exploitation, imperialism, core vs periphery, hegemony and dialectic?<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Tutorial 4</strong>",
            "topic_description": "Tutorial 4 Student Questions: On the English School What are the key components of English School scholarship? How does the English School compare to realism and liberalism? What is international society? How is it different from the international system? What tensions exist between conceptions of order and justice in world politics? On Marxism and Neo-Marxism What are the key components of classical Marxism? What role do economic factors play in Marxist theories? How do liberalism and realism deal with these factors? What are the key components of the dependency theory? How does its view of the world compare to realism and liberalism? What are the key components of hegemony, and how can it help us explain social change? What are the key components of neo-Marxist theories? And why do they draw a difference between problem-solving and critical theories? What role does emancipation play in Marxism? And why did Marx say:  The philosophers have only interpreted the world, in various ways; the point is to change it ? What is an ideal speech situation? What do these terms mean: production, exploitation, imperialism, core vs periphery, hegemony and dialectic? .",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>7. English School, Marxism and Critical Theory</strong><br><p>We now explore other theories that offer alternatives to the two most powerful approaches, realism and liberalism.<br/>\nFirst, we explore the so-called English School tradition, which to some extent offers a compromise between realism and liberalism. We examine some of the key thinkers, such as Martin Wight and Hedley Bull, and see how their understanding of international society provides theoretical possibilities for understanding why states cooperate even in an allegedly anarchical international society.</p>\n<p>The second part of the lecture examines the various Marxist and neo-Marxist approaches. We begin very briefly with classical Marxists, such as Marx and Engels, paying attention to how they bring imperialism and the economy into view. We then focus primarily on how more recent Marxist approaches theorize international politics. Here we focus on the so-called dependency theory as an illustration of a conceptual approach to international relations that is fundamentally different from realism and liberalism. We then examine the importance of the Italian theorist Antonio Gramsci, focusing in particular on his concept of hegemony and its relevance to international relations. The final part deals with neo-Marxists, or critical theory. Here we deal with theorists of the so-called Frankfurt School, such as Max Horkheimer, Theodor Adorno, and Jurgen Habermas. We examine the relevance of their work to international relations, contrasting, in particular, problem-solving and critical theories.<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>7. English School, Marxism and Critical Theory</strong>",
            "topic_description": "7. English School, Marxism and Critical Theory We now explore other theories that offer alternatives to the two most powerful approaches, realism and liberalism. First, we explore the so-called English School tradition, which to some extent offers a compromise between realism and liberalism. We examine some of the key thinkers, such as Martin Wight and Hedley Bull, and see how their understanding of international society provides theoretical possibilities for understanding why states cooperate even in an allegedly anarchical international society. The second part of the lecture examines the various Marxist and neo-Marxist approaches. We begin very briefly with classical Marxists, such as Marx and Engels, paying attention to how they bring imperialism and the economy into view. We then focus primarily on how more recent Marxist approaches theorize international politics. Here we focus on the so-called dependency theory as an illustration of a conceptual approach to international relations that is fundamentally different from realism and liberalism. We then examine the importance of the Italian theorist Antonio Gramsci, focusing in particular on his concept of hegemony and its relevance to international relations. The final part deals with neo-Marxists, or critical theory. Here we deal with theorists of the so-called Frankfurt School, such as Max Horkheimer, Theodor Adorno, and Jurgen Habermas. We examine the relevance of their work to international relations, contrasting, in particular, problem-solving and critical theories. .",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>No Lecture this week</strong><br><p>No Classes</p></br></p></div></td>",
            "topic_title": "<strong>No Lecture this week</strong>",
            "topic_description": "No Lecture this week No Classes",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid Sem break(23 Sep - 29 Sep)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semester Break</strong><br/></p></div></td>",
            "topic_title": "<strong>Semester Break</strong>",
            "topic_description": "Semester Break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>8. Research and Writing Session</strong><br><p>This session will be used to discuss essay writing. It features discussions on writing styles, structuring, construction of arguments, referencing and other elements necessary for the successful completion of an essay. The lecture will move from general themes related to research and writing to more specific issues about the essay assignment for this class.<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>8. Research and Writing Session</strong>",
            "topic_description": "8. Research and Writing Session This session will be used to discuss essay writing. It features discussions on writing styles, structuring, construction of arguments, referencing and other elements necessary for the successful completion of an essay. The lecture will move from general themes related to research and writing to more specific issues about the essay assignment for this class. .",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(07 Oct - 13 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>9. Poststructuralism and Constructivism</strong><br><p>This session finishes our engagement with alternative theories. First, it deals with so-called poststructural or postmodern positions. We explore postmodernism in two different ways: as an attempt to understand a historical period   shaped by processes of globalization   that is fundamentally different from a modern one; and as a particular way of knowing world politics that revolves around engaging questions of power, knowledge and representation. The lecture introduces the key postmodern theorists, the particular vocabulary they tend to use, as well as the implications the ensuing positions have for the theory and practice of world politics. We then discuss the similarities and differences between postmodern and poststructural approaches.</p>\n<p>The last theory we study is constructivism, which builds on prevailing alternative theories, most notably postmodernism. It borrows from them the idea that reality is socially constructed, but seeks to combine this insight with more conventional understandings of social science prevalent in realist and liberal approaches to international relations. Central to this idea of a middle ground is the assumption that the social construction of reality can   and should − actually be empirically evaluated.<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>9. Poststructuralism and Constructivism</strong>",
            "topic_description": "9. Poststructuralism and Constructivism This session finishes our engagement with alternative theories. First, it deals with so-called poststructural or postmodern positions. We explore postmodernism in two different ways: as an attempt to understand a historical period   shaped by processes of globalization   that is fundamentally different from a modern one; and as a particular way of knowing world politics that revolves around engaging questions of power, knowledge and representation. The lecture introduces the key postmodern theorists, the particular vocabulary they tend to use, as well as the implications the ensuing positions have for the theory and practice of world politics. We then discuss the similarities and differences between postmodern and poststructural approaches. The last theory we study is constructivism, which builds on prevailing alternative theories, most notably postmodernism. It borrows from them the idea that reality is socially constructed, but seeks to combine this insight with more conventional understandings of social science prevalent in realist and liberal approaches to international relations. Central to this idea of a middle ground is the assumption that the social construction of reality can   and should − actually be empirically evaluated. .",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 5</strong><br><p>Student Questions:<br/>\n \tWhat are the key theories of international relations?<br/>\n \tHow convincing is each of them?<br/>\n \tAre they compatible or incommensurable?<br/>\n \tHow can they help us understand the world?<br/>\n \tAsk of each of the theories we studied the key questions we posed at the beginning of the course:<br/>\n \tWhat is the broad image of the world?<br/>\n \tHow can we know this world?<br/>\n \tWho are the main actors in this world?<br/>\n \tWhat possibilities for ethics and peace exist in this world?<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Tutorial 5</strong>",
            "topic_description": "Tutorial 5 Student Questions: What are the key theories of international relations? How convincing is each of them? Are they compatible or incommensurable? How can they help us understand the world? Ask of each of the theories we studied the key questions we posed at the beginning of the course: What is the broad image of the world? How can we know this world? Who are the main actors in this world? What possibilities for ethics and peace exist in this world? .",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>10. Summary and The Future of IR Theory</strong><br><p>This week we review the key theories we have studied during the semester   asking questions about where international relations theory stands now and how it can help us understand the realities of world politics.</p>\n<p>In the first lecture Roland will summarize the key themes of the course. Our tour through IR theory ends with a guest lecture by Dr Emma Hutchison. This session is both an end and a beginning. While paying tribute to and drawing on the history of the field, we will survey prominent emerging trends in conceptualising world politics. Three cutting-edge shifts in how scholars are reflecting on and analysing world politics will be explored in particular. These are: (1) The broad turn to rethinking political agency   from the local to national and global   and specifically how international relations is being transformed through several key  turns , including debates on everyday political experiences, the micro-foundations of international politics, political practices, emotions, embodiment and visuality; (2) Decolonial theory and the need to decolonise the knowledge and practices through which world politics has traditionally taken place; and (3) The increasing attention to interweaving cutting-edge theoretical understandings with practice and policy.<br/>\n.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>10. Summary and The Future of IR Theory</strong>",
            "topic_description": "10. Summary and The Future of IR Theory This week we review the key theories we have studied during the semester   asking questions about where international relations theory stands now and how it can help us understand the realities of world politics. In the first lecture Roland will summarize the key themes of the course. Our tour through IR theory ends with a guest lecture by Dr Emma Hutchison. This session is both an end and a beginning. While paying tribute to and drawing on the history of the field, we will survey prominent emerging trends in conceptualising world politics. Three cutting-edge shifts in how scholars are reflecting on and analysing world politics will be explored in particular. These are: (1) The broad turn to rethinking political agency   from the local to national and global   and specifically how international relations is being transformed through several key  turns , including debates on everyday political experiences, the micro-foundations of international politics, political practices, emotions, embodiment and visuality; (2) Decolonial theory and the need to decolonise the knowledge and practices through which world politics has traditionally taken place; and (3) The increasing attention to interweaving cutting-edge theoretical understandings with practice and policy. .",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>11. Summary: Key Themes in Theory</strong><br/></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>11. Summary: Key Themes in Theory</strong>",
            "topic_description": "11. Summary: Key Themes in Theory",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        }
    ]
}