{
    "course_title": "Applied Gerontology",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/PSYC8291-62823-7460",
    "full_course_code": "PSYC8291-62823-7460",
    "course_code": "PSYC8291",
    "class_code": "62823",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand current major theories pertaining to older adult development, positive ageing and aetiologies of age-related disease processes such as late-life depression and Alzheimers disease"
        },
        {
            "number": "LO2.",
            "description": "Understand and apply specialised assessment, case conceptualisation, diagnostic and treatment strategies to an older population"
        },
        {
            "number": "LO3.",
            "description": "Formulate management plans for older adults in specialist situations (e.g. long-term care settings)"
        },
        {
            "number": "LO4.",
            "description": "Have working knowledge of age-related issues such as competency and guardianship, end of life and hospice care, psychometric and research paradigms, and public policy"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Public Health Message Abstract",
            "special_indicators": [],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p> 19/08/2024 5:00 pm</p></dd>",
            "learning_objectives": "L02",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Your goal is to write up a brief, no more than 350 word summary as to your topic and why you are choosing that topic. This should include making reference to the evidence-base for your topic. References are not included in the word count and you should include no more than 10 references. You will have a chance to discuss the basics of this assignment during the workshop days.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via Turn-it-In link on Blackboard. Please keep a copy of your submission receipt.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Conceptualising older adults: A case study",
            "special_indicators": [],
            "weighting": "<dd>55%</dd>",
            "due_date": "<dd><p> 9/09/2024 5:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You will write a case study using the format stipulated by the Clinical Case Studies journal (https://journals.sagepub.com/home/ccs (https://journals.sagepub.com/home/ccs)) and following their author instructions (https://journals.sagepub.com/author-instructions/CCS (https://journals.sagepub.com/author-instructions/CCS)) except that the word limit will be between 4000 and 5000 words (not including the Reference list). Your inspiration for the case is to come from an older adult character in your movie or book of your choice. Your task will be made \"easier\" if the character is one of the main characters as this will reduce your need to fill in information for the case study based on assumptions. Note that there may be some need regardless of which character you choose to fill in some blanks. These should make sense in terms of the overall narrative you are presenting. Movies you might like to consider include: As Good As It Gets; Gran Torino; The Lady in the Van; The Bucket List; Harry Brown; About Schmidt, etc... Books you might like to consider include The Thursday Murder Club (my personal favourite!); The 100 Year Old Man who Climbed Out the Window and Disappeared; Olive, Again; Elizabeth is Missing; Before the Coffee Gets Cold, etc.... Please consult with the Course Coordinator on your choice if you want to ensure the feasibility of the character. You will have a chance to discuss the basics of this assignment during the workshop days. Essentially the goal of the case study is a write up of \"your\" older adult client.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Case study to be submitted via the Turn-It-In link provided on Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Public Health Message Video",
            "special_indicators": [],
            "weighting": "<dd>35%</dd>",
            "due_date": "<dd><p> 8/10/2024 5:00 pm</p></dd>",
            "learning_objectives": "L01, L04",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Paper/ Report/ Annotation, Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Potential topics dealing with older adults include: how can hearing dogs improve life for older people with hearing loss; relieving stress in later life; how pets can improve quality of life; how to keep your brain healthy; tips for improving mood or anxiety; how to facilitate emotional recovery after a fall; what to know in terms of alcohol intake in later life; exercise for longevity; the real story of vitamins, supplements and ageing; relating to grandchildren – a survival guide for grandparents; how are mood and the microbiome linked in later life; a user’s guide to retirement; help for bereavement; coping with caregiving; how hobbies assist with ageing; driving and ageing; ageism and its consequences; outdoor activities for restoration and longer life; living with the after effects of stroke; dangers of polypharmacy; tips to quit smoking in later life; improve your sleeping habits with age; etc... You will have a chance to discuss the basics of this assignment during the workshop days. You will have already submitted your Public Health Message Abstract detailing your topic of choice in August.</p>\n<p>Requirements:</p>\n<ul>\n<li>2-3 minute video produced using ECHO360. </li>\n<li>Accompanied by a separately uploadable 1-2 page written summary of your public health message (no more than 1000 words) plus reference sheet (10 most relevant references, that may include published material such as course readings, scientific papers, published chapters or books, and \"grey\" literature (e.g. government reports). Any on-line links of note will not count against reference total of 10. The idea of the written summary is to provide the evidence-base behind the message you are aiming to get across in the video (i.e., the video should be readily understood by the general public and not filled with jargon, citations, and such).</li>\n<li>References / links do not count against word limit.</li>\n<li>The written summary document is uploaded to Turn-It-In.</li>\n<li>Please note <strong>extensions are discouraged </strong>for this piece of assessment given that you have between the 5th August and the 10th October to complete this particular piece of assessment. It is therefore an expectation that you manage your time, particularly as the creative content and creation of an actual video is not conducive to cramming the night before, for example.</li>\n<li>We cannot emphasise enough how very important it is that you take on the responsibility of exploring ECHO360 early in the semester to ensure you are able to effectively use this tool and to enable you the time to be able to tease out any issues you may be experiencing. REMEMBER the practice video we created during the workshops!</li>\n<li>It is VERY unwise to think that you will be able to submit the video component on the due date given there are always at least one or two students who experience technological issues. No extension will be granted for such issues unless the UQ servers themselves have issues and a notification is posted by UQ I.T. staff.</li>\n</ul>\n<p> </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The public health message video is to be created using ECHO360 and uploaded to the PSYC8291 Blackboard site via the My Media link. Please ensure you share the video as this means that the course coordinator can see your submission. The written summary document is uploaded via the Turn-It-In link on Blackboard. Please keep a copy of your submission receipt.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction to Applied Gerontology and Basic Issues</strong><br/><p>As well as introducing the students to the course overall, this workshop will focus on lifespan theories, sensory issues in later life, and ageism awareness.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Introduction to Applied Gerontology and Basic Issues</strong>",
            "topic_description": "Introduction to Applied Gerontology and Basic Issues As well as introducing the students to the course overall, this workshop will focus on lifespan theories, sensory issues in later life, and ageism awareness.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Psychiatric Conditions in Later Life</strong><br/><p>This workshop explores issues of assessment, diagnosis and formulation in older adults living with anxiety, depression, dementia, as well as psychopharmacology and medical co-morbidities. </p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Psychiatric Conditions in Later Life</strong>",
            "topic_description": "Psychiatric Conditions in Later Life This workshop explores issues of assessment, diagnosis and formulation in older adults living with anxiety, depression, dementia, as well as psychopharmacology and medical co-morbidities.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Issues and Interventions in Later Life</strong><br/><p>This workshop explores issues of grief and loss as well as sexual identity. The afternoon involves a special guest lecture on reminiscence therapy, as well as a round table discussion of other therapy modalities including IPT, CBT and ACT.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Issues and Interventions in Later Life</strong>",
            "topic_description": "Issues and Interventions in Later Life This workshop explores issues of grief and loss as well as sexual identity. The afternoon involves a special guest lecture on reminiscence therapy, as well as a round table discussion of other therapy modalities including IPT, CBT and ACT.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Residential aged care considerations and interprofessional practice with older people</strong><br/><p>This workshop explores contemporary psychological practice in aged care settings, and interprofessional issues and synergies in practice with older people. </p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Residential aged care considerations and interprofessional practice with older people</strong>",
            "topic_description": "Residential aged care considerations and interprofessional practice with older people This workshop explores contemporary psychological practice in aged care settings, and interprofessional issues and synergies in practice with older people.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Unlocking tools for healthy ageing and assignment wrap-up</strong><br/><p>This workshop explores issues of retirement, planning for healthy longevity, and flourishing. The workshop ends with a discussion of issues and concerns relating to the assignments.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Unlocking tools for healthy ageing and assignment wrap-up</strong>",
            "topic_description": "Unlocking tools for healthy ageing and assignment wrap-up This workshop explores issues of retirement, planning for healthy longevity, and flourishing. The workshop ends with a discussion of issues and concerns relating to the assignments.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}