{
    "course_title": "Human Development and Relationships Across the Life Span",
    "study_period": "Sem 2 2024",
    "location": "Herston",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/PXMH7104-62159-7460",
    "full_course_code": "PXMH7104-62159-7460",
    "course_code": "PXMH7104",
    "class_code": "62159",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Identify, understand and apply critical analysis to selected key theories of human development as they apply to the field of study"
        },
        {
            "number": "LO2.",
            "description": "Demonstrate specialist skills and knowledge required to work with clients mental health challenges throughout the lifespan."
        },
        {
            "number": "LO3.",
            "description": "Understand the importance of human relationships and the broader socio-cultural environment, and how they can either enhance or impact negatively on mental health."
        },
        {
            "number": "LO4.",
            "description": "Understand the importance of developing cultural perspectives and learning to apply cultural sensitivity and humility when working with clients."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Cultural Humility and Professional Practice",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p> 16/08/2024 5:00 pm</p></dd>",
            "learning_objectives": "L03, L04",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Part One: Cultural Sharing (5 minutes)</strong></p>\n<ul>\n<li>You will participate in a cultural sharing event where you present a snapshot of your own culture and identity to your peers in an engaging, discussion-based manner. This informal presentation will be shared during group workshops/tutorials and should highlight one aspect of your background. The definition of culture is broad, encompassing heritage, ethnicity, place of birth or living, childhood upbringing, rituals/traditions, key messages from family, friendship circles, passions, hobbies, identity, faith, beliefs, values, and important memories. Choose an aspect you feel comfortable sharing in a public forum.</li>\n<li>Your presentation should be 2-3 minutes long and can be delivered in various formats such as objects, visuals, written pieces, songs, poetry, photos, products/food, or verbal storytelling. Following your presentation, allow time for one question from the audience, making the total duration 5 minutes.</li>\n</ul>\n<p><strong>Part Two: Reflection (800 words)</strong></p>\n<ul>\n<li>After participating in the cultural sharing event, immerse yourself in your fellow students' cultural presentations. </li>\n<li>Reflect on the cultural experiences shared by others and your own presentation. </li>\n<li>Use these insights to write an 800-word reflective essay discussing the influence of culture and understanding the cultural experiences of others. </li>\n<li>Focus on how these experiences inform your approach to clinical work with cultural humility and curiosity.</li>\n</ul>\n<p><strong>Criteria &amp; Marking</strong></p>\n<ol>\n<li>You are able to provide a summary of your cultural sharing experience, discussing both the giving and hearing of cultural expressions of identity. 5%</li>\n<li>You are able to explore 1 key cultural difference or learning theme identified for yourselves during the cultural sharing experience, and reflect on the potential impact this difference or theme could have in clinical practice. You engage in reflection that inspires cultural humility, respect and curiosity.5%</li>\n<li>You should state how you would navigate this in a clinical setting and demonstrate consideration of the culture of the self (the clinician) and the culture of the client/consumer within a therapeutic alliance in mental health care. You are able to articulate strategies and/or professional skills that are important to your practice when engaging with individuals, families and communities in mental health care and suggest ways to implement this in practice. 5%</li>\n<li>Reflection is written in reflective short essay style, first person approach, within <strong>800 words</strong>. No references are required. </li>\n</ol>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission instructions will be provided via <a href=\"https://learn.uq.edu.au/\">Learn.UQ</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>Assessments submitted after the due date without an approved extension will receive a <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184#:~:text=of%20submitted%20work).-,Penalties%20for%20Late%20Submission,-(48)\">late penalty</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Family Experiences and Therapeutic Practice",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>35%</dd>",
            "due_date": "<dd><p> 20/09/2024 5:00 pm</p></dd>",
            "learning_objectives": "L02, L03, L04",
            "mode": "Written",
            "category": "Essay/ Critique, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Part One: Family Genogram/Community Map (5%)</strong></p>\n<p>You are asked to create a family genogram and/or a map of your family/community to reflect on key relationships and family experiences. This visual representation should include relevant key relationships and, where possible, encompass two to three generations of family members. Use standard symbols and elements of a genogram or an alternative mapping method to illustrate the structure and connections within your family/community.</p>\n<p><strong>Part Two: Reflective Essay (30%)</strong></p>\n<p>In a <strong>1400-word essay</strong>, reflect on how your family of origin, family experiences, and key relationships have shaped your identity and worldview. Articulate key themes, challenges, and learnings that have influenced your life and professional practice in mental health. Address the following points in your reflection:</p>\n<p><em>Influence on Therapeutic Practice:</em></p>\n<ul>\n<li>Discuss how your family, cultural, and community experiences and relationships have shaped your childhood, development, and worldview.</li>\n<li>Explain how these experiences influence your therapeutic practice with individuals and families.</li>\n</ul>\n<p><em>Connection to Self:</em></p>\n<ul>\n<li>Articulate the connection between your experiences and your current sense of self and way of being.</li>\n<li>State the boundaries of confidentiality and safety you used when deciding what information to include in your essay.</li>\n</ul>\n<p><em>Impact on Professional Values:</em></p>\n<ul>\n<li>Reflect on how your family, culture, community, and relationships have impacted your professional values and practice in mental health.</li>\n<li>Present both the strengths and challenges that your experiences bring to your therapeutic practice and alliance.</li>\n</ul>\n<p>Your essay should be self-reflective and well-written, adhering to the word limit. You may include reflective art pieces or photography related to the topic to guide your written reflections.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission instructions will be provided via <a href=\"https://learn.uq.edu.au/\">Learn.UQ</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>Assessments submitted after the due date without an approved extension will receive a <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184#:~:text=of%20submitted%20work).-,Penalties%20for%20Late%20Submission,-(48)\">late penalty</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Mental Health Challenges Across the Lifespan",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 1/11/2024 5:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Product/ Design",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Part One: Therapeutic Resource (35%)</strong></p>\n<p>Select a developmental period and target population discussed in the course, and create a therapeutic resource addressing a mental health challenge experienced by this population. Possible formats include a pamphlet, fact sheet, video, animation, podcast, poster, or worksheets. The resource should provide both psychoeducation and therapeutic strategies suitable for consumers or carers during mental health support.</p>\n<p><em>Criteria:</em></p>\n<ol>\n<li>Developmental Stage and Context:</li>\n<li>Define the chosen developmental stage and provide a contemporary perspective on its relevance to mental health and well-being. (5%)</li>\n<li>Target Population and Objectives:</li>\n<li>Specify the target population within the developmental stage and state the intended audience and goals/objectives of the resource.</li>\n<li>Mental Health Challenge:</li>\n<li>Focus on one mental health challenge relevant to the target population. Explain its key components and implications on mental health and well-being, considering bio-psycho-social, cultural, relational, and developmental factors. Reference contemporary understandings of this issue in Australian society. (15%)</li>\n<li>Learning and Strategies:</li>\n<li>Provide learning materials and strategies that support and improve the well-being of the target population in the context of the discussed mental health challenge. Include at least two relevant activities or therapeutic processes, detailing the practical steps and any limitations or caveats. (10%)</li>\n<li>Format and Presentation:</li>\n<li>Ensure the content, whether read, spoken, or watched, is a <strong>minimum of 4 minutes but no longer than 5 minutes</strong>. The resource should be in a consumer-friendly format suitable for the intended audience. Use appropriate in-text/spoken referencing of literature/theories where relevant.</li>\n</ol>\n<p><strong>Part Two: Written Guide (15%)</strong></p>\n<p>Accompany your therapeutic resource with a written guide (<strong>maximum 1000 words</strong>) intended for other therapists/health professionals. This guide should assist them in using the resource with their consumers/carers.</p>\n<p><em>Criteria:</em></p>\n<ol>\n<li>Context and Purpose:</li>\n<li>Detail the context and purpose of the resource, including the key concepts and theories of development utilised.</li>\n<li>Evidence and Application:</li>\n<li>Provide evidence for the activities/therapeutic processes shared in the resource and explain their potential usage in practice.</li>\n<li>Appropriate Writing:</li>\n<li>Ensure the guide is written appropriately for other therapists and health professionals. Include a bibliography/reference list of literature and other sources used. (5%)</li>\n</ol>\n<p><strong>Submission Instructions</strong></p>\n<ul>\n<li>Compile both your resource and written guide into one file for submission via Turnitin.</li>\n<li>For audio/video files, save the file in your University One Drive folder or a similar electronic drive and include a link in your submitted PDF/Word document.</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission instructions will be provided via <a href=\"https://learn.uq.edu.au/\">Learn.UQ</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>Assessments submitted after the due date without an approved extension will receive a <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184#:~:text=of%20submitted%20work).-,Penalties%20for%20Late%20Submission,-(48)\">late penalty</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Culture Humility and Self in the Therapeutic Alliance</strong><br/><p>Introduction to PXMH7104, Culture Humility and Self in the Therapeutic Alliance. Preparation for Presentation in Week 3. </p>\n<ul>\n<li>Why is understanding human development and relationships important for therapists and mental health practitioners? </li>\n<li>In what ways is it important that we understand our own experience and culture as we work in therapy and mental health? </li>\n<li>How do we negotiate the connection and alliance between the person and our own human self? </li>\n<li>How does culture and our upbringing influence our work with others?</li>\n</ul></p><p><strong>Learning outcomes:</strong> L03, L04</p></div></td>",
            "topic_title": "<strong>Culture Humility and Self in the Therapeutic Alliance</strong>",
            "topic_description": "Culture Humility and Self in the Therapeutic Alliance Introduction to PXMH7104, Culture Humility and Self in the Therapeutic Alliance. Preparation for Presentation in Week 3. Why is understanding human development and relationships important for therapists and mental health practitioners? In what ways is it important that we understand our own experience and culture as we work in therapy and mental health? How do we negotiate the connection and alliance between the person and our own human self? How does culture and our upbringing influence our work with others?",
            "learning_outcomes": [
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Identity, Gender, Sexuality and Belonging </strong><br/><ul>\n<li>How does my assigned gender and experienced gender differ or match? </li>\n<li>How do norms or perceptions impact my mental health and sense of self? </li>\n<li>How does my personal identity interact or fit with those of my family, community and society at large? </li>\n<li>What does belonging mean and what happens when I don’t belong? </li>\n<li>How does my identity (or discrimination for my identity) impact my mental health, and in what contexts and Why? </li>\n<li>How much do I know about the needs of LGBTIQA+ people and who I can support them as a therapist?</li>\n</ul></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Identity, Gender, Sexuality and Belonging </strong>",
            "topic_description": "Identity, Gender, Sexuality and Belonging How does my assigned gender and experienced gender differ or match? How do norms or perceptions impact my mental health and sense of self? How does my personal identity interact or fit with those of my family, community and society at large? What does belonging mean and what happens when I don’t belong? How does my identity (or discrimination for my identity) impact my mental health, and in what contexts and Why? How much do I know about the needs of LGBTIQA+ people and who I can support them as a therapist?",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Workshops/Discussion Topics - Residential Week</strong><br/><p>Active learning about key themes in the course, Cultural Humility, Identity, Inclusive Practice and Child Art/Therapy for all students. Resources and pre-workshop videos listed on <a href=\"https://learn.uq.edu.au/\">Learn.UQ</a>/Learning Resources and Full day Group workshops Tuesday 6th August and Half Day (AM) workshop Thursday 8th August during residential week (Herston Campus). Workshop includes active participation for Assessment 1.</p>\n<p><strong>Please watch </strong>the Cultural Humility video (approx. 1 hr) and Child Art Therapy presentation delivered by the UQ team. </p>\n<p><strong>Prepare your Part 1 for Assessment 1 </strong>(you will conduct this in during a small group exercise).</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Workshops/Discussion Topics - Residential Week</strong>",
            "topic_description": "Workshops/Discussion Topics - Residential Week Active learning about key themes in the course, Cultural Humility, Identity, Inclusive Practice and Child Art/Therapy for all students. Resources and pre-workshop videos listed on Learn.UQ /Learning Resources and Full day Group workshops Tuesday 6th August and Half Day (AM) workshop Thursday 8th August during residential week (Herston Campus). Workshop includes active participation for Assessment 1. Please watch the Cultural Humility video (approx. 1 hr) and Child Art Therapy presentation delivered by the UQ team. Prepare your Part 1 for Assessment 1 (you will conduct this in during a small group exercise).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4(12 Aug - 18 Aug)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Family and Relationship Structures</strong><br/><ul>\n<li>How much do I know and understand about my own family and its impact on me and my work? </li>\n<li>How are other families organised? </li>\n<li>How does this impact on their strengths and vulnerabilities? </li>\n<li>What about being taken away from your family? </li>\n<li>Working with the complexity of family and family/community structures in mental health – what are key skills and perspectives?</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Family and Relationship Structures</strong>",
            "topic_description": "Family and Relationship Structures How much do I know and understand about my own family and its impact on me and my work? How are other families organised? How does this impact on their strengths and vulnerabilities? What about being taken away from your family? Working with the complexity of family and family/community structures in mental health – what are key skills and perspectives?",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Infancy, Attachment, Parenting</strong><br/><ul>\n<li>How does our experience of early relationships with our caregivers influence our development, our sense of self, our world view, our interpersonal skills and sensitivities?</li>\n<li>How does attachment and early relationships impact on children and impact on humans in later life?</li>\n<li>How do we view Development within the infant, and even pre -birth, and the link with relationships. </li>\n<li>How can we understand this time of life e.g. Attachment, Parenting Style, Caregiver mental health?</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Infancy, Attachment, Parenting</strong>",
            "topic_description": "Infancy, Attachment, Parenting How does our experience of early relationships with our caregivers influence our development, our sense of self, our world view, our interpersonal skills and sensitivities? How does attachment and early relationships impact on children and impact on humans in later life? How do we view Development within the infant, and even pre -birth, and the link with relationships. How can we understand this time of life e.g. Attachment, Parenting Style, Caregiver mental health?",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Early Childhood</strong><br/><ul>\n<li>How do I focus on learning, being my own person but needing closeness? </li>\n<li>What are A.C.E.’s and how do they manifest in childhood and throughout life? </li>\n<li>How do developmental issues start to arise and be seen by those around me? </li>\n<li>What if I experience a trauma or significant change, how does this effect my development? </li>\n<li>How do we support young children in this period? What mental health strengths and needs or concerns arise at this stage?</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Early Childhood</strong>",
            "topic_description": "Early Childhood How do I focus on learning, being my own person but needing closeness? What are A.C.E.’s and how do they manifest in childhood and throughout life? How do developmental issues start to arise and be seen by those around me? What if I experience a trauma or significant change, how does this effect my development? How do we support young children in this period? What mental health strengths and needs or concerns arise at this stage?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 7(02 Sep - 08 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Middle Childhood</strong><br/><ul>\n<li>The time where we are going to school, making friends, learning and exploring the world, learning about who we are and what we like, taking on new responsibilities. </li>\n<li>What does wellness and mental health look like? </li>\n<li>What challenges might arise?</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Middle Childhood</strong>",
            "topic_description": "Middle Childhood The time where we are going to school, making friends, learning and exploring the world, learning about who we are and what we like, taking on new responsibilities. What does wellness and mental health look like? What challenges might arise?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Adolescence</strong><br/><ul>\n<li>Who am I, where do I fit in relationship to others within family, culture and rest of world? </li>\n<li>Where is my life going? </li>\n<li>What am I passionate about? </li>\n<li>How does society and our parents see us? </li>\n<li>So much is changing, excitement and stress all at once. What is the key to wellness and positive mental health? </li>\n<li>How do we manage the risks of mental health, self harm and suicidality that arise? </li>\n<li>How do we support young people, families and the wider community? How do we engage a recovery model when an adolescent in is tension between being cared for and being independent?</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Adolescence</strong>",
            "topic_description": "Adolescence Who am I, where do I fit in relationship to others within family, culture and rest of world? Where is my life going? What am I passionate about? How does society and our parents see us? So much is changing, excitement and stress all at once. What is the key to wellness and positive mental health? How do we manage the risks of mental health, self harm and suicidality that arise? How do we support young people, families and the wider community? How do we engage a recovery model when an adolescent in is tension between being cared for and being independent?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Early Adulthood to Adulthood</strong><br/><p>Assessment 3 Check in</p>\n<p>Transitioning to the adult world and adult responsibilities. </p>\n<ul>\n<li>What am I going to do with my life and who am I going to do it with? </li>\n<li>Shifts in family and friend relationships, entering the workforce and a career. Intimate relationships, parenting and lots of decisions. </li>\n<li>How does our society see this period of life, what is important, what are the key stressors?</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Early Adulthood to Adulthood</strong>",
            "topic_description": "Early Adulthood to Adulthood Assessment 3 Check in Transitioning to the adult world and adult responsibilities. What am I going to do with my life and who am I going to do it with? Shifts in family and friend relationships, entering the workforce and a career. Intimate relationships, parenting and lots of decisions. How does our society see this period of life, what is important, what are the key stressors?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Middle to Mature Adulthood</strong><br/><ul>\n<li>Changes and transitions of relationships, looking forward and back. </li>\n<li>Have I done what I want/need to do at home and in the world? </li>\n<li>Family, career, changes in the world emerge and how do I see these, manage these? </li>\n<li>What does mental health look like as I go through different parts of adulthood? </li>\n<li>How do my strengths, needs, hopes and goals sustain or change or evolve?</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Middle to Mature Adulthood</strong>",
            "topic_description": "Middle to Mature Adulthood Changes and transitions of relationships, looking forward and back. Have I done what I want/need to do at home and in the world? Family, career, changes in the world emerge and how do I see these, manage these? What does mental health look like as I go through different parts of adulthood? How do my strengths, needs, hopes and goals sustain or change or evolve?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 11(07 Oct - 13 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Old Age</strong><br/><ul>\n<li>How do I engage with what’s done and what’s to come? </li>\n<li>Reflections of my life and on future death. </li>\n<li>Retirement, connections, transitions in lifestyle. </li>\n<li>What challenges occur at this age, what benefits of being older and having lived and experienced a lifetime of relationships and situations? </li>\n<li>What does wellness look like? </li>\n<li>What mental health concerns become relevant? </li>\n<li>How does my identity, culture influence my perspective?</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Old Age</strong>",
            "topic_description": "Old Age How do I engage with what’s done and what’s to come? Reflections of my life and on future death. Retirement, connections, transitions in lifestyle. What challenges occur at this age, what benefits of being older and having lived and experienced a lifetime of relationships and situations? What does wellness look like? What mental health concerns become relevant? How does my identity, culture influence my perspective?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>End of Life</strong><br/><ul>\n<li>End of life can occur when you are in old age or much earlier due to illness or other concerns. </li>\n<li>How does being near the end of our life impact our sense of self, the world and our mental health and wellness. </li>\n<li>How can therapists support individuals, families and communities in situations of palliative care, life limited conditions, enduring suicidality, grief and loss. </li>\n<li>What does life and death mean in my culture? </li>\n<li>How does my family engage in or understand end of life and beyond?</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>End of Life</strong>",
            "topic_description": "End of Life End of life can occur when you are in old age or much earlier due to illness or other concerns. How does being near the end of our life impact our sense of self, the world and our mental health and wellness. How can therapists support individuals, families and communities in situations of palliative care, life limited conditions, enduring suicidality, grief and loss. What does life and death mean in my culture? How does my family engage in or understand end of life and beyond?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Emotional and Social Development</strong><br/><ul>\n<li>How do I prefer to “be” in society, in my community, how do I prefer to interact with others? </li>\n<li>What challenges do I face in social settings and why? </li>\n<li>Am I an introvert, extrovert, a social butterfly, a quiet achiever, an observer but what do these terms mean anyway? </li>\n<li>How do I perceive care, love, support from others? </li>\n<li>How does this impact my coping, my perception of mental health, my expression of resiliency, my sense of self?</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Emotional and Social Development</strong>",
            "topic_description": "Emotional and Social Development How do I prefer to “be” in society, in my community, how do I prefer to interact with others? What challenges do I face in social settings and why? Am I an introvert, extrovert, a social butterfly, a quiet achiever, an observer but what do these terms mean anyway? How do I perceive care, love, support from others? How does this impact my coping, my perception of mental health, my expression of resiliency, my sense of self?",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}