{
    "course_title": "Russian Language IV",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/RSSN2120-61057-7460",
    "full_course_code": "RSSN2120-61057-7460",
    "course_code": "RSSN2120",
    "class_code": "61057",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand discussions on topics covered in the course and make sense of spoken stories and anecdotes."
        },
        {
            "number": "LO2.",
            "description": "Participate in a discussion on topics covered in the course and express your opinion clearly, recount personal events and stories."
        },
        {
            "number": "LO3.",
            "description": "Understand simple literary and non-fiction texts which describe events and feelings, travel and leisure."
        },
        {
            "number": "LO4.",
            "description": "Provide structured written arguments on topics covered in the course and recount a story."
        },
        {
            "number": "LO5.",
            "description": "Use a range of nouns and adjective cases and verbs of motion effectively."
        },
        {
            "number": "LO6.",
            "description": "Show awareness of Russophone cultural practices and points of view on familiar topics."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Written Assessment series",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 16/08/2024 5:00 pm</p>\n<p> 6/09/2024 5:00 pm</p>\n<p> 4/10/2024 5:00 pm</p>\n<p> 25/10/2024 5:00 pm</p>\n<p>\n</p><p>Each assessment is available for 48 hrs Wed-Fri of the scheduled week.</p></dd>",
            "learning_objectives": "L01, L03, L04, L05",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Over the course of the semester, students will be required to complete <strong>4 x 10% online, non-invigilated, timed Online Written Assessments (OWA) </strong>on the course Blackboard site. Each assessment will be <strong>available for 48 hours Wed-Friday of the week it is scheduled</strong> and the duration will vary between <strong>75-90 minutes. </strong></p>\n<p>These are <strong>open-book assessments</strong>, which means that students are allowed to use the textbook, their notes, ppt slides and any print or online reference materials and print and online dictionaries (but see the Artificial Intelligence and Machine Translation statement below*). This series of assessments will test the retention of the material and skills covered this semester and, as such, they are designed to provide students with an opportunity to reflect on their learning journey, aspects that they have mastered and aspects that may require further revision or consolidation. </p>\n<p>The marking criteria for assessing these tasks will be informed by students' ability to demonstrate mastery and accurate usage of material covered in class and their: </p>\n<ul>\n<li>ability to understand a video/audio conversation/monologue related to the content of the course.  </li>\n<li>ability to read and understand short texts on topics related to the content of the course.  </li>\n<li>ability to write or reconstruct complete grammatical sentences. </li>\n<li>ability to reuse vocabulary and grammatical items studied in the course (points attributed for vocabulary and grammatical structures correctly used). </li>\n<li>ability to write short, coherent sentences/texts (points attributed for structures and phrases correctly used).  </li>\n<li>awareness of Russian-speaking practices (e.g., when to use formal and informal terms of address) and other social and cultural practices. </li>\n</ul>\n<p>Please note that OWAs are non-invigilated digital assessment tasks which students will complete <strong>using their own device</strong>. Students should make sure that they have<strong> access to a reliable internet connection </strong>when completing each task. Only one attempt will be allowed for each OWA. </p>\n<p><strong>Further information, including submission links, will be provided on the Blackboard site for this course. </strong></p>\n<p><strong>Gen AI &amp; MT Statement: </strong>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies for preparation, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students may be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Follow detailed instructions and marking criteria posted on Blackboard in the relevant Assessments folder.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Course Engagement Portfolio",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p> 25/10/2024 5:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L05, L06",
            "mode": "Oral, Product/ Artefact/ Multimedia, Written",
            "category": "Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>In order to demonstrate your participation and engagement in this course, students will be required to contribute weekly to an individual PadletUQ, for which the template will be made available on the course Blackboard site. To build this Portfolio, the students will make brief weekly posts (short texts, audio recordings, videos, copies of exercises, images, etc.) demonstrating their engagement with the Russian language and culture beyond required course content. Students will have the option to respond to a prompt provided in the Padlet template or make their own. Students will also submit a final critical reflection about their engagement with the course (written in English, 200-250 words). <strong>This</strong> <strong>final reflection is due on the last day of the teaching semester, FRIDAY of Week 13 at 5pm, and signifies the submission of the portfolio for marking.</strong></p>\n<p><strong>See detailed instructions and marking criteria in the relevant Assessment folder on Blackboard.</strong></p>\n<p><strong>Gen AI &amp; MT Statement: </strong><strong> </strong>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The link to the student's Padlet should be submitted on Blackboard following the instructions in the relevant Assessment folder.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Interview Project",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 8/11/2024 5:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L04, L05, L06",
            "mode": "Oral, Product/ Artefact/ Multimedia, Written",
            "category": "Presentation, Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>THE INTERVIEW PROJECT: Real World interaction with Native Speakers </strong> </p>\n<p>In the first weeks of the semester, each student will partner with a native speaker of Russian for the Interview Project, which will create an opportunity to consolidate and practice the course material studied this semester in a real-world context over the course of 3 interviews and to reflect on their learning. The assessment will consist of a <strong>6-minute multimedia video-presentation in Russian to be submitted via Blackboard during the Examination Period as an mp4 file along with the transcript. </strong> </p>\n<p>To prepare for the presentation, students are to schedule 3 meetings 40-50 minutes long (preferably in person, but also possible by Zoom or other video-communication platform) during which they will ask their interview partner and answer about themselves a series of questions related to the topics discussed in class. The goal is to have a real conversation in which students and members of the Russian-speaking community learn about each other and form shared inter-cultural knowledge. The presentation should aim at consolidating the most interesting information about the interview partner from all three meetings. While showcasing the students’ knowledge of vocabulary and grammar learned this semester, the presentation should not only summarize but also <strong>synthesize important differences and similarities between the partner and the students </strong>that transpired from these meetings. </p>\n<p>Also as part of preparation for the presentation, after each interview meeting, students are asked to write a short summary in Russian of what they learned about/from their partner and submit it via Blackboard for formative feedback (<strong>3 summaries total, at least 250 words each). </strong>Although the summaries are not assessed, their goal is to help students to consolidate what they have learned and use the feedback to prepare for the presentation. </p>\n<p><strong>The due date for the assessment (upload of the presentation and script on Blackboard) is 5pm on the Friday of Week 1 in the Examination Period</strong>. </p>\n<p>*The suggested timing of the interviews is around Weeks 4, 8 and 12 is to help the students pace themselves. The interview summaries are to be submitted for feedback shortly after the interview and no later than the end of the final week of classes to allow time for feedback. </p>\n<p><strong>**</strong><strong>Gen AI &amp; MT Statement: </strong><strong> </strong>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies for preparation, successful completion of this assessment will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct. To pass this assessment, students may be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You will be prompted to submit the summaries for feedback and the presentation files for marking on Blackboard under the Assessment tab</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Final Oral Assessment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 14/11/2024</p>\n<p>\n</p><p>Check the time of the assessment in the Assessment folder on Blackboard</p></dd>",
            "learning_objectives": "L01, L02, L03, L05, L06",
            "mode": "Oral",
            "category": "Practical/ Demonstration",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The <strong>Final Oral Assessment (30%)</strong> held in the examination period week will assess students' oral and aural skills as well as their ability to initiate and engage in conversation with classmates or with teachers. </p>\n<p>Students will work in pairs in front of the two examiners. In each interview, the students will take turns to </p>\n<p><strong>1) ask one another questions and to talk to each other and/examiner(s) about one of the several topics covered in class.</strong></p>\n<p><strong>2) respond to the examiners' follow up questions about topics learned this semester</strong>. </p>\n<p>The interview will last <strong>approximately 10 minutes</strong>. Emphasis will be placed on oral production, comprehension and fluency as well as accuracy in grammatical structures and lexical knowledge acquired throughout the semester. </p>\n<p>Students will be able to sign up for the interview in week 13.</p>\n<p><strong>Marking Criteria </strong>:</p>\n<p><strong>Preparation guidelines and detailed marking criteria will be available on Blackboard. </strong></p>\n<p>This is an individually marked assessment item but it requires students to work in pairs during the interview. Each student will be evaluated using the oral assessment rubric based on their fluency, pronunciation, vocabulary, grammar, and comprehension. </p>\n<p>The interviews will be recorded for marking and self-evaluation. If a member of the pair is absent on the day of the assessment, the course coordinator will negotiate a solution with the remaining partner. One of the markers or other willing classmates who have already finished the assessment can step in as the partner for the student without a pair. If a student who has already been marked steps in to help the student without a pair, they will not be marked, only the student without a pair will.</p>\n<p><strong>Gen AI &amp; MT Statement: </strong>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance. To pass this assessment, students will be required to demonstrate detailed comprehension and ability to use Russian independent of AI and MT tools. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Sign-up page, detailed guidelines and marking criteria are available on Blackboard</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(22 Jul - 27 Oct)",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In-class work</strong><br><p>In-class work (General Contact): Every class hour builds on the material from the previous one. Regular preparation, attendance and active participation are key to successful learning and progress in the course.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>In-class work</strong>",
            "topic_description": "In-class work In-class work (General Contact): Every class hour builds on the material from the previous one. Regular preparation, attendance and active participation are key to successful learning and progress in the course.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        },
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13(22 Jul - 27 Oct)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Homework and preparation for in-class activities</strong><br><p>Homework and preparation for in-class activities (Independent Study): Some weekly tasks will be done by you independently online at your own pace, either before or after class, in order to ensure that class time is used mostly for communication.</p></br></p><p><strong>Sub-activity:</strong> </p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06</p></div></td>",
            "topic_title": "<strong>Homework and preparation for in-class activities</strong>",
            "topic_description": "Homework and preparation for in-class activities Homework and preparation for in-class activities (Independent Study): Some weekly tasks will be done by you independently online at your own pace, either before or after class, in order to ensure that class time is used mostly for communication. Sub-activity:",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        }
    ]
}