{
    "course_title": "Science Engagement in the Community",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SCIE3010-64823-7460",
    "full_course_code": "SCIE3010-64823-7460",
    "course_code": "SCIE3010",
    "class_code": "64823",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Characterise audiences based on their demographics, priorities, values, and communication preferences."
        },
        {
            "number": "LO2.",
            "description": "Develop and refine genre and purpose of engagement strategy based on your audience."
        },
        {
            "number": "LO3.",
            "description": "Develop and deliver a meaningful engagement strategy or activity that facilitates audience participation with science."
        },
        {
            "number": "LO4.",
            "description": "Evaluate the impact of an engagement strategy or activity."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate proficiency in stakeholder engagement specific to science communication."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Project Portfolio",
            "special_indicators": [],
            "weighting": "<dd>80%</dd>",
            "due_date": "<dd><p>There are three milestones within this assessment task. Further information is provided in-course. 23/08/2024 - 4/11/2024</p>\n<p>\n</p><p>Some variation of due dates may be appropriate depending on the specific nature of the chosen project. </p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You will produce a <strong>10 page </strong>portfolio featuring your science engagement project in the community project. There are three milestones in this assessment task (you can think of it as a three part assessment).</p>\n<p><br/></p>\n<p><strong>Milestone 1 (20% out of 80%)</strong></p>\n<p>The first <strong>4 pages</strong> of your portfolio should: </p>\n<p>·       introduce your project idea using a persuasive rationale, </p>\n<p>·       characterise the audience you intend to work with based on their demographics, priorities, and communication preferences,</p>\n<p>·       describe the scientific content to be communicated in your project, and</p>\n<p>·       propose a thoughtful implementation plan.</p>\n<p>You are expected to approach the development of your ideas in a scholarly manner, referencing scholarly work or other credible sources of information. You will submit Milestone 1 by Week 5, and should expect to receive feedback within two weeks. </p>\n<p> </p>\n<p><strong>Milestone 2 (30% out of 80%)</strong></p>\n<p>The next <strong>2 pages</strong> of your portfolio should: </p>\n<p>·       respond to the feedback provided in Milestone 2 (focussing on the <em>what</em> and the <em>why</em>),</p>\n<p>·       (where possible) annotate the first 4 pages (Milestone 1) with supplementary information that addresses the feedback provided to you,</p>\n<p>·       demonstrate further development and refinement of your ideas that results in a clear activity plan, and</p>\n<p>·       evidence instances where you demonstrated professional stakeholder engagement (e.g. contacting an external audience). </p>\n<p>You will submit Milestone 2 by Week 8. </p>\n<p> </p>\n<p><strong>Milestone 3 (30% out of 80%)</strong></p>\n<p>The final <strong>4 pages </strong>of your portfolio should:</p>\n<p>·       evidence genuine and authentic project delivery (e.g. photos, videos, creative outputs, testimonials etc.),</p>\n<p>·       summarise and interpret audience feedback in a meaningful and constructive way, and</p>\n<p>·       identify limitations and suggestions for improvement on your engagement activity based on your personal reflection and audience feedback.</p>\n<p>Optional: you may supplement your project evaluation with any news stories, social media posts, or publications from your project supervisory team, industry partner, or external stakeholder company or organisation. You will submit Milestone 3 after study week (SWOTVAC).</p>\n<p> </p>\n<p>The portfolio is designed to be a creative production that encourages use of mixed media. You could thoughtfully integrate written form, in-text citations, appropriate referencing style, visual art, photos, original short videos etc. </p>\n<p> </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission instructions will be provided in class.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Excursion social media post",
            "special_indicators": [],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p> 4/10/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L03",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Creative Production/ Exhibition",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>For one of the excursions, you will produce a social media post that exemplifies effective science engagement. You will choose your preferred social media platform. You are not required to actually make a post on your chosen social media platform. You will be assessed on:</p>\n<p>·       visual composition and content</p>\n<p>·       choice of social media platform</p>\n<p>·       effective and ethical use of chosen social media platform</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submission instructions will be provided in class.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Seminar journal",
            "special_indicators": [],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p> 20/09/2024 10:30 pm</p></dd>",
            "learning_objectives": "L01, L04",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>For two of the three seminars embedded within the course, you will complete a thoughtful reflection of professional practice in science communication/ engagement. A reflection structure will be suggested for you. You may submit three reflections and have the best two used for this assessment. You will be assessed on:</p>\n<ul>\n<li>characterisation of genre, audience, and purpose relevant to one science engagement featured during the seminar</li>\n<li>identification of challenges and successes in science engagement specific to the seminar presenter</li>\n<li>reflection of personal practice as a science communicator, and how you have benefitted from the information presented</li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You will compile your reflections and submit them only once.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Team Based Learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Purpose (with Dr Gurion Ang)</strong><br><p>Science engagement toolkit part 1 of 4</p>\n<p>Topics including but not limited to purpose of science engagement, social media, and gathering evidence for community engagement. Includes a course introduction and overview of assessment items. </p></br></p><p><strong>Learning outcomes:</strong> L01, L05</p></div></td>",
            "topic_title": "<strong>Purpose (with Dr Gurion Ang)</strong>",
            "topic_description": "Purpose (with Dr Gurion Ang) Science engagement toolkit part 1 of 4 Topics including but not limited to purpose of science engagement, social media, and gathering evidence for community engagement. Includes a course introduction and overview of assessment items.",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Team Based Learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Design principles (with Associate Professor Louise Kuchel)</strong><br/><p>Science engagement toolkit part 2 of 4</p>\n<p>Topics including but not limited to filling the GAP (genre, audience, purpose), brain science, memory and processing new information, values and beliefs, and framing messages.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Design principles (with Associate Professor Louise Kuchel)</strong>",
            "topic_description": "Design principles (with Associate Professor Louise Kuchel) Science engagement toolkit part 2 of 4 Topics including but not limited to filling the GAP (genre, audience, purpose), brain science, memory and processing new information, values and beliefs, and framing messages.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Team Based Learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Building trust (with Dr Angela Dean)</strong><br/><p>Science engagement toolkit part 3 of 4</p>\n<p>Topics including but not limited to listening, buy-in, building relationships around diverse audiences, social and behavioural change, conflict prevention and management.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L05</p></div></td>",
            "topic_title": "<strong>Building trust (with Dr Angela Dean)</strong>",
            "topic_description": "Building trust (with Dr Angela Dean) Science engagement toolkit part 3 of 4 Topics including but not limited to listening, buy-in, building relationships around diverse audiences, social and behavioural change, conflict prevention and management.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Team Based Learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Measuring success (with Associate Professor Louise Kuchel and Dr Angela Dean)</strong><br/><p>Science engagement toolkit part 4 of 4</p>\n<p>Topics including but not limited to evaluation techniques (qualitative and quantitative), triangulation of data, and survey design.</p></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Measuring success (with Associate Professor Louise Kuchel and Dr Angela Dean)</strong>",
            "topic_description": "Measuring success (with Associate Professor Louise Kuchel and Dr Angela Dean) Science engagement toolkit part 4 of 4 Topics including but not limited to evaluation techniques (qualitative and quantitative), triangulation of data, and survey design.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Excursion",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Excursion to Queensland Museum (with Dr Gurion Ang)</strong><br/><p>We will:</p>\n<ul>\n<li>Understand the Queensland Museum Kurilpa role in public education and engagement with science</li>\n<li>Appreciate core enabling functions in a museum setting (curation, front of house, event management etc.)</li>\n<li>Identify challenges and opportunities for Queensland Museum Kurilpa specifically related to public engagement with science</li>\n<li>Contextualise with a case study of World Science Festival Brisbane</li>\n<li>Participate in a panel discussion with staff</li>\n<li>Enjoy a guided tour</li>\n<li>Enjoy lunch together (BYO at Museum cafe)</li>\n<li>Enjoy the exhibits</li>\n<li>Work on your assessment</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Excursion to Queensland Museum (with Dr Gurion Ang)</strong>",
            "topic_description": "Excursion to Queensland Museum (with Dr Gurion Ang) We will: Understand the Queensland Museum Kurilpa role in public education and engagement with science Appreciate core enabling functions in a museum setting (curation, front of house, event management etc.) Identify challenges and opportunities for Queensland Museum Kurilpa specifically related to public engagement with science Contextualise with a case study of World Science Festival Brisbane Participate in a panel discussion with staff Enjoy a guided tour Enjoy lunch together (BYO at Museum cafe) Enjoy the exhibits Work on your assessment",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Building a brand (with Dr Gurion Ang)</strong><br/><p>Seminar series 1 of 3</p>\n<p>In the first half of the seminar you will work with Dr Gurion Ang on building a brand. In the second half of the seminar you will interact with a professional involved in science engagement with the community (noting your 10% seminar journal assessment).</p>\n<p>Guest presenter: Professor Tamara Davis, Laureate Fellow, School of Mathematics and Physics</p>\n<p><em>Professor Tamara Davis is an astrophysicist who studies the elusive \"dark energy\" that's accelerating the universe. Her accolades include the Astronomical Society of Australia's Louise Webster Medal for early career research impact, the L'Oréal Women in Science Fellowship for Australia, the Australian Institute of Physics Women in Physics Lectureship, the Australian Academy of Science's Nancy Millis Medal for outstanding female leadership in science, an Australian Research Council Laureate Fellowship, the Astronomical Society of Australia's Ellery Lectureship, and a Member of the Order of Australia (AM).</em></p>\n<p><br/></p></p><p><strong>Learning outcomes:</strong> L01, L04, L05</p></div></td>",
            "topic_title": "<strong>Building a brand (with Dr Gurion Ang)</strong>",
            "topic_description": "Building a brand (with Dr Gurion Ang) Seminar series 1 of 3 In the first half of the seminar you will work with Dr Gurion Ang on building a brand. In the second half of the seminar you will interact with a professional involved in science engagement with the community (noting your 10% seminar journal assessment). Guest presenter: Professor Tamara Davis, Laureate Fellow, School of Mathematics and Physics Professor Tamara Davis is an astrophysicist who studies the elusive \"dark energy\" that's accelerating the universe. Her accolades include the Astronomical Society of Australia's Louise Webster Medal for early career research impact, the L'Oréal Women in Science Fellowship for Australia, the Australian Institute of Physics Women in Physics Lectureship, the Australian Academy of Science's Nancy Millis Medal for outstanding female leadership in science, an Australian Research Council Laureate Fellowship, the Astronomical Society of Australia's Ellery Lectureship, and a Member of the Order of Australia (AM).",
            "learning_outcomes": [
                "L01",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Misinformation (with Associate Professor Louise Kuchel)</strong><br><p>Seminar series 2 of 3</p>\n<p>In the first half of the seminar you will work with Associate Professor Louise Kuchel on misinformation. In the second half of the seminar you will interact with a professional involved in science engagement with the community (noting your 10% seminar journal assessment).</p>\n<p>Guest presenter: Professor Keith Chappell, School of Chemistry and Molecular Biosciences </p>\n<p><em>Keith develops vaccines against medically and environmentally significant viruses, and is one of the inventors of a UQ's molecular clamp platform. </em></p></br></p><p><strong>Learning outcomes:</strong> L01, L04, L05</p></div></td>",
            "topic_title": "<strong>Misinformation (with Associate Professor Louise Kuchel)</strong>",
            "topic_description": "Misinformation (with Associate Professor Louise Kuchel) Seminar series 2 of 3 In the first half of the seminar you will work with Associate Professor Louise Kuchel on misinformation. In the second half of the seminar you will interact with a professional involved in science engagement with the community (noting your 10% seminar journal assessment). Guest presenter: Professor Keith Chappell, School of Chemistry and Molecular Biosciences Keith develops vaccines against medically and environmentally significant viruses, and is one of the inventors of a UQ's molecular clamp platform.",
            "learning_outcomes": [
                "L01",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Behaviour (with Dr Angela Dean)</strong><br/><p>Seminar series 3 of 3</p>\n<p>In the first half of the seminar you will work with Dr Angela Dean on behaviour. In the second half of the seminar you will interact with a professional involved in science engagement with the community (noting your 10% seminar journal assessment).</p>\n<p>Guest presenter: Jaana Dielenberg, Biodiversity Council </p>\n<p><em>Jaana is the Communication and Engagement Manager for the Biodiversity Council. She facilitates improved outcomes for biodiversity through the promotion of robust science and Traditional Knowledge, and the engagement of strategically relevant audiences. Jaana is responsible for the development and implementation of communication and engagement strategies and campaigns to meet the objectives of the Biodiversity Council, in areas of public profile, community and private sector engagement, fundraising, policy impact and biodiversity outcomes. She is the Council's media liaison contact, develops the Council's media campaigns and provides communications and media coaching to scientists and Indigenous knowledge holders to increase their effectiveness in prosecuting the case for biodiversity through the media and with policy makers and other stakeholders.</em></p></p><p><strong>Learning outcomes:</strong> L01, L04, L05</p></div></td>",
            "topic_title": "<strong>Behaviour (with Dr Angela Dean)</strong>",
            "topic_description": "Behaviour (with Dr Angela Dean) Seminar series 3 of 3 In the first half of the seminar you will work with Dr Angela Dean on behaviour. In the second half of the seminar you will interact with a professional involved in science engagement with the community (noting your 10% seminar journal assessment). Guest presenter: Jaana Dielenberg, Biodiversity Council Jaana is the Communication and Engagement Manager for the Biodiversity Council. She facilitates improved outcomes for biodiversity through the promotion of robust science and Traditional Knowledge, and the engagement of strategically relevant audiences. Jaana is responsible for the development and implementation of communication and engagement strategies and campaigns to meet the objectives of the Biodiversity Council, in areas of public profile, community and private sector engagement, fundraising, policy impact and biodiversity outcomes. She is the Council's media liaison contact, develops the Council's media campaigns and provides communications and media coaching to scientists and Indigenous knowledge holders to increase their effectiveness in prosecuting the case for biodiversity through the media and with policy makers and other stakeholders.",
            "learning_outcomes": [
                "L01",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Excursion",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Excursion to Integrated Pathology Learning Centre (with Dr Gurion Ang)</strong><br/><p>We will:</p>\n<ul>\n<li>Understand UQ's Integrated Pathology Learning Centre (IPLC)'s role in secondary and tertiary education and engagement with science</li>\n<li>Appreciate the operational requirements of curation in IPLC </li>\n<li>Identify challenges and opportunities for IPLC specifically related to engagement with science</li>\n<li>Experience and reflect on a science engagement program IPLC runs with secondary students </li>\n<li>Enjoy a guided tour</li>\n<li>Enjoy lunch together (provided)</li>\n<li>Enjoy the exhibits </li>\n<li>Work on your assessment</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Excursion to Integrated Pathology Learning Centre (with Dr Gurion Ang)</strong>",
            "topic_description": "Excursion to Integrated Pathology Learning Centre (with Dr Gurion Ang) We will: Understand UQ's Integrated Pathology Learning Centre (IPLC)'s role in secondary and tertiary education and engagement with science Appreciate the operational requirements of curation in IPLC Identify challenges and opportunities for IPLC specifically related to engagement with science Experience and reflect on a science engagement program IPLC runs with secondary students Enjoy a guided tour Enjoy lunch together (provided) Enjoy the exhibits Work on your assessment",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Team Based Learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Showcase and reflection 1 (with Dr Gurion Ang)</strong><br/><p>A celebration of your achievements in the course!</p></p><p><strong>Learning outcomes:</strong> L03, L04</p></div></td>",
            "topic_title": "<strong>Showcase and reflection 1 (with Dr Gurion Ang)</strong>",
            "topic_description": "Showcase and reflection 1 (with Dr Gurion Ang) A celebration of your achievements in the course!",
            "learning_outcomes": [
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Team Based Learning",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Showcase and reflection 2 (with Dr Gurion Ang)</strong><br/><p>A celebration of your achievements in the course!</p></p><p><strong>Learning outcomes:</strong> L03, L04</p></div></td>",
            "topic_title": "<strong>Showcase and reflection 2 (with Dr Gurion Ang)</strong>",
            "topic_description": "Showcase and reflection 2 (with Dr Gurion Ang) A celebration of your achievements in the course!",
            "learning_outcomes": [
                "L03",
                "L04"
            ]
        }
    ]
}