{
    "course_title": "Sociology of the Environment",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SOCY2020-63246-7460",
    "full_course_code": "SOCY2020-63246-7460",
    "course_code": "SOCY2020",
    "class_code": "63246",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Explain the social dimensions of a variety of national and international environmental problems"
        },
        {
            "number": "LO2.",
            "description": "Compare and contrast diverse theoretical and conceptual approaches, and apply these to understand - and design responses to - contemporary environmental problems"
        },
        {
            "number": "LO3.",
            "description": "Engage critically with contemporary public debates on a variety of environmental issues"
        },
        {
            "number": "LO4.",
            "description": "Critically appraise globally sourced academic literature - including global south and north, and Indigenous scholars - in the field of sociology of environment"
        },
        {
            "number": "LO5.",
            "description": "Apply diverse knowledges - including Indigenous and local ecological knowledges - to explain contemporary environment issues"
        },
        {
            "number": "LO6.",
            "description": "Explain how a healthy environment is directly connected to human rights, including Indigenous rights"
        },
        {
            "number": "LO7.",
            "description": "Design and evaluate diverse strategies for affecting positive social and environmental change"
        },
        {
            "number": "LO8.",
            "description": "Think independently, critically reflect and develop a reasoned argument, as well as listen deeply and work carefully with others"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Workshop Quizzes (3 x 10% each)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 29/07/2024 - 21/10/2024</p>\n<p>\n</p><p>in-class quiz</p></dd>",
            "learning_objectives": "L01, L02, L06, L07",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>There will be 3 workshop quizzes (each worth 10%) that will be held across 3 of the workshops. You will be made aware that there is a workshop quiz at the start of the chosen workshops (not before). You will be provided with 45 minutes at the end of the workshop to complete this quiz.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>AI Use: </strong>This assessment task is to be completed in-person. The use of Artificial Intelligence (AI) tools will not be permitted. Any attempted use of AI may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Workshop quiz will be submitted to the lecturer before you leave the workshop, in the selected 3 weeks. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Sociological analysis of an environmental film",
            "special_indicators": [],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 8/10/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment task requires you to apply your sociological imagination to critically examine the film ‘Ants and Grasshoppers’ (2021). The film will be played during the lecture in week 6 - and you must attend class to watch it. You will then be required to provide a sociological analysis of the issues and themes of the film. You should draw from specific content and themes in the film, as well as literature in this course, in answering the following questions as part of your film review:</p>\n<ol>\n<li>How does key environmental theory (e.g. treadmill of production, ecological modernisation, political economy - consider choosing one) assist you to explain the global climate crisis? </li>\n<li>What are the various ways this film showcases climate justice, and importantly, climate injustice? How are discourses about climate (in)justice 'assembled, presented and contested'? (hint see Hannigan, pp. 56 - 66). </li>\n<li>How does the film grapple with themes of loss and emotions, including specifically in relation to climate change?</li>\n<li>How does the film showcase the significance of gender equality in building a climate just future? </li>\n<li>How might Anita and Esther's experience have been similar and/or different had they travelled from Malawi to Australia, rather than the US? In other words, what are the similarities and differences between Australia and the US related to political and public responses to the climate crisis, as well as local movements driving climate justice? </li>\n</ol>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>AI Use: </strong>This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct. </p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Reflective Journal",
            "special_indicators": [],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 25/10/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L03, L08",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>You are required to write a reflective journal of a maximum of 2000 words. This reflective journal should showcase your reflections - and learning through personal insights - across the semester. By reflections, I mean your thinking; the way you are making sense of and/or grappling with course content, as well as broader ideas that are coming up for you as you learn your way through the course. Each week, you are required to write up to 200 words that enable you to explore your ideas. You are encouraged to reflect on course content (including lecture material, in class discussion as well as set weekly readings). You might also like to reflect on case studies of environmental issues you are learning about, as well as broader politics and public debates that are playing out across the course of the semester. You should aim to take a diverse approach to this activity; that is, do not reflect on the same thing (e.g. one reading) each week. Rather, you will be rewarded for reflecting on different things (e.g. a reading, lecture content, workshop discussion, real life politics) in different weeks. You will also be rewarded not simply for describing the thing (the content etc) but rather, reflecting on it. By this, I mean thinking about it in creative and different ways. You might like to think through what thoughts and feelings come up for you in light of our weekly learnings.</p>\n<p>The final due date for the complete reflections journal is 25-Oct. This is to be submitted via Turnitin. You will have the opportunity to gain feedback throughout the semester, and there will be space in some workshops to write your reflective journals.</p>\n<p><strong>Marking criteria</strong> and/or marking rubrics are available in the ‘Assessment’ folder in Blackboard for this course. </p>\n<p><strong>AI Use: </strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1 Introduction: the why's and the what's</strong><br/><p>We start here in week 1 with an introduction to environmental sociology, including the why's and the what's! This week we dive into a couple of quick reads from Professor Stewart Lockie, Director of the Cairns Institute at James Cook University, and one of Australia's leading environmental sociologists. These readings will assist you to understand the why and what of environmental sociology - two important introductory pieces. You also have a piece from Dr Anne Poelina, from the Kimberley, in Western Australia. Her piece will support you to think about the diverse ways in which we come to understand human/nature relations, including a perspective offered from her standpoint as an Aboriginal woman and leader in the environment and Indigenous rights movements in Australia. Dr Poelina is a national leader in the field of environmental management, and bringing Indigenous knowledges to the task of conservation and environmental protection. In her piece she sets out some useful frameworks to guide thinking in this area. Together, this is a good launch pad for your journey in Sociology of Environment.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 1 Introduction: the why's and the what's</strong>",
            "topic_description": "Week 1 Introduction: the why's and the what's We start here in week 1 with an introduction to environmental sociology, including the why's and the what's! This week we dive into a couple of quick reads from Professor Stewart Lockie, Director of the Cairns Institute at James Cook University, and one of Australia's leading environmental sociologists. These readings will assist you to understand the why and what of environmental sociology - two important introductory pieces. You also have a piece from Dr Anne Poelina, from the Kimberley, in Western Australia. Her piece will support you to think about the diverse ways in which we come to understand human/nature relations, including a perspective offered from her standpoint as an Aboriginal woman and leader in the environment and Indigenous rights movements in Australia. Dr Poelina is a national leader in the field of environmental management, and bringing Indigenous knowledges to the task of conservation and environmental protection. In her piece she sets out some useful frameworks to guide thinking in this area. Together, this is a good launch pad for your journey in Sociology of Environment.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2: Diverse approaches to env soc (1)</strong><br/><p>This week we start sinking our teeth into some key sociological theories that inform thinking in this field. The content from this week (and along with week 3) should, I hope, inform the rest of your semester in this course; you should feel free to dive back into this reading material, and go deeper into ideas introduced this week, in the weeks to come. The reading this week is from Professor John Hannigan, who is a world leading thinker in the field of environmental sociology. He will take you on a journey across political economy, risk, and constructivism, and in so doing, show you there are multiple ways in which we can come to think sociologically about the environment. Overall, this week, you will leave with a bag full of theories - political economy, risk and constructivism, as approaches to make sense of environmental issues.</p>\n<p>Workshop activity: starting on your reflective practice - some in class time to work on this assessment task.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Week 2: Diverse approaches to env soc (1)</strong>",
            "topic_description": "Week 2: Diverse approaches to env soc (1) This week we start sinking our teeth into some key sociological theories that inform thinking in this field. The content from this week (and along with week 3) should, I hope, inform the rest of your semester in this course; you should feel free to dive back into this reading material, and go deeper into ideas introduced this week, in the weeks to come. The reading this week is from Professor John Hannigan, who is a world leading thinker in the field of environmental sociology. He will take you on a journey across political economy, risk, and constructivism, and in so doing, show you there are multiple ways in which we can come to think sociologically about the environment. Overall, this week, you will leave with a bag full of theories - political economy, risk and constructivism, as approaches to make sense of environmental issues. Workshop activity: starting on your reflective practice - some in class time to work on this assessment task.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3 : Diverse approaches to env soc (2)</strong><br/><p>This week we continue sinking our teeth into key sociological theories that inform thinking in this field. The content from this week should, I hope, and along with the week 2 lecture and readings, inform the rest of your semester in this course. You should feel free to dive back into this reading material, and go deeper into ideas introduced this week, in the weeks to come. The readings this week are from Dr Kyle Whyte, Potawatomi Indigenous scholar, based at Michigan State University, where he heads up the Indigenous Climate Change and Climate Justice group. In the pieces you will read from him this week, you will come to understand the ways in which colonisation, and for us in Australia, the settler colonial state, has profoundly shaped environmental impacts and issues. You'll also begin to see the intersections between environmental justice and Indigenous rights. We will also explore the connections between environmental problems, inequality and the environmental justice framework. Environmental justice has become a central defining framework for social movements. It has also become increasingly recognised as significant within environmental sociological theorising, particularly on the basis that it enables us to bring together the intersection of ways communities may grapple with environmental problems (including on the basis of Indigeneity, ethnicity, gender etc). You will leave this week knowing more about the ways in which a justice framework matters in terms of making sense of contemporary environmental problems, and its situatedness in histories of colonialism.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L05, L06, L07</p></div></td>",
            "topic_title": "<strong>Week 3 : Diverse approaches to env soc (2)</strong>",
            "topic_description": "Week 3 : Diverse approaches to env soc (2) This week we continue sinking our teeth into key sociological theories that inform thinking in this field. The content from this week should, I hope, and along with the week 2 lecture and readings, inform the rest of your semester in this course. You should feel free to dive back into this reading material, and go deeper into ideas introduced this week, in the weeks to come. The readings this week are from Dr Kyle Whyte, Potawatomi Indigenous scholar, based at Michigan State University, where he heads up the Indigenous Climate Change and Climate Justice group. In the pieces you will read from him this week, you will come to understand the ways in which colonisation, and for us in Australia, the settler colonial state, has profoundly shaped environmental impacts and issues. You'll also begin to see the intersections between environmental justice and Indigenous rights. We will also explore the connections between environmental problems, inequality and the environmental justice framework. Environmental justice has become a central defining framework for social movements. It has also become increasingly recognised as significant within environmental sociological theorising, particularly on the basis that it enables us to bring together the intersection of ways communities may grapple with environmental problems (including on the basis of Indigeneity, ethnicity, gender etc). You will leave this week knowing more about the ways in which a justice framework matters in terms of making sense of contemporary environmental problems, and its situatedness in histories of colonialism.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L05",
                "L06",
                "L07"
            ]
        },
        {
            "learning_period": "Week 4(12 Aug - 18 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4: Social Construction of environmental problems</strong><br/><p>We start this week with a further chapter from Professor John Hannigan. This will give you a solid grounding in the social constructivist approach, including the key conceptual tools available from this approach. You'll then dive into the Great Barrier Reef, starting with a collaborative writing project by Rohan Lloyd, Maxine Newlands and Theresa Petray, all academics based at James Cook University in Townsville. Our travels in the reef would not be complete without a good dose of science communication from Sir David Attenborough. Take some time to explore this interactive website - and bring your social constructivist imagination to thinking about how the reef is being constructed, and what the purpose of this might be?</p>\n<p>Starting a review of literature and referencing workshop: This week we will aim to do two things. First, we will take some time in providing skills and resources for finding and assessing literature, academic writing and referencing. We will, secondly, discuss the requirements of the film review assessment task, and how skills in literature review will assist you with this activity. This is the 'not to be missed' workshop for those wishing to shine in their assessment item for this course.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>Week 4: Social Construction of environmental problems</strong>",
            "topic_description": "Week 4: Social Construction of environmental problems We start this week with a further chapter from Professor John Hannigan. This will give you a solid grounding in the social constructivist approach, including the key conceptual tools available from this approach. You'll then dive into the Great Barrier Reef, starting with a collaborative writing project by Rohan Lloyd, Maxine Newlands and Theresa Petray, all academics based at James Cook University in Townsville. Our travels in the reef would not be complete without a good dose of science communication from Sir David Attenborough. Take some time to explore this interactive website - and bring your social constructivist imagination to thinking about how the reef is being constructed, and what the purpose of this might be? Starting a review of literature and referencing workshop: This week we will aim to do two things. First, we will take some time in providing skills and resources for finding and assessing literature, academic writing and referencing. We will, secondly, discuss the requirements of the film review assessment task, and how skills in literature review will assist you with this activity. This is the 'not to be missed' workshop for those wishing to shine in their assessment item for this course.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5(19 Aug - 25 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5: Food Sovereignty and the environment</strong><br/><p>This week we will explore the connections between global food systems and their environmental (and social, human/non-human animal rights) impacts. To do this, you'll be introduced to the concept of food sovereignty, as detailed by world leading thinker in the field, Dr Raj Patel (also the film maker from the film we watch in week 6). Raj will help you to understand the ways the right to food can be understood, and the intersections between achieving the right to food with gender based equality. Then, Alex Barnard and Marie Mourad will take you on a journey from dumpster dives to disco vibes - exploring some of the politics around food waste, and movements to reimagine food systems to reclaim excessive consumption.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 5: Food Sovereignty and the environment</strong>",
            "topic_description": "Week 5: Food Sovereignty and the environment This week we will explore the connections between global food systems and their environmental (and social, human/non-human animal rights) impacts. To do this, you'll be introduced to the concept of food sovereignty, as detailed by world leading thinker in the field, Dr Raj Patel (also the film maker from the film we watch in week 6). Raj will help you to understand the ways the right to food can be understood, and the intersections between achieving the right to food with gender based equality. Then, Alex Barnard and Marie Mourad will take you on a journey from dumpster dives to disco vibes - exploring some of the politics around food waste, and movements to reimagine food systems to reclaim excessive consumption.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6: film screening Ants and Grasshoppers</strong><br/><p>This week we will watch the film 'Ants and Grasshoppers', by Raj Patel. This film critically explores the disconnect between heavy emitting countries and those communities most vulnerable in the face of a rapidly changing climate. Raj takes you from Malawi to Washington D.C. and this film is told from the perspective of Anita, a Malawian farmer, climate campaigner and community organiser. This film will enable you to see climate denialism, climate justice, diverse forms of resistance in the face of the climate crisis, as well as the vital place of gender justice in addressing environmental challenges. This film will enable you to bring diverse social theories - including constructivism, discourse analysis, political economy and more, to understand environmental problems and local and global responses. We will watch the film together, and stop throughout to discuss and explore ideas. This week will set you up to effectively achieve the assessment item for this course - the film review.</p>\n<p>This workshop will be vital for you in preparing your assessment for this course, the film review. In this workshop, we will start to reflect on the series of questions you are required to address as part of this assessment task.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L08</p></div></td>",
            "topic_title": "<strong>Week 6: film screening Ants and Grasshoppers</strong>",
            "topic_description": "Week 6: film screening Ants and Grasshoppers This week we will watch the film 'Ants and Grasshoppers', by Raj Patel. This film critically explores the disconnect between heavy emitting countries and those communities most vulnerable in the face of a rapidly changing climate. Raj takes you from Malawi to Washington D.C. and this film is told from the perspective of Anita, a Malawian farmer, climate campaigner and community organiser. This film will enable you to see climate denialism, climate justice, diverse forms of resistance in the face of the climate crisis, as well as the vital place of gender justice in addressing environmental challenges. This film will enable you to bring diverse social theories - including constructivism, discourse analysis, political economy and more, to understand environmental problems and local and global responses. We will watch the film together, and stop throughout to discuss and explore ideas. This week will set you up to effectively achieve the assessment item for this course - the film review. This workshop will be vital for you in preparing your assessment for this course, the film review. In this workshop, we will start to reflect on the series of questions you are required to address as part of this assessment task.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L08"
            ]
        },
        {
            "learning_period": "Week 7(02 Sep - 08 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7: Place, loss and emotions</strong><br/><p>This week we explore the complex ways in which place is understood - from the perspectives of those affected by environmental changes. We turn our attention to Australia's recent bushfire crisis to do this. Your readings include a piece by Bhiamie Williamson, Jessica Weir and Vanessa Cavanagh, who describe and analyse the ways destruction of Country and place from an Aboriginal perspective is tied to broader ongoing settler colonial destruction that bares down upon Aboriginal and Torres Strait Islander Australians. Assistant Professor Ashleigh McKinzie from Tennessee State University will assist you to understand the interconnections between physical and social worlds, including in the face of disasters. You'll begin to grow your understandings of disaster, loss, emotions, and wellbeing, and how this can be usefully brought to bare to make sense of environmental issues. Professor Lockie's piece will also provide some broad scene setting and context for this week.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Week 7: Place, loss and emotions</strong>",
            "topic_description": "Week 7: Place, loss and emotions This week we explore the complex ways in which place is understood - from the perspectives of those affected by environmental changes. We turn our attention to Australia's recent bushfire crisis to do this. Your readings include a piece by Bhiamie Williamson, Jessica Weir and Vanessa Cavanagh, who describe and analyse the ways destruction of Country and place from an Aboriginal perspective is tied to broader ongoing settler colonial destruction that bares down upon Aboriginal and Torres Strait Islander Australians. Assistant Professor Ashleigh McKinzie from Tennessee State University will assist you to understand the interconnections between physical and social worlds, including in the face of disasters. You'll begin to grow your understandings of disaster, loss, emotions, and wellbeing, and how this can be usefully brought to bare to make sense of environmental issues. Professor Lockie's piece will also provide some broad scene setting and context for this week.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8: Independent study, no classes</strong><br/><p>This week is your opportunity to catch up on your reflective journal practice, and to also dive into your film review. </p></p></div></td>",
            "topic_title": "<strong>Week 8: Independent study, no classes</strong>",
            "topic_description": "Week 8: Independent study, no classes This week is your opportunity to catch up on your reflective journal practice, and to also dive into your film review.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9: Women, water and ecofeminism</strong><br/><p>We continue the themes around inequality and justice we started in week 4, this time adding a gendered perspective to our approach. You will learn about ecofeminism(s), and consider the ways this approach might be brought to bare in approaches to managing environmental issues and problems, including how an ethic of care might be applied. You'll start this week with a reading from Rachel Hart Winter, a US-based writer and thinker. She will assist you to understand the particularly gendered nature of water access, rights and other issues. We will also delve into the work of Val Plumwood, one of Australia's key environmental philosophers, including in the field of ecofeminism. Her chapter will help you understand the diverse ways in which ecofeminism can be framed and approached, and why it matters for 21st century environmental problem solving.</p>\n<p>We will allow time in class for reflective practice. </p></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 9: Women, water and ecofeminism</strong>",
            "topic_description": "Week 9: Women, water and ecofeminism We continue the themes around inequality and justice we started in week 4, this time adding a gendered perspective to our approach. You will learn about ecofeminism(s), and consider the ways this approach might be brought to bare in approaches to managing environmental issues and problems, including how an ethic of care might be applied. You'll start this week with a reading from Rachel Hart Winter, a US-based writer and thinker. She will assist you to understand the particularly gendered nature of water access, rights and other issues. We will also delve into the work of Val Plumwood, one of Australia's key environmental philosophers, including in the field of ecofeminism. Her chapter will help you understand the diverse ways in which ecofeminism can be framed and approached, and why it matters for 21st century environmental problem solving. We will allow time in class for reflective practice.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Mid Sem break(23 Sep - 29 Sep)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid-Semester Break</strong><br/><p>No Lecture/Tutorial</p></p></div></td>",
            "topic_title": "<strong>Mid-Semester Break</strong>",
            "topic_description": "Mid-Semester Break No Lecture/Tutorial",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10: Black/Green Politics</strong><br/><p>(Guest lecturer, TBC) This week we will explore some of the opportunities and challenges that arise when green and black issues - referring to environmental and Aboriginal and Torres Strait Islander rights issues - converge around an environmental issue (including a proposed mine, or other infrastructure project).</p>\n<p>While assumptions are often made that green and black interests are mutually inclusive, this is not always the case. Indeed, in many instances an Indigenous rights agenda may stand in contrast to essentialised ideas of 'wilderness', and 'locking up' landscapes so as to protect them. At the same time, environmental groups might find themselves guilty of 'using' Aboriginal communities to advance a conservation agenda, without grappling with the fundamental rights, sovereignty, or other issues Aboriginal and Torres Strait Islander communities may be seeking to address. </p>\n<p>You'll read two pieces this week. First, a chapter by Adrian Burragubba, senior spokesperson for the Wangan and Jagalingou Family Council, and outspoken opponent to Adani's proposed Carmichael coal mine on Wangan and Jagalingou country. </p>\n<p>You will also read a piece by Jenny Pickerill, which will be helpful as you make sense of the the importance of the language environment movements use to engage action, including the problematic term, 'wilderness'.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Week 10: Black/Green Politics</strong>",
            "topic_description": "Week 10: Black/Green Politics (Guest lecturer, TBC) This week we will explore some of the opportunities and challenges that arise when green and black issues - referring to environmental and Aboriginal and Torres Strait Islander rights issues - converge around an environmental issue (including a proposed mine, or other infrastructure project). While assumptions are often made that green and black interests are mutually inclusive, this is not always the case. Indeed, in many instances an Indigenous rights agenda may stand in contrast to essentialised ideas of 'wilderness', and 'locking up' landscapes so as to protect them. At the same time, environmental groups might find themselves guilty of 'using' Aboriginal communities to advance a conservation agenda, without grappling with the fundamental rights, sovereignty, or other issues Aboriginal and Torres Strait Islander communities may be seeking to address. You'll read two pieces this week. First, a chapter by Adrian Burragubba, senior spokesperson for the Wangan and Jagalingou Family Council, and outspoken opponent to Adani's proposed Carmichael coal mine on Wangan and Jagalingou country. You will also read a piece by Jenny Pickerill, which will be helpful as you make sense of the the importance of the language environment movements use to engage action, including the problematic term, 'wilderness'.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11(07 Oct - 13 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11: Rights and nature</strong><br/><p>This week you will learn about the rapidly growing area of interest - rights of nature. You'll be guided by readings from two of Australia's leading thinkers and advocates in this space, Associate Professor Wendy Steele, and Dr Michelle Maloney (who is also director of Australian Earth Laws Alliances). Along with Michelle and Wendy, you will explore what recognition of the rights of nature might mean for environmental decision making and environmental management. How might governance be done differently, in situations where rights were accorded to rivers, mountains and other natural places, regardless of the so called use value to humans?</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L06</p></div></td>",
            "topic_title": "<strong>Week 11: Rights and nature</strong>",
            "topic_description": "Week 11: Rights and nature This week you will learn about the rapidly growing area of interest - rights of nature. You'll be guided by readings from two of Australia's leading thinkers and advocates in this space, Associate Professor Wendy Steele, and Dr Michelle Maloney (who is also director of Australian Earth Laws Alliances). Along with Michelle and Wendy, you will explore what recognition of the rights of nature might mean for environmental decision making and environmental management. How might governance be done differently, in situations where rights were accorded to rivers, mountains and other natural places, regardless of the so called use value to humans?",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L06"
            ]
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12: Environmental movements and social change</strong><br/><p>As we reach towards the end of this course in sociology of environment, we turn our attention towards the future. Specifically, this week, we consider diverse theories for achieving social and environmental change. We have come to understand the various ways different interest groups understand environmental issues in different ways. We have also thought about the ways histories of colonialism and on-going violence constrain just action related to both human and earth rights. With this as context, how do those working to affect change strategise to affect positive change? We will start our readings with a book chapter from L. Pyles, who assists us to understand the diverse forms of community organising, reflecting specifically on the neo-liberal US context (not too dis-similar to Australia). We will then turn to consider the effectiveness of legal strategies for delivering environmental outcomes, including considering the current Youth Verdict legal case, which Associate Professor Justine Bell-James describes in your second article for this week.</p>\n<p>In this final lecture of the semester, we will also draw together key learnings from the course. We will check these off against the learning objectives, and think about where this knowledge might take us ... beyond this course.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 12: Environmental movements and social change</strong>",
            "topic_description": "Week 12: Environmental movements and social change As we reach towards the end of this course in sociology of environment, we turn our attention towards the future. Specifically, this week, we consider diverse theories for achieving social and environmental change. We have come to understand the various ways different interest groups understand environmental issues in different ways. We have also thought about the ways histories of colonialism and on-going violence constrain just action related to both human and earth rights. With this as context, how do those working to affect change strategise to affect positive change? We will start our readings with a book chapter from L. Pyles, who assists us to understand the diverse forms of community organising, reflecting specifically on the neo-liberal US context (not too dis-similar to Australia). We will then turn to consider the effectiveness of legal strategies for delivering environmental outcomes, including considering the current Youth Verdict legal case, which Associate Professor Justine Bell-James describes in your second article for this week. In this final lecture of the semester, we will also draw together key learnings from the course. We will check these off against the learning objectives, and think about where this knowledge might take us ... beyond this course.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L07",
                "L08"
            ]
        }
    ]
}