{
    "course_title": "Project",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SOSC3202-63256-7460",
    "full_course_code": "SOSC3202-63256-7460",
    "course_code": "SOSC3202",
    "class_code": "63256",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Plan and manage a small-scale social research project"
        },
        {
            "number": "LO2.",
            "description": "Work effectively in team environments"
        },
        {
            "number": "LO3.",
            "description": "Conduct data collection using methods relevant to your research questions and aims"
        },
        {
            "number": "LO4.",
            "description": "Understand and address ethical issues relating to social research as they arise in the context of conducting research"
        },
        {
            "number": "LO5.",
            "description": "Analyse, synthesise and present empirical research data to mount a convincing argument"
        },
        {
            "number": "LO6.",
            "description": "Write research reports and outputs for different audiences"
        },
        {
            "number": "LO7.",
            "description": "Reflect critically upon your learning and your achievements"
        },
        {
            "number": "LO8.",
            "description": "Transfer your knowledge and skills to diverse professional employment contexts"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Research Project Reflection",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>15%</dd>",
            "due_date": "<dd><p> 5/08/2024 2:00 pm</p></dd>",
            "learning_objectives": "L02, L07, L08",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>THE TASK: </strong></p>\n<p>Early in semester you are required to submit <strong>a 1000 word reflection </strong>that captures a significant learning experience in the research project course. Your reflection will follow the three phases of a reflective model known as the “What” Reflection model (Driscoll, 2000). The model, and some useful prompt questions to help steer your thinking, are included below. This is an <strong>individual assessment</strong>. </p>\n<p><strong>BACKGROUND TO THIS ASSESSMENT:</strong></p>\n<p>This assignment is intended to help you take stock, capture your learning and help you focus your attention on the semester ahead. This task has been developed because the skills of observation and reflection are critical to research. Being a good researcher means constantly reflecting on your practice and seeking ways to continually develop your skills. Doing something well doesn’t mean much if you don’t know why it worked and how you can replicate it. Doing something poorly isn’t a disaster if it provides a rich learning opportunity and leads to greater insight and improvements for next time. In putting your reflection together you are being invited to hold your work both appreciatively and critically. Neither false modesty nor an over-inflated ego will be helpful to this exercise.</p>\n<p><strong>Title of reflection:</strong></p>\n<p><strong><em>1. What?  </em></strong></p>\n<p>This is the descriptive phase of your reflection that captures what happened and what the impact on you was. What you need to do is to reflect on your experiences in the Research Course (SOSC3201/SOSC3202) so far and choose one important learning moment for you. (See below for some ideas and suggestions for starting places).</p>\n<p>Include a brief description of the event, situation or issue. State your reaction to the situation or issue.</p>\n<ul>\n<li>Describe the experience - what happened?</li>\n<li>What did you observe/feel/question about the situation/issue?</li>\n<li>What was the impact on you?</li>\n</ul>\n<p><strong><em>2. So what?  </em></strong></p>\n<p>This is the analytical phase of your reflection that captures how your deeper insights. So, what sense do you make of this? So what have you learnt from this? Now what other ideas do you connect to? (eg from coursework, current events, theories, past experiences).</p>\n<p><strong><em>3. Now what?</em></strong></p>\n<p>This is the intention phase of the reflection that shows how you will apply what you have learned from an experience, to future endeavours.</p>\n<p>Now what are you going to do as a result of your experience? Now what do you need to take with you from this experience? Now what will you do to apply what you have learnt in the future? Now what are the critical questions to further pursue? Now what thinking is required? Now what actions are needed?</p>\n<p><strong>Marking criteria and matrix </strong>are available in the ‘Assessment’ folder in Blackboard for this course.</p>\n<p><strong>ChatGPT, Generative Articial Intelligence tools and automated writing aids: </strong>ChatGPT is allowed to be used to <strong><em>support </em></strong>you with your assessment preparation. It cannot be used to prepare drafts of writing, but can be used to assist in identifying possible writing structures, or topics you might need to cover, or for checking grammar.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must submit your assignment electronically by the due time, on the due date. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Feedback Summary Sheet for Research Participants",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>25% Group  </dd>",
            "due_date": "<dd><p> 23/09/2024</p>\n<p>\n</p><p>You are also required to complete a BuddyCheck assessment of each group member's contribution. This is required within 3 days following the assessment due date.</p>\n<p>If a member of the group is unable to make their contributions, please consider having them apply for an extension. If this is done, the student will need to liase with the course coordinator to clarify how to manage the due date for the student and the group.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L08",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This piece of assessment is designed to meet three aims.</p>\n<ol>\n<li>As part of our commitment to conduct ethically-informed research, it is important that research participants and other relevant stakeholders are given access to the research results and conclusions in one form or another. While it is your industry partner who has effectively 'contracted' the research, the study would not have been possible without your research participants and it is important that you 'give something back' to acknowledge their time and effort.</li>\n<li>This assignment represents a first opportunity for you to start writing up your research findings and to consider what your main themes and argument are in preparation for your poster, presentation and report.</li>\n<li>This assignment is designed to equip you with the skills of writing for different audiences, meaning that how you present your work is informed by who you are writing it for. When writing for research participants and other stakeholder groups, it is important that you present your work in a way that is communicable and easy to understand, rather than necessarily using a lot of technical or academic language or 'jargon'. While you may ultimately send participants a copy of your report with the industry partner's permission, they are more likely to read a brief summary sheet than a long, academic document.</li>\n</ol>\n<p>As a group, you are required to write a two-page A4 summary feedback sheet for your research participants and other relevant stakeholders. How you present it is up to you, but consider ways of making it look eye-catching, easily digestible and something that somone will actually stop to read. The sheet should contain the following material:</p>\n<ul>\n<li>A clear statement of the research problem, aims, questions, and methods</li>\n<li>A discussion of your research findings, structured by theme.</li>\n</ul>\n<p>You should also find ways of presenting your data in a suitable format, either through <strong>quotes, tables, graphs </strong>or other means. While you do not want your document to be heavily referenced, you should draw on a few key <strong>references </strong>to explain where your work fits with existing research and why it is important.</p>\n<p>The sheet should also contain details of how the research team might be <strong>contacted</strong>, and some form of <strong>acknowledgement </strong>of your research participants.</p>\n<p>Examples will be provided to you in class and on Blackboard to illustrate what is required.</p>\n<p>While this will be marked as a separate piece of assessment to your final report, you should append a copy of this sheet to your final report for the industry partner. Feedback on this document will be provided and you are expected to update and revise the summary sheet accordingly before providing to the industry report and circulating to your participants. You are likely to need the industry partner's permission before you can make this sheet available to participants and may need their assistance with distribution. <strong>Please do not send this to participants without receiving the full consent of your industry partner, or without giving them an opportunity to check it for content.</strong></p>\n<p>The <strong>length </strong>of this document should be no more than two sides of one A4 sheet. </p>\n<p><strong>ChatGPT, Generative Articial Intelligence tools and automated writing aids: </strong>ChatGPT is allowed to be used to <strong><em>support </em></strong>you with your assessment preparation. It cannot be used to prepare drafts of writing, but can be used to assist in identifying possible writing structures, or topics you might need to cover, or for checking grammar.</p>\n<p><strong>Marking criteria and matrix </strong>are available in the ‘Assessment’ folder in Blackboard for this course.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>You must submit your assignment electronically by the due time, on the due date.</strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Draft research report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> Formative assessment </dd>",
            "due_date": "<dd><p> 8/10/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L08",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This is the main product of your efforts over the course of the year and you should plan it well in advance to ensure you produce something of a high quality that you can be proud of. The research report should include the following sections:</p>\n<ul>\n<li><strong>Separate title page</strong> (with author names)</li>\n<li><strong>Acknowledgements</strong></li>\n<li><strong>Executive Summary</strong> (no more than one A4 page)</li>\n<li><strong>Table of Contents</strong></li>\n<li><strong>Introduction</strong>: Describe the research problem and its importance, the scope and focus of your research, and a brief outline of your research report </li>\n<li><strong>Research questions</strong>: Your research questions must be clearly stated, and clearly related to your research aims and objectives. They should flow naturally from your problem statement outlined in the introduction.</li>\n<li><strong>Literature review</strong>: Provide a concise, comprehensive summary and evaluation of literature relevant to your research, and identification of gaps in existing literature.</li>\n<li><strong>Key concepts or theoretical framework:</strong> at the end of your literature review, you should provide an outline of the approach you plan to take with your study by identifying key theories or concepts that inform your research questions, analysis or conclusions.</li>\n<li><strong>Methodology</strong>: Methodology is the theory of methods and covers the research paradigm through which you conduct your research (such as interpretivism, or action research), and the techniques used to collect your data. You must describe the participants in your study (e.g. how and why they were selected), and the procedures you used in order to implement your research design (data collection techniques; measures/tests; data analysis methods; consideration of issues of validity &amp; reliability, etc) and provide a clear justification for your research design and methods.</li>\n<li><strong>Results</strong>: Present and elaborate the key findings of your research and clearly present the evidence you have gathered to support findings.</li>\n<li><strong>Discussion</strong>: Your discussion should relate your findings to relevant literature, and apply your findings to answer your research questions. Depending on the type of study you have conducted, results and discussion may be presented together in an analysis section. The course coordinator will work through these different report formats with you in class.</li>\n<li><strong>Conclusion</strong>: Your conclusion should summarise the results of your research and relate findings to key research questions and the aims of your research. Your conclusion should include a statement of any specific limits of your research design that might have affected the validity or reliability of the results, and/or the application of your findings. You should include any recommendations that arise from your research in the concluding section and/or identify why your work is significant.</li>\n<li><strong>References</strong>: You must acknowledge all source material, using an established social science referencing convention (e.g. APA)</li>\n<li><strong>Appendices</strong>: Place any questionnaires or interview materials in an appendix, along with a final copy of your participant feedback sheet. Do not append your raw data or data analysis. (Appendices will not be included in the word count for your Final Research Report.)</li>\n</ul>\n<p>Word limit: 6500-7500 words.</p>\n<p><strong>ChatGPT, Generative Articial Intelligence tools and automated writing aids: </strong>All reports must include an <strong>AI Disclosure Report </strong>at the end of the assessment, which is not included in the word count. Generative AI (such as ChatGPT) is allowed to be used to <em>support </em>you with your assessment preparation. It cannot be used to prepare drafts of writing, but can be used to assist in identifying possible writing structures, or topics you might need to cover, or for checking grammar and spelling. If you use ChatGPT or similar, it is necessary that you include in your <strong>AI Disclosure Report</strong> the tools you used and the prompts you used to generate material. Further discussion and advice is provided in the Workshops. </p>\n<p><strong>Please note: </strong>A quality <strong>draft </strong>of your report should be submitted to the course coordinator. The report will be returned to you with feedback so that you can revise your report and make any recommended changes, but no mark or grade will be awarded at this point. The intention is to help you secure a higher grade for your report by having the opportunity to revise and resubmit it, and also to ensure that what you ultimately submit to your industry partner is a piece of work that you can be proud of. </p>\n<p><strong>Marking criteria and matrix </strong>are available in the ‘Assessment’ folder in Blackboard for this course.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>This is a group assessment. Only one member of your group needs to submit your assessment on the group's behalf.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>As this a formative assessment without marks, there is no late penalty.  You will need to engage with the course coordinator if you and your group do not think you can submit by the due date.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Group Video and Showcase Presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p>Submit Video 21/10/2024</p>\n<p>Showcase Presentation 23/10/2024</p>\n<p>\n</p><p>Your video is due for submission prior to the Showcase (held in week 13). This is to allow for the video to be uploaded for the Showcase presentation.  The video will be shown at the Showcase and all group members are required to be present to answer audience questions.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L08",
            "mode": "Oral, Product/ Artefact/ Multimedia",
            "category": "Creative Production/ Exhibition, Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Each team will prepare a short 5-6 minute audio-visual presentation, accompanied by a five minute oral Q&amp;A discussion at the research showcase in Week 13.  All team members should be prepared to answer any questions posed by their peers, advisors, or invited guests. <strong>All students must attend </strong>(via Zoom if in person attendance is not possible). A people's choice <strong>award </strong>will be presented for the video of the highest standard.</p>\n<p>Videos <strong>must </strong>be submitted to the Blackboard sitecourse no later than <strong>2pm on Friday 18 October</strong> for loading into the Showcase presentation. For the purposes of course assessment, the video and oral presentation will be assesed based on the criteria found on Blackboard.</p>\n<p>A good video needs a good plan - so start planning early and consult with your academic advisor and industry partner. Your video should provide a visually engaging summary of your research - including your project title and participants; acknowledgement of contributors, partners and advisors; research aims; methods; key research questions; and findings. Specific guidelines for formatting will be provided on Blackboard. </p>\n<p><strong>ChatGPT, Generative Articial Intelligence tools and automated writing aids: </strong>An<strong> AI Disclosure Report </strong>will need to be submitted alongside the video. <strong>Generative AI can be used to produce visual images</strong>. and experimentation is welcomed. Generative AI (such as ChatGPT) is allowed to be used to <em>support </em>you with your assessment preparation. It cannot be used to prepare drafts of writing, but can be used to assist in identifying possible writing structures, or topics you might need to cover, or for checking grammar and spelling. If you use ChatGPT or similar, it is necessary that you include in your <strong>AI Disclosure Report</strong> the tools you used and the prompts you used to generate material. Further discussion and advice is provided in the Workshops. </p>\n<p><strong>Marking criteria and matrix </strong>are available in the ‘Assessment’ folder in Blackboard for this course.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Your assignment must be submitted via Blackboard. Only one member of the group is required to submit the assessment.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-4",
            "assessment_title": "Final research report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 4/11/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L08",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This is the main product of your efforts over the course of the year and you should plan it well in advance to ensure you produce something of a high quality that you can be proud of. The research report should include the following sections:</p>\n<ul>\n<li><strong>Separate title page</strong> (with author names)</li>\n<li><strong>Acknowledgements</strong></li>\n<li><strong>Executive Summary</strong> (no more than one A4 page)</li>\n<li><strong>Table of Contents</strong></li>\n<li><strong>Introduction</strong>: Describe the research problem and its importance, the scope and focus of your research, and a brief outline of your research report </li>\n<li><strong>Research questions</strong>: Your research questions must be clearly stated, and clearly related to your research aims and objectives. They should flow naturally from your problem statement outlined in the introduction.</li>\n<li><strong>Literature review</strong>: Provide a concise, comprehensive summary and evaluation of literature relevant to your research, and identification of gaps in existing literature.</li>\n<li><strong>Key concepts or theoretical framework:</strong> at the end of your literature review, you should provide an outline of the approach you plan to take with your study by identifying key theories or concepts that inform your research questions, analysis or conclusions.</li>\n<li><strong>Methodology</strong>: Methodology is the theory of methods and covers the research paradigm through which you conduct your research (such as interpretivism, or action research), and the techniques used to collect your data. You must describe the participants in your study (e.g. how and why they were selected), and the procedures you used in order to implement your research design (data collection techniques; measures/tests; data analysis methods; consideration of issues of validity &amp; reliability, etc) and provide a clear justification for your research design and methods.</li>\n<li><strong>Results</strong>: Present and elaborate the key findings of your research and clearly present the evidence you have gathered to support findings.</li>\n<li><strong>Discussion</strong>: Your discussion should relate your findings to relevant literature, and apply your findings to answer your research questions. Depending on the type of study you have conducted, results and discussion may be presented together in an analysis section. The course coordinator will work through these different report formats with you in class.</li>\n<li><strong>Conclusion</strong>: Your conclusion should summarise the results of your research and relate findings to key research questions and the aims of your research. Your conclusion should include a statement of any specific limits of your research design that might have affected the validity or reliability of the results, and/or the application of your findings. You should include any recommendations that arise from your research in the concluding section and/or identify why your work is significant.</li>\n<li><strong>References</strong>: You must acknowledge all source material, using an established social science referencing convention (e.g. APA)</li>\n<li><strong>Appendices</strong>: Place any questionnaires or interview materials in an appendix, along with a final copy of your participant feedback sheet. Do not append your raw data or data analysis. (Appendices will not be included in the word count for your Final Research Report.)</li>\n</ul>\n<p>Word limit: 6500-7500 words.</p>\n<p><strong>Please note:</strong>You will have received feedback on your draft report. This assessment is your revised and enhanced version of your draft report, which will be marked and graded.</p>\n<p><strong>ChatGPT, Generative Articial Intelligence tools and automated writing aids</strong></p>\n<p>All reports must include an <strong>AI Disclosure Report </strong>at the end of the assessment, which is not included in the word count. Generative AI (such as ChatGPT) is allowed to be used to <em>support </em>you with your assessment preparation. It cannot be used to prepare drafts of writing, but can be used to assist in identifying possible writing structures, or topics you might need to cover, or for checking grammar and spelling. If you use ChatGPT or similar, it is necessary that you include in your <strong>AI Disclosure Report</strong> the tools you used and the prompts you used to generate material. Further discussion and advice is provided in the Workshops. </p>\n<p><strong>Peer Assesment: </strong>Within a week of submitting this assessment, you should also submit a Peer Assessment via BuddyCheck. This peer assessment must cover your assessment both the final report and the Video Assessment, and takes into account each member's contribution to the group since the submission of the Participant Feedback Sheet (i.e. week 9). </p>\n<p><strong>Marking criteria and matrix </strong>are available in the ‘Assessment’ folder in Blackboard for this course.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p><strong>As a group assignment, only one member of your group is required to submit your assignment electronically by the due date and time.</strong></p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-5",
            "assessment_title": "Revised Report Delivered to Industry Partner",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd> Required for award of grade </dd>",
            "due_date": "<dd><p> 15/11/2024 2:00 pm</p>\n<p>\n</p><p>You have until Monday after Exam week 2 (i.e. 18 November 2024) to submit to the Industry partner.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05, L06, L07, L08",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Your final obligation as a student research team will be to deliver a copy of your final report (audio-visual and participant feedback sheet) to your industry partner, including any accompanying materials. Your final report must not be delivered to your industry partner until it has been assessed and approved for distribution by the Course Coordinator and the Academic Advisor.</p>\n<p>Once you have submitted your Research Report for assessment, you will be given feedback by the course coordinator that you should address prior to submitting to your Industry Partner. To assist you, the Course teaching team will clearly outline any changes that need to be made. These revisions or corrections will hopefully be minor. You may consult with your Academic Advisor(s) on how to respond effectively to feedback. </p>\n<p>Once you have addressed any requirements for minor revision or correction and prepared all materials for despatch, you must obtain approval from your Academic Advisor that the report is ready for submission to the Industry Partner. This approval MUST be obtained by email and the Course Coordinator should be copied in. One member of your team should then email the report to the Industry Partner, copying in the Academic Advisor(s) and the Course Coordinator.</p>\n<p>Despatch of your Final Report to your industry partner and notification of such to the Course Co-ordinator are required for a grade. If your report is not submitted or you do not advise your course coordinator, your grades will be withheld, and graduation for some students delayed. </p>\n<p><strong>ChatGPT, Generative Articial Intelligence tools and automated writing aids: </strong>ChatGPT is allowed to be used to <strong><em>support </em></strong>you with your assessment preparation. It cannot be used to prepare drafts of writing, but can be used to assist in identifying possible writing structures, or topics you might need to cover, or for checking grammar.</p>\n<p><strong>Marking criteria and matrix </strong>are available in the ‘Assessment’ folder in Blackboard for this course.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You must deliver your Final Report and accompanying material to your industry partner, via email only once you have approval from the Academic Advisor(s) to do so, and cc your Course Coordinator, Academic Advisor(s) and all team members.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>Please advise the Course Coordinator as soon as possible if you are unable ot meet the deadline.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1(22 Jul - 28 Jul)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 1: Course Overview, Skills Audit</strong><br/><p>The coordinator will work through an overview of the semester's activities. We will discuss the first piece of assessment for this semester. Student teams will also be asked to review their team charter and complete a skills audit checklist to identify where support for the work ahead will be needed.</p>\n<p>You should also arrange a meeting with your Academic Advisor and Industry Partner.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L07</p></div></td>",
            "topic_title": "<strong>Week 1: Course Overview, Skills Audit</strong>",
            "topic_description": "Week 1: Course Overview, Skills Audit The coordinator will work through an overview of the semester's activities. We will discuss the first piece of assessment for this semester. Student teams will also be asked to review their team charter and complete a skills audit checklist to identify where support for the work ahead will be needed. You should also arrange a meeting with your Academic Advisor and Industry Partner.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L07"
            ]
        },
        {
            "learning_period": "Week 2(29 Jul - 04 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 2: Fieldwork Set-up and Skills Workshops</strong><br/><p>The session will be in two parts, as follows: Part 1 will be spent working with relevant groups on fieldwork preparation according to the skills audit provided in Week 1. These may include skills relating to conducting interviews, data management, survey design, research ethics in practice etc. We will also provide an introduction to the online survey software systems <strong>Qualtrics</strong>. In Part 2, teams should review and plan your activities for fieldwork, such as working through interview and survey questions, finalising procedures for participant recruitment and sampling, undertaking documentary analysis etc.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L07</p></div></td>",
            "topic_title": "<strong>Week 2: Fieldwork Set-up and Skills Workshops</strong>",
            "topic_description": "Week 2: Fieldwork Set-up and Skills Workshops The session will be in two parts, as follows: Part 1 will be spent working with relevant groups on fieldwork preparation according to the skills audit provided in Week 1. These may include skills relating to conducting interviews, data management, survey design, research ethics in practice etc. We will also provide an introduction to the online survey software systems Qualtrics . In Part 2, teams should review and plan your activities for fieldwork, such as working through interview and survey questions, finalising procedures for participant recruitment and sampling, undertaking documentary analysis etc.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L07"
            ]
        },
        {
            "learning_period": "Week 3(05 Aug - 11 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 3: Fieldwork</strong><br/><p>Fieldwork period: Most teams should be engaged in data collection by this point, although progressing at different rates according to the nature of their projects. </p></p><p><strong>Sub-activity:</strong> Complete BuddyCheck Lickert Scale group assessment via Blackboard (for discussion in week 4)</p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 3: Fieldwork</strong>",
            "topic_description": "Week 3: Fieldwork Fieldwork period: Most teams should be engaged in data collection by this point, although progressing at different rates according to the nature of their projects. Sub-activity: Complete BuddyCheck Lickert Scale group assessment via Blackboard (for discussion in week 4)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 4(12 Aug - 18 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 4: Fieldword period; Participant Summary Research Findings Assessment; Group Dynamics </strong><br/><p>Much of today's workshop will focus on working through your research activities, including recruitment, data collection and preparing for data analysis. Today we will also discuss the requirements for assessment 2 - the Participant Summary Research Findings Sheet. Groups will also reflect on their group dynamics based on the peer assessments via BuddyCheck the week before.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 4: Fieldword period; Participant Summary Research Findings Assessment; Group Dynamics </strong>",
            "topic_description": "Week 4: Fieldword period; Participant Summary Research Findings Assessment; Group Dynamics Much of today's workshop will focus on working through your research activities, including recruitment, data collection and preparing for data analysis. Today we will also discuss the requirements for assessment 2 - the Participant Summary Research Findings Sheet. Groups will also reflect on their group dynamics based on the peer assessments via BuddyCheck the week before.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 5(19 Aug - 25 Aug)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 5: Managing and analysing qualitative data: Working with NVIVO</strong><br/><p>Most teams will still be engaged in fieldwork. Nevertheless, you will need to start thinking about how to manage and analyse the data you have collected. In week 5, we will do a brief refresher of textual data for qualitative data analysis. Advice will be provided on issues of transcription, thematic and other forms of qualitative data analysis that are relevant to your projects. The workshop will focus on introducing you to new digital research analysis tools and methods, in the form of computational textual analysis. At least one member of each group will need to download LEXIMANCER prior to the workshop. If you have collected textual data, please bring to use. </p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 5: Managing and analysing qualitative data: Working with NVIVO</strong>",
            "topic_description": "Week 5: Managing and analysing qualitative data: Working with NVIVO Most teams will still be engaged in fieldwork. Nevertheless, you will need to start thinking about how to manage and analyse the data you have collected. In week 5, we will do a brief refresher of textual data for qualitative data analysis. Advice will be provided on issues of transcription, thematic and other forms of qualitative data analysis that are relevant to your projects. The workshop will focus on introducing you to new digital research analysis tools and methods, in the form of computational textual analysis. At least one member of each group will need to download LEXIMANCER prior to the workshop. If you have collected textual data, please bring to use.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 6(26 Aug - 01 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 6: Managing and analysing quantitative data: Working with STATA</strong><br/><p>This is the second in a series of training sessions on data management and analysis; this time for those using quantitative data analysis. We will do a brief refresher on quantitative data management, cleaning and coding, and common statistical analytic techniques. Given that survey data can be analysed in Qualitrics, a refresher on STATA will be provided as required for more advanced statistical methods.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 6: Managing and analysing quantitative data: Working with STATA</strong>",
            "topic_description": "Week 6: Managing and analysing quantitative data: Working with STATA This is the second in a series of training sessions on data management and analysis; this time for those using quantitative data analysis. We will do a brief refresher on quantitative data management, cleaning and coding, and common statistical analytic techniques. Given that survey data can be analysed in Qualitrics, a refresher on STATA will be provided as required for more advanced statistical methods.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 7(02 Sep - 08 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 7: Developing Audio-visual presentations</strong><br/><p>This week you will be introduced to preparing audio-visual presentations using online tools (such as Moovly and Animoto), starting with story-boarding.</p>\n<p>We will also discuss the requirements for the audio-visual assessment for the Research Showcase. </p>\n<p>A guest speaker will teach you about processes of video design and production.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 7: Developing Audio-visual presentations</strong>",
            "topic_description": "Week 7: Developing Audio-visual presentations This week you will be introduced to preparing audio-visual presentations using online tools (such as Moovly and Animoto), starting with story-boarding. We will also discuss the requirements for the audio-visual assessment for the Research Showcase. A guest speaker will teach you about processes of video design and production.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 8(09 Sep - 15 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 8: Writing for diverse audiences:</strong><br/><p>You will be introduced to the different ways to report on research findings, depending on the relevant audience. This class begins to equip students with the skills in report writing for their report to industry partners as well as feedback in everyday language to research participants and other relevant stakeholders as part of our obligation to conduct ethical research and acknowledge participants' time and effort.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 8: Writing for diverse audiences:</strong>",
            "topic_description": "Week 8: Writing for diverse audiences: You will be introduced to the different ways to report on research findings, depending on the relevant audience. This class begins to equip students with the skills in report writing for their report to industry partners as well as feedback in everyday language to research participants and other relevant stakeholders as part of our obligation to conduct ethical research and acknowledge participants' time and effort.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 9(16 Sep - 22 Sep)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 9: Preparing your research report</strong><br/><p>We begin to prepare for the main research output of your work - the report to industry partners. This is a very different kind of written output to what you are used to producing at university: it is written for the explicit benefit of your industry partner so that they can learn what you have found in your research and what these findings mean to their practice. We will spend time in the workshop outlining the requirements of this report and the ways to approach it.</p>\n<p>This is also a good time to meet with your industry partner to talk them through your emerging research findings. They will be able to help you make sense of what you have found and what it means for their work so that any recommendations or conclusions you draw are meaningful to the industry partner.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 9: Preparing your research report</strong>",
            "topic_description": "Week 9: Preparing your research report We begin to prepare for the main research output of your work - the report to industry partners. This is a very different kind of written output to what you are used to producing at university: it is written for the explicit benefit of your industry partner so that they can learn what you have found in your research and what these findings mean to their practice. We will spend time in the workshop outlining the requirements of this report and the ways to approach it. This is also a good time to meet with your industry partner to talk them through your emerging research findings. They will be able to help you make sense of what you have found and what it means for their work so that any recommendations or conclusions you draw are meaningful to the industry partner.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Mid Sem break(23 Sep - 29 Sep)",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Mid Semester Break</strong><br/></p><p><strong>Sub-activity:</strong> Complete Lickert Scale BuddyCheck in Blackboard.</p></div></td>",
            "topic_title": "<strong>Mid Semester Break</strong>",
            "topic_description": "Mid Semester Break Sub-activity: Complete Lickert Scale BuddyCheck in Blackboard.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10(30 Sep - 06 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 10: Being a social science professional</strong><br/><p>This week we will discuss - with the input from a panel of guests - about working as a social science professional and how to pitch your BSocSci skills to prospective employers.</p>\n<p>Groups will also reflect on and discuss their group dynamics based on peer assessment via BuddyCheck, to identify any problems or challenges and possible solutions.</p>\n<p>During this week, you will also revise your participant research summary sheet in light of feedback provided by the course coordinator. Changes should be made to your summary sheet in time for submission as part of your final research report.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 10: Being a social science professional</strong>",
            "topic_description": "Week 10: Being a social science professional This week we will discuss - with the input from a panel of guests - about working as a social science professional and how to pitch your BSocSci skills to prospective employers. Groups will also reflect on and discuss their group dynamics based on peer assessment via BuddyCheck, to identify any problems or challenges and possible solutions. During this week, you will also revise your participant research summary sheet in light of feedback provided by the course coordinator. Changes should be made to your summary sheet in time for submission as part of your final research report.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 11(07 Oct - 13 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 11: King's Birthday Public Holiday</strong><br/><p>While there is no workshop, during this week group should be focusing on finalising your DRAFT research reports. By now, each team should have a good idea of their research aims, findings and significance and so the time will be dedicated to the presentation of material in a visually attractive and suitable format.</p></p></div></td>",
            "topic_title": "<strong>Week 11: King's Birthday Public Holiday</strong>",
            "topic_description": "Week 11: King's Birthday Public Holiday While there is no workshop, during this week group should be focusing on finalising your DRAFT research reports. By now, each team should have a good idea of their research aims, findings and significance and so the time will be dedicated to the presentation of material in a visually attractive and suitable format.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12(14 Oct - 20 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 12: Finalising your research presentation</strong><br/><p>This week will be devoted to the task of finalising your presentations for the research showcase. We will go through the principles of a good presentation in time for the research showcase next week. The workshop will consist of Group Consultation to work through the feedback on your DRAFT research report.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 12: Finalising your research presentation</strong>",
            "topic_description": "Week 12: Finalising your research presentation This week will be devoted to the task of finalising your presentations for the research showcase. We will go through the principles of a good presentation in time for the research showcase next week. The workshop will consist of Group Consultation to work through the feedback on your DRAFT research report.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        },
        {
            "learning_period": "Week 13(21 Oct - 27 Oct)",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Week 13: Research Showcase</strong><br/><p>This is the last week of semester and the culmination of all your work over the year. It's also the week of the research showcase where you present your work to your peers, families, industry partners and university staff.</p>\n<p>There will be no formal class content so that you can all practice your presentations and get ready for your big night. While no formal workshop is scheduled, Course teaching staff will attend and be available, and you may use the room to meet and work through the feedback as a team and seek any clarification you need on your final report.</p></p><p><strong>Sub-activity:</strong> Research Showcase - 4-6pm Wednesday 23 October.</p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05, L06, L07, L08</p></div></td>",
            "topic_title": "<strong>Week 13: Research Showcase</strong>",
            "topic_description": "Week 13: Research Showcase This is the last week of semester and the culmination of all your work over the year. It's also the week of the research showcase where you present your work to your peers, families, industry partners and university staff. There will be no formal class content so that you can all practice your presentations and get ready for your big night. While no formal workshop is scheduled, Course teaching staff will attend and be available, and you may use the room to meet and work through the feedback as a team and seek any clarification you need on your final report. Sub-activity: Research Showcase - 4-6pm Wednesday 23 October.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06",
                "L07",
                "L08"
            ]
        }
    ]
}