{
    "course_title": "Advanced Training Programs",
    "study_period": "Sem 2 2024",
    "location": "External",
    "attendance": "Online",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SPCG7028-61688-7460",
    "full_course_code": "SPCG7028-61688-7460",
    "course_code": "SPCG7028",
    "class_code": "61688",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Describe the characteristics of an elite performer within their chosen sport and outline some relevant strategies and concepts applicable to the design of a high performance program"
        },
        {
            "number": "LO2.",
            "description": "Conduct a performance review of a chosen athlete, team or position/discipline in order to identify key developmental interventions for high performance"
        },
        {
            "number": "LO3.",
            "description": "Design a training program which is individualised to meet the performance goals of the individual and reflects best practice in training principles"
        },
        {
            "number": "LO4.",
            "description": "Design an appropriate planning system using Microsoft Excel and use this system to prepare an annual training program which includes: o Individual goals o Training Session Plans o Microcycle and Macrocycle Plans o Identifies key competitions (peaking) and reflects an appropriate training phase design"
        },
        {
            "number": "LO5.",
            "description": "Design a comprehensive and useful electronic coaching tool for future use in the planning of training programs"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Needs Analysis",
            "special_indicators": [],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 15/08/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assessment item has two parts: </p>\n<p><strong>Part A: Methods of monitoring training (and competition)</strong></p>\n<p>Design a training and monitoring program for your athlete/s or team and include two elements:</p>\n<ol>\n<li>Training load - How will you document and measure training and game output? (e.g. frequency, volume and intensity). Normally this might include keeping a tally of the time spent training on a daily basis (volume) and accumulated over each microcycle and macrocycle, or include an intensity measure (based on the type of training activity). It could also include time spent on the field (meters covered, distance travelled etc)</li>\n<li>Evaluating training - Impact on athlete/s or team – How will you monitor the level of coping from the athlete (e.g. implement the use of an athlete monitoring tool such as the relative perceived effort scale or a player welfare survey or training diary).</li>\n</ol>\n<p><em>Please refer to the readings and notes provided in the learning resources section for this (training concepts)</em></p>\n<p>Formatting for Task A</p>\n<p>Present as short discussion (maximum 600 words) – please use text, titles and referencing to support your methods (e.g. rationale for using RPE scale or a National Sporting Organisation procedure for your sport).</p>\n<p><strong>Part B: Synopsis on training methods in high performance sport including high performance components and the principles of specificity </strong></p>\n<p>Complete the following table by:</p>\n<ol>\n<li>Providing a definition for the selected term in the second column</li>\n<li>Outline how this concept applies in your own sporting context and provide an example for each one and comment on the following parameters:</li>\n<li>Context – athlete/s stage of development (emerging or developing elite athlete; elite athlete)</li>\n</ol>\n<p>Students are asked to used Vancouver referencing style in this assessment item.</p>\n<p>Read through the rubric for this assessment item to identify the key features of the assessment item.</p>\n<p><strong>Artificial Intelligence: </strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Training Report",
            "special_indicators": [],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 12/09/2024 2:00 pm</p></dd>",
            "learning_objectives": "L03, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This task is comprised of two Parts (A and B) and Microsoft Excel manipulation for Part C</p>\n<p><strong>Part A</strong></p>\n<p>Please present as a short essay in a word or text document. Include any relevant references or sources of information (e.g. performance benchmarks from sporting organisation).</p>\n<p>You must address the following</p>\n<p><strong>Demands of the Sport</strong></p>\n<p>Athlete profile - nature of program (sport, squad or individual – stage of development, performance goal settings):</p>\n<p>Competition schedule (annual plan) including peak events</p>\n<p><strong>Athlete/s profile</strong></p>\n<p>Evaluation methods – comparison to elite or high performance (e.g. benchmarking, performance results, fitness testing…)</p>\n<p><strong>Program objectives</strong></p>\n<p>Individual – goal setting (e.g. refer Weinberg reading)</p>\n<p>Team – goal setting – based on competition structure, previous performance of the team and profile of the team (levels of development and experience)</p>\n<p><strong>Part B</strong></p>\n<p>Part B is to be completed either as a word document using the template matrix provided in Learn.UQ).</p>\n<p>Discuss each of the five skill domains and how they are to be applied within the annual plan (look at the papers and references on periodisation provided in the learning activity). Consider:</p>\n<ul>\n<li>Mental skills</li>\n<li>Physical skills</li>\n<li>Technical skills</li>\n<li>Tactical Skills</li>\n<li>Life skills</li>\n</ul>\n<p>Depending on the context, it is also important when putting together an annual program that you take a whole of life approach – in this case consider non-sport commitments and skills. For example, a developmental program targeting adolescents should also factor in study commitments (key times for exams or assignments and the need to modify training commitments to accommodate them).</p>\n<p><strong>Part C</strong></p>\n<p>Develop a yearly plan and must be completed in an Excel file (as per examples provided Learn.UQ).</p>\n<p>You must address the following:</p>\n<p>Provide a periodised program across the year (single or double) and a summary of the objectives of each phase.</p>\n<p>Include the 5 phases:</p>\n<ul>\n<li>Transition</li>\n<li>General Preparation</li>\n<li>Specific preparation</li>\n<li>Pre-Competition</li>\n<li>Competition</li>\n</ul>\n<p>Also consider competitions, training camps, selection events and any reviews e.g. fitness testing.</p>\n<p>Students are asked to used Vancouver referencing style in this assessment item.</p>\n<p>Read through the rubric for this assessment item to identify the key features of the assessment item.</p>\n<p><strong>Artificial Intelligence: </strong>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Planning Presentation",
            "special_indicators": [],
            "weighting": "<dd>45%</dd>",
            "due_date": "<dd><p> 10/10/2024 2:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Presentation, Product/ Design",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This task is comprised of six parts (A to F)</p>\n<p>This assignment is about using the <strong>functionality of the Microsoft Excel Template. </strong>It is also where you complete a monitoring program for the subject athlete or team. This design process links in with assignment 2 where you provided a basic annual plan worksheet on Excel as well as the matrix for training priorities across the 4 skill domains. In this assignment, students are required to design a layout for an annual training program that utilises the power of Excel to speed up the planning and monitoring process. Part of the reason we develop these plans is to communicate with others involved in the training (e.g. coaches, specialists, etc.) therefore the use of Excel’s visual aids such as graphing and colour-scheming (to highlight phases or peaking, etc.) is valuable.</p>\n<p>Excel can also automate the translation from Annual Charts into macro and micro-cycles and can allow the volume and intensity to be highlighted for the various stages on the year. That is you can link the mesocycle plans to the annual plan’s corresponding cell (see an example on the template you downloaded in Assessment Item 2).Drop down lists can provide convenient selection of repetitive information and lookup functions can provide automated conversion of global information into more convenient or specific forms. Within your design, you should provide the layout for the annual plan, macro and micro-cycle plans on separate worksheets. It is a good idea to have the relevant microcycles (weekly planners) listed under the macrocycle plan (vertical) as this makes it easier to navigate between the different elements of the plan making it easier to design and review your program. Worksheets should also be provided to record assessments or player data such as training age or priorities, stage of development, etc. as well as any performance results. Some sports may like to use match evaluations or other record of the athlete’s assessment of where their strengths and weaknesses were apparent. It is also important to incorporate your Priority Allocation Model (Assessment Item 2).</p>\n<p>When allocating resources to a training program, it is essential for the player and coach to be aware of stress times with sources of this stress being quite varied:</p>\n<ul>\n<li>Training and Competition peaks (Major events, Commonwealth Games, Olympic Games, etc.)</li>\n<li>School/University or Work Commitments (exams, end-of-the-financial year issues, et.)</li>\n<li>Family/Social Commitments (weddings, holidays, etc)</li>\n<li>Other Commitments (Sponsorship servicing, club commitments, etc)</li>\n</ul>\n<p><strong>It is important that you include a means to plot these stressors so that appropriate resources (including time) can be allocated at the best times to optimise results.</strong></p>\n<p><strong>Monitoring Tool (measures of volume, intensity and variations of RPE) </strong></p>\n<p>Apart from data entry (training design and priorities) it is important to outline how you are going to monitor the training load for your selected athlete/s. Create a section on your annual plan for a training load graphic. These measures of training load should be available to assist in carefully overloading the athlete (ensuring adaptation) at appropriate times in the year. The final component of the assignment is to provide an explanation of how your spreadsheet works, to highlight the time saving functionality that you have incorporated and how this tool will enable you to prepare annual plans for your athletes that integrate the concepts and principles that you have been uncovering through the other assignments.</p>\n<p><em>Annual Planner features: </em></p>\n<p><em>This exercise is important in terms of designing a functional excel template</em></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit via Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Analysing Elite Performance</strong><br><p>Students will explore how to conduct a needs analysis relevant to their sport.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Analysing Elite Performance</strong>",
            "topic_description": "Analysing Elite Performance Students will explore how to conduct a needs analysis relevant to their sport.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Design Training Elements</strong><br><p>Students will explore the conceptual training elements that form part of athletic training programs and periodisation.</p></br></p><p><strong>Learning outcomes:</strong> L03, L04</p></div></td>",
            "topic_title": "<strong>Design Training Elements</strong>",
            "topic_description": "Design Training Elements Students will explore the conceptual training elements that form part of athletic training programs and periodisation.",
            "learning_outcomes": [
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Build the Planning Tool</strong><br><p>Students will explore how to build an effective and efficient training plan and periodisation plan that can be implmented in their chosen sport.</p></br></p><p><strong>Learning outcomes:</strong> L04, L05</p></div></td>",
            "topic_title": "<strong>Build the Planning Tool</strong>",
            "topic_description": "Build the Planning Tool Students will explore how to build an effective and efficient training plan and periodisation plan that can be implmented in their chosen sport.",
            "learning_outcomes": [
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Not Timetabled",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Annual Training Plan</strong><br><p>Students will implement their planning skills to articulate a coherent periodised training plan for their chosen sport.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Annual Training Plan</strong>",
            "topic_description": "Annual Training Plan Students will implement their planning skills to articulate a coherent periodised training plan for their chosen sport.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}