{
    "course_title": "Communication & Swallowing Skills in Adults II & Professional Practice II",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/SPCH7122-60100-7460",
    "full_course_code": "SPCH7122-60100-7460",
    "course_code": "SPCH7122",
    "class_code": "60100",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (24/06/2024 - 25/10/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Describe communication and swallowing disorders that can present in adults and explain how these difficulties impact on the adult client and their significant others in community settings. (SPA PS Domains/ Standards 1.6, 1.7, 2.5, 3.2, 3.3)"
        },
        {
            "number": "LO2.",
            "description": "Apply the principles of person- and family-centred and culturally responsive practice to manage communication and swallowing disorders in adults within community settings. (SPA PS Domains/ Standards 1.1, 1.2, 1.3, 1.4, 1.6, 2.2, 2.5, 2.6, 3.2, 3.3, 3.4)"
        },
        {
            "number": "LO3.",
            "description": "Explain the principles of culturally responsive practice to manage communication and swallowing disorders in adults from Aboriginal and Torres Strait Islander backgrounds within community settings. (SPA PS Domains/ Standards 1.4, 1.5, 1.6, 2.2, 3.1)"
        },
        {
            "number": "LO4.",
            "description": "Analyse and interpret assessment data to inform the differential diagnosis and management of communication and swallowing disorders in adults within community settings. (SPA PS Domains/ Standards 2.5, 3.2, 3.3, 3.4)"
        },
        {
            "number": "LO5.",
            "description": "Apply the different theories of speech and language processing, learning, and cognition to assessment and diagnosis of communication and swallowing disorders in adults within community settings. (SPA PS Domains/ Standards 2.2, 2.5, 3.2, 3.3)"
        },
        {
            "number": "LO6.",
            "description": "Explain the role of interprofessional teams in the overall management of communication and swallowing disorders in adults within community settings. (SPA PS Domains/ Standards 1.4, 1.6, 2.2, 2.5, 2.6, 3.4)"
        },
        {
            "number": "LO7.",
            "description": "Describe and demonstrate how to implement evidence-based practice and uphold the Code of Ethics when managing communication and swallowing disorders in adults within community settings. (SPA PS Domains/ Standards 1.1, 1.2, 1.3, 1.4 )"
        },
        {
            "number": "LO8.",
            "description": "Acquire and develop skills in various areas of speech pathology practice (PS Domains 1-3; relative to opportunity)"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "In-semester Exam (Voice and Fluency)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>45% MUST PASS </dd>",
            "due_date": "<dd><p> 20/09/2024 9:00 am</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This in-semester exam will assess knowledge and skills acquired from UQ Extend and tutorials in relation to the assessment, diagnosis, and management of voice and fluency disorders, and the provision of gender-affirming communication care (Weeks 3-8). This assessment will encompass short answer questions including case-based questions relating to assessment interpretation, differential diagnosis and management options for voice and fluency disorders. Students will also be required to perform an online assessment of stuttering behaviours and vocal features from a video recording during this exam.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Reflection Tasks: Voice and Fluency Disorders Management and Interprofessional Simulation Clinic Experience",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>10%</dd>",
            "due_date": "<dd><p>2pm 27/09/2024</p>\n<p>1pm 20/09/2024 - 11/10/2024</p>\n<p>\n</p><p>The Voice and Fluency Video Reflection is due for all students on Friday 27th September at 2pm for all students.</p>\n<p>The interprofessional simulation clinic will be run over a three week period on a Thursday (2-6pm) from Week 9 (19th September) until Week 11 (10th October). Each Speech Pathology student will be assigned an Occupational Therapy student partner, and will be required to attend one (1) scheduled simulation session in Week 9 OR 10 OR 11. An associated reflection task will be submitted by each student online, the day after (Friday at 1pm) each student’s scheduled simulation session. The course co-ordinator will allocate students to these sessions and provide an allocation list on Blackboard.</p></dd>",
            "learning_objectives": null,
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Following completion of the voice and fluency management tutorials provided in Weeks 3-8, students will submit a video reflection (4-5 minutes). Students will be required to reflect on clinical skills acquired in Semester 1 and to explain how these skills were transferrable to the management of voice and fluency disorders in Semester 2. Students are also required to participate in an interprofessional simulation clinic with OT students and collaboratively manage an adult case with cognitive-communication impairment following brain injury. Following the clinic, students are required to submit a written (300 word) reflection relating to their interprofessional practice experience. Each of these reflection tasks is worth 5% of your overall grade for this course.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>This assessment task is to be submitted via the course eLearning Blackboard site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Adult Community Practice Assignment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd>45% MUST PASS </dd>",
            "due_date": "<dd><p> 4/11/2024 1:00 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This assignment involves two (2) parts:</p>\n<p><br/></p>\n<p>Part A requires the evaluation of case-based information for a client with communication and swallowing impairments following discharge from an inpatient hospital rehabilitation unit back into the community. The first task is to develop a comprehensive, culturally responsive, and evidence-based management plan to support the client’s transition and ongoing care in the community. Students will be required to: 1) assess and interpret case-based information related to a client with communication and swallowing impairments; 2) develop a culturally responsive management plan that addresses the client’s needs; 3) apply evidence-based practices in the creation of the management plan; 4) demonstrate critical thinking and problem-solving skills in the context of community health care.</p>\n<p><br/></p>\n<p>Part B requires students to complete a reflection task following attendance at the lived-experience community showcase in Week 13. Students are required to provide a written reflection pertaining to the lived-experience of a community client that influenced understanding of challenges faced by individuals with communication disorders or gender-affirming communication care needs. The reflection must demonstrate a clear connection between the chosen client's lived-experience and an evolving approach to speech pathology service provision.</p>\n<p><br/></p>\n<p>A detailed task description and marking criteria will be made available on the course Blackboard site.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The assessment task is to be submitted via TurnItIn with an SHRS coversheet included.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-3",
            "assessment_title": "Professional Practice Portfolio",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                }
            ],
            "weighting": "<dd> PASS/ FAIL (MUST PASS summative assessment) </dd>",
            "due_date": "<dd><p>Midway COMPASS will be due on different dates for each placement, depending on start date. 5/08/2024 - 23/09/2024</p>\n<p>Mid-placement written reflection will be due on different dates for each placement, depending on start date, and will be stipulated by relevant practice educators. 5/08/2024 - 23/09/2024</p>\n<p>Final COMPASS will be due on different dates for each placement, depending on start date. 30/08/2024 - 25/10/2024</p>\n<p>End placement curation and video  reflection will be due on different dates for each placement, depending on start date, and will be stipulated by relevant practice educators. 30/08/2024 - 25/10/2024</p>\n<p>\n</p><p>If you are unable to attend a compulsory clinical learning activity due to medical or extenuating circumstances, you are required to complete the SHRS Absentee Form. The completed form along with the <strong>required evidence</strong> must be emailed to the School of Health and Rehabilitation Sciences Student and Academic Support Unit (<a href=\"mailto:enquiries.shrs@uq.edu.au)\">enquiries.shrs@uq.edu.au)</a> within <strong>three calendar days of the scheduled activity. </strong></p>\n<p><br/></p>\n<p>The SHRS Absentee Form can be found on your relevant Course Blackboard site. </p>\n<p><strong> </strong></p>\n<p>If your absence is due to a non-permissible circumstance (as per the SHRS Absentee Form), your attendance at the clinical activity is expected. </p>\n<p><br/></p>\n<p>Please note, it is expected that you will notify your practice educator <strong>prior to or on the day of clinical placement and as soon as is practical </strong>to notify of your absence, in addition to submitting the above information to SASU. </p>\n<p><br/></p>\n<p>Implications for lack of attendance</p>\n<p>A <strong>minimum of 90% attendance is expected</strong> at all compulsory clinical learning activities. This includes sessional clinical placement, block clinical placement, and simulations. This ensures that you can participate in all relevant learning experiences and allows your practice educator to observe sufficient clinical activities to complete relevant ratings and assessments. </p></dd>",
            "learning_objectives": null,
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Placement, Portfolio",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>There are four assessment components in relation to the Professional Practice Portfolio associated with this course.</p>\n<p>Part 1) Performance on placement will be assessed using the Competency Assessment in Speech Pathology (COMPASS®) tool:</p>\n<p>At the mid-way point of the placement, students will receive a formative rating on the COMPASS® to assist with understanding of progress and plan goals for the remainder of the placement.</p>\n<p>Part 2) Mid-placement written reflection (300 words; formative and required, with resubmission available):</p>\n<p>Using the 5R framework students will reflect on their placement experiences so far during semester and the COMPASS units. Students will describe how they have developed as a future speech pathologist and explain the development needs they have identified.</p>\n<p>Then, thinking forward to the remainder of their placement, students will identify skills, knowledge, and attributes they will continue to build, and outline how they will address their development needs and goals.</p>\n<p>Part 3) End-placement curation and video reflection (3-4 minutes, summative and required, with resubmission available):</p>\n<p>Students will collect at least 3 different examples of professional practice and add these to the Portfolio. These can include:</p>\n<p>• De-identified session plans</p>\n<p>• De-identified client reports</p>\n<p>• Resources that you have developed</p>\n<p>• References relevant to placement</p>\n<p>Then, in a 3–4-minute video, students will reflect on their placement experiences this semester and explain why they have selected these specific examples of their work and how they will use them in future practice (considering the transferability of these to different practice settings).</p>\n<p>Part 4) At the end of the placement, students will receive a <strong>summative rating on the COMPASS®. This will be a pass/fail assessment</strong> (please see criteria &amp; marking for details for the expectations of a passing mark). This assessment must be passed to gain an overall pass for this course.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>ePortfolio tasks (reflection and curation) will be submitted via Anthology link(s) in assessment folder on Blackboard (learn.uq.edu.au). For all submissions / weeks, there will be a list on Blackboard showing you who you need to submit to.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 12(01 Jul - 22 Sep)",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Online (UQ Extend) Self-Directed Learning Modules (Self-directed Learning)</strong><br><p>A series of 12 weekly (Weeks 1-12) online modules will provide information pertaining to the management of communication and swallowing disorders in adulthood within a community practice context. Course content will cover a broad range of topics, including: patient- and family-centred care frameworks, culturally and linguistically diverse communities, community practice approaches to the management of dysphagia, motor speech disorders, aphasia , cognitive-communication, voice and fluency disorders. </p></br></p></div></td>",
            "topic_title": "<strong>Online (UQ Extend) Self-Directed Learning Modules (Self-directed Learning)</strong>",
            "topic_description": "Online (UQ Extend) Self-Directed Learning Modules (Self-directed Learning) A series of 12 weekly (Weeks 1-12) online modules will provide information pertaining to the management of communication and swallowing disorders in adulthood within a community practice context. Course content will cover a broad range of topics, including: patient- and family-centred care frameworks, culturally and linguistically diverse communities, community practice approaches to the management of dysphagia, motor speech disorders, aphasia , cognitive-communication, voice and fluency disorders.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 1(01 Jul - 07 Jul)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introductory Lecture (Week 1)</strong><br><p>The introductory lecture will provide an overview of speech pathology and health care within a community context. Information about the course and associated assessment will also be provided in this lecture. </p></br></p></div></td>",
            "topic_title": "<strong>Introductory Lecture (Week 1)</strong>",
            "topic_description": "Introductory Lecture (Week 1) The introductory lecture will provide an overview of speech pathology and health care within a community context. Information about the course and associated assessment will also be provided in this lecture.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 2 To Week 12(08 Jul - 22 Sep)",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Weekly on Campus Tutorials</strong><br><p>The tutorials will be conducted from weeks 2-12 of semester and will incorporate inquiry-based learning, practical activities, and small group discussion to further explore community practice approaches to the management of communication and swallowing disorders in adulthood. Tutorials have been designed for experiential learning and therefore, students are expected to attend and participate in all tutorials. It is essential that students prepare for weekly tutorials by completing the online (UQ Extend) learning modules and associated preparation activities. As students will be working in small groups during this learning activity, tutorials will not be recorded.</p></br></p></div></td>",
            "topic_title": "<strong>Weekly on Campus Tutorials</strong>",
            "topic_description": "Weekly on Campus Tutorials The tutorials will be conducted from weeks 2-12 of semester and will incorporate inquiry-based learning, practical activities, and small group discussion to further explore community practice approaches to the management of communication and swallowing disorders in adulthood. Tutorials have been designed for experiential learning and therefore, students are expected to attend and participate in all tutorials. It is essential that students prepare for weekly tutorials by completing the online (UQ Extend) learning modules and associated preparation activities. As students will be working in small groups during this learning activity, tutorials will not be recorded.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 3 To Week 13(15 Jul - 06 Oct)",
            "activity_type": "Clinical Hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Clinical Placement</strong><br><p>Students will be placed in a sessional speech pathology (internal or external) clinic with a practice educator. Start/finish times of placements may vary depending on the placement allocated to each student.</p></br></p></div></td>",
            "topic_title": "<strong>Clinical Placement</strong>",
            "topic_description": "Clinical Placement Students will be placed in a sessional speech pathology (internal or external) clinic with a practice educator. Start/finish times of placements may vary depending on the placement allocated to each student.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Multiple weeksFrom Week 9 To Week 11(26 Aug - 15 Sep)",
            "activity_type": "Practical",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Interprofessional Simulation Clinic</strong><br><p>Students are required to participate in interprofessional simulation clinic with OT students and collaboratively manage an adult case with cognitive-communication impairment following brain injury. </p></br></p></div></td>",
            "topic_title": "<strong>Interprofessional Simulation Clinic</strong>",
            "topic_description": "Interprofessional Simulation Clinic Students are required to participate in interprofessional simulation clinic with OT students and collaboratively manage an adult case with cognitive-communication impairment following brain injury.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13(30 Sep - 06 Oct)",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lived-experience Community Showcase (Week 13)</strong><br><p>The final lecture in this course will showcase a panel of lived-experience experts sharing their personal journeys and experiences of speech pathology community care. Following individual presentations, a panel discussion will take place. This moderated discussion (between students, staff and lived-experience experts) will delve into common themes, varying experiences, and the overall impact of speech pathology care. </p></br></p></div></td>",
            "topic_title": "<strong>Lived-experience Community Showcase (Week 13)</strong>",
            "topic_description": "Lived-experience Community Showcase (Week 13) The final lecture in this course will showcase a panel of lived-experience experts sharing their personal journeys and experiences of speech pathology community care. Following individual presentations, a panel discussion will take place. This moderated discussion (between students, staff and lived-experience experts) will delve into common themes, varying experiences, and the overall impact of speech pathology care.",
            "learning_outcomes": []
        }
    ]
}