{
    "course_title": "Urban Design: Responsive Environments",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/UDAD7016-60059-7460",
    "full_course_code": "UDAD7016-60059-7460",
    "course_code": "UDAD7016",
    "class_code": "60059",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (24/06/2024 - 17/08/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Critically analyse the relationship between urban design, social and environmental systems, and their impacts, through individual and/or collaborative analysis and propositions."
        },
        {
            "number": "LO2.",
            "description": "Deploy a reflexive and research-driven design process."
        },
        {
            "number": "LO3.",
            "description": "Integrate contemporary urban strategies, practice and discourse in the design of a complex project at the urban scale, with a focus on contextual, social and environmental system opportunities."
        },
        {
            "number": "LO4.",
            "description": "Communicate the technical, experiential, formal and spatial qualities of an urban design proposal across a range of scales and disciplinary contexts, to a best practice standard, using emerging techniques, governance and design strategies to demonstrate urban opportunity and social, economic and environmental enhancement."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "A01: Olympic Legacy Framework (OLF)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--standard--alert-triangle icon-text--small",
                    "special_indicator_text": "Hurdle"
                },
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 16/07/2024 4:00 pm</p>\n<p>\n</p><p><strong>Digital Submission:</strong> Via Blackboard </p>\n<p><strong>Presentation &amp; Review</strong> in class on Friday, 12/07/2024, 9:00 am</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Oral, Product/ Artefact/ Multimedia",
            "category": "Participation/ Student contribution, Presentation, Product/ Design",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Assessment Rationale:</strong></p>\n<p>The core of this studio is an intensive, 2-week design workshop, where students work alongside industry exploring the opportunities for city-to-precinct scale urban resilience (socially and environmentally) triggered by the Olympics. In a dynamic and participative learning environment, they are be encouraged to test, and challenge, established thinking and large-scale design schemes.</p>\n<p>In <strong>Week 1</strong> of this intensive urban design studio, students focus on the city scale, where the city is defined as a network of ‘nodes’ (Olympic Legacy Development Areas – OLDA) and connecting green-blue infrastructure (Olympic Legacy Links – OLL), along three corridors identified by the <em>Connected Precinct Program</em>. Teams of students first investigate Brisbane’s structural layers (built form, public space/places and infrastructures) and their ongoing transformation driven by the 2032 Olympic and Paralympic Games. Learning from international examples, the teams collaborate and compete to shape the <strong>Olympic Legacy Map</strong>. Each team focuses on two OLDAs and the infrastructural corridors connecting them (OLL), while contributing to a collective understanding of the city (and its future) from the viewpoint of strategic Olympic places; the collective aim is to identify and reveal legacy potential and opportunities for urban resilience (including social, environmental and economic benefits) for residents and visitors to Brisbane beyond the Games.</p>\n<p>In <strong>Week 2</strong>, each team works at the node scale, where Olympic sites become triggers for sustainable urban development and resilience; the team is challenged to develop a compelling vision, principles and implementation strategies for the selected OLDA, which comprises multiple precincts, finally shaping a spatial plan of ‘gold places’ and supporting green-blue infrastructure – for mobility, water and energy management, food growth and community wellbeing and leisure. Students undertake critical reading, background research, site exploration, documentation, and data gathering/visualisation. Through structured studio sessions, students will deliver comprehensive analysis and mapping of the key drivers and opportunities shaping change in order to define an <strong>Olympic Legacy Framework</strong> (OLF) to set the spatial and social foundations for enhancing urban resilience.</p>\n<p>Working in teams of 4 or 5 (depending on the final enrolments), students are required to:</p>\n<p>1.    Collect, process and visualise the environmental, economic and social data relevant to the selected OLDAs and connecting infrastructure (OLL) through both static and moving/ animated imagery and information.</p>\n<p>2.    Contribute to shape a collective Olympic Legacy Map</p>\n<p>3.    Produce video documentation of site perception, challenges and opportunities of the team OLDA</p>\n<p>4.    Define a transformative and compelling vision for the team OLDA </p>\n<p>5.    Define and conceptualise an Olympic Legacy Framework that sets out the macro scale spatial strategies and priority principles to establish the foundations for the transformation of the area, in line with the vision.</p>\n<p>Participation, engagement and contribution to <strong>teamwork</strong> during the intensive workshop will be valued through a Student Peer Assessment process and may affect the A01 individual grade. Should you feel that your team is not functioning effectively, please contact your Course Coordinator for support.</p>\n<p><strong>Complex/Authentic assessment using AI and/or to support learning: </strong>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The School of Architecture, Design and Planning uses Blackboard and Turnitin for assessment submission. Turnitin is accessed through the course Blackboard site. Turnitin also checks for plagiarism or instances where the original work of others is not appropriately acknowledged.  </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>The late penalty for this assessment item will be calculated as follows: </p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "A02: Urban Resilience Design Toolkit (URDT)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 8/08/2024 4:00 pm</p>\n<p>\n</p><p><strong>Digital Submission:</strong> Via Blackboard</p>\n<p><strong>Presentation &amp; Review</strong> in class on Friday 9/08/2024, 9:00 am</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Oral, Product/ Artefact/ Multimedia",
            "category": "Presentation, Product/ Design",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Assessment Rationale: </strong></p>\n<p>In the second part of this urban design studio, students work individually to develop a design toolkit to support urban outcomes as outlined in the Olympic Legacy Framework (OLF) for the team Olympic Legacy Development Area (OLDA). The guideline provides designers with guidance about how to achieve consistency with relevant OLDA development requirements of the OLF (set in A01).</p>\n<p>In the <strong>Urban Resilience Design Toolkit</strong> (URDT), students focus on a specific area or precinct within the team OLDA, to advance and put in place spatial strategies to enable the proposed OLF’s delivery. Each student is encouraged to select a different precinct, contributing to the team OLDA guidelines. Following the individual refinement and consolidation of the OLDA’s OLF, each student enhances it at the precinct level, focusing on a connected network of high-quality public spaces and green-blue infrastructure that are expected to revitalise the city and support its community beyond the Olympics. The aim is to promote social and environmental wellbeing through increased green and open public space for accessible outdoor comfortable leisure, active travel, nature-based water and energy management and urban heat island effect mitigation.</p>\n<p>Working independently, students are required to:</p>\n<p>1.    Finalise the OLF of the team OLDA.</p>\n<p>2.    Develop an Olympic Legacy Precinct Plan (OLPP) for the selected location within the team OLDA</p>\n<p>3.    Develop the URDT for the selected precinct.</p>\n<p><strong>Complex/Authentic assessment using AI and/or MT to support learning: </strong>Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The School of Architecture, Design and Planning uses Blackboard and Turnitin for assessment submission. Turnitin is accessed through the course Blackboard site. Turnitin also checks for plagiarism or instances where the original work of others is not appropriately acknowledged.  </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>The late penalty for this assessment item will be calculated as follows: </p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lecture</strong><br/><p><strong>Week 1 </strong>(1-5/07)<strong> - Intensive Design Studio - City scale</strong></p>\n<p>Day 1 - AM: Project Introduction and teamwork; PM: City thinking - Shaping Brisbane</p>\n<p>Day 2 - AM: Olympic legacy – A case study; PM: Brisbane 2032 – The ambition</p>\n<p>Day 4 - AM: Guiding change – Informing Olympic infrastructure design and delivery; PM: What is urban resilience Part 01 - Social resilience</p>\n<p>Day 5 - AM: What is urban resilience Part 02 - Environmental resilience</p>\n<p><strong>Week 2 </strong>(8-12/07)<strong> - Intensive Design Studio - Urban Areas scale</strong> </p>\n<p>Day 1 - AM: What is an Urban Design Framework</p>\n<p>Day 2 - AM: The Gabba. Shaping urban change at precinct scale; PM: Greenslopes. Future-proof our city for a changing climate</p>\n<p>Day 3 - PM: Communicate with impact</p>\n<p>Day 5 - PM: What is an urban design toolkit?</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>Lecture</strong>",
            "topic_description": "Lecture Week 1 (1-5/07) - Intensive Design Studio - City scale Day 1 - AM: Project Introduction and teamwork; PM: City thinking - Shaping Brisbane Day 2 - AM: Olympic legacy – A case study; PM: Brisbane 2032 – The ambition Day 4 - AM: Guiding change – Informing Olympic infrastructure design and delivery; PM: What is urban resilience Part 01 - Social resilience Day 5 - AM: What is urban resilience Part 02 - Environmental resilience Week 2 (8-12/07) - Intensive Design Studio - Urban Areas scale Day 1 - AM: What is an Urban Design Framework Day 2 - AM: The Gabba. Shaping urban change at precinct scale; PM: Greenslopes. Future-proof our city for a changing climate Day 3 - PM: Communicate with impact Day 5 - PM: What is an urban design toolkit?",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Multiple weeks",
            "activity_type": "Studio",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Studio</strong><br/><p><strong>Week 1 </strong>(1-5/07)<strong> - Intensive Design Studio - City scale </strong>(teamwork)</p>\n<p>Day 1 - AM: Team building<strong> </strong>; PM: Urban analysis (SWOT) + Roundtable (Challenges and opportunity for change at city scale)</p>\n<p>Day 2 - AM: Case study analysis + Presentation; PM: Mapping the Olympics + Roundtable (Challenges and opportunity for Olympic legacy)</p>\n<p>Day 3 - AM: Site visit; PM: Site visit + Presentation (Challenges and opportunity for Olympic legacy - Team report)</p>\n<p>Day 4 - AM: Developing visions and urban design strategies workshop; PM: Developing OLDA's social resilience strategies</p>\n<p>Day 5 - AM: Developing OLDA's environmental resilience strategies; PM: Developing a shared Olympic Legacy Map workshop</p>\n<p><strong>Week 2 </strong>(8-12/07)<strong> - Intensive Design Studio - Urban Areas scale</strong> (teamwork)</p>\n<p>Day 1 - AM: Developing OLDA vision and principles; PM: Developing OLDA vision and principles + Presentation</p>\n<p>Day 2 - AM: Developing OLDA resilience strategies; PM: Developing OLDA environmental resilience strategies</p>\n<p>Day 3 - AM: Developing OLDA social resilience strategies; PM: Developing the team's final presentation</p>\n<p>Day 4 - AM: Finalising the OLDA Plan - Conceptually and spatially; PM: Finalising the OLDA Plan - Conceptually and spatially</p>\n<p>Day 5 - AM: Team presentation – OLF Pitch; PM: Developing site specific elements of the design toolkit </p>\n<p><strong>Week 3 </strong>(19/07)<strong> - </strong><strong>Developing the Urban Resilience Design Toolkit </strong></p>\n<p><strong>Week 4 </strong>(26/07)<strong> - </strong><strong>Progressing the Urban Resilience Design Toolkit </strong></p>\n<p><strong>Week 5 </strong>(2/08)<strong> - </strong><strong>Progressing the Urban Resilience Design Toolkit </strong></p>\n<p><strong>Week 6 </strong>(9/08)<strong> - Presenting</strong><strong> the Urban Resilience Design Toolkit </strong></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Studio</strong>",
            "topic_description": "Studio Week 1 (1-5/07) - Intensive Design Studio - City scale (teamwork) Day 1 - AM: Team building ; PM: Urban analysis (SWOT) + Roundtable (Challenges and opportunity for change at city scale) Day 2 - AM: Case study analysis + Presentation; PM: Mapping the Olympics + Roundtable (Challenges and opportunity for Olympic legacy) Day 3 - AM: Site visit; PM: Site visit + Presentation (Challenges and opportunity for Olympic legacy - Team report) Day 4 - AM: Developing visions and urban design strategies workshop; PM: Developing OLDA's social resilience strategies Day 5 - AM: Developing OLDA's environmental resilience strategies; PM: Developing a shared Olympic Legacy Map workshop Week 2 (8-12/07) - Intensive Design Studio - Urban Areas scale (teamwork) Day 1 - AM: Developing OLDA vision and principles; PM: Developing OLDA vision and principles + Presentation Day 2 - AM: Developing OLDA resilience strategies; PM: Developing OLDA environmental resilience strategies Day 3 - AM: Developing OLDA social resilience strategies; PM: Developing the team's final presentation Day 4 - AM: Finalising the OLDA Plan - Conceptually and spatially; PM: Finalising the OLDA Plan - Conceptually and spatially Day 5 - AM: Team presentation – OLF Pitch; PM: Developing site specific elements of the design toolkit Week 3 (19/07) - Developing the Urban Resilience Design Toolkit Week 4 (26/07) - Progressing the Urban Resilience Design Toolkit Week 5 (2/08) - Progressing the Urban Resilience Design Toolkit Week 6 (9/08) - Presenting the Urban Resilience Design Toolkit",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}